{"2022": {"summary": "The professor's research focuses on various areas within computer science. They have explored the infodemic surrounding COVID-19 vaccination on Twitter, analyzed the management of mutable erasure coded data, proposed a system to address scalability and trust issues in blockchain, and presented a modular framework for analyzing centrality and clustering in complex networks. Their work contributes to understanding and addressing challenges in these areas, showcasing their expertise and dedication to advancing knowledge in computer science.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:4X0JR2_MtJMC": "The article describes a dataset called FaCov, which contains fact-checking articles about COVID-19 rumors and claims from popular sources. It aims to understand the major conversations and conflicts surrounding the pandemic.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:Ak0FvsSvgGUC": "This research article explores the infodemic surrounding COVID-19 vaccination on Twitter, using a pretrained transformer-based model to classify tweets as misleading or non-misleading and analyzing their characteristics.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:lgwcVrK6X84C": "This research article discusses the management of mutable erasure coded data, focusing on issues such as update computation, concurrency control, and consistency.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:48xauSegjOkC": "The article proposes a system called 1DLT that aims to address the scalability and trust issues in Ethereum blockchain by enabling rapid and secure deployment of an Ethereum Virtual Machine based blockchain.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:LgRImbQfgY4C": "The research article proposes a quorum system for erasure coded warm data that guarantees sequential consistency and supports atomic read-modify-write operations by multiple clients. It analyzes the viability of quorums under node unavailability, contention of resources between read and write operations, and quorum load.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:F1b5ZUV5XREC": "This research article presents a modular framework for analyzing centrality and clustering in complex networks, using a generalized model of Markov entropic centrality and a novel two-stage graph clustering algorithm."}}, "2023": {"summary": "The professor's research focuses on blockchain technology and its applications in various domains. Their work includes the development of a practical blockchain interoperability framework, the use of language processing and machine learning to counter misinformation on social media, the design of a stablecoin system for cross-chain commerce, and the exploration of blockchain-based data governance and secure Ethereum Virtual Machine deployment. Their research contributes to advancing the understanding and implementation of blockchain technology in diverse fields.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:U4n9YNQMCAIC": "The article proposes PIEChain, a practical blockchain interoperability framework that enables cross-chain communication without requiring intrusive changes to existing blockchains.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:7Hz3ACDFbsoC": "The research article presents a proof-of-concept called the Misinformation Concierge, which utilizes language processing and machine learning to identify and counter misinformation on social media, providing statistical reports and recommending rebuttal messages for policy-makers to intervene promptly.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:kVjdVfd2voEC": "The research article discusses the design and implementation of CroCoDai, a stablecoin system that addresses the challenges of cross-chain commerce in the decentralized finance ecosystem.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:MpfHP-DdYjUC": "This research article proposes a blockchain-based data governance system that uses attribute-based encryption to ensure privacy and prevent unauthorized access to confidential data stored in the cloud.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:LdasjJ6CEcoC": "The research article presents BlockChain I/O, an overarching framework that enables cross-chain commerce by providing transaction atomicity, stablecoin support, privacy-preserving digital identities, and general applicability. It includes a core architecture and demonstrates its practical performance through an experimental evaluation.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:BzfGm06jWhQC": "This research article compares parsimonious cladograms and dendograms from hierarchical clustering, showing that they can yield different results in clustering analysis.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:43bX7VzcjpAC": "This research article explores the themes and discussions surrounding the Covid-19 pandemic on the r/Coronavirus subreddit over the course of the first year. It analyzes sentiment and topics through lexical analysis and unsupervised topic modeling, uncovering contentious topics and the presence of misleading news.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:cK4Rrx0J3m0C": "The article proposes a novel system, 1DLT, that allows for the rapid deployment of a secure and efficient Ethereum Virtual Machine based blockchain, addressing scalability and transaction cost issues."}}, "2020": {"summary": "In their recent research, the professor delved into the world of sextortionists in the Bitcoin network. By employing a flow-centric method, they successfully identified key Bitcoin addresses and flows that indicated potential links among scammers. This study sheds light on the intricate network of sextortionists and contributes to our understanding of their operations in the cryptocurrency realm.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=20&pagesize=80&citation_for_view=VWi3_OIAAAAJ:P7Ujq4OLJYoC": "The research article analyzes the ego network of sextortionists in the Bitcoin network, using a flow-centric approach to identify relevant Bitcoin addresses and flows that suggest connections among scammers."}}, "2021": {"summary": "The professor's research focuses on various aspects of blockchain technology and its applications in digital government, public services, and cybersecurity. Their work includes exploring the use of blockchain for anonymizing user data, enhancing the anonymity of whistleblower systems, developing consistency mechanisms for distributed storage systems, and analyzing the temporal characteristics of networks.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=20&pagesize=80&citation_for_view=VWi3_OIAAAAJ:lvd772isFD0C": "This research article explores the use of blockchain technology in digital government and public services, examining its fundamental properties and limitations through a survey of vision papers, reports, and academic literature.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=20&pagesize=80&citation_for_view=VWi3_OIAAAAJ:HeT0ZceujKMC": "This research article analyzes the use of multi-input multi-output transactions in the Bitcoin network to obfuscate relationships between users and introduces novel techniques to detect mixing-like behaviors.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:5icHVeHT4IsC": "This research article proposes a utility-driven approach for anonymizing public transport user data by prioritizing attribute generalization based on their utility.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:gKiMpY-AVTkC": "This research article proposes a Bonus-Malus model for cyber risk insurance, which addresses the issue of moral hazard and incentivizes mitigation of cyber losses through adjusting insurance premiums.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:nVrZBo8bIpAC": "This research article proposes a blind signature based protocol to enhance the anonymity and resilience of whistleblower submission systems, mitigating the impact of spam posts and denial of service attacks.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:tH6gc1N1XXoC": "This research article proposes a hierarchical graph clustering method using Renyi entropy, with two approaches for embedding and clustering the graph. Numerical examples demonstrate the consistency of both approaches.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:Bg7qf7VwUHIC": "The research article proposes a framework called QLOC for consistent distributed storage systems using erasure coding, with support for warm data storage and quorum-based consistency mechanisms.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:gVv57TyPmFsC": "The article explores the design of grid quorum systems for erasure code based distributed storage systems, investigating their load characteristics and demonstrating how sequential consistency is maintained in the presence of storage node failures.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=200&pagesize=100&citation_for_view=VWi3_OIAAAAJ:GFxP56DSvIMC": "The article proposes a methodology for exploring the temporal characteristics of a network by constructing a graph time series and performing principal component analysis. It includes case studies on a Bitcoin subgraph."}}, "2023": {"summary": "The professor's research focuses on various aspects of blockchain technology, including blockchain interoperability, misinformation detection on social media, stablecoin design for cross-chain commerce, blockchain-based data governance, and secure and efficient blockchain deployment. Their work aims to address challenges and improve the functionality and security of blockchain systems in areas such as cross-chain communication, decentralized finance, privacy protection, and data analysis.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:U4n9YNQMCAIC": "The article proposes PIEChain, a practical blockchain interoperability framework that enables cross-chain communication without intrusive changes to existing blockchains. It is the first publicly available implementation of a general framework for cross-chain communication.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:7Hz3ACDFbsoC": "The research article presents a proof-of-concept called the Misinformation Concierge, which uses language processing and machine learning to identify and counter misinformation on social media, providing statistical reports and rebuttal messages for policy-makers.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:kVjdVfd2voEC": "The article discusses the design of CroCoDai, a stablecoin that aims to facilitate cross-chain commerce in the decentralized finance ecosystem by efficiently supporting multiple blockchains and mitigating risks associated with price fluctuations and platform failures.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:MpfHP-DdYjUC": "The research article proposes a blockchain-based data governance system that uses attribute-based encryption to protect privacy and prevent unauthorized access to confidential data in cloud services.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:LdasjJ6CEcoC": "The article proposes a framework called BlockChain I/O that enables secure and practical cross-chain commerce by addressing challenges such as transaction atomicity, stablecoin support, privacy-preserving digital identities, and general applicability in the decentralized finance ecosystem.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:BzfGm06jWhQC": "This research article explores the relationship between parsimonious cladograms and clustering, comparing their effectiveness in analyzing non-biological data.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:43bX7VzcjpAC": "This study analyzes the content on the r/Coronavirus subreddit to understand the main themes and discussions surrounding the global pandemic over the course of its first year. It examines sentiment and topics and identifies contentious topics and misleading news.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=VWi3_OIAAAAJ&cstart=100&pagesize=100&citation_for_view=VWi3_OIAAAAJ:cK4Rrx0J3m0C": "The article proposes 1DLT, a system that allows for the rapid deployment of a secure and efficient blockchain based on the Ethereum Virtual Machine (EVM), addressing scalability and transaction cost issues."}}}