{"full_name": "A S Madhukumar", "designation": "Associate Professor, School of Computer Science and Engineering", "email": "asmadhukumar@ntu.edu.sg", "biography": "AS Madhukumar’s expertise lies in the areas of multi-tier cellular architecture, cooperative and cognitive radio systems, interference management, coding and modulation, new multiple access schemes, hybrid radio systems and other advanced signal processing algorithms for future communication systems. He is involved in a number of funded research projects, organizing international conferences, and a permanent reviewer for many internationally reputed journals and conferences. He has published over 300 referred international conference and journal papers. He is a recipient of Nanyang Award for Teaching Excellence in 2007 and obtained best paper awards in IEEE 35th Digital Avionics Conference in 2016 and in IEEE Integrated Communications, Navigations and Surveillance Conference in 2016 and in 2017. A S Madhukumar received his B Tech degree from College of Engineering, Trivandrum, India, M Tech from Cochin University of Science and Technology, India and Ph D from Department of Computer Science and Engineering, Indian Institute of Technology, Madras, India. He is currently an Associate Professor in the School of Computer Engineering, Nanyang Technological University, Singapore. Before joining NTU, he was involved in communications and signal processing research at Centre for Development of Advanced Computing (Electronics R&D Centre), Govt. of India and Institute for Infocomm Research (Centre for Wireless Communications), Singapore. Dr. Madhukumar is a senior member of IEEE.", "google_scholar": "https://scholar.google.com/citations?user=7_AzrLwAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-8740-634X", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7003877769", "web_of_science": "https://www.webofscience.com/wos/author/record/990763", "other_websites": ["http://www3.ntu.edu.sg/home/asmadhukumar/"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["2922", "26", "81"], "Since 2018": ["1296", "19", "34"]}, "chart": {"2002": 18, "2003": 10, "2004": 19, "2005": 53, "2006": 95, "2007": 91, "2008": 113, "2009": 96, "2010": 98, "2011": 125, "2012": 129, "2013": 142, "2014": 148, "2015": 132, "2016": 149, "2017": 153, "2018": 145, "2019": 190, "2020": 203, "2021": 265, "2022": 288, "2023": 200}}, "interests": [], "num_published": {"2006": 12, "2003": 22, "2016": 14, "2021": 6, "2012": 19, "2015": 13, "2019": 21, "2017": 15, "2011": 17, "2004": 11, "2005": 14, "2020": 16, "2018": 18, "1994": 1, "1993": 2, "2013": 10, "2010": 13, "2008": 12, "2007": 17, "2002": 5, "2001": 6, "2014": 8, "1997": 4, "2009": 10, "2000": 5, "1991": 3, "1998": 1, "1992": 1, "2023": 8, "2022": 1, "1999": 2, "unknown": 4}, "bachelor_degree": null, "masters": null, "phd": null}