{"full_name": "Anupam Chattopadhyay", "designation": "Associate Professor, School of Computer Science and Engineering", "email": "anupam@ntu.edu.sg", "image_path": "./profile_img/anupam_chattopadhyay.jpg", "biography": "Anupam Chattopadhyay received his B.E. degree from Jadavpur University, India, MSc. from ALaRI, Switzerland and PhD from RWTH Aachen in 2000, 2002 and 2008 respectively. From 2008 to 2009, he worked as a Member of Consulting Staff in CoWare R&D, Noida, India. From 2010 to 2014, he led the MPSoC Architectures Research Group in RWTH Aachen, Germany as a Junior Professor. Since September, 2014, Anupam was appointed as an Assistant Professor in SCSE, NTU, where he got promoted to Associate Professor with Tenure from August, 2019. In the past, he held visiting positions at Politecnico di Torino, Italy; EPFL, Switzerland; Technion, Israel and Indian Statistical Institute, Kolkata.During his doctoral studies, he worked on automatic RTL generation from the architecture description language LISA, which led to a spin-off, and subsequently was acquired by a leading EDA vendor. He developed novel high-level optimisations, verification techniques, and proposed a language-based modelling, exploration and design framework for partially re-configurable processors - many of which resulted in successful technology transfers to the EDA and Semiconductor IP industry. Anupam currently heads a team of 20+ researchers, overseeing projects in the area of computer architectures, security, design automation and emerging technologies. His research advances has been reported in more than 100 conference/journal papers (ACM/IEEE/Springer), multiple research monographs and edited books (CRC, Springer) and open-access forums. Together with his doctoral students, Anupam proposed novel research directions like, domain-specific high-level synthesis for cryptography, high-level reliability estimation flows for embedded processors, generalisation of classic linear algebra kernels and multi-layered coarse-grained reconfigurable architecture. Anupam’s research in the area of emerging technologies has been covered by major news outlets across the world, including Asian Scientist, Straits Times and The Economist.Anupam regularly serves in the TPCs of top conferences, reviews journal/ conference articles and presented multiple invited seminars/tutorials in prestigious venues. He is a series editor of Springer book series on Computer Architecture and Design Methodologies. He is a member of ACM and a senior member of IEEE.Anupam received Borcher's plaque from RWTH Aachen, Germany for outstanding doctoral dissertation in 2008, nomination for the best IP award in the ACM/IEEE DATE Conference 2016 and nomination for the best paper award in the International Conference on VLSI Design 2018.", "grants": "Computer science approaches to quantum computing for financeIncremental, Multimodal and Robust Watermarking for AV Perception Systems (IMUROW)Project EPOQ-IIResearch Programme in Assuring Hardware Security by Design in Systems on Chip (SOCure)SOCure: Assuring Hardware Security by Design in Systems on ChipSpin Orbit Coupling based IntelligencE TechnologY (SOCIETY)Strategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)", "google_scholar": "https://scholar.google.co.in/citations?user=TIt4ggwAAAAJ&hl=en", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01076", "other_websites": [], "interests": ["Computer Architecture", "Electronic Design Automation", "Hardware Security", "Emerging Technologies", "CPS Security"], "bachelor_degree": null, "masters": null, "phd": null, "published_by_year": {"2018": 47, "2017": 32, "2008": 8, "2016": 30, "2020": 36, "2005": 5, "2012": 7, "2006": 3, "2015": 21, "2013": 18, "2019": 48, "2004": 2, "2011": 3, "2022": 24, "2007": 5, "2014": 17, "2021": 24, "2009": 4, "2023": 23, "unknown": 20, "2010": 2, "1997": 1, "1993": 1, "1994": 0, "1995": 0, "1996": 0, "1998": 0, "1999": 0, "2000": 0, "2001": 0, "2002": 0, "2003": 0}, "citations_by_year": {"Year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "# of Citations": [4, 18, 26, 38, 68, 53, 71, 73, 65, 114, 140, 191, 178, 277, 350, 591, 761, 1064, 1213, 990]}, "all_time_h_index": 36, "all_time_i10_index": 144, "h_index_by_publication_year": {"2018": 16, "2017": 14, "2008": 5, "2016": 13, "2020": 13, "2005": 4, "2012": 6, "2006": 3, "2015": 9, "2013": 8, "2019": 14, "2004": 2, "2011": 2, "2022": 4, "2007": 4, "2014": 9, "2021": 8, "2009": 2, "2023": 4, "2010": 0}, "h_index_by_year": {"2018": 21, "2019": 23, "2020": 26, "2021": 29, "2022": 33, "2023": 36, "2017": 18, "2008": 7, "2009": 8, "2010": 9, "2011": 11, "2012": 11, "2013": 13, "2014": 14, "2015": 15, "2016": 15, "2005": 3, "2006": 4, "2007": 4, "2004": 1}, "h_index_by_years_from_publication_year": {"Publication Year": [2018, 2017, 2008, 2016, 2020, 2005, 2012, 2006, 2015, 2013, 2019, 2004, 2011, 2022, 2007, 2014, 2021, 2009, 2023], "Year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [[null, null, null, null, null, null, null, null, null, null, null, null, null, null, 3, 5, 9, 12, 14, 16], [null, null, null, null, null, null, null, null, null, null, null, null, null, 3, 6, 8, 11, 13, 13, 14], [null, null, null, null, 2, 3, 3, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5], [null, null, null, null, null, null, null, null, null, null, null, null, 2, 5, 8, 8, 9, 11, 13, 13], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 5, 9, 11, 13], [null, 2, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], [null, null, null, null, null, null, null, null, 2, 4, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], [null, null, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], [null, null, null, null, null, null, null, null, null, null, null, 2, 4, 6, 7, 8, 8, 8, 9, 9], [null, null, null, null, null, null, null, null, null, 2, 4, 5, 6, 7, 7, 7, 7, 8, 8, 8], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 3, 6, 10, 13, 14], [1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 3, 4], [null, null, null, 0, 2, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], [null, null, null, null, null, null, null, null, null, null, 3, 5, 7, 8, 9, 9, 9, 9, 9, 9], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 2, 6, 8], [null, null, null, null, null, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 4]]}}