{"full_name": "Bo An", "designation": "Professor, School of Computer Science and Engineering", "email": "boan@ntu.edu.sg", "biography": "Bo An is a Professor in Computer Science and Engineering, and Co-Director of Artificial Intelligence Research Institute (AI.R) at Nanyang Technological University, Singapore. He received the Ph.D degree in Computer Science from the University of Massachusetts, Amherst. His current research interests include artificial intelligence, multiagent systems, computational game theory, reinforcement learning, and optimization. His research results have been successfully applied to many domains including infrastructure security and e-commerce. He has published over 100 referred papers at AAMAS, IJCAI, AAAI, ICAPS, KDD, UAI, EC, WWW, ICLR, NeurIPS, ICML, JAAMAS, AIJ and ACM/IEEE Transactions. Dr. An was the recipient of the 2010 IFAAMAS Victor Lesser Distinguished Dissertation Award, an Operational Excellence Award from the Commander, First Coast Guard District of the United States, the 2012 INFORMS Daniel H. Wagner Prize for Excellence in Operations Research Practice, and 2018 Nanyang Research Award (Young Investigator). His publications won the Best Innovative Application Paper Award at AAMAS’12, the Innovative Application Award at IAAI’16, and the best paper award at DAI’20. He was invited to give Early Career Spotlight talk at IJCAI’17. He led the team HogRider which won the 2017 Microsoft Collaborative AI Challenge. He was named to IEEE Intelligent Systems' \"AI's 10 to Watch\" list for 2018. He is PC Co-Chair of AAMAS’20 and will be General Co-Chair of AAMAS’23. He is a member of the editorial board of JAIR and is the Associate Editor of AIJ, JAAMAS, IEEE Intelligent Systems, ACM TAAS, and ACM TIST. He was elected to the board of directors of IFAAMAS, senior member of AAAI, and Distinguished member of ACM. You can find more information at https://personal.ntu.edu.sg/boan", "google_scholar": "https://scholar.google.com/citations?hl=en&user=PEEpuNwAAAAJ", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8901577100", "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/boan/"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["7100", "45", "147"], "Since 2018": ["5194", "35", "123"]}, "chart": {"2010": 49, "2011": 70, "2012": 135, "2013": 178, "2014": 219, "2015": 328, "2016": 398, "2017": 444, "2018": 478, "2019": 632, "2020": 763, "2021": 911, "2022": 1188, "2023": 1218}}, "interests": ["Artificial intelligence", "multi-agent systems", "game theory", "reinforcement learning", "optimization"], "num_published": {"2020": 20, "2012": 13, "2010": 3, "2017": 25, "2018": 18, "2016": 18, "2021": 26, "2019": 26, "2011": 7, "2022": 32, "2013": 10, "2014": 18, "2007": 5, "2006": 3, "2015": 9, "2009": 5, "2008": 4, "2023": 32, "2005": 5, "2004": 1, "unknown": 6}, "bachelor_degree": null, "masters": null, "phd": "University of Massachusetts, Amherst", "h_index_by_publication_year": {"2020": 10, "2012": 10, "2010": 2, "2017": 14, "2018": 13, "2016": 13, "2021": 12, "2019": 15, "2011": 6, "2022": 7, "2013": 8, "2014": 9, "2007": 4, "2006": 2, "2015": 6, "2009": 5, "2008": 4, "2023": 3, "2005": 3, "2004": 1}, "h-index_over_time": {"2020": 34, "2021": 39, "2022": 43, "2023": 45, "2012": 9, "2013": 11, "2014": 13, "2015": 16, "2016": 18, "2017": 23, "2018": 26, "2019": 30, "2010": 4, "2011": 7, "2007": 1, "2008": 2, "2009": 2, "2006": 0, "2005": 0, "2004": 0}}