{"full_name": "Cham Tat Jen", "designation": "Associate Professor, School of Computer Science and Engineering", "email": "astjcham@ntu.edu.sg", "biography": "Tat-Jen is an Associate Professor in the School of Computer Science & Engineering, Nanyang Technological University. He received his BA in Engineering in 1993 and his PhD in 1996, both from the University of Cambridge. Tat-Jen was subsequently conferred a Jesus College Research Fellowship in Science in 1996-97. From 1998 to 2001, he was a research scientist at DEC/Compaq Research Lab in Cambridge, MA, USA. After joining NTU in 2002, he was concurrently a Faculty Fellow in the Singapore-MIT Alliance Computer Science Program in 2003-2006.In research., Tat-Jen received overall best paper prizes at PROCAMS’05, BMVC’94, and in particular at ECCV'96, while his PhD student Minh-Tri Pham was awarded the PREMIA 2nd best student paper prize for their ICCV'2007 paper. Tat-Jen is an inventor on eight patents. He is currently a co-Principal Investigator in the NRF BeingTogether Centre (BTC) on 3D Telepresence, a collaboration between NTU and UNC at Chapel Hill.Tat-Jen is an Area Chair for ICCV’19, and has served as an editorial board member for the International Journal of Computer Vision (IJCV), a General Chair for ACCV’14, an Area Chair for ICCV'09, ACCV’07, ICCV’05 and ACCV’06, Associate Editor for IJIG and IPSJ-CVA, a Program Chair for MMM’07, and a co-founder for the PROCAMS workshop series in 2003. Nationally, he has been on various review panels for A*STAR and the National Research Foundation (NRF). Tat-Jen has served for a number of terms on the NTU Senate, and previous roles held include being the Director for the Centre for Multimedia & Network Technology (CeMNet) and an affiliate faculty with the Singapore-ETH Centre’s Future Cities Lab.", "google_scholar": "https://scholar.google.com/citations?hl=en&user=Lx3X7W0AAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/astjcham/index.html"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["5605", "40", "76"], "Since 2018": ["2516", "23", "42"]}, "chart": {"1998": 23, "1999": 34, "2000": 60, "2001": 56, "2002": 91, "2003": 165, "2004": 150, "2005": 190, "2006": 172, "2007": 150, "2008": 143, "2009": 156, "2010": 192, "2011": 166, "2012": 156, "2013": 204, "2014": 184, "2015": 223, "2016": 208, "2017": 253, "2018": 201, "2019": 242, "2020": 350, "2021": 501, "2022": 612, "2023": 605}}, "interests": ["Computer Vision"], "num_published": {"1999": 4, "2019": 7, "2015": 9, "2007": 7, "2018": 6, "2001": 6, "2006": 6, "2004": 3, "2010": 4, "2020": 3, "2016": 2, "2003": 6, "2021": 8, "2014": 6, "1995": 1, "1998": 1, "2008": 2, "2022": 11, "1997": 1, "2002": 3, "1996": 3, "2000": 2, "2005": 5, "2013": 4, "2011": 2, "2017": 5, "1994": 3, "2012": 2, "2023": 5, "unknown": 6}}