{"full_name": "Chen Change Loy", "designation": "Professor, School of Computer Science and Engineering", "email": "ccloy@ntu.edu.sg", "image_path": "./profile_img/chen_change_loy.jpg", "biography": "Chen Change Loy is a Professor with the School of Computer Science and Engineering, Nanyang Technological University, Singapore. He received his PhD (2010) in Computer Science from the Queen Mary University of London. Prior to joining NTU, he served as a Research Assistant Professor at the MMLab of the Chinese University of Hong Kong, from 2013 to 2018.  He was a postdoctoral researcher at Queen Mary University of London and Vision Semantics Limited (acquired by Veritone), from 2010 to 2013. His research interests include computer vision and deep learning with a focus on image/video restoration and enhancement, generative tasks, and representation learning. He and his research group pioneer the research in face detection, face alignment, and image super-resolution by deep learning. His journal paper on image super-resolution was selected as the `Most Popular Article' by IEEE Transactions on Pattern Analysis and Machine Intelligence in 2016. It remains as one of the top 10 non-survey articles to date.He is recognized as one of the 100 most influential scholars in computer vision from 2020 to 2023 by AMiner. He received the Nanyang Associate Professorship Award in 2019. He was selected as the outstanding reviewer of ACCV 2014, BMVC 2017, and CVPR 2017.He serves as an Associate Editor of the Computer Vision and Image Understanding (CVIU), International Journal of Computer Vision (IJCV) and IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). He also serves/served as the Area Chair of top conferences such as ICCV, CVPR, ECCV, and NeurIPS. He has co-organized several workshops and challenges at major computer vision conferences. He is a senior member of IEEE.Check out MMLab@NTU.", "google_scholar": "https://scholar.google.com/citations?hl=en&user=559LF80AAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/ccloy"], "interests": ["Computer Vision", "Image Processing", "Machine Learning"], "all_time_h_index": 105, "all_time_i10_index": 207, "bachelor_degree": null, "masters": null, "phd": "Queen Mary University of London", "published_by_year": {"2015": 14, "2014": 11, "2018": 22, "2016": 19, "2019": 21, "2020": 23, "2012": 6, "2022": 44, "2013": 7, "2009": 4, "2021": 31, "2017": 15, "2010": 2, "2011": 2, "2007": 1, "2023": 55, "2005": 2, "2006": 0, "2008": 0}, "citations_by_year": {"Year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "# of Citations": [0, 3, 2, 2, 13, 19, 62, 69, 127, 266, 642, 1682, 2820, 4347, 6373, 8522, 11258, 13691, 13899]}, "h_index_by_publication_year": {"2015": 13, "2014": 11, "2018": 21, "2016": 18, "2019": 19, "2020": 20, "2012": 6, "2022": 23, "2013": 7, "2009": 4, "2021": 25, "2017": 13, "2010": 2, "2011": 2, "2007": 1, "2023": 9, "2005": 2, "2006": 0, "2008": 0}, "h_index_by_year": {"2015": 19, "2016": 31, "2017": 36, "2018": 44, "2019": 53, "2020": 67, "2021": 77, "2022": 91, "2023": 105, "2014": 13, "2012": 7, "2013": 9, "2009": 3, "2010": 4, "2011": 6, "2007": 1, "2008": 1, "2005": 0, "2006": 1}, "h_index_by_years_from_publication_year": {"Publication Year": [2015, 2014, 2018, 2016, 2019, 2020, 2012, 2022, 2013, 2009, 2021, 2017, 2010, 2011, 2007, 2023, 2005], "Year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [[null, null, null, null, null, null, null, null, null, null, 4, 9, 12, 13, 13, 13, 13, 13, 13], [null, null, null, null, null, null, null, null, null, 4, 8, 9, 10, 10, 11, 11, 11, 11, 11], [null, null, null, null, null, null, null, null, null, null, null, null, null, 8, 16, 18, 20, 21, 21], [null, null, null, null, null, null, null, null, null, null, null, 6, 12, 16, 17, 18, 18, 18, 18], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, 7, 15, 19, 19, 19], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 8, 17, 20, 20], [null, null, null, null, null, null, null, 1, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 11, 23], [null, null, null, null, null, null, null, null, 2, 5, 6, 6, 6, 6, 7, 7, 7, 7, 7], [null, null, null, null, 1, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 9, 22, 25], [null, null, null, null, null, null, null, null, null, null, null, null, 5, 8, 11, 11, 13, 13, 13], [null, null, null, null, null, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 9], [0, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]]}}