{"full_name": "Lam Kwok Yan", "designation": "Associate Vice President (Strategy & Partnerships)", "email": "kwokyan.lam@ntu.edu.sg", "image_path": "./profile_img/lam_kwok_yan.jpg", "biography": "Professor Lam is the Associate Vice President (Strategy and Partnerships) and Professor in the School of Computer Science and Engineering at the Nanyang Technological University (NTU), Singapore. Professor Lam Kwok Yan is a renowned Cyber Security researcher and practitioner. Professor Lam has collaborated extensively with law-enforcement agencies, government regulators, telecommunication operators and financial institutions in various aspects of Infocomm and Cyber Security in the region. He is currently also the Executive Director of the National Centre for Research in Digital Trust (DTC), Director of the Strategic Centre for Research in Privacy-Preserving Technologies and Systems (SCRiPTS), and Director of NTU’s SPIRIT Smart Nation Research Centre. From August 2020 to August 2023, Professor Lam was also on part-time secondment to the INTERPOL as a Consultant at Cyber and New Technology Innovation. He served as the Director of the Nanyang Technopreneurship Center 2019-2022, and as Program Chair (Secure Community) of the Graduate College at NTU 2017-2019. Professor Lam has been a Professor of the Tsinghua University, PR China (2002-2010) and a faculty member of the National University of Singapore and the University of London since 1990. He was a visiting scientist at the Isaac Newton Institute of the Cambridge University and a visiting professor at the European Institute for Systems Security. In 2018, Professor Lam founded TAU Express Pte Ltd, an NTU start-up which specializes in AI and Data Analytics technologies for Smart Cities applications. TAU is a spin-off of the Intelligent Case Retrieval System project, a collaboration between NTU and the Singapore Supreme Court. In 1997, he founded PrivyLink International Ltd, a spin-off company of the National University of Singapore, specializing in e-security technologies for homeland security and financial systems. In 2012, he co-founded Soda Pte Ltd which won the Most Innovative Start Up Award at the RSA 2015 Conference. In 1998, he received the Singapore Foundation Award from the Japanese Chamber of Commerce and Industry in recognition of his R&D achievement in Information Security in Singapore.  Prof Lam received his B.Sc. (First Class Honours) from the University of London in 1987 and his Ph.D. from the University of Cambridge in 1990. His research interests include Distributed Systems, IoT Security Infrastructure and Cyber-Physical System Security, Distributed Protocols for Blockchain, Biometric Cryptography, Quantum Computing, Homeland Security and Cybersecurity. In 2020, he authored a Technical Report on the “Application of Quantum Computers for Law Enforcement and Security Communications” for a Singapore Government ministry. Professor Lam is the recipient of the 2022 Singapore Cybersecurity Hall of Fame Award.", "grants": "Cyber Research Programme Office (CRPO)Digital Trust Centre (a.k.a. The National Centre for Research in Digital Trust (NCDT))GRANT AGREEMENT FOR SMART NATION INTERNET-OF-THINGS (IOT)- SYSTEM HONEYPOTJoint lab in collaboration with MastercardMonetary Academic RewardNTU Internal Contribution for NCDTProvenance-Based Graph Analytics and Transfer Learning for Intrusion DetectionSCSE Core Manpower (SPIRIT Phase 2)Smart Nation IoT-system Threat AnalyticsSpectrum Optimization and Mobility Management for LEO Satellite Internet of ThingsStrategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)TRANS Lab SPIRIT Phase 2", "google_scholar": "https://scholar.google.com.sg/citations?user=NDMIYKsAAAAJ&hl=en", "orcid": "https://orcid.org/0000-0001-7479-7970", "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00321", "other_websites": [], "interests": ["Cybersecurity", "Privacy-Preserving technologies", "Distributing systems", "LegalTech", "cloud computing"], "bachelor_degree": null, "masters": null, "phd": "University of Cambridge", "published_by_year": {"2020": 21, "2009": 13, "2018": 20, "1999": 26, "2021": 23, "2010": 6, "2000": 10, "1997": 7, "1998": 16, "2019": 24, "2003": 9, "1992": 2, "2016": 2, "2005": 7, "2017": 5, "2002": 8, "1994": 2, "2022": 31, "1996": 5, "1995": 4, "2001": 7, "2012": 1, "2007": 8, "2008": 5, "2004": 8, "1993": 4, "1991": 2, "2013": 2, "2011": 1, "2006": 4, "2023": 25, "unknown": 8, "2014": 0, "2015": 0}, "citations_by_year": {"Year": [1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "# of Citations": [0, 2, 5, 2, 14, 8, 6, 21, 34, 48, 70, 52, 82, 117, 130, 119, 95, 87, 124, 131, 136, 138, 135, 124, 126, 107, 117, 147, 242, 384, 712, 1108, 994]}, "all_time_h_index": 37, "all_time_i10_index": 119, "h_index_by_publication_year": {"2020": 11, "2009": 8, "2018": 13, "1999": 12, "2021": 10, "2010": 3, "2000": 5, "1997": 4, "1998": 9, "2019": 12, "2003": 7, "1992": 2, "2016": 1, "2005": 3, "2017": 3, "2002": 6, "1994": 2, "2022": 8, "1996": 2, "1995": 2, "2001": 2, "2012": 1, "2007": 3, "2008": 3, "2004": 5, "1993": 2, "1991": 1, "2013": 1, "2011": 1, "2006": 2, "2023": 2, "2014": 0, "2015": 0}, "h_index_by_year": {"2020": 28, "2021": 31, "2022": 34, "2023": 37, "2009": 19, "2010": 20, "2011": 21, "2012": 21, "2013": 23, "2014": 24, "2015": 26, "2016": 26, "2017": 26, "2018": 27, "2019": 27, "1999": 4, "2000": 6, "2001": 8, "2002": 10, "2003": 11, "2004": 12, "2005": 14, "2006": 15, "2007": 17, "2008": 18, "1997": 4, "1998": 4, "1992": 1, "1993": 1, "1994": 2, "1995": 3, "1996": 4, "1991": 0}, "h_index_by_years_from_publication_year": {"Publication Year": [2020, 2009, 2018, 1999, 2021, 2010, 2000, 1997, 1998, 2019, 2003, 1992, 2016, 2005, 2017, 2002, 1994, 2022, 1996, 1995, 2001, 2012, 2007, 2008, 2004, 1993, 1991, 2013, 2011, 2006, 2023], "Year": [1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [[null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 6, 7, 9, 11], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 1, 3, 3, 4, 5, 5, 6, 6, 7, 7, 7, 7, 7, 8, 8], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 4, 6, 10, 12, 13, 13], [null, null, null, null, null, null, null, null, 2, 3, 6, 7, 7, 9, 9, 10, 10, 10, 10, 11, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 4, 8, 10], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 1, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], [null, null, null, null, null, null, null, null, null, 0, 1, 2, 3, 3, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5], [null, null, null, null, null, null, 0, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], [null, null, null, null, null, null, null, 2, 3, 4, 5, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 2, 4, 8, 10, 12], [null, null, null, null, null, null, null, null, null, null, null, null, 1, 2, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 7], [null, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 1, 3, 3, 3, 3, 3, 3], [null, null, null, null, null, null, null, null, null, null, null, 1, 2, 3, 4, 4, 4, 4, 4, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], [null, null, null, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 5, 8], [null, null, null, null, null, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, 0, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], [null, null, null, null, null, null, null, null, null, null, null, null, null, 1, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 5], [null, null, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 2]]}}