{"full_name": "Lee Bu Sung", "designation": "Associate Professor, School of Computer Science and Engineering", "email": "ebslee@ntu.edu.sg", "biography": "Bu Sung Lee received his B.Sc. (Hons) and PhD from the Electrical and Electronics Department, Loughborough University of Technology, UK in 1982 and 1987 respectively. He has held various senior administrative positions(Head of Division, Associate Chair for Research) in the School of Computing Engineering, Nanyang Technological University over the period from 2003-2010. He is currently an Associate Professor with the School of Computer Engineering, Nanyang technological University. He is currently involved in the Joint NTU-UBC Research Center of Excellence in Active Living for the Elderly (LILY) as its  Silver Cloud Programme Director. The later deals with developing deploying services to extend the active living of elderly community.  In addition, to the academic activities he also holds a Joint appointment as Director, Service Platform Lab, HP Labs. Singapore since July 2010 – June 2012.  He currently holds a position as Director, International Networks at National SuperComputing Center, Singapore.  He has been actively involved with the Asia-Pacific research and education network since the formation of Singapore Advance Research and Education Network(SingAREN). He is the founding president of SingAREN society, 2003-2007, and is currently the President of SingAREN(2011-2015).  Since 2004, he is a member of the technical management team of Trans-Eurasia Information Network (TEIN-2); the first large scale is the first large-scale research and education network for the Asia-Pacific. It connects ten countries in the region, and provides direct connectivity to Europe’s GÉANT2 network.  His involvements continue into the new phase of the project TEIN-3 and TEIN-4. He was elected the founding Chair of the governors of the Trans-Eurasia Information Network Cooperation Center(TEIN*CC), in May 2012,  which manages the TEIN-4 project.  Bu-Sung Lee has published over 300 peer preview conference papers, and 100 journal papers. His research areas cover both Grid/Cloud Computing and network. Lately he has carried out research in the area of application of Data Analytics and Big Data.  He has received a number of research grants. He is the co-author of a number of papers that has won Best Paper awards and demonstration award.  He has given numerous Invited/Keynote address in conferences and played an active role in the academic community in organizing conferences.Bu-Sung Lee, has been awarded numerous grants over the years. In early 2014, he successfully completed the A*STAR thematic grants “User and Domain Driven Data Analytics as a Service framework”.  The project developed a data analytics platform using Cloud resources and applied it to energy efficiency in building.", "google_scholar": "https://scholar.google.com/citations?hl=en&user=TyytTfQAAAAJ", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7405441352", "web_of_science": null, "other_websites": [], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["14760", "54", "213"], "Since 2018": ["4677", "33", "87"]}, "chart": {"2003": 64, "2004": 91, "2005": 189, "2006": 311, "2007": 380, "2008": 451, "2009": 486, "2010": 492, "2011": 555, "2012": 808, "2013": 1115, "2014": 1175, "2015": 1198, "2016": 1306, "2017": 1054, "2018": 1054, "2019": 874, "2020": 787, "2021": 769, "2022": 686, "2023": 505}}, "interests": ["General interest in the area of Networks and Grid"], "num_published": {"2011": 47, "2017": 16, "2004": 23, "2009": 20, "2012": 38, "2018": 15, "2007": 31, "2006": 25, "2005": 35, "2002": 17, "2013": 28, "2014": 21, "2015": 10, "2010": 32, "2023": 5, "2003": 23, "2016": 9, "1997": 4, "2008": 17, "2021": 7, "2001": 11, "1982": 1, "1999": 12, "2000": 9, "2019": 8, "1998": 6, "1971": 1, "1976": 1, "1993": 2, "2020": 5, "unknown": 26, "2022": 8, "1996": 3, "1994": 3, "1985": 3, "1990": 2, "1986": 5}, "bachelor_degree": null, "masters": null, "phd": "Loughborough University of Technology"}