{"full_name": "Lim Wei Yang Bryan", "designation": "Assistant Professor, School of Computer Science and Engineering", "email": "bryan.limwy@ntu.edu.sg", "image_path": "./profile_img/lim_wei_yang_bryan.jpg", "biography": "Wei Yang Bryan Lim is an Assistant Professor at the School of Computer Science and Engineering at Nanyang Technological University (NTU), Singapore, having joined in September 2023. Between 2022 and 2023, he held the title of Wallenberg-NTU Presidential Postdoctoral Fellow. In 2022, he earned his PhD from NTU under the Alibaba PhD Talent Programme and was affiliated with the CityBrain team of DAMO academy during this period. His doctoral efforts earned him accolades such as the \"Most Promising Industrial Postgraduate Programme Student\" award and the IEEE Technical Community on Scalable Computing (TCSC) Outstanding PhD Dissertation Award. Besides, his works have been honored with Best Paper Awards, notably from the IEEE Wireless Communications and Networking Conference (WCNC) and the IEEE Asia Pacific Board. He also serves on the Technical Programme Committee for flagship conferences and is a review board member or guest editor for reputable journals like the IEEE Transactions on Parallel and Distributed Systems and IEEE Wireless Communications. In 2023, he co-edited a submission on \"Requirements and Design Criteria for Sustainable Metaverse Systems\" for the International Telecommunication Union (ITU). Alongside his publications in high impact journals of his field, he is the first author of two books. Additionally, he has been a visiting scholar at the KTH Royal Institute of Technology, University of Sydney, University of New South Wales, and the Singapore University of Technology and Design.", "grants": "Investigations on resource allocation for edge intelligenceTechnical challenges, linguistic obstacles, and cultural barriers in bringing knowledge societies into the metaverse. With a metaverse showcase of how the peoples of Afro-Eurasia saw each other transitioning into modernity", "google_scholar": "https://scholar.google.com/citations?user=K2CHjf0AAAAJ&hl=en", "orcid": "https://orcid.org/0000-0003-2150-5561", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=57216418969", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02085", "other_websites": ["https://sites.google.com/view/wyb/home"], "interests": ["Edge Intelligence", "Fog/Edge Computing", "Applied AI", "Resource Allocation", "Incentive Mechanism"], "bachelor_degree": null, "masters": null, "phd": "NTU", "published_by_year": {"2020": 17, "2022": 18, "2021": 21, "2023": 10}, "citations_by_year": {"Year": [2020, 2021, 2022, 2023], "# of Citations": [202, 581, 1261, 1350]}, "all_time_h_index": 21, "all_time_i10_index": 28, "h_index_by_publication_year": {"2020": 9, "2022": 9, "2021": 9, "2023": 2}, "h_index_by_year": {"2020": 5, "2021": 9, "2022": 18, "2023": 21}, "h_index_by_years_from_publication_year": {"Publication Year": [2020, 2022, 2021, 2023], "Year": [2020, 2021, 2022, 2023], "h-index": [[5, 8, 9, 9], [null, null, 7, 9], [null, 3, 8, 9], [null, null, null, 2]]}}