{"full_name": "Liu Weichen", "designation": "Associate Professor, School of Computer Science and Engineering", "email": "liu@ntu.edu.sg", "biography": "Dr. Weichen Liu is an Associate Professor at the School of Computer Science and Engineering, Nanyang Technological University, Singapore. He was a Nanyang Assistant Professor (NAP) during 2018-2023. He received his PhD degree from the Hong Kong University of Science and Technology, and the MEng and BEng degrees from Harbin Institute of Technology, China. Dr. Liu serves as an Associate Editor of IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), and a Subject Area Editor of Elsevier Journal of Systems Architecture (JSA). He served as a General Chair of the 25th IEEE International Symposium on Real-Time Computing (ISORC 2020), a Program Chair of ISORC 2019, a Track Chair of ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED 2021, 2022), The 16th IEEE International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC 2023), and a chair, technical program committee member, organizing committee member and guest editor of over 20 premier international conferences, journals, workshops and student forums, including DAC, ICCAD, ASP-DAC, CODES+ISSS, RTSS, RTAS, ISLPED, GLSVLSI, MSC@ESWEEK, SRF@ASP-DAC, EAI@ICDCS, etc. Dr. Liu authored and co-authored more than 170 research papers in peer-reviewed journals, conferences and books, and received the best paper candidate awards from DATE 2023, GLSVLSI 2022, ASP-DAC 2020, 2019 and 2016, CASES 2015, CODES+ISSS 2009, and the best poster paper awards from SRF@ASP-DAC 2020 and 2017, RTCSA 2017, AMD-TFE 2010. His research was supported by leading industrial partners including Intel, AMD, Xilinx, MediaTek, Huawei and HP.", "google_scholar": "https://scholar.google.com/citations?user=UozjxW8AAAAJ&hl=en", "orcid": "https://orcid.org/0000-0001-9348-4662", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=21743260700", "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/liu/"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["2702", "29", "63"], "Since 2018": ["1801", "24", "54"]}, "chart": {"2009": 10, "2010": 18, "2011": 36, "2012": 69, "2013": 95, "2014": 128, "2015": 121, "2016": 191, "2017": 195, "2018": 195, "2019": 235, "2020": 278, "2021": 362, "2022": 373, "2023": 356}}, "interests": ["Embedded Systems", "Multiprocessor Systems", "Network-on-Chip"], "num_published": {"2018": 17, "2010": 5, "2011": 4, "2013": 3, "2012": 6, "2019": 20, "2021": 17, "2014": 10, "2008": 1, "2020": 19, "2017": 11, "2016": 6, "2007": 2, "2009": 5, "2015": 8, "2022": 12, "2006": 1, "2023": 16, "unknown": 1}, "bachelor_degree": null, "masters": null, "phd": "Hong Kong University of Science and Technology"}