{"full_name": "Loke Yuan Ren", "designation": "Lecturer, School of Computer Science and Engineering", "email": "yrloke@ntu.edu.sg", "image_path": "./profile_img/loke_yuan_ren.jpg", "biography": "Dr. Yuan Ren Loke received his B.Eng. degree and Ph.D. degree in electrical engineering from the National University of Singapore in 2005 and 2013, respectively. Prior to joining NTU, he was an instructor with responsibility for lab demonstrator, tutor and final year project supervisor at National University of Singapore. Aside from development of several undergraduate course materials and teaching courses on embedded system design, digital electronic, microcontroller programming and engineering mathematics, he has been working on the development of vision based collision avoidance system from unmanned aerial vehicles, text detection and recognition in the wild. His research interests focus on computer vision, image processing, machine learning, and embedded computer vision system. He is currently a Lecturer with the School of Computer Science and Engineering, Nanyang Technological University in Singapore. Concurrently, he is also appointed as CSC Part-time Programme Coordinator. He is a member of IEEE.", "grants": "Project Plan For NSCC-NTU Student Supercomputing Competition And Event Support", "google_scholar": "https://scholar.google.com/citations?hl=en&user=e1u44asAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00585", "other_websites": ["https://personal.ntu.edu.sg/yrloke/"], "interests": ["Machine Learning", "Computer Vision"], "bachelor_degree": null, "masters": null, "phd": "National University of Singapore", "collaboration_network": {"target": ["Ashraf A. Kassim"], "target_id": ["JmcDlF8AAAAJ"], "type": ["Outside NTU"], "location": ["National University of Singapore"], "year": [2013], "title": ["Face hallucination on personal photo albums"], "link": ["https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:u-x6o8ySG0sC"]}, "published_by_year": {"Year": ["2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023"], "# of Publications": [1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0]}, "citations_by_year": {"Year": ["2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023", "unknown"], "# of Citations": [0, 0, 1, 1, 2, 1, 1, 2, 2, 1, 0, 1, 0, 0, 1, 0, 2, 3, 0]}, "all_time_h_index": 3, "all_time_i10_index": 0, "h_index_by_publication_year": {"Publication Year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0]}, "avg_citations_by_publication_year": {"Publication Year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "Avg Citations per Publication": [9.0, 0.0, 0.0, 3.0, 0.0, 0.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.0, 0.0]}, "h_index_by_year": {"Year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [0, 0, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]}, "h_index_by_years_from_publication_year": {"Publication Year": [2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2018, 2018, 2018, 2018, 2018, 2018, 2019, 2019, 2019, 2019, 2019, 2020, 2020, 2020, 2020, 2021, 2021, 2021, 2022, 2022, 2023], "Year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2018, 2019, 2020, 2021, 2022, 2023, 2019, 2020, 2021, 2022, 2023, 2020, 2021, 2022, 2023, 2021, 2022, 2023, 2022, 2023, 2023], "h-index": [0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0]}, "all_time_i20_index": 0, "publications": {"Publication Year": ["2006", "2022", "2009", "2013", "2019", "2012", "2007"], "Title": ["Object matching across multiple non-overlapping fields of view using fuzzy logic", "Raingan: Unsupervised raindrop removal via decomposition and composition", "Image inpainting with a learned guidance vector field", "Face hallucination on personal photo albums", "REMO: A Fast Region-and Morphology-based Scene Text Detector", "DATA-DRIVEN FACIAL IMAGE SYNTHESIS FROM POOR QUALITY LOW RESOLUTION IMAGE", "Batch Algorithm with Additional Shape Constraints for Non-Rigid Factorization."], "Link": ["https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:9yKSN-GCB0IC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:UeHWp8X0CEIC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:d1gkVwhDpl0C", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:u-x6o8ySG0sC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:qjMakFHDy7sC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:2osOgNQ5qMEC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=e1u44asAAAAJ&citation_for_view=e1u44asAAAAJ:u5HHmVD_uO8C"], "Topic": ["Others", "Federated Learning", "Others", "Others", "Others", "Others", "Others"], "# of Citations": [9, 4, 3, 2, 0, 0, 0], "Description": ["An approach based on fuzzy logic for matching both articulated and non-articulated objects across multiple non-overlapping field of views (FoVs) from multiple cameras is proposed. We call it fuzzy logic matching algorithm (FLMA). The approach uses the information of object motion, shape and camera topology for matching objects across camera views. The motion and shape information of targets are obtained by tracking them using a combination of ConDensation and CAMShift tracking algorithms. The information of camera topology is obtained and used by calculating the projective transformation of each view with the common ground plane. The algorithm is suitable for tracking non-rigid objects with both linear and non-linear motion. We show videos of tracking objects across multiple cameras based on FLMA. From our experiments, the system is able to correctly match the targets across views with a high accuracy.", "Adherent raindrops on windshield or camera lens may distort and occlude vision, causing issues for downstream machine vision perception. Most of the existing raindrop removal methods focus on learning the mapping from a raindrop image to its clean content by the paired raindrop-clean images. However, the paired real-world data is difficult to collect in practice. This paper presents a novel framework for raindrop removal that eliminates the need for paired training samples. Based on the assumption that a raindrop image is a composition of a clean image and raindrop style, the proposed framework decomposes a raindrop image into a clean content image and a raindrop-style latent code. Inversely, it composes a clean content image and a raindrop style code to a raindrop image for data augmentation. The proposed framework introduces a domain-invariant residual block to facilitate the identity mapping for the clean portion of the raindrop image. Extensive experiments on real-world raindrop datasets show that our network can achieve superior performance in raindrop removal to other unpaired image-to-image translation methods, even with comparable performance with state-of-the-art methods that require paired data.", "Image inpainting is one of the challenging problems in image restoration. To recover the missing region, we can only rely on the information in the uncorrupted region of the input image and some prior knowledge. The latter can be learned from suitable training data or implemented through some smoothness constraints. In this paper, a new approach for image inpainting is proposed. Here, we iteratively learn a guidance vector field from training data and recover the missing region by solving the Poisson equation using the learned guidance vector field with Dirichlet boundary conditions. In addition, we also propose a method to select the best training set by using the correlation between neighboring patches of the damaged input image and training images. The experimental results on face images show that the new approach yields smooth and visually pleasing results.", "This paper presents a new approach to generate a high quality facial image from a low resolution facial image, based on a large set of facial images belongs to the same person but varies in pose and expression. The input images are taken by low-end cameras or cameras from a long distance. The facial poses and expressions are not consistent and aligned. Firstly, using a low resolution facial image as a query image, a set of high resolution images with similar pose and expression is retrieved from the image examples by the proposed similarity measurement based on its shape and texture information of the query image. The selected images are then aligned with the query image and used as the candidates for the face hallucination. A Markov random field (MRF) model based on a new proposed color and edge constraints is introduced to find an optimum solution for the hallucination image. In the …", "Scene text detection remains a challenging problem as natural scene images are often displayed with complex issues. These include uneven lighting, blurring, varying text sizes and fonts, perspective distortion and oriented text. In recent years, there has been a growing focus on oriented text detection to address the prevalent issue of perspective distortion in natural scene text. However, most of these proposed methods are computationally expensive and slow. Therefore, they are not applicable to real-time detection, which is a crucial requirement for many practical applications-such as in visual navigation for autonomous vehicles. In this paper, we present a novel morphology-and machine learning-based method, the Region Extracting Morphological Operation (REMO) natural scene text detector. The proposed method is not only capable of detecting perspective-distorted and oriented text effectively, but is also …", "Recovering 3D structure from a sequence of images is one of typical interest topics in the computer vision community. In the past two decades, factorization algorithms have been widely applied to structure from motion (SFM) problems. It was first introduced to reconstruct rigid structure under arbitrary motion by Tomasi and Kanade [90]. Basically, the factorization algorithm for SFM decomposes the image feature tracks (measurement matrix) into motion of the camera and the 3D shape matrix via Singular Value Decomposition (SVD) and rank theorem. However, it is an ill-conditioned problem. Their linear transformations also yield valid motions and bases. Therefore, it is not possible to recover structure from the image sequence without some prior knowledge. Additional constraints such", "Recently, recovery of non-rigid structure by the factorization algorithms have received attention in the literature. The factorization algorithm decomposes the feature points over the given image sequence into motion of the camera and 3D shape bases. The non-rigid structure can be represented by the linear combination of the 3D shape bases. Although the closed-form solution of the non-rigid factorization algorithm is proven, the algorithm is sensitive to noise. In this paper, we propose a batch algorithm to recover multiple non-rigid structures from subsets of the data. Then, we introduce a set of non-linear shape constraints to optimize the recovered non-rigid structures. Synthetic data and real data were used in the experiments. The experimental results showed that the new factorization algorithm gives significant improvement than the original algorithm. With noisy data, the new algorithm is more robust and more accurate in recovering non-rigid structure."]}}