{"full_name": "Luu Anh Tuan", "designation": "Assistant Professor, School of Computer Science and Engineering", "email": "anhtuan.luu@ntu.edu.sg", "biography": "Luu Anh Tuan is an \bAssistant Professor in the School of Computer Science and Engineering (SCSE) at Nanyang Technological University, Singapore. He received his MSc degree from National University of Singapore in 2011 and Ph.D. degree from Nanyang Technological University in 2017. He was a Post-doctoral Research Fellow at Massachusetts Institute of Technology (MIT) from 2018 to 2020 under the supervision of Professor Regina Bazillay. Prior to that, he was a Research Scientist at Institute for Infocomm Research (I2R), A*STAR from 2016 to 2018.Tuan's research interests lie in the intersection of Artificial Intelligence, Deep Learning, and Natural Language Processing. He has published over 40 papers on top-tier conferences and journals including NeurIPS, ICLR, ACL, EMNLP, KDD, WWW, TACL, AAAI, etc. Tuan also served as the Senior Area Chair of EMNLP 2020, Area Chair of ACL 2021, Senior Program Committee of IJCAI 2020-2021, and Program Committee member of NeuIPS, ICLR, ICML, AAAI, etc. and standing reviewer of Transaction of ACL (TACL), Computational Linguistics (CL), Transactions on Knowledge and Data Engineering (TKDE), ACM Computing Surveys. He is a recipient of the Ministry of Trade and Industry (MTI) Singapore Innovation Award in 2013.", "google_scholar": "https://scholar.google.com/citations?user=d6ixOGYAAAAJ&hl=en&oi=ao", "orcid": null, "github": "https://tuanluu.github.io/", "scopus": null, "web_of_science": null, "other_websites": [], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["4382", "32", "51"], "Since 2018": ["4218", "31", "49"]}, "chart": {"2013": 13, "2014": 15, "2015": 27, "2016": 40, "2017": 49, "2018": 252, "2019": 470, "2020": 655, "2021": 827, "2022": 982, "2023": 1025}}, "interests": ["AI", "NLP", "Pretrained Language Model", "Robustness & TrustworthyInformation Extraction & Semantics"], "num_published": {"2023": 23, "2018": 17, "2017": 11, "2022": 13, "2019": 6, "2016": 2, "2021": 5, "2014": 2, "2010": 2, "2020": 3, "2015": 1, "2012": 3, "2013": 1, "2007": 1, "2024": 1, "unknown": 3}, "bachelor_degree": null, "masters": "National University of Singapore", "phd": "Nanyang Technological University"}