{"full_name": "Oh Hong Lye", "designation": "Senior Lecturer, School of Computer Science and Engineering", "email": "hloh@ntu.edu.sg", "image_path": "./profile_img/oh_hong_lye.jpg", "biography": "Prior to joining NTU, Oh Hong Lye worked in the semiconductor industry for 20 years in Application and R&D job functions, covering a wide range of embedded system and wireless connectivity related products in consumer, computer and industrial segments.  As part of his job function, he interacts frequently with product R&D and project management teams from Multinational, Small & Medium Enterprises and Start-up companies, both locally and oversea in US, Europe and Asia.  He is also one of the pioneers of the Texas Instruments Asia Technical Training Organisation and the first Mentor workshop instructor in Asia.  As a result of his significant contribution to the company share-holder value and technical community.  He is elected to the technical ladder of Senior Member of the Technical Staff in Texas Instruments.He holds three patents from his work done in Video Compression Algorithm when in STMicroelectronics Asia Pacific.  In NTU, his research interests includes embedded system and wireless connectivity.  The research projects he is involved in are the Singapore Millennium Foundation Grant: “Think on Your Feet - Learning through Purposeful Collaborative Play and Movement”, which uses wireless connectivity technology to enable purposeful play targeted initially at special needs students, and SCALE@NTU: “Lost and Found: Localisation”, a project that uses various outdoor and indoor localisation technologies to enable effective detection and intervention of Dementia Patients who are lost or wandering.He is currently the Assistant Chair (Student Care) and has previously served as the Chair for the SCSE Outreach Committee from 2018-2020.  He is awarded the Nanyang Education Awards (School) in 2019.", "grants": "Think on Your Feet- Learning Through Purposeful Collaborative Play and Movement (Booster Application)", "google_scholar": "https://scholar.google.com/citations?hl=en&user=d74x37YAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00131", "other_websites": [], "interests": [], "bachelor_degree": null, "masters": null, "phd": null, "published_by_year": {"2005": 1, "2021": 2, "2009": 2, "2017": 1, "2006": 1, "2020": 1, "2022": 2, "1997": 1, "2002": 1, "2023": 1, "2015": 1, "1996": 1, "1998": 0, "1999": 0, "2000": 0, "2001": 0, "2003": 0, "2004": 0, "2007": 0, "2008": 0, "2010": 0, "2011": 0, "2012": 0, "2013": 0, "2014": 0, "2016": 0, "2018": 0, "2019": 0}, "citations_by_year": {"Year": [1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "# of Citations": [0, 0, 0, 0, 0, 0, 0, 4, 3, 2, 4, 1, 3, 2, 7, 14, 12, 12, 14, 7, 7, 6, 11, 19, 26, 37, 33]}, "all_time_h_index": 7, "all_time_i10_index": 6, "h_index_by_publication_year": {"2005": 1, "2021": 2, "2009": 2, "2017": 1, "2006": 1, "2020": 1, "2022": 1, "1997": 1, "2002": 1, "1998": 0, "1999": 0, "2000": 0, "2001": 0, "2003": 0, "2004": 0, "2007": 0, "2008": 0, "2010": 0, "2011": 0, "2012": 0, "2013": 0, "2014": 0, "2015": 0, "2016": 0, "2018": 0, "2019": 0, "2023": 0}, "h_index_by_year": {"2005": 2, "2006": 2, "2007": 2, "2008": 2, "2009": 3, "2010": 3, "2011": 3, "2012": 4, "2013": 4, "2014": 4, "2015": 4, "2016": 4, "2017": 4, "2018": 4, "2019": 5, "2020": 5, "2021": 5, "2022": 6, "2023": 7, "1997": 0, "1998": 0, "1999": 0, "2000": 0, "2001": 0, "2002": 0, "2003": 0, "2004": 1}, "h_index_by_years_from_publication_year": {"Publication Year": [2005, 2021, 2009, 2017, 2006, 2020, 2022, 1997, 2002], "Year": [1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [[null, null, null, null, null, null, null, null, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 1, 1, 2], [null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 0, 1, 1, 1], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, 1, 1], [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [null, null, null, null, null, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]]}, "co_authors": {}}