{"full_name": "Sun Aixin", "designation": "Associate Chair (Academic), School of Computer Science and Engineering", "email": "axsun@ntu.edu.sg", "biography": "Dr. Sun Aixin is an Associate Professor and Assistant Chair (Academic) at the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. He has been a faculty member of SCSE since 2005 and was the Assistant Chair (Admissions and Outreach) from 2016 to 2020. He is a member of Singapore Data Science Consortium (SDSC) Technical Committee, and SDSC institution representative of NTU. His current research interests include information retrieval, text mining, social computing, and digital libraries.Dr. Sun received B.A.Sc (1st class honours) and Ph.D. both in Computer Engineering from NTU in 2001 and 2004 respectively. He has published about 200 papers in major international journals and conferences. According to Google Scholar, his papers have received more than 13,000 citations, with h-index above 50.Dr. Sun is an associate editor of Neurocomputing, editorial board member of Journal of the Association for Information Science and Technology (JASIST), and editorial board member of Information Retrieval Journal. He has served as the demonstration track co-chair for SIGIR2020, ICDM2018, CIKM2017, PC co-chair for AIRS2019, and general chair for ADMA2017. He was a member of the best paper committee for SIGIR2020. He has also served as Area Chair, Senior PC member or PC member for many conferences including SIGIR, WWW, WSDM, EMNLP, AAAI, and IJCAI.", "google_scholar": "https://scholar.google.com/citations?hl=en&user=wyKGVKUAAAAJ&view_op=list_works", "orcid": "https://orcid.org/0000-0003-0764-4258", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7202552214", "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/axsun"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["17279", "59", "160"], "Since 2018": ["11524", "47", "120"]}, "chart": {"2005": 69, "2006": 128, "2007": 123, "2008": 152, "2009": 231, "2010": 280, "2011": 362, "2012": 394, "2013": 420, "2014": 597, "2015": 801, "2016": 944, "2017": 1034, "2018": 1241, "2019": 1534, "2020": 1904, "2021": 2191, "2022": 2472, "2023": 2163}}, "interests": ["Information Retrieval", "Text Mining", "Recommender Systems"], "num_published": {"2019": 16, "2022": 20, "2013": 11, "2001": 3, "2012": 11, "2007": 10, "2014": 13, "2016": 8, "2002": 4, "2009": 13, "2018": 19, "2008": 12, "2020": 13, "2017": 13, "2005": 10, "2015": 9, "2004": 3, "2003": 4, "2006": 9, "2011": 11, "2021": 14, "2010": 9, "2023": 30}, "bachelor_degree": null, "masters": null, "phd": null}