{"full_name": "Wen Yonggang", "designation": "Associate Vice President (Capability Building)", "email": "ygwen@ntu.edu.sg", "biography": "Yonggang Wen is an IEEE Fellow and the Professor of Computer Science & Engineering at the School of Computer Science and Engineering (SCSE) of Nanyang Technological University, Singapore. He also serves as the Associate Dean (Research) at the College of Engineering(CoE). He received his PhD degree in Electrical Engineering and Computer Science (minor in Western Literature) from Massachusetts Institute of Technology (MIT), Cambridge, USA, in 2008. Dr. Wen has published over 200 papers in top journals and prestigious conferences. His work in Multi-Screen Cloud Social TV has been featured by global media (more than 1600 news articles from over 29 countries) and received ASEAN ICT Award 2013 (Gold Medal). His work on Cloud3DView, as the only academia entry, has won the Data Centre Dynamics Awards 2015 – APAC, and 2016 ASEAN ICT Awards (Gold Medal).  His research on applying AI for optimizing and automating data center operations and management (O&M), Project DCWiz, has been deployed by Alibaba to support its Cyber Sales Day in 2018 and won 2020 IEEE TCCPS Industrial Technical Excellence Award. He received 2016 Nanyang Award for Innovation and Entrepreneurship. He is a co-recipient of 2019 IEEE TCSVT Best Paper Award and 2015 IEEE Multimedia Best Paper Award, and a co-recipient of Best Paper Awards at IEEE Globecom 2016, EAI/ICST Chinacom 2015, IEEE WCSP 2014, IEEE Globecom 2013 and IEEE EUC 2012.He serves on editorial boards for multiple prestigious journals, including IEEE Wireless Communications, IEEE Communications Survey & Tutorials, IEEE Transactions on Multimedia, IEEE Transactions on Signal and Information Processing over Networks,  IEEE Access Journal and Elsevier Ad Hoc Networks, and was elected as the Chair for IEEE ComSoc Multimedia Communication Technical Committee (2014-2016). His research focuses on large-scale networked computer systems with applications to artificial intelligence, big data, cloud computing, and machine learning.", "google_scholar": "https://scholar.google.com/citations?hl=en&user=byeygOkAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/ygwen/"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["18234", "64", "186"], "Since 2018": ["13093", "51", "154"]}, "chart": {"2010": 47, "2011": 61, "2012": 86, "2013": 236, "2014": 427, "2015": 1043, "2016": 1342, "2017": 1571, "2018": 1797, "2019": 2030, "2020": 2126, "2021": 2319, "2022": 2623, "2023": 2174}}, "interests": ["Data Center", "Multimedia Systems"], "num_published": {"2014": 27, "2015": 35, "2016": 26, "2019": 21, "2013": 38, "2021": 25, "2012": 20, "2020": 24, "2017": 34, "2007": 2, "2005": 4, "2022": 21, "2011": 9, "2018": 19, "2008": 3, "2002": 1, "2023": 21, "2006": 3, "2003": 1, "2010": 1, "2004": 1, "2000": 1, "unknown": 12, "2009": 1, "2001": 1}}