{"full_name": "Wentong Cai", "designation": "Associate Chair (Faculty),  School of Computer Science and Engineering", "email": "aswtcai@ntu.edu.sg", "biography": "Wentong CAI is a Professor in the School of Compute Science and Engineering (SCSE) at Nanyang Technological University (NTU), Singapore.  He received his Ph.D. in Computer Science from University of Exeter (UK) in 1991.  He was a Post-doctoral Research Fellow at Queen's University (Canada) before joining NTU as a Faculty Member in 1993. Prof Cai’s expertise is mainly in the areas of Modelling and Simulation (particularly, modelling and simulation of large-scale complex systems, and system support for parallel and distributed simulation and distributed virtual environments).  He has published extensively in these areas and has received a number of best paper awards at the international conferences for his research (e.g., DS-RT’18, SIGSIM PADS’18, SIGSIM PADS’17, DS-RT’09, PADS’06, DS-RT’04, and ESS’03).  His recent research also involves using Agent-based Modelling techniques to understand the effect of individual behaviour on system-level dynamics and to develop scalable simulation applications (e.g., traffic and crowd simulation).He has been actively collaborating with Singapore industries (e.g., MPA, STEE, EADS, SAP, D-SIMLAB, and SGH) and research institutes (e.g., IHPC and SIMTech) on simulation projects.  Over his career, he has been successful in attracting competitive research funding from various funding agencies (e.g., MOE, A*STAR, NRF, and DSTA).  He has graduated 11 research Master and 15 PhD students as sole/main supervisor.  Prof Cai is a member of the IEEE and the ACM.  He has been an associate editor of the ACM Transactions on Modelling and Computer Simulation (TOMACS) since 2007, an editor of the Future Generation Computer Systems (FGCS) since 2011.  He is also an editor of the Journal of Simulation (JOS).  He has chaired a number of international conferences in the areas of Modelling and Simulation, and Parallel and Distributed Computing.  Most recent ones include: SIGSIM PADS’17, DS-RT’15, CloudCom’14, ICPADS’12, and MACOTS’11.", "google_scholar": "https://scholar.google.com/citations?hl=en&user=QdmIiyIAAAAJ", "orcid": "https://orcid.org/0000-0002-0183-3835", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7401711207", "web_of_science": "https://www.webofscience.com/wos/author/record/890646", "other_websites": ["http://personal.ntu.edu.sg/aswtcai/"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["7510", "43", "195"], "Since 2018": ["2704", "28", "66"]}, "chart": {"1994": 31, "1995": 46, "1996": 39, "1997": 34, "1998": 54, "1999": 63, "2000": 79, "2001": 66, "2002": 91, "2003": 109, "2004": 157, "2005": 228, "2006": 231, "2007": 249, "2008": 282, "2009": 311, "2010": 300, "2011": 284, "2012": 325, "2013": 319, "2014": 335, "2015": 292, "2016": 355, "2017": 370, "2018": 410, "2019": 371, "2020": 425, "2021": 549, "2022": 542, "2023": 405}}, "interests": ["Parallel and Distributed Computing", "Modeling and Simulation"], "num_published": {"2010": 25, "2006": 9, "1999": 12, "2008": 13, "2004": 27, "1995": 7, "2000": 11, "2018": 17, "2002": 18, "2015": 21, "2014": 18, "1992": 4, "2005": 20, "1996": 7, "2019": 11, "2009": 18, "2020": 22, "1994": 4, "2001": 13, "2017": 15, "2007": 12, "2016": 16, "1997": 6, "2013": 14, "2012": 10, "2003": 22, "2011": 18, "1998": 6, "1993": 4, "2021": 17, "1989": 3, "2022": 19, "1991": 1, "unknown": 55, "2023": 9, "1990": 1}}