{"full_name": "Yeo Chai Kiat", "designation": "Associate Professor, School of Computer Science and Engineering", "email": "asckyeo@ntu.edu.sg", "biography": "Associate Professor Yeo Chai Kiat is currently in the School of Computer Science and Engineering (SCSE). She received her Ph.D. in electrical and electronic engineering from the Nanyang Technological University and her MSc and B.Eng. (1st class honours) in electrical and electronic engineering from National University of Singapore. She has spent six years with Singapore Electronic and Engineering Limited (SEEL), a company now subsumed under Singapore Technologies Engineering, first as an engineer and later held the concurrent position of Assistant Principal Engineer and Deputy Program Manager.A/P Yeo is currently the Deputy Director and Programme Director of Singtel Cognitive land Artificial Intelligence Lab for Enterprises@NTU (SCALE@NTU). She is also the Assistant Chair (Faculty) of SCSE. She was the Associate Chair (Academic) of SCSE from Dec 2007 to May 2017 and the Sub Dean of School of Applied Science (predecessor of SCSE)  from Jun 1996 to May 1999. She has been a Visiting Professor with Osaka University, Graduate School of Information Science and Technology. She was Deputy Director of Centre for Multimedia and Network Technology (CeMNet) from Jul 2006 until Jun 2008.A/P Yeo has published over 280 research papers in international journals and conference proceedings in the areas of anomaly detection, predictive analytics, machine learning, AI, mobile networks, internet technologies, overlay networks and speech processing. She has also directed a number of funded projects in these areas.", "google_scholar": "https://scholar.google.com/citations?user=jWi-5AYAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-7618-1472", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7102545548", "web_of_science": null, "other_websites": ["https://personal.ntu.edu.sg/asckyeo/"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["4286", "31", "100"], "Since 2018": ["1991", "23", "52"]}, "chart": {"2001": 27, "2002": 17, "2003": 30, "2004": 36, "2005": 45, "2006": 70, "2007": 117, "2008": 121, "2009": 112, "2010": 139, "2011": 147, "2012": 218, "2013": 240, "2014": 261, "2015": 255, "2016": 221, "2017": 184, "2018": 247, "2019": 271, "2020": 287, "2021": 327, "2022": 437, "2023": 418}}, "interests": ["Anomaly Detection", "Predictive Analytics", "Machine Learning", "Artificial Intelligence", "Wireless Networks"], "num_published": {"2018": 18, "1998": 6, "2006": 8, "2004": 5, "2005": 11, "2011": 17, "1999": 15, "2009": 16, "2021": 11, "2015": 11, "2012": 20, "1997": 4, "2017": 12, "2014": 10, "2003": 7, "2010": 20, "2016": 11, "2019": 5, "2013": 11, "2008": 11, "2000": 10, "2020": 6, "2002": 10, "2007": 12, "2022": 13, "2001": 7, "2023": 8, "unknown": 18, "1996": 3, "1994": 1}, "bachelor_degree": null, "masters": null, "phd": null}