{"full_name": "Yu Han", "designation": "Nanyang Assistant Professor, School of Computer Science and Engineering", "email": "han.yu@ntu.edu.sg", "biography": "Dr Han Yu is a Nanyang Assistant Professor (NAP) in the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. He has been a Visiting Scholar at the Department of Computer Science and Engineering, Hong Kong University of Science and Technology (HKUST) from 2017 to 2018. Between 2015 and 2018, he held the prestigious Lee Kuan Yew Post-Doctoral Fellowship (LKY PDF) at the Joint NTU-UBC Research Centre of Excellence in Active Living for the Elderly (LILY). Before joining NTU, he worked as an Embedded Software Engineer at Hewlett-Packard (HP) Pte Ltd, Singapore. He obtained his PhD from the School of Computer Science and Engineering, NTU in 2014. During his PhD study, he held the prestigious Singapore Millennium Foundation (SMF) PhD Scholarship. His research focuses on online convex optimization, ethical AI, federated machine learning and their applications in complex collaborative systems such as crowdsourcing. He has published over 150 research papers in book chapters, leading international conferences and journals including AAAI, IJCAI, CVPR, SIGIR, ASE, ACM MM, CIKM, AAMAS, NAACL, ICME and ACM/IEEE Transactions. He co-authored the book \"Federated Learning\" - the first monograph on the topic of federated learning. His research work has been recognized with 25 awards from conferences and journals. He is an Associate Editor of IEEE TNNLS. He is a founding Co-PI of the Trustworthy Federated Ubiquitous Learning (TrustFUL) Research Lab (https://trustful.federated-learning.org/).", "google_scholar": "https://scholar.google.com.sg/citations?user=eXgoTXMAAAAJ&hl=en", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55753004000", "web_of_science": "https://www.webofscience.com/wos/author/record/1174765", "other_websites": ["http://hanyu.sg"], "citation_statistics": {"table": {"": ["Citations", "h-index", "i10-index"], "All": ["12407", "48", "122"], "Since 2018": ["10797", "39", "100"]}, "chart": {"2011": 43, "2012": 66, "2013": 76, "2014": 121, "2015": 333, "2016": 493, "2017": 294, "2018": 280, "2019": 403, "2020": 1059, "2021": 2140, "2022": 3398, "2023": 3494}}, "interests": ["Federated Learning", "AI Ethics", "Computational Social Choice", "Trustworthy AI", "Trust and Reputation Management"], "num_published": {"2021": 29, "2018": 15, "2019": 25, "2020": 39, "2010": 6, "2022": 45, "2013": 9, "2017": 13, "2009": 5, "2012": 9, "2016": 17, "2015": 14, "2014": 10, "2007": 3, "2011": 5, "2023": 62, "2008": 1, "2006": 1, "2024": 1, "2005": 1}, "bachelor_degree": null, "masters": null, "phd": null}