[{"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:u5HHmVD_uO8C", "title": "Compositional analysis framework using EDP resource models", "authors": ["Arvind Easwaran", "Madhukar Anand", "Insup Lee"], "description": "Compositional schedulability analysis of hierarchical scheduling frameworks is a well studied problem, as it has wide-ranging applications in the embedded systems domain. Several techniques, such as periodic resource model based abstraction and composition, have been proposed for this problem. However these frameworks are sub-optimal because they incur bandwidth overhead. In this work, we introduce the explicit deadline periodic (EDP) resource model, and present compositional analysis techniques under EDF and DM. We show that these techniques are bandwidth optimal, in that they do not incur any bandwidth overhead in abstraction or composition. Hence, this framework is more efficient when compared to existing approaches.", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 8, 26, 23, 25, 24, 24, 26, 23, 17, 12, 12, 9, 7, 9, 7, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:u-x6o8ySG0sC", "title": "Hierarchical scheduling framework for virtual clustering of multiprocessors", "authors": ["Insik Shin", "Arvind Easwaran", "Insup Lee"], "description": "Scheduling of sporadic task systems on multiprocessor platforms is an area which has received much attention in the recent past. It is widely believed that finding an optimal scheduler is hard, and therefore most studies have focused on developing algorithms with good utilization bounds. These algorithms can be broadly classified into two categories: partitioned scheduling in which tasks are statically assigned to individual processors, and globalscheduling in which each task is allowed to execute on any processor in the platform. In this paper we consider a third, more general, approach called cluster-based scheduling. In this approach each task is statically assigned to a processor cluster, tasks in each cluster areglobally scheduled among themselves, and clusters in turn are scheduled on the multiprocessor platform. We develop techniques to support such cluster-based scheduling algorithms, and also consider …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 19, 20, 26, 17, 21, 24, 21, 14, 18, 17, 6, 7, 16, 5, 2, 5]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:9yKSN-GCB0IC", "title": "Resource sharing in global fixed-priority preemptive multiprocessor scheduling", "authors": ["Arvind Easwaran", "Bjorn Andersson"], "description": "In this paper we consider global fixed-priority preemptive multiprocessor scheduling of constrained-deadline sporadic tasks that share resources in a non-nested manner. We develop a novel resource-sharing protocol and a corresponding schedulability test for this system. We also develop the first schedulability analysis of priority inheritance protocol for the aforementioned system. Finally, we show that these protocols are efficient (based on the developed schedulability tests) for a class of priority-assignments called reasonable priority-assignments.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 18, 13, 13, 14, 8, 7, 2, 7, 7, 5, 11, 4, 7, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:9ZlFYXVOiuMC", "title": "Response time analysis of cots-based multicores considering the contention on the shared memory bus", "authors": ["Dakshina Dasari", "Bjorn Andersson", "Vincent Nelis", "Stefan M Petters", "Arvind Easwaran", "Jinkyu Lee"], "description": "The current industry trend is towards using Commercially available Off-The-Shelf (COTS) based multicores for developing real time embedded systems, as opposed to the usage of custom-made hardware. In typical implementation of such COTS-based multicores, multiple cores access the main memory via a shared bus. This often leads to contention on this shared channel, which results in an increase of the response time of the tasks. Analyzing this increased response time, considering the contention on the shared bus, is challenging on COTS-based systems mainly because bus arbitration protocols are often undocumented and the exact instants at which the shared bus is accessed by tasks are not explicitly controlled by the operating system scheduler; they are instead a result of cache misses. This paper makes three contributions towards analyzing tasks scheduled on COTS-based multicores. Firstly, we …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 12, 17, 13, 13, 6, 7, 8, 6, 12, 8, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:2osOgNQ5qMEC", "title": "Optimal virtual cluster-based multiprocessor scheduling", "authors": ["Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "Scheduling of constrained deadline sporadic task systems on multiprocessor platforms is an area which has received much attention in the recent past. It is widely believed that finding an optimal scheduler is hard, and therefore most studies have focused on developing algorithms with good processor utilization bounds. These algorithms can be broadly classified into two categories: partitioned scheduling in which tasks are statically assigned to individual processors, and global scheduling in which each task is allowed to execute on any processor in the platform. In this paper we consider a third, more general, approach called cluster-based scheduling. In this approach each task is statically assigned to a processor cluster, tasks in each cluster are globally scheduled among themselves, and clusters in turn are scheduled on the multiprocessor platform. We develop techniques to support such cluster-based …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 9, 11, 7, 13, 8, 6, 7, 7, 8, 8, 5, 6, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:IjCSPb-OGe4C", "title": "A compositional scheduling framework for digital avionics systems", "authors": ["Arvind Easwaran", "Insup Lee", "Oleg Sokolsky", "Steve Vestal"], "description": "ARINC specification 653-2 describes the interface between application software and underlying middleware in a distributed real-time avionics system. The real-time workload in this system comprises of partitions, where each partition consists of one or more processes. Processes incur blocking and preemption overheads and can communicate with other processes in the system. In this work we develop compositional techniques for automated scheduling of such partitions and processes. At present, system designers manually schedule partitions based on interactions they have with the partition vendors. This approach is not only time consuming, but can also result in under utilization of resources. In contrast, the technique proposed in this paper is a principled approach for scheduling ARINC-653 partitions and therefore should facilitate system integration.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 12, 7, 9, 8, 8, 15, 7, 1, 6, 4, 4, 6, 5, 2, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:j3f4tGmQtD8C", "title": "Demand-based scheduling of mixed-criticality sporadic tasks on one processor", "authors": ["Arvind Easwaran"], "description": "Strategies that artificially tighten high-criticality task deadlines in low-criticality behaviors have been successfully employed for scheduling mixed-criticality systems. Although efficient scheduling algorithms have been developed for implicit deadline task systems, the same is not true for more general sporadic tasks. In this paper we develop a new demand-based schedulability test for such general mixed-criticality task systems, in which we collectively bound the low- and high-criticality demand of tasks. We show that the new test strictly dominates the only other known demand-based test for such systems. We also propose a new deadline tightening strategy based on this test, and show through simulations that the strategy significantly outperforms all known scheduling algorithms for a variety of sporadic task systems.", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 8, 8, 9, 14, 11, 8, 6, 8, 11, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:HDshCWvjkbEC", "title": "Global edf schedulability analysis for synchronous parallel tasks on multicore platforms", "authors": ["Hoon Sung Chwa", "Jinkyu Lee", "Kieu-My Phan", "Arvind Easwaran", "Insik Shin"], "description": "The trend towards multi-core/many-core architectures is well underway. It is therefore becoming very important to develop software in ways that take advantage of such parallel architectures. This particularly entails a shift in programming paradigms towards fine-grained, thread-parallel computing. Many parallel programming models have been introduced targeting such intra-task thread-level parallelism. However, most successful results on traditional multi-core real-time scheduling are focused on sequential programming models. For example, thread-level parallelism is not properly captured into the concept of interference, which is key to many schedulability analysis techniques. Thereby, most interference-based analysis techniques are not directly applicable to parallel programming models. Motivated by this, we extend the notion of interference to capture thread-level parallelism more accurately. We then …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 8, 9, 11, 10, 8, 13, 5, 5, 7, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:JV2RwH3_ST0C", "title": "MC-Fluid: Fluid model-based mixed-criticality scheduling on multiprocessors", "authors": ["Jaewoo Lee", "Kieu-My Phan", "Xiaozhe Gu", "Jiyeon Lee", "Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "A mixed-criticality system consists of multiple components with different criticalities. While mixed-criticality scheduling has been extensively studied for the uniprocessor case, the problem of efficient scheduling for the multiprocessor case has largely remained open. We design a fluid model-based multiprocessor mixed-criticality scheduling algorithm, called MC-Fluid, in which each task is executed in proportion to its criticality-dependent rate. We propose an exact schedulability condition for MC-Fluid and an optimal assignment algorithm for criticality-dependent execution rates with polynomial complexity. Since MC-Fluid cannot construct a schedule on real hardware platforms due to the fluid assumption, we propose MC-DP-Fair algorithm, which can generate a non-fluid schedule while preserving the same schedulability properties as MC-Fluid. We show that MC-Fluid has a speedup factor of (1 + v 5)/2 ( 1.618 …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 8, 11, 15, 12, 6, 8, 10, 1, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:d1gkVwhDpl0C", "title": "Incremental schedulability analysis of hierarchical real-time components", "authors": ["Arvind Easwaran", "Insik Shin", "Oleg Sokolsky", "Insup Lee"], "description": "Embedded systems are complex as a whole but consist of smaller independent modules minimally interacting with each other. This structure makes embedded systems amenable to compositional system design. Compositional design of real-time embedded systems can be done using hierarchical systems which consist of real-time components arranged in a scheduling hierarchy. Each component consists of a real-time workload and a scheduling policy for the workload. To simplify schedulability analysis of hierarchical systems, analysis can be done compositionally using interfaces that abstract the timing requirements of components. Associative composition will facilitate analysis of systems in which components are modified on the fly. In this paper, we propose efficient algorithms to abstract the resource requirements of components in the form of periodic resource models. Each component interface consists of a …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [5, 10, 10, 5, 9, 11, 4, 3, 5, 5, 1, 1, 3, 0, 0, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:ns9cj8rnVeAC", "title": "Resource efficient isolation mechanisms in mixed-criticality scheduling", "authors": ["Xiaozhe Gu", "Arvind Easwaran", "Kieu-My Phan", "Insik Shin"], "description": "Mixed-criticality real-time scheduling has been developed to improve resource utilization while guaranteeing safe execution of critical applications. These studies use optimistic resource reservation for all the applications to improve utilization, but prioritize critical applications when the reservations become insufficient at runtime. Many of them however share an impractical assumption that all the critical applications will simultaneously demand additional resources. As a consequence, they under-utilize resources by penalizing all the low-criticality applications. In this paper we overcome this shortcoming using a novel mechanism that comprises a parameter to model the expected number of critical applications simultaneously demanding more resources, and an execution strategy based on the parameter to improve resource utilization. Since most mixed criticality systems in practice are component-based, we design …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 4, 11, 11, 11, 2, 6, 5, 6, 2]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:CHSYGLWDkRkC", "title": "MC-Fluid: simplified and optimally quantified", "authors": ["Sanjoy Baruah", "Arvind Easwaran", "Zhishan Guo"], "description": "The fluid scheduling model allows for schedules in which an individual task may be assigned a fraction of a processor at each time instant. These assignments are subject to the constraints that no fraction exceeds one and the sum of all the assigned fractions do not exceed the sum of the computing capacities of all the processors at any instant. An algorithm, MC-Fluid, has recently been proposed for scheduling systems of mixed-criticality implicit-deadline sporadic tasks under the fluid scheduling model. MC-Fluid has been shown to have a speedup bound no worse than (1 + √5)/2 or ≈ 1.618 for scheduling dual-criticality systems. We derive here a simplified variant of MC-Fluid called MCF, that has run-time linear in the number of tasks. We prove that this simplified variant has a speedup bound no worse than 4/3 for dual-criticality systems, and show that this implies that MC-Fluid, too, has a speedup bound no …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 5, 9, 8, 11, 6, 8, 6, 1, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:zA6iFVUQeVQC", "title": "Dynamic budget management with service guarantees for mixed-criticality systems", "authors": ["Xiaozhe Gu", "Arvind Easwaran"], "description": "Many existing studies on mixed-criticality (MC) scheduling assume that low-criticality budgets for high-criticality applications are known apriori. These budgets are primarily used as guidance to determine when the scheduler should switch the system mode from low to high. Based on this key observation, in this paper we propose a dynamic MC scheduling model under which low-criticality budgets for individual high-criticality applications are determined at runtime as opposed to being fixed offline. To ensure sufficient budget for high-criticality applications at all times, we use offline schedulability analysis to determine a system-wide total low-criticality budget allocation for all the high-criticality applications combined. This total budget is used as guidance in our model to determine the need for a mode-switch. The runtime strategy then distributes this total budget among the various applications depending on their …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 10, 11, 8, 7, 2, 8, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:ldfaerwXgEUC", "title": "Under-approximating backward reachable sets by polytopes", "authors": ["Bai Xue", "Zhikun She", "Arvind Easwaran"], "description": "Under-approximations are useful for falsification of safety properties for nonlinear (hybrid) systems by finding counter-examples. Polytopic under-approximations enable analysis of these properties using reasoning in the theory of linear arithmetic. Given a nonlinear system, a target region of the simply connected compact type and a time duration, we in this paper propose a method using boundary analysis to compute an under-approximation of the backward reachable set. The under-approximation is represented as a polytope. The polytope can be computed by solving linear program problems. We test our method on several examples and compare them with existing methods. The results show that our method is highly promising in under-approximating reachable sets. Furthermore, we explore some directions to improve the scalability of our method.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 4, 10, 9, 8, 7, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:rO6llkc54NcC", "title": "Probabilistic analysis for mixed criticality systems using fixed priority preemptive scheduling", "authors": ["Dorin Maxim", "Robert I Davis", "Liliana Cucu-Grosjean", "Arvind Easwaran"], "description": "This paper introduces probabilistic analysis for fixed priority preemptive scheduling of mixed criticality systems on a uniprocessor using the Adaptive Mixed Criticality (AMC) and Static Mixed Criticality (SMC) schemes. We compare this analysis to existing deterministic methods, highlighting the performance gains that can be obtained by utilising more detailed information about worst-case execution time estimates described in terms of probability distributions. Besides improvements in schedulability, we also demonstrate significant gains in terms of the budgets that can be allocated to LO-criticality tasks.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 4, 8, 5, 6, 7, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:Y0pCki6q_DkC", "title": "LLF schedulability analysis on multiprocessor platforms", "authors": ["Jinkyu Lee", "Arvind Easwaran", "Insik Shin"], "description": "LLF (Least Laxity First) scheduling, which assigns a higher priority to a task with smaller laxity, has been known as an optimal preemptive scheduling algorithm on a single processor platform. However, its characteristics upon multiprocessor platforms have been little studied until now. Orthogonally, it has remained open how to efficiently schedule general task systems, including constrained deadline task systems, upon multiprocessors. Recent studies have introduced zero laxity (ZL) policy, which assigns a higher priority to a task with zero laxity, as a promising scheduling approach for such systems (e.g., EDZL). Towards understanding the importance of laxity in multiprocessor scheduling, this paper investigates the characteristics of ZL policy and presents the first ZL schedulability test for any work-conserving scheduling algorithm that employs this policy. It then investigates the characteristics of LLF scheduling …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 7, 5, 3, 5, 3, 2, 2, 1, 2, 2, 1, 0, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:HE397vMXCloC", "title": "Towards safe machine learning for cps: infer uncertainty from training data", "authors": ["Xiaozhe Gu", "Arvind Easwaran"], "description": "Machine learning (ML) techniques are increasingly applied to decision-making and control problems in Cyber-Physical Systems among which many are safety-critical, e.g., chemical plants, robotics, autonomous vehicles. Despite the significant benefits brought by ML techniques, they also raise additional safety issues because 1) most expressive and powerful ML models are not transparent and behave as a black box and 2) the training data which plays a crucial role in ML safety is usually incomplete. An important technique to achieve safety for ML models is \"Safe Fail\", i.e., a model selects a reject option and applies the backup solution, a traditional controller or a human operator for example, when it has low confidence in a prediction. Data-driven models produced by ML algorithms learn from training data, and hence they are only as good as the examples they have learnt. As pointed in [17], ML models work well …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 7, 7, 13, 7, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:Wp0gIr-vW9MC", "title": "CARTS: a tool for compositional analysis of real-time systems", "authors": ["Linh TX Phan", "Jaewoo Lee", "Arvind Easwaran", "Vinay Ramaswamy", "Sanjian Chen", "Insup Lee", "Oleg Sokolsky"], "description": "As real-time embedded systems are increasingly complex, integration becomes a great challenge in their design and development. Managing complexity of the system design is therefore essential for high-assurance and cost-effective development. Component-based design has consequently been developed and gained its importance over the years as a powerful technique for complexity management. In this design paradigm, a large complex system is first decomposed into smaller and simpler components - which are developed independently - before recomposing them into a complete system using interfaces that abstract away their internal complexities.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 1, 7, 4, 6, 6, 3, 1, 1, 3, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:Se3iqnhoufwC", "title": "Finding an upper bound on the increase in execution time due to contention on the memory bus in COTS-based multicore systems", "authors": ["Björn Andersson", "Arvind Easwaran", "Jinkyu Lee"], "description": "Contention on the memory bus in COTS based multicore systems is becoming a major determining factor of the execution time of a task. Analyzing this extra execution time is non-trivial because (i) bus arbitration protocols in such systems are often undocumented and (ii) the times when the memory bus is requested to be used are not explicitly controlled by the operating system scheduler; they are instead a result of cache misses. We present a method for finding an upper bound on the extra execution time of a task due to contention on the memory bus in COTS based multicore systems. This method makes no assumptions on the bus arbitration protocol (other than assuming that it is work-conserving).", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 2, 1, 3, 6, 9, 1, 2, 4, 1, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&citation_for_view=B_ouhTgAAAAJ:Y5dfb0dijaUC", "title": "Challenges in digital twin development for cyber-physical production systems", "authors": ["Heejong Park", "Arvind Easwaran", "Sidharta Andalam"], "description": "The recent advancement of information and communication technology makes digitalisation of an entire manufacturing shop-floor possible where physical processes are tightly intertwined with their cyber counterparts. This led to an emergence of a concept of digital twin, which is a realistic virtual copy of a physical object. Digital twin will be the key technology in Cyber-Physical Production Systems (CPPS) and its market is expected to grow significantly in the coming years. Nevertheless, digital twin is still relatively a new concept that people have different perspectives on its requirements, capabilities, and limitations. To better understand an effect of digital twin’s operations, mitigate complexity of capturing dynamics of physical phenomena, and improve analysis and predictability, it is important to have a development tool with a strong semantic foundation that can accurately model, simulate, and synthesise …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 10, 10, 8, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:WF5omc3nYNoC", "title": "Maximizing contention-free executions in multiprocessor scheduling", "authors": ["Jinkyu Lee", "Arvind Easwaran", "Insik Shin"], "description": "It is widely assumed that scheduling real-time tasks becomes more difficult as their deadlines get shorter. With deadlines shorter, however, tasks potentially compete less with each other for processors, and this could produce more contention-free slots at which the number of competing tasks is smaller than or equal to the number of available processors. This paper presents a policy (called CF policy) that utilizes such contention-free slots effectively. This policy can be employed by any work-conserving, preemptive scheduling algorithm, and we show that any algorithm extended with this policy dominates the original algorithm in terms of schedulability. We also present improved schedulability tests for algorithms that employ this policy, based on the observation that interference from tasks is reduced when their executions are postponed to contention-free slots. Finally, using the properties of the CF policy, we derive a …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 6, 0, 5, 2, 3, 4, 1, 3, 2, 1, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:UeHWp8X0CEIC", "title": "Compositional schedulability analysis of hierarchical real-time systems", "authors": ["Arvind Easwaran", "Insup Lee", "Insik Shin", "Oleg Sokolsky"], "description": "Embedded systems are complex as a whole but consist of smaller independent modules interacting with each other. This structure makes them amenable to compositional design. Real-time embedded systems consist of realtime workloads having deadlines. Compositional design of such systems can be done using real-time components arranged in a scheduling hierarchy. Each component consists of some real-time workload and a scheduling policy for the workload. To simplify schedulability analysis for such systems, analysis should be done compositionally using interfaces that abstract timing requirement of components. To facilitate analysis of dynamically changing systems, the framework should also support incremental analysis. In this paper, we overview our approach to compositional and incremental schedulability analysis of hierarchical real-time systems. We describe a compositional analysis technique …", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 1, 2, 5, 4, 4, 1, 7, 1, 0, 1, 3, 1, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:SeFeTyx0c_EC", "title": "Global EDF schedulability analysis for parallel tasks on multi-core platforms", "authors": ["Hoon Sung Chwa", "Jinkyu Lee", "Jiyeon Lee", "Kiew-My Phan", "Arvind Easwaran", "Insik Shin"], "description": "With the widespread adoption of multi-core architectures, it is becoming more important to develop software in ways that takes advantage of such parallel architectures. This particularly entails a shift in programming paradigms towards fine-grained, thread-parallel computing. Many parallel programming models have been introduced for targeting such intra-task thread-level parallelism. However, most successful results on traditional multi-core real-time scheduling are focused on sequential programming models. For example, thread-level parallelism is not properly captured into the concept of interference, which is key to many schedulability analysis techniques. Thereby, most interference-based analysis techniques are not directly applicable to parallel programming models. Motivated by this, we extend the notion of interference to capture thread-level parallelism more accurately. We then leverage the proposed …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 5, 6, 9, 3, 7, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:qjMakFHDy7sC", "title": "Steering of discrete event systems: Control theory approach", "authors": ["Arvind Easwaran", "Sampath Kannan", "Oleg Sokolsky"], "description": "Runtime verification involves monitoring the system at runtime to check for conformance of the execution trace to user defined safety properties. Typically, run-time verifiers do not assume a system model and hence cannot predict violations until they occur. This limits the practical applicability of runtime verification. Steering is the process of predicting the occurrence of violations and preventing them by controlling system execution. Steerers can achieve this using a limited knowledge of the system model even in situations where it is infeasible to store the entire model. In this paper, we explore a control-theoretic view of steering for discrete event systems. We introduce an architecture for steering and also describe different steering paradigms.", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 0, 4, 1, 2, 3, 4, 6, 2, 1, 1, 0, 3, 0, 1, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:ZHo1McVdvXMC", "title": "Reach-avoid verification for nonlinear systems based on boundary analysis", "authors": ["Bai Xue", "Arvind Easwaran", "Nam-Joon Cho", "Martin Fränzle"], "description": "In this technical note, we propose a set-boundary based method to verify reach-avoid properties of non-linear dynamical systems with parametric uncertainty, which works under the assumption that the initial set is a compact set. In comparison to the conventional approach employing safely overapproximating state extrapolation on the full volume of the initial set, our boundary-based method applies such state extrapolation only to the initial set's boundary, and thus to a set of significantly smaller volume. This can help enhance precision and reduce computational burden when solving reach-avoid verification problems, especially for cases with large initial sets and/or large time horizons. Furthermore, our boundary-based method lifts existing reachability-analysis techniques with their often confined geometric representations of reachable sets (like interval boxes, zonotopes, polyhedra, ellipsoids) to considerably more …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 5, 3, 4, 2, 9, 6, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:kRWSkSYxWN8C", "title": "A hierarchical framework for holistic optimization of the operations of district cooling systems", "authors": ["Zhonglin Chiam", "Arvind Easwaran", "David Mouquet", "Samira Fazlollahi", "Jaume V Millás"], "description": "The potential for greater energy efficiency gave rise to the popularity of implementing district cooling systems. In newer districts, however, the discrepancy between the designed capacity of the cooling system and actual cooling demand usually negates these benefits. In such scenarios, the optimization of the system’s operations with respect to cooling demand could considerably improve the energy efficiency of the system, without incurring additional capital costs.Components of a district cooling system are usually operated at pre-defined setpoints or individually optimized, without regard of the impact on the overall system. Formulation of an optimization problem which adequately captures the thermal and physical interactions as well as the tight coupling between components, i.e., holistically, results in a mixed integer non-linear program which is large and difficult to solve. In this article, a hierarchical optimization …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 3, 5, 11, 9, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:hC7cP41nSMkC", "title": "Zero-laxity based real-time multiprocessor scheduling", "authors": ["Jinkyu Lee", "Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "It has been widely studied how to schedule real-time tasks on multiprocessor platforms. Several studies have developed optimal scheduling policies for implicit deadline task systems. So far however, studies have failed to develop effective scheduling strategies for more general task systems such as constrained deadline tasks. We argue that a narrow focus on deadline satisfaction (urgency) is the primary reason for this lack of success. In particular, few studies have considered the impact on scheduling of the restriction that a job cannot simultaneously execute on more than one core (parallelism). In this paper we look at one such simple, but effective, characterization of urgency and parallelism – the zero laxity first policy (ZL policy). We study in detail how beneficial the ZL policy is to schedulability. We then develop an improved schedulability test for any algorithm that employs the ZL policy, and prove that the test …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 1, 7, 3, 3, 2, 4, 4, 0, 1, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:zYLM7Y9cAGgC", "title": "Compositional feasibility analysis of conditional real-time task models", "authors": ["Madhukar Anand", "Arvind Easwaran", "Sebastian Fischmeister", "Insup Lee"], "description": "Conditional real-time task models, which are generalizations of periodic, sporadic, and multi-frame tasks, represent real world applications more accurately. These models can be classified based on a tradeoff in two dimensions - expressivity and hardness of schedulability analysis. In this work, we introduce a class of conditional task models and derive efficient schedulability analysis techniques for them. These models are more expressive than existing models for which efficient analysis techniques are known. In this work, we also lay the groundwork for schedulability analysis of hierarchical scheduling frameworks with conditional task models. We propose techniques that abstract timing requirements of conditional task models, and support compositional analysis using these abstractions.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 2, 3, 4, 1, 3, 2, 2, 1, 0, 0, 2, 2, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:M3NEmzRMIkIC", "title": "Mapping time-critical safety-critical cyber physical systems to hybrid FPGAs", "authors": ["Kizheppatt Vipin", "Shanker Shreejith", "Suhaib A Fahmy", "Arvind Easwaran"], "description": "Cyber Physical Systems (CPSs), such as those found in modern vehicles, include a number of important time and safety-critical functions. Traditionally, applications are mapped to several dedicated electronic control units (ECUs), and hence, as new functions are added, compute weight and cost increase considerably.%ECU consolidation, where multiple functions are combined on fewer ECUs is an important area, but traditional software ECUs fail to offer the required performance, parallelism, and isolation to support this. With increasing computational and communication demands, traditional software ECUs fail to offer the required performance to provide determinism and predictability, while multi-core approaches fail to provide sufficient isolation between tasks. Hybrid FPGAs, combining a processor and reconfigurable fabric on a single die, allow for parallel hardware implementation of complex sensor …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 6, 2, 2, 4, 4, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:UebtZRa9Y70C", "title": "Advances in hierarchical real-time systems: Incrementality, optimality, and multiprocessor clustering", "authors": ["Arvind Easwaran"], "description": "Component-based engineering is a popular design strategy for multi-functional and complex real-time systems; it decomposes the system into simpler components and then composes them using interfaces that hide internal complexities. Since components also have time-constrained resource demand, this design leads to hierarchical real-time systems that share resources under a scheduling hierarchy. Due to resource-constrained operating environments, schedulability analysis of such hierarchical systems-analysis to verify satisfaction of component timing constraints-is an important problem that must be addressed in the design phase. Additionally, to preserve the principles of component-based engineering, this analysis must be compositional, ie, system schedulability must be determined by composing interfaces that abstractly represent component resource requirements.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 4, 6, 3, 4, 2, 3, 0, 1, 0, 0, 0, 0, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:LkGwnXOMwfcC", "title": "Provably good multiprocessor scheduling with resource sharing", "authors": ["Björn Andersson", "Arvind Easwaran"], "description": "We present a 12(1+3R/(4m)) competitive algorithm for scheduling implicit-deadline sporadic tasks on a platform comprising m processors, where a task may request one of R shared resources.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 1, 3, 1, 1, 1, 2, 3, 4, 0, 1, 3, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:bEWYMUwI8FkC", "title": "Composition of schedulability analyses for real-time multiprocessor systems", "authors": ["Jinkyu Lee", "Kang G Shin", "Insik Shin", "Arvind Easwaran"], "description": "With increasing popularity and deployment of multi-core chips in embedded systems, a number of real-time multiprocessor scheduling algorithms have been proposed along with their schedulability analyses (or tests), which verify temporal correctness under a specific algorithm. Each of these algorithms often comes with several different schedulability tests, especially when it is difficult to find exact schedulability tests for the algorithm. Such tests usually find different task sets deemed schedulable even under the same scheduling algorithm. While these different tests have been compared with each other in terms of schedulability performance, little has been done on how to combine such different tests to improve the overall schedulability of a given scheduling algorithm beyond a simple union of their individual schedulability. Motivated by this, we propose a composition theory for schedulability tests with two new …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 3, 4, 1, 3, 1, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:SdhP9T11ey4C", "title": "Managing industrial communication delays with software-defined networking", "authors": ["Rutvij H Jhaveri", "Rui Tan", "Arvind Easwaran", "Sagar V Ramani"], "description": "Recent technological advances have fostered the development of complex industrial cyber-physical systems with communication delay requirements. The consequences of delay requirement violation in such systems may become increasingly severe. In this paper, we propose a contract-based fault-resilient methodology which aims at managing the communication delays of network flows in industries. With this objective, we present a lightweight mechanism to estimate end-to-end communication delays in the network where the clocks of the switches are not synchronized. The mechanism aims at providing high level of accuracy with little communication overhead. We then propose a contract-based framework using software-defined networking (SDN) where the components are associated with delay contracts and a resilience manager. The proposed resilience management framework contains: (1) contracts which …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 8, 9, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:hFOr9nPyWt4C", "title": "Extending task-level to job-level fixed priority assignment and schedulability analysis using pseudo-deadlines", "authors": ["Hoon Sung Chwa", "Hyoungbu Back", "Sanjian Chen", "Jinkyu Lee", "Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "In global real-time multiprocessor scheduling, a recent analysis technique for Task-level Fixed-Priority (TFP) scheduling has been shown to outperform many of the analyses for Job-level Fixed-Priority (JFP) scheduling on average. Since JFP is a generalization of TFP scheduling, and the TFP analysis technique itself has been adapted from an earlier JFP analysis, this result is counter-intuitive and in our opinion highlights the lack of good JFP scheduling techniques. Towards generalizing the superior TFP analysis to JFP scheduling, we propose the Smallest Pseudo-Deadline First (SPDF) JFP scheduling algorithm. SPDF uses a simple task-level parameter called pseudo-deadline to prioritize jobs, and hence can behave as a TFP or JFP scheduler depending on the values of the pseudodeadlines. This natural transition from TFP to JFP scheduling has enabled us to incorporate the superior TFP analysis technique in …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 4, 0, 3, 5, 1, 1, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:ufrVoPGSRksC", "title": "Compositional schedulability analysis for cyber-physical systems", "authors": ["Arvind Easwaran", "Insup Lee"], "description": "Cyber-physical systems (CPSs) are becoming all-pervasive, and due to increasing complexity they are designed using component-based approaches. Temporal constraints of such complex CPSs are then modeled using hierarchical scheduling frameworks. Therefore, there is a need to develop compositional schedulability analysis techniques for such CPSs. In this essay, we describe one such CPS present in air-crafts. We also discuss the hierarchical frameworks that are found in these systems, and highlight shortcomings of existing techniques in analyzing them.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 3, 1, 3, 1, 3, 0, 1, 0, 1, 2, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:BUYA1_V_uYcC", "title": "Efficient Out-of-Distribution Detection Using Latent Space of β-VAE for Cyber-Physical Systems", "authors": ["Shreyas Ramakrishna", "Zahra Rahiminasab", "Gabor Karsai", "Arvind Easwaran", "Abhishek Dubey"], "description": "Deep Neural Networks are actively being used in the design of autonomous Cyber-Physical Systems (CPSs). The advantage of these models is their ability to handle high-dimensional state-space and learn compact surrogate representations of the operational state spaces. However, the problem is that the sampled observations used for training the model may never cover the entire state space of the physical environment, and as a result, the system will likely operate in conditions that do not belong to the training distribution. These conditions that do not belong to training distribution are referred to as Out-of-Distribution (OOD). Detecting OOD conditions at runtime is critical for the safety of CPS. In addition, it is also desirable to identify the context or the feature(s) that are the source of OOD to select an appropriate control action to mitigate the consequences that may arise because of the OOD condition. In this article …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [13, 6, 1]}, "topic": "Cyber-Physical System", "agg_topic": "Advanced Computing Concep", "final_topic": "Computing"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:PR6Y55bgFSsC", "title": "Out-of-distribution detection in multi-label datasets using latent space of β-vae", "authors": ["Vijaya Kumar Sundar", "Shreyas Ramakrishna", "Zahra Rahiminasab", "Arvind Easwaran", "Abhishek Dubey"], "description": "Learning Enabled Components (LECs) are widely being used in a variety of perceptions based autonomy tasks like image segmentation, object detection, end-to-end driving, etc. These components are trained with large image datasets with multimodal factors like weather conditions, time-of-day, traffic-density, etc. The LECs learn from these factors during training, and while testing if there is variation in any of these factors, the components get confused resulting in low confidence predictions. Those images with factor values, not seen, during training are commonly referred to as Out-of-Distribution (OOD). For safe autonomy, it is important to identify the OOD images, so that a suitable mitigation strategy can be performed. Classical one-class classifiers like SVM and SVDD are used to perform OOD detection. However, multiple labels attached to images in these datasets restrict the direct application of these …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 10, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:qUcmZB5y_30C", "title": "Laxity dynamics and LLF schedulability analysis on multiprocessor platforms", "authors": ["Jinkyu Lee", "Arvind Easwaran", "Insik Shin"], "description": "LLF (Least Laxity First) scheduling, which assigns a higher priority to a task with a smaller laxity, has been known as an optimal preemptive scheduling algorithm on a single processor platform. However, little work has been made to illuminate its characteristics upon multiprocessor platforms. In this paper, we identify the dynamics of laxity from the system’s viewpoint and translate the dynamics into LLF multiprocessor schedulability analysis. More specifically, we first characterize laxity properties under LLF scheduling, focusing on laxity dynamics associated with a deadline miss. These laxity dynamics describe a lower bound, which leads to the deadline miss, on the number of tasks of certain laxity values at certain time instants. This lower bound is significant because it represents invariants for highly dynamic system parameters (laxity values). Since the laxity of a task is dependent of the amount of …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 6, 1, 3, 0, 1, 3, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:ZuybSZzF8UAC", "title": "TiLA: twin-in-the-loop architecture for cyber-physical production systems", "authors": ["Heejong Park", "Arvind Easwaran", "Sidharta Andalam"], "description": "Digital twin is a virtual replica of a real-world object that lives simultaneously with its physical counterpart. Since its first introduction in 2003 by Grieves, digital twin has gained momentum in a wide range of applications such as industrial manufacturing, automotive and artificial intelligence. However, many digital-twin-related approaches, found in industries as well as literature, mainly focus on modelling individual physical things with high-fidelity methods with limited scalability. In this paper, we introduce a digital-twin architecture called TiLA (Twin-in-the-Loop Architecture). TiLA employs heterogeneous models and online data to create a digital twin, which follows a Globally Asynchronous Locally Synchronous (GALS) model of computation. It facilitates the creation of a scalable digital twin with different levels of modelling abstraction as well as giving GALS formalism for execution strategy. Furthermore, TiLA provides …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 8, 7, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:bnK-pcrLprsC", "title": "Dynamic budget management and budget reclamation for mixed-criticality systems", "authors": ["Xiaozhe Gu", "Arvind Easwaran"], "description": "Many existing studies on mixed-criticality (MC) scheduling assume that low-criticality budgets for high-criticality applications are known apriori. These budgets are primarily used as guidance to determine when the scheduler should switch the system mode from low to high. Based on this key observation, in this paper we propose a dynamic MC scheduling model under which low-criticality budgets for individual high-criticality applications are determined at runtime based on a system-wide total low-criticality budget allocation for all the high-criticality applications combined. This total budget is used as guidance in our model to determine the need for a mode-switch. At run time, a job may terminate prior to its allocated low-criticality budget, and hence the remaining low-criticality budget is wasted. Therefore, in the paper, we also propose a budget reclamation scheme that can work along with the dynamic model …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 3, 5, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:NhqRSupF_l8C", "title": "Model-based analysis of timed-triggered ethernet", "authors": ["Bruno Dutertre", "Arvind Easwaran", "Brendan Hall", "Wilfried Steiner"], "description": "Timed-Triggered Ethernet (TTEthernet) is a communication infrastructure that enables the use of Ethernet networks in real-time, distributed applications. The core of TTEthernet is a set of fault-tolerant protocols for clock synchronization, startup, and clique detection and resolution. We present recent work on model-based analysis of the TTEthernet startup and synchronization protocols. We first use automated test-generation tools to drive high-coverage testing of prototype TTEthernet hardware, based on a state-machine model of the TTEthernet protocols. With almost no human guidance, this technique enables us to achieve MC/DC coverage of the startup protocol under valid fault scenarios. We then focus on the TTEthernet clock-synchronization protocol. We develop correctness proofs of key properties of this protocol using the PVS interactive theorem prover [1]. As a result of this formalization, we have identified a …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 1, 2, 3, 3, 3, 0, 4, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:cFHS6HbyZ2cC", "title": "Underapproximating backward reachable sets by semialgebraic sets", "authors": ["Bai Xue", "Zhikun She", "Arvind Easwaran"], "description": "Underapproximations (UAs) of backward reachable sets play an important role in controller synthesis and trajectory analysis for constrained nonlinear dynamical systems, but there are few methods available to compute them. Given a nonlinear system, a target region of simply connected compact type and a time duration, we present a method using boundary analysis to compute an UA of the backward reachable set. The UA is represented as a semialgebraic set, formed by what we term polynomial level - set functions. The polynomial level - set function is a semidefinite positive function with one real root, such that the interior and closure of a semialgebraic set formed by it are both simply connected and have the same boundary. The function can be computed by solving a convex program, which is constructed based on sum-of-squares decomposition and linear interval inequalities. We test our method on several …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 5, 4, 2, 3, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:YFjsv_pBGBYC", "title": "Systems and methods generating inter-group and intra-group execution schedules for instruction entity allocation and scheduling on multi-processors", "authors": null, "description": "Systems and methods for instruction entity allocation and scheduling on multi-processors is provided. In at least one embodiment, a method for generating an execution schedule for a plurality of instruction entities for execution on a plurality of processing units comprises arranging the plurality of instruction entities into a sorted order and allocating instruction entities in the plurality of instruction entities to individual processing units in the plurality of processing units. The method further comprises scheduling instances of the instruction entities in scheduled time windows in the execution schedule, wherein the instances of the instruction entities are scheduled in scheduled time windows according to the sorted order of the plurality of instruction entities and organizing the execution schedule into execution groups.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 5, 4, 1, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:ipzZ9siozwsC", "title": "An anomaly detection framework for digital twin driven cyber-physical systems", "authors": ["Chuanchao Gao", "Heejong Park", "Arvind Easwaran"], "description": "In recent years, the digital twin has been one of the active research areas in modern Cyber-Physical Systems (CPS). Both the digital twin and its physical counterpart, called a plant, are highly intertwined such that they continuously exchange data to reveal useful information about the overall system. Such class of CPSs need to be robust to various types of disturbances, such as faulty sensors and model discrepancies, since the interplay between the physical plant's operation and digital twin's simulation may lead to undesirable or even destructive effect. To address this problem, this paper introduces a flexible anomaly detection framework for monitoring anomalous behaviours in digital twin based CPSs. In particular, our approach integrates both the digital twin and data-driven techniques that detect and classify anomalous behaviours due to modelling errors (e.g. incomplete models) and sensor and physical system …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 9, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:JoZmwDi-zQgC", "title": "Scheduling parallel real-time tasks on the minimum number of processors", "authors": ["Hyeonjoong Cho", "Chulgoo Kim", "Joohyung Sun", "Arvind Easwaran", "Ju-Derk Park", "Byeong-Cheol Choi"], "description": "Recently, several parallel frameworks have emerged to utilize the increasing computational capacity of multiprocessors. Parallel tasks are distinguished from traditional sequential tasks in that the subtasks contained in a single parallel task can simultaneously execute on multiple processors. In this study, we consider the scheduling problem of minimizing the number of processors on which the parallel real-time tasks feasibly run. In particular, we focus on scheduling sporadic parallel real-time tasks, in which precedence constraints between subtasks of each parallel task are expressed using a directed acyclic graph (DAG). To address the problem, we formulate an optimization problem that aims to minimize the maximum processing capacity for executing the given tasks. We then suggest a polynomial solution consisting of three steps: (1) transform each parallel real-time task into a series of multithreaded segments …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 4, 1, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:tkaPQYYpVKoC", "title": "A practical degradation model for mixed-criticality systems", "authors": ["Vijaya Kumar Sundar", "Arvind Easwaran"], "description": "Existing Mixed Criticality System (MCS) task models consider criticality as the relative importance of a task and use it to achieve graceful degradation of the system either by suspending or degrading tasks with relatively lower criticality level than the overloading task. Graceful degradation based on this notion of criticality as a relative parameter may not always be desired. In this paper, we propose a Context-Aware Mixed Criticality System (CA-MCS) model with which each task can be specified with multiple degraded budgets. To handle a system overload due to timing faults i.e. budget overrun of a task, tasks that need to be degraded are chosen irrespective of their criticality level. However, to handle system overload when multiple tasks overrun their budgets, a specific degraded budget of the task chosen for degradation is decided based on the criticality level of the overrun tasks. Experiments performed in a …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 0, 6, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:R3hNpaxXUhUC", "title": "Systems and methods for task grouping on multi-processors", "authors": null, "description": "Embodiments of the present invention provide improved systems and methods for grouping instruction entities. In one embodiment, a system comprises a processing cluster to execute software, the processing cluster comprising a plurality of processing units, wherein the processing cluster is configured to execute the software as a plurality of instruction entities. The processing cluster is further configured to execute the plurality of instruction entities in a plurality of execution groups, each execution group comprising one or more instruction entities, wherein the processing cluster executes a group of instruction entities in the one or more instruction entities in an execution group concurrently. Further, the execution groups are configured so that a plurality of schedule-before relationships are established, each schedule-before relationship being established among a respective set of instruction entities by executing the …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 1, 0, 2, 2, 2, 4, 0, 2]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:roLk4NBRz8UC", "title": "Multiprocessor real-time scheduling considering concurrency and urgency", "authors": ["Jinkyu Lee", "Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "It has been widely studied how to schedule realtime tasks on multiprocessor platforms. Several studies find optimal scheduling policies for implicit deadline task systems, but it is hard to understand how each policy utilizes the two important aspects of scheduling real-time tasks on multiprocessors: inter-job concurrency and job urgency. In this paper, we introduce a new scheduling policy that considers these two properties. We prove that the policy is optimal for the special case when the execution time of all tasks are equally one and deadlines are implicit, and observe that the policy is a new concept in that it is not an instance of Pfair or ERfair. It remains open to find a scheduliability condition for general task systems under our scheduling policy.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 3, 1, 0, 0, 0, 1, 1, 3, 2, 0, 0, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:W7OEmFMy1HYC", "title": "Bounding preemptions under EDF and RM schedulers", "authors": ["Arvind Easwaran", "Insik Shin", "Insup Lee", "Oleg Sokolsky"], "description": null, "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 2, 1, 2, 0, 2, 0, 0, 2, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:1yQoGdGgb4wC", "title": "A scenario-based branch-and-bound approach for MES scheduling in urban buildings", "authors": ["Mainak Dan", "Seshadhri Srinivasan", "Suresh Sundaram", "Arvind Easwaran", "Luigi Glielmo"], "description": "This article presents a novel solution technique for scheduling multi-energy system (MES) in a commercial urban building to perform price-based demand response and reduce energy costs. The MES scheduling problem is formulated as a mixed integer nonlinear program (MINLP), a nonconvex NP-hard problem with uncertainties due to renewable generation and demand. A model predictive control approach is used to handle the uncertainties and price variations. This in-turn requires solving a time-coupled multitime step MINLP during each time-epoch, which is computationally intensive. This investigation proposes an approach called the scenario-based branch-and-bound (SB3), a light-weight solver to reduce the computational complexity. It combines the simplicity of convex programs with the ability of meta-heuristic techniques to handle complex nonlinear problems. The performance of the SB3 solver is …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 5, 6, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:yD5IFk8b50cC", "title": "Utilization difference based partitioned scheduling of mixed-criticality systems", "authors": ["Saravanan Ramanathan", "Arvind Easwaran"], "description": "Mixed-Criticality (MC) systems consolidate multiple functionalities with different criticalities onto a single hardware platform. Such systems improve the overall resource utilization while guaranteeing resources to critical tasks. In this paper, we focus on the problem of partitioned multiprocessor MC scheduling, in particular the problem of designing efficient partitioning strategies. We develop two new partitioning strategies based on the principle of evenly distributing the difference between total high-critical utilization and total low-critical utilization for the critical tasks among all processors. By balancing this difference, we are able to reduce the pessimism in uniprocessor MC schedulability tests that are applied on each processor, thus improving overall schedulability. To evaluate the schedulability performance of the proposed strategies, we compare them against existing partitioned algorithms using extensive …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 2, 1, 0, 5, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:fEOibwPWpKIC", "title": "Authentication protocol for secure automotive systems: Benchmarking post-quantum cryptography", "authors": ["Prasanna Ravi", "Vijaya Kumar Sundar", "Anupam Chattopadhyay", "Shivam Bhasin", "Arvind Easwaran"], "description": "Ensuring communication security in real-time automotive networks is of paramount importance given the sensitivity of the exchanged information and highly safety critical nature of its operation. The first step towards ensuring security is to securely authenticate all the computational nodes through use of authentication protocols based on public-key cryptography. But, traditional public-key cryptographic primitives we use today are believed to be breakable by large scale quantum computers of the future. Thus, NIST is currently running a global global level standardization process for quantum-resistant public-key cryptography, better known as post-quantum cryptography. In this work, we perform a first of its kind practical implementation of a secure authentication protocol for automotive systems with post-quantum cryptographic algorithms and perform a detailed comparative evaluation of the speed and communication …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 4, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:u9iWguZQMMsC", "title": "Evaluation of an artificial pancreas in in silico patients with online-tuned internal model control", "authors": ["Arpita Bhattacharjee", "Arvind Easwaran", "Melvin Khee-Shing Leow", "Namjoon Cho"], "description": "A fully-automated controller in the artificial pancreas (AP) system designed to regulate blood glucose concentration can give better lifestyle to a type 1 diabetic patient. This paper deals with evaluating the benefit of fully-automated online-tuned controller for the AP system over offline-tuned and semi-automated controller based on internal model control (IMC) strategy. The online-tuned controller is fully-automatic in the sense that it can automatically deal with intra- and inter-patient variabilities and compensate for unannounced meal disturbances without any prior knowledge of patient parameters, patient specific characteristics or patient specific input–output data. A data driven Volterra model of patients is used to design IMC algorithms. For online-tuned controller, the Volterra kernels of the model are computed online by recursive least squares algorithm. The IMC algorithms are evaluated using different scenarios in …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 2, 1, 4, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:4JMBOYKVnBMC", "title": "Contention-free executions for real-time multiprocessor scheduling", "authors": ["Jinkyu Lee", "Arvind Easwaran", "Insik Shin"], "description": "A time slot is defined as contention-free if the number of jobs with remaining executions in the slot is no larger than the number of processors, or contending, otherwise. Then an important property holds that in any contention-free slot, all jobs with remaining executions are guaranteed to be scheduled as long as the scheduler is work-conserving. This article aims at improving schedulability by utilizing the contention-free slots. To achieve this, this article presents a policy (called CF policy) that moves some job executions from contending slots to contention-free ones. This policy can be employed by any work-conserving, preemptive scheduling algorithm, and we show that any algorithm extended with this policy dominates the original algorithm in terms of schedulability. We also present improved schedulability tests for algorithms that employ this policy, based on the observation that interference from jobs is reduced …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 0, 3, 3, 3, 0, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:IWHjjKOFINEC", "title": "Convex optimization framework for intermediate deadline assignment in soft and hard real-time distributed systems", "authors": ["Jinkyu Lee", "Insik Shin", "Arvind Easwaran"], "description": "It is generally challenging to determine end-to-end delays of applications for maximizing the aggregate system utility subject to timing constraints. Many practical approaches suggest the use of intermediate deadline of tasks in order to control and upper-bound their end-to-end delays. This paper proposes a unified framework for different time-sensitive, global optimization problems, and solves them in a distributed manner using Lagrangian duality. The framework uses global viewpoints to assign intermediate deadlines, taking resource contention among tasks into consideration. For soft real-time tasks, the proposed framework effectively addresses the deadline assignment problem while maximizing the aggregate quality of service. For hard real-time tasks, we show that existing heuristic solutions to the deadline assignment problem can be incorporated into the proposed framework, enriching their mathematical …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 4, 0, 0, 1, 2, 1, 1, 0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:4DMP91E08xMC", "title": "Optimal control of software ensuring safety and functionality", "authors": ["Arvind Easwaran", "Sampath Kannan", "Insup Lee"], "description": "Existing verification and validation methodologies can detect software violations very effectively but fail to provide any mechanism for correcting faults once they are detected. Detection of faults, their diagnosis and corrective actions are all essential components of any software rectification framework. In this paper, we propose a framework for correction of violations in software systems ensuring that the desired goals of the system are achieved. We describe a stochastic finite state machine used to abstract a software system along with the uncertainty in its operating environment. Safety property violations and satisfaction of functionalities are abstracted using penalties and rewards on the states, respectively. Rectification of software is then formulated as a stochastic optimal control problem over this abstraction. Algorithms polynomial in the size of the abstraction have been developed for solving this optimization …", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 3, 3, 0, 0, 0, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:Tyk-4Ss8FVUC", "title": "Simulation of simultaneous events in regular expressions for run-time verification", "authors": ["U Sammapun", "A Easwaran", "I Lee", "O Sokolsky"], "description": "When specifying system requirements, we want a language that can express the requirements in the simplest and most intuitive form. Although the MaC system provides an expressive language, called MEDL, it is generally awkward to express certain features like temporal ordering of complex events, timing constraints, and frequencies of events which are inherent in safety properties. MEDL-RE extends the MEDL language to include regular expressions to easily specify timing dependencies and timing constraints. Due to simultaneous events generated by the MaC system, monitoring regular expressions by simulating DFAs would result in a potential problem. The DFA simulations would involve concurrent multi-path simulations and result in exponential running time. To handle simultaneous events inexpensively, we generate a dependency graph to identify possible simultaneous events. Further, we augment the …", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 3, 0, 0, 1, 0, 1, 1, 0, 3, 0, 0, 0, 0, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:_Re3VWB3Y0AC", "title": "PAC model checking of black-box continuous-time dynamical systems", "authors": ["Bai Xue", "Miaomiao Zhang", "Arvind Easwaran", "Qin Li"], "description": "In this article, we present a novel model checking approach to finite-time safety verification of black-box continuous-time dynamical systems within the framework of probably approximately correct (PAC) learning. The black-box dynamical systems are the ones, for which no model is given but whose states changing continuously through time within a finite-time interval can be observed at some discrete-time instants for a given input. The new model checking approach is termed as the PAC model checking due to the incorporation of learned models with correctness guarantees expressed using the terms error probability and confidence. Based on the error probability and confidence level, our approach provides statistically formal guarantees that the time-evolving trajectories of the black-box dynamical system over finite-time horizons fall within the range of the learned model plus a bounded interval, contributing to …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 1, 7, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:VOx2b1Wkg3QC", "title": "Crossbar-constrained technology mapping for ReRAM based in-memory computing", "authors": ["Debjyoti Bhattacharjee", "Yaswanth Tavva", "Arvind Easwaran", "Anupam Chattopadhyay"], "description": "In-memory computing has gained significant attention due to the potential for dramatic improvement in speed and energy. Redox-based resistive RAMs (ReRAMs), capable of non-volatile storage and logic operations simultaneously have been used for logic-in-memory computing approaches. To this effect, we propose ReRAM based VLIW Architecture for in-Memory comPuting (ReVAMP), supported by a detailed device-accurate simulation setup with peripheral circuitry. We present theoretical bounds on the minimum area required for in-memory computation of arbitrary Boolean functions specified using structural representation (And-Inverter Graph and Majority-Inverter Graph) and two-level representation (Exclusive-Sum-of-Product). To support the ReVAMP architecture, we present two technology mapping flows that fully exploit the bit-level parallelism offered by the execution of logic using ReRAM crossbar array …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 5, 4, 0, 2]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:9vf0nzSNQJEC", "title": "Combining task-level and system-level scheduling modes for mixed criticality systems", "authors": ["Jalil Boudjadar", "Saravanan Ramanathan", "Arvind Easwaran", "Ulrik Nyman"], "description": "Different scheduling algorithms for mixed criticality systems have been recently proposed. The common denominator of these algorithms is to discard low critical tasks whenever high critical tasks are in lack of computation resources. This is achieved upon a switch of the scheduling mode from Normal to Critical. We distinguish two main categories of the algorithms: system-level mode switch and task-level mode switch. System-level mode algorithms allow low criticality (LC) tasks to execute only in normal mode. Task-level mode switch algorithms enable to switch the mode of an individual high criticality task (HC), from low (LO) to high (HI), to obtain priority over all LC tasks. This paper investigates an online scheduling algorithm for mixed-criticality systems that supports dynamic mode switches for both task level and system level. When a HC task job overruns its LC budget, then only that particular job is switched to HI …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 3, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:5Ul4iDaHHb8C", "title": "Mixed-criticality scheduling on multiprocessors with service guarantees", "authors": ["Saravanan Ramanathan", "Arvind Easwaran"], "description": "Mixed-criticality (MC) systems are composed of tasks with varying criticality co-hosted on a single shared platform. In conventional MC systems, upon criticality change, the lower criticality tasks are penalized to guarantee resources for the higher criticality ones. However, in practice, penalizing lower criticality tasks have adverse effects and hence, the system is often under-utilized. In this paper, we consider the problem of reservation-based scheduling of mixed-criticality systems on a homogeneous multiprocessor platform to guarantee full service to the lower criticality tasks when one of the processors switches to the critical state. We explore the semi-partitioned scheduling model for dual-criticality systems in which the low criticality tasks executing on a processor are migrated to another processor upon mode switch to improve the service offered to them in the high criticality mode. We present the scheduling strategy …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 1, 1, 2, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:dfsIfKJdRG4C", "title": "A systematic security analysis of real-time cyber-physical systems", "authors": ["Arvind Easwaran", "Anupam Chattopadhyay", "Shivam Bhasin"], "description": "Security in Cyber-Physical Systems (CPS) has become a serious concern owing to the rapid adoption of technologies such as plug-and-play connectivity, robotics and remote coordination and control. It is well understood that the performance overhead incurred due to security considerations is rather high, which needs to be captured holistically for a real-time CPS with strict timing budget and hard deadlines. Additionally, attacks in real-time CPS may only alter the timing behaviour of system components without any changes in functionality, resulting in serious consequences due to missed deadlines. To address this challenging issue, it is necessary to understand the role of diverse components in a real-time CPS and how those expose the system to a malicious attacker. In this paper, we propose a systematic security analysis flow, using a novel Attack Sequence Diagram (ASD), which links the sources, intermediate …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 4, 1, 3, 0, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:3s1wT3WcHBgC", "title": "Mixed-criticality scheduling to minimize makespan", "authors": ["Sanjoy Baruah", "Arvind Easwaran", "Zhishan Guo"], "description": "In the mixed-criticality job model, each job is characterized by two execution time parameters, representing a smaller (less conservative) estimate and a larger (more conservative) estimate on its actual, unknown, execution time. Each job is further classified as being either less critical or more critical. The desired execution semantics are that all jobs should execute correctly provided all jobs complete upon being allowed to execute for up to the smaller of their execution time estimates, whereas if some jobs need to execute beyond their smaller execution time estimates (but not beyond their larger execution time estimates), then only the jobs classified as being more critical are required to execute correctly. The scheduling of collections of such mixed-criticality jobs upon identical multiprocessor platforms in order to minimize the makespan is considered here.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 1, 0, 3, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:4TOpqqG69KYC", "title": "Online robust optimization framework for qos guarantees in distributed soft real-time systems", "authors": ["Jinkyu Lee", "Insik Shin", "Arvind Easwaran"], "description": "In distributed soft real-time systems, maximizing the aggregate quality-of-service (QoS) is a typical system-wide goal, and addressing the problem through distributed optimization is challenging. Subtasks are subject to unpredictable failures in many practical environments, and this makes the problem much harder. In this paper, we present a robust optimization framework for maximizing the aggregate QoS in the presence of random failures. We introduce the notion of K-failure to bound the effect of random failures on schedulability. Using this notion we define the concept of K-robustness that quantifies the degree of robustness on QoS guarantee in a probabilistic sense. The parameter K helps to tradeoff achievable QoS versus robustness. The proposed robust framework produces optimal solutions through distributed computations on the basis of Lagrangian duality, and we present some implementation techniques …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 3, 2, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:dTyEYWd-f8wC", "title": "Probably approximate safety verification of hybrid dynamical systems", "authors": ["Bai Xue", "Martin Fränzle", "Hengjun Zhao", "Naijun Zhan", "Arvind Easwaran"], "description": "In this paper we present a method based on linear programming that facilitates reliable safety verification of hybrid dynamical systems subject to perturbation inputs over the infinite time horizon. The verification algorithm applies the probably approximately correct (PAC) learning framework and consequently can be regarded as statistically formal verification in the sense that it provides formal safety guarantees expressed using error probabilities and confidences. The safety of hybrid systems in this framework is verified via the computation of so-called PAC barrier certificates, which can be computed by solving a linear programming problem. Based on scenario approaches, the linear program is constructed by a family of independent and identically distributed state samples. In this way we can conduct verification of hybrid dynamical systems that existing methods are not capable of dealing with. Some …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 1, 4, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:mvPsJ3kp5DgC", "title": "Contract-based hierarchical resilience management for cyber-physical systems", "authors": ["Mohammad Shihabul Haque", "Daniel Jun Xian Ng", "Arvind Easwaran", "Karthikeyan Thangamariappan"], "description": "Cyber-physical systems satisfy user requirements through close collaboration among physical and cyber components. Software-based resilience management solutions can provide flexibility in dealing with component failures. To improve efficiency and ease of implementation, we present a contractbased hierarchical resilience management framework.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 1, 3, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:abG-DnoFyZgC", "title": "Multi-rate fluid scheduling of mixed-criticality systems on multiprocessors", "authors": ["Saravanan Ramanathan", "Arvind Easwaran", "Hyeonjoong Cho"], "description": "In this paper we consider the problem of mixed-criticality (MC) scheduling of implicit-deadline sporadic task systems on a homogenous multiprocessor platform. Focusing on dual-criticality systems, algorithms based on the fluid scheduling model have been proposed in the past. These algorithms use a dual-rate execution model for each high-criticality task depending on the system mode. Once the system switches to the high-criticality mode, the execution rates of such tasks are increased to meet their increased demand. Although these algorithms are speed-up optimal, they are unable to schedule several feasible dual-criticality task systems. This is because a single fixed execution rate for each high-criticality task after the mode switch is not efficient to handle the high variability in demand during the transition period immediately following the mode switch. This demand variability exists as long as the carry …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 4, 1, 0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:4OULZ7Gr8RgC", "title": "Area-constrained technology mapping for in-memory computing using ReRAM devices", "authors": ["Debjyoti Bhattacharjee", "Arvind Easwaran", "Anupam Chattopadhyay"], "description": "In-memory computing platforms, such as Resistive RAM (ReRAM), offer natural advantage to data-intensive applications. The benefits of data locality and capability to perform native Boolean operations is exploited for significant performance advantage in multiple contexts ranging across neuromorphic computing, associative memory-based computing, arithmetic benchmarks and general-purpose programmable logic-in-memory computing. Despite these advances, design automation tools supporting in-memory computing are still in a nascent phase. In this work, we investigate for the first time, the problem of minimizing delay under arbitrary area constraint of ReRAM devices. We formulate the problem of area-constrained delay minimization as an Integer Linear Programming (ILP) formulation and further propose heuristics that offers scalability as well as solution close to optimal performance. Area-constrained …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 3, 0, 4, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:Tiz5es2fbqcC", "title": "Mixed criticality on multicore/manycore platforms (dagstuhl seminar 15121)", "authors": ["Sanjoy K Baruah", "Liliana Cucu-Grosjean", "Roabert I Davis", "Claire Maiza"], "description": "This report provides an overview of the discussions, the program and the outcomes of the first Dagstuhl Seminar on Mixed Criticality on multicore/Manycore Platforms. The seminar brought together researchers working on challenges related to executing mixed criticality real-time applications on multicore and manycore architectures with the main purpose of promoting a closer interaction between the sub-communities involved in real-time scheduling, real-time operating systems/runtime environments, and timing analysis as well as interaction with specialists in hardware architectures.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 1, 1, 3, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:AvfA0Oy_GE0C", "title": "Improving variational autoencoder based out-of-distribution detection for embedded real-time applications", "authors": ["Yeli Feng", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "Uncertainties in machine learning are a significant roadblock for its application in safety-critical cyber-physical systems (CPS). One source of uncertainty arises from distribution shifts in the input data between training and test scenarios. Detecting such distribution shifts in real-time is an emerging approach to address the challenge. The high dimensional input space in CPS applications involving imaging adds extra difficulty to the task. Generative learning models are widely adopted for the task, namely out-of-distribution (OoD) detection. To improve the state-of-the-art, we studied existing proposals from both machine learning and CPS fields. In the latter, safety monitoring in real-time for autonomous driving agents has been a focus. Exploiting the spatiotemporal correlation of motion in videos, we can robustly detect hazardous motion around autonomous driving agents. Inspired by the latest advances in the …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:OU6Ihb5iCvQC", "title": "Efficient schedulability test for dynamic-priority scheduling of mixed-criticality real-time systems", "authors": ["Xiaozhe Gu", "Arvind Easwaran"], "description": "Systems in many safety-critical application domains are subject to certification requirements. In such a system, there are typically different applications providing functionalities that have varying degrees of criticality. Consequently, the certification requirements for functionalities at these different criticality levels are also varying, with very high levels of assurance required for a highly critical functionality, whereas relatively low levels of assurance are required for a less critical functionality. Considering the timing assurance given to various applications in the form of guaranteed budgets within deadlines, a theory of real-time scheduling for such multi-criticality systems has been recently under development. In particular, an algorithm called Earliest Deadline First with Virtual Deadlines (EDF-VD) has shown a lot of promise for systems with two criticality levels, especially in terms of practical performance demonstrated …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 0, 0, 5, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:lSLTfruPkqcC", "title": "MC-Fluid: rate assignment strategies", "authors": ["Saravanan Ramanathan", "Arvind Easwaran"], "description": "Task system behaviours: A MC task system with two criticality levels can exhibit the following behaviours LO mode: The system is in this behaviour as long as no task has executed beyond its LO WCET HI mode: The system switches to this behaviour when any HI task executes beyond its LO WCET MC Correctness: A MC system is said to be correct if In LO mode: All tasks with LO WCETs are schedulable In HI mode: Only HI tasks with HI WCETs are schedulable All LO tasks are dropped", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 4, 2, 2, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:_Ybze24A_UAC", "title": "Real-time energy monitoring in IoT-enabled mobile devices", "authors": ["Nitin Shivaraman", "Seima Saki", "Zhiwei Liu", "Saravanan Ramanathan", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "With rapid advancements in the Internet of Things (IoT) paradigm, electrical devices in the near future is expected to have IoT capabilities. This enables fine-grained tracking of individual energy consumption data of such devices, offering location-independent per-device billing. Thus, it is more fine-grained than the location-based metering of state-of-the-art infrastructure, which traditionally aggregates on a building or household level, defining the entity to be billed. However, such in-device energy metering is susceptible to manipulation and fraud. As a remedy, we propose a decentralized metering architecture that enables devices with IoT capabilities to measure their own energy consumption. In this architecture, the device-level consumption is additionally reported to a system-level aggregator that verifies distributed information and provides secure data storage using Blockchain, preventing data manipulation by …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 5, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:epqYDVWIO7EC", "title": "Embedded out-of-distribution detection on an autonomous robot platform", "authors": ["Michael Yuhas", "Yeli Feng", "Daniel Jun Xian Ng", "Zahra Rahiminasab", "Arvind Easwaran"], "description": "Machine learning (ML) is actively finding its way into modern cyber-physical systems (CPS), many of which are safety-critical real-time systems. It is well known that ML outputs are not reliable when testing data are novel with regards to model training and validation data, i.e., out-of-distribution (OOD) test data. We implement an unsupervised deep neural network-based OOD detector on a real-time embedded autonomous Duckiebot and evaluate detection performance. Our OOD detector produces a success rate of 87.5% for emergency stopping a Duckiebot on a braking test bed we designed. We also provide case analysis on computing resource challenges specific to the Robot Operating System (ROS) middleware on the Duckiebot.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:2KloaMYe4IUC", "title": "A schedule randomization policy to mitigate timing attacks in WirelessHART networks", "authors": ["Ankita Samaddar", "Arvind Easwaran", "Rui Tan"], "description": "Industrial control systems consist of large-scale wireless sensor-actuator networks (WSAN) that control the physical plant. The communications between the sensors and the actuators need to be reliable and guaranteed within strict deadlines for safe operation of all the system components in industrial setups. WirelessHART is the most suitable and widely adopted WSAN standard that serves as the medium of communication in industries. To satisfy deadlines of real-time flows in WirelessHART networks, the centralized network manager decides the communication schedule during network initialization. The same schedule repeats every hyperperiod. The repetitive nature of the communication slots over every hyperperiod makes the system vulnerable to timing attacks which can eventually disrupt the safety of the system. To mitigate such attacks, we propose SlotSwapper, a moving target defense mechanism that randomizes …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:Fu2w8maKXqMC", "title": "A game-theoretic approach to secure estimation and control for cyber-physical systems with a digital twin", "authors": ["Zhiheng Xu", "Arvind Easwaran"], "description": "Cyber-Physical Systems (CPSs) play an increasingly significant role in many critical applications. These valuable applications attract various sophisticated attacks. This paper considers a stealthy estimation attack, which aims to modify the state estimation of the CPSs. The intelligent attackers can learn defense strategies and use clandestine attack strategies to avoid detection. To address the issue, we design a Chi-square detector in a Digital Twin (DT), which is an online digital model of the physical system. We use a Signaling Game with Evidence (SGE) to find the optimal attack and defense strategies. Our analytical results show that the proposed defense strategies can mitigate the impact of the attack on the physical estimation and guarantee the stability of the CPSs. Finally, we use an illustrative application to evaluate the performance of the proposed framework.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 0, 2, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:EUQCXRtRnyEC", "title": "Mc-fluid: Multi-core fluid-based mixed-criticality scheduling", "authors": ["Jaewoo Lee", "Saravanan Ramanathan", "Kieu-My Phan", "Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "Owing to growing complexity and scale, safety-critical real-time systems are generally designed using the concept of mixed-criticality, wherein applications with different criticality or importance levels are hosted on the same hardware platform. To guarantee non-interference between these applications, the hardware resources, in particular the processor, are statically partitioned among them. To overcome the inefficiencies in resource utilization of such a static scheme, the concept of mixed-criticality real-time scheduling has emerged as a promising solution. Although there are several studies on such scheduling strategies for uniprocessor platforms, the problem of efficient scheduling for the multiprocessor case has largely remained open. In this work, we design a fluid-model based mixed-criticality scheduling algorithm for multiprocessors, in which multiple tasks are allowed to execute on the same processor …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 1, 2, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:_FxGoFyzp5QC", "title": "Interface algebra for analysis of hierarchical real-time systems", "authors": ["Arvind Easwaran", "Insup Lee", "Oleg Sokolsky"], "description": "Complex real-time embedded systems can be developed using component based design methodologies. Timing requirements of real-time components in the system can be modeled using hierarchical frameworks to capture resource sharing among components under different schedulers. To support component based design for real-time embedded systems, we must then address schedulability analysis of hierarchical scheduling models. In this paper, we propose a generic interface algebra for compositional schedulability analysis of such models. We also define conditions under which this algebra supports incremental analysis, dynamic adaptability, and independent implementability. Furthermore, we also propose a novel periodic resource model based framework for compositional and incremental schedulability analysis of hierarchical scheduling models. This extends our earlier proposed framework with a technique that allows periodic resource models with different periods to be composed together. We formulate this framework in our proposed algebra to demonstrate ease of use of the algebra and to identify framework properties.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 1, 1, 1, 2, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:eq2jaN3J8jMC", "title": "SlotSwapper: a schedule randomization protocol for real-time WirelessHART networks", "authors": ["Ankita Samaddar", "Arvind Easwaran", "Rui Tan"], "description": "Industrial process control systems are time-critical systems where reliable communications between sensors and actuators need to be guaranteed within strict deadlines to maintain safe operation of all the components of the system. WirelessHART is the most widely adopted standard which serves as the medium of communication in industrial setups due to its support for Time Division Multiple Access (TDMA) based communication, multiple channels, channel hopping, centralized architecture, redundant routes and avoidance of spatial re-use of channels. However, the communication schedule in WirelessHART network is decided by a centralized network manager at the time of network initialization and the same communication schedule repeats every hyper-period. Due to predictability in the time slots of the communication schedule, these systems are vulnerable to timing attacks which eventually can disrupt the …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 2, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:l7t_Zn2s7bgC", "title": "Contract-based Methodology for Developing Resilient Cyber-Infrastructure in the Industry 4.0 Era", "authors": ["Sidharta Andalam", "Daniel Jun Xian Ng", "Arvind Easwaran", "Karthikeyan Thangamariappan"], "description": "As the industrial cyber-infrastructure become increasingly important to realize the objectives of Industry 4.0, the consequence of disruption due to internal or external faults become increasingly severe. Thus there is a need for a resilient infrastructure. In this letter, we propose a contract-based methodology where components across layers of the cyber-infrastructure are associated with contracts and a light-weight resilience manager. This allows the system to detect faults (contract violation monitored using observers) and react (change contracts dynamically) effectively.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 0, 0, 2, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:8k81kl-MbHgC", "title": "Scheduling sporadic tasks on multiprocessors with mutual exclusion constraints", "authors": ["Arvind Easwaran", "Björn Andersson"], "description": "Consider the problem of scheduling sporadic tasks on a multiprocessor platform under mutual exclusion constraints. We present an approach which appears promising for allowing large amounts of parallel task executions and still ensures low amounts of blocking.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:p__nRnzSRKYC", "title": "Observation-based approximate dependency modeling and its use for program slicing", "authors": ["Seongmin Lee", "David Binkley", "Robert Feldt", "Nicolas Gold", "Shin Yoo"], "description": "While dependency analysis is foundational to much program analysis, many techniques have limited scalability and handle only monolingual systems. We present a novel dependency analysis technique that aims to approximate program dependency from a relatively small number of perturbed executions. Our technique, MOAD (Modeling Observation-based Approximate Dependency), reformulates program dependency as the likelihood that one program element is dependent on another (instead of a Boolean relationship). MOAD generates program variants by deleting parts of the source code and executing them while observing the impact. MOAD thus infers a model of program dependency that captures the relationship between the modification and observation points. We evaluate MOAD using program slices obtained from the resulting probabilistic dependency models. Compared to the existing observation …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:geHnlv5EZngC", "title": "Clair: A contract-based framework for developing resilient cps architectures", "authors": ["Sidharta Andalam", "Daniel Jun Xian Ng", "Arvind Easwaran", "Karthikeyan Thangamariappan"], "description": "Industrial cyber-infrastructure is normally a multilayered architecture. The purpose of the layered architecture is to hide complexity and allow independent evolution of the layers. In this paper, we argue that this traditional strict layering results in poor transparency across layers affecting the ability to significantly improve resiliency. We propose a contract-based methodology where components across and within the layers of the cyber-infrastructure are associated with contracts and a light-weight resilience manager. This allows the system to detect faults (contract violation monitored using observers) and react (change contracts dynamically) effectively. It results in (1) improving transparency across layers; helps resiliency, (2) decoupling fault-handling code from application code; helps code maintenance, (3) systematically generate error-free fault handling code; reduces development time. Using an industrial case …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 1, 0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:t7zJ5fGR-2UC", "title": "Efficient multi-class out-of-distribution reasoning for perception based networks: Work-in-progress", "authors": ["Shreyas Ramakrishna", "Zahra Rahiminasab", "Arvind Easwaran", "Abhishek Dubey"], "description": "Perception-based deep neural networks used in Cyber Physical Systems are known to fail when faced with inputs that are out-of-distribution (ODD). ODD detection is a complex problem as we need to first identify the shift in the test data from the training distribution and then we need to isolate the responsible generative factor(s) (weather, lighting levels, traffic density, etc.), Unlike the state of the art that uses multi-chained one-class classifiers, we propose an efficient single monitor that uses the principle of disentanglement to train the latent space of a variational autoencoder to be sensitive to distribution shifts in different generative factors. We demonstrate our approach using an end-to-end driving controller in the CARLA simulator.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:eJXPG6dFmWUC", "title": "Flow network models for online scheduling real-time tasks on multiprocessors", "authors": ["Hyeonjoong Cho", "Arvind Easwaran"], "description": "We consider the flow network model to solve the multiprocessor real-time task scheduling problems. Using the flow network model or its generic form, linear programming (LP) formulation, for the problems is not new. However, the previous works have limitations, for example, that they are classified as offline scheduling techniques since they establish a flow network model or an LP problem considering a very long time interval. In this study, we propose how to construct the flow network model for online scheduling periodic real-time tasks on multiprocessors. Our key idea is to construct the flow network only for the active instances of tasks at the current scheduling time, while guaranteeing the existence of an optimal schedule for the future instances of the tasks. The optimal scheduling is here defined to ensure that all real-time tasks meet their deadlines when the total utilization demand of the given tasks does not …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:35r97b3x0nAC", "title": "Blockchain, what time is it? trustless datetime synchronization for iot", "authors": ["Emanuel Regnath", "Nitin Shivaraman", "Shanker Shreejith", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "Time synchronization among IoT devices is a fundamental requirement for efficient and reliable communication on a global scale. Common synchronization schemes such as NTP operate on a trust-based client-server model, which does not scale well in a decentralized network because single server failures can lead to a severe downtime before re-establishing synchronization. Public blockchains such as Ethereum provide a trustless network and tamper-proof time-stamped data that is freely available. In this paper, we leverage the availability of time information in the block headers, which are very small (several hundreds of bytes) compared to the full blocks and can be validated without participation in the mining process. Our approach uses two estimators that are fed with the timestamps from block headers as well as the elapsed time between consecutive block receptions to estimate the true time to an accuracy …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:BrmTIyaxlBUC", "title": "Flow network-based real-time scheduling for reducing static energy consumption on multiprocessors", "authors": ["Joohyung Sun", "Hyeonjoong Cho", "Arvind Easwaran", "Ju-Derk Park", "Byeong-Cheol Choi"], "description": "The energy management for embedded real-time systems is crucial due to their restricted power supplies. With the advancement of technologies, the static energy consumption of the embedded systems that is caused by their leakage power is growing. Thus, a number of research works have started focusing on reducing the static energy consumption by making the systems transit into low-power states, wherein some hardware components are temporarily shut down. Specifically, when a processor is idling, they attempt to set the processor into one of several low-power states. To make a processor remain in the low-power state as long as possible to minimize the energy consumption, the idle time should be maximally clustered. At the same time, in order to satisfy the real-time constraints of the tasks, the length of the clustered idle time should be estimated accurately. To achieve our objective, we propose energy …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 2, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:738O_yMBCRsC", "title": "The feasibility analysis of mixed-criticality systems", "authors": ["Saravanan Ramanathan", "Xiaozhe Gu", "Arvind Easwaran"], "description": "The Feasibility Analysis of Mixed-Criticality Systems Page 1 Motivation Open Problem Possible \nSolution Design Methodology The Feasibility Analysis of Mixed-Criticality Systems Saravanan \nRamanathan, Xiaozhe Gu, Arvind Easwaran Nanyang Technological University, Singapore July \n5, 2016 NTU RTSOPS2016 1 / 15 Page 2 Motivation Open Problem Possible Solution Design \nMethodology Outline 1 Motivation 2 Open Problem 3 Possible Solution 4 Design Methodology \nNTU RTSOPS2016 2 / 15 Page 3 Motivation Open Problem Possible Solution Design \nMethodology Outline 1 Motivation 2 Open Problem 3 Possible Solution 4 Design Methodology \nNTU RTSOPS2016 3 / 15 Page 4 Motivation Open Problem Possible Solution Design \nMethodology Motivation NTU RTSOPS2016 4 / 15 Page 5 Motivation Open Problem Possible \nSolution Design Methodology Outline 1 Motivation 2 Open Problem 3 Possible Solution 4 …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 1, 0, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:p2g8aNsByqUC", "title": "Evaluation of mixed-criticality scheduling algorithms using a fair taskset generator", "authors": ["Saravanan Ramanathan", "Arvind Easwaran"], "description": "Evaluation of Mixed-Criticality Scheduling Algorithms using a Fair Taskset Generator Page 1 \nMixed-Criticality (MC) System Motivation Taskset Generators MC-FairGen Evaluation Summary \nEvaluation of Mixed-Criticality Scheduling Algorithms using a Fair Taskset Generator \nSaravanan Ramanathan and Arvind Easwaran Nanyang Technological University, Singapore \nJuly 5, 2016 NTU WATERS 2016 1 / 20 Page 2 Mixed-Criticality (MC) System Motivation \nTaskset Generators MC-FairGen Evaluation Summary Outline 1 Mixed-Criticality (MC) System 2 \nMotivation 3 Taskset Generators Existing Taskset Parameters New Taskset Parameter Existing \nGenerators 4 MC-FairGen MC-FairGen Framework MC-FairGen Generator 5 Evaluation \nSingle-core Multi-core 6 Summary NTU WATERS 2016 2 / 20 Page 3 Mixed-Criticality (MC) \nSystem Motivation Taskset Generators MC-FairGen Evaluation Summary Outline 1 Mixed-…", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:P5F9QuxV20EC", "title": "On the complexity of generating optimal interfaces for hierarchical systems", "authors": ["Arvind Easwaran", "Madhukar Anand", "Insup Lee", "Oleg Sokolsky"], "description": null, "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:kuK5TVdYjLIC", "title": "Design methodology for deep out-of-distribution detectors in real-time cyber-physical systems", "authors": ["Michael Yuhas", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "When machine learning (ML) models are supplied with data outside their training distribution, they are more likely to make inaccurate predictions; in a cyber-physical system (CPS), this could lead to catastrophic system failure. To mitigate this risk, an out-of-distribution (OOD) detector can run in parallel with an ML model and flag inputs that could lead to undesirable outcomes. Although OOD detectors have been well studied in terms of accuracy, there has been less focus on deployment to resource constrained CPSs. In this study, a design methodology is proposed to tune deep OOD detectors to meet the accuracy and response time requirements of embedded applications. The methodology uses genetic algorithms to optimize the detector’s preprocessing pipeline and selects a quantization method that balances robustness and response time. It also identifies several candidate task graphs under the Robot …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 3, 0]}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:uLbwQdceFCQC", "title": "A survey on time-sensitive resource allocation in the cloud continuum", "authors": ["Saravanan Ramanathan", "Nitin Shivaraman", "Seima Suryasekaran", "Arvind Easwaran", "Etienne Borde", "Sebastian Steinhorst"], "description": "Artificial Intelligence (AI) and Internet of Things (IoT) applications are rapidly growing in today’s world where they are continuously connected to the internet and process, store and exchange information among the devices and the environment. The cloud and edge platform is very crucial to these applications due to their inherent compute-intensive and resource-constrained nature. One of the foremost challenges in cloud and edge resource allocation is the efficient management of computation and communication resources to meet the performance and latency guarantees of the applications. Numerous research studies have been carried out to address this intricate problem. In this paper, the current state-of-the-art resource allocation techniques for the cloud continuum, in particular those that consider time-sensitive applications, are reviewed. Furthermore, we present the key challenges in the resource allocation …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:olpn-zPbct0C", "title": "Design of an online-tuned model based compound controller for a fully automated artificial pancreas", "authors": ["Arpita Bhattacharjee", "Arvind Easwaran", "Melvin Khee-Shing Leow", "Namjoon Cho"], "description": "This paper deals with the development of a control algorithm that can predict optimal insulin doses without patients’ intervention in fully automated artificial pancreas system. An online-tuned model based compound controller comprising an online-tuned internal model control (IMC) algorithm and an enhanced IMC (eIMC) algorithm along with a meal detection module is proposed. Volterra models, used to develop IMC and eIMC algorithms, are developed online using recursive least squares (RLS) filter. The time domain kernels, computed online using RLS filter, are converted into frequency domain to obtain Volterra transfer function (VTF). VTFs are used to develop both IMC and eIMC algorithms. The compound controller is designed in such a way that eIMC predicts insulin doses when the glucose rate increase detector of meal detection module is positive, otherwise conventional IMC takes the control …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 1, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:a0OBvERweLwC", "title": "Efficient decentralized active balancing strategy for smart battery cells", "authors": ["Nitin Shivaraman", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "Among series-connected cells in large battery packs, such as those found in electric vehicles, a charge imbalance develops over time due to manufacturing and temperature variations. Therefore, active balancing strategies can be employed in Battery Management Systems (BMSs) to attain a charge balance among cells by transferring charge between them, maximizing the usable capacity of the battery pack. Recently, decentralized BMS architectures with smart battery cells have been developed, in which balancing strategies can operate by local cooperation between the cells without requiring global coordination. In this paper, we propose a decentralized active balancing strategy for smart cells where we identify boundary cells having special properties. These boundary cells enable to divide the global balancing problem into independent subproblems, where local decisions on charge transfers eventually …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 1, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:g5m5HwL7SMYC", "title": "Towards compositional mixed-criticality real-time scheduling in open systems", "authors": ["Jaewoo Lee", "Hoon Sung Chwa", "Arvind Easwaran", "Insik Shin", "Insup Lee"], "description": "Although many cyber-physical systems are both mixed-criticality system and compositional system, there are little work on intersection of mixed-criticality system and compositional system. We propose novel concepts for task-level criticality-mode and reconsider temporal isolation in terms of compositional mixed-criticality scheduling.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:maZDTaKrznsC", "title": "Optimal speedup bound for 2-level mixed-criticality arbitrary deadline systems", "authors": ["Xiaozhe Gu", "Arvind Easwaran"], "description": "I. BACKGROUND For safety-critical embedded systems, an increasing trend is to integrate multiple independent functionalities on a single shared computing platform; this trend is evident in industry-driven initiatives and standards such as ARINC653 [1] and IMA and AUTOSAR [2] in automotive. However among all the functionalities in a system, only some functionalities are critical for the correctness of the system and need to be certificated by statutory certification authorities (CAs) and the rest of the functionalities will not influence the safety of the system to the same extent. Under normal conditions, all tasks providing different functionalities will receive enough processing resource. But more critical tasks should be given preference if something abnormal happens in the system (ie when tasks exceed their expected worst-case execution times (WECTs)[3] which in fact is highly unlikely to happen). Such systems comprised of tasks of different criticalities are called mixed-criticality (MC) systems. In many previous studies of mixed-criticality real-time systems, the model proposed by Vestal is widely used [3]. In this model, a task can be specified as тi=(Ti, Li, ci, Di), where Ti denotes minimum separation between job releases, Li denotes criticality level based on the task’s importance to the system, ci= c1 i, c2 i,···, cmax i is a list of WCET values measured with different degrees of confidence (here cj i denotes тi’s WCET when the system is at criticality level j), and Di ( Ti) denotes тi’s deadline. Jobs of тi are released with a separation of at least Ti time units, and each job needs to execute for no more than Cj i time units within Di time units from its release …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 0, 0, 2, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:WbkHhVStYXYC", "title": "Scheduling (dagstuhl seminar 10071)", "authors": ["GJ Woeginger"], "description": null, "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 2, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:Z5m8FVwuT1cC", "title": "Cluster-based network time synchronization for resilience with energy efficiency", "authors": ["Nitin Shivaraman", "Patrick Schuster", "Saravanan Ramanathan", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "Time synchronization of devices in Internet-of-Things (IoT) networks is one of the challenging problems and a pre-requisite for the design of low-latency applications. Although many existing solutions have tried to address this problem, almost all solutions assume all the devices (nodes) in the network are faultless. Furthermore, these solutions exchange a large number of messages to achieve synchronization, leading to significant communication and energy overhead. To address these shortcomings, we propose C-sync, a clustering-based decentralized time synchronization protocol that provides resilience against several types of faults with energy-efficient communication. C-sync achieves scalability by introducing multiple reference nodes in the network that restrict the maximum number of hops any node can have to its time source. The protocol is designed with a modular structure on the Contiki platform to allow …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:ZfRJV9d4-WMC", "title": "Resilience bounds of network clock synchronization with fault correction", "authors": ["Linshan Jiang", "Rui Tan", "Arvind Easwaran"], "description": "Naturally occurring disturbances and malicious attacks can lead to faults in synchronizing the clocks of two network nodes. In this article, we investigate the fundamental resilience bounds of network clock synchronization for a system of N nodes against the peer-to-peer synchronization faults. Our analysis is based on practical synchronization algorithms with time complexity down to O(N3) that attempt to correct the faults by checking the consistency among the following three types of data: (1) the estimated faults, (2) the estimated clock offsets among the nodes, and (3) the measured clock offsets from the potentially faulty peer-to-peer synchronization sessions. Our analysis gives the following three major results. First, the maximum number of faults that can be corrected by the algorithms has a tight bound of ⌊N/2 ⌋ − 1 when every node pair performs a synchronization session. Second, by converting the fault …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=20&pagesize=80&citation_for_view=B_ouhTgAAAAJ:5awf1xo2G04C", "title": "Automatic generation of hierarchical contracts for resilience in cyber-physical systems", "authors": ["Zhiheng Xu", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "With the growing scale of Cyber-Physical Systems (CPSs), it is challenging to maintain their stability under all operating conditions. How to reduce the downtime and locate the failures becomes a core issue in system design. In this paper, we employ a hierarchical contract-based resilience framework to guarantee the stability of CPS. In this framework, we use Assume Guarantee (A-G) contracts to monitor the non-functional properties of individual components (e.g., power and latency), and hierarchically compose such contracts to deduce information about faults at the system level. The hierarchical contracts enable rapid fault detection in large-scale CPS. However, due to the vast number of components in CPS, manually designing numerous contracts and the hierarchy becomes challenging. To address this issue, we propose a technique to automatically decompose a root contract into multiple lower-level contracts …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:WA5NYHcadZ8C", "title": "Contract-based hierarchical resilience framework for cyber-physical systems: demo abstract", "authors": ["Daniel Jun Xian Ng", "Arvind Easwaran", "Sidharta Andalam"], "description": "This demonstration presents a framework for building a resilient Cyber-Physical Systems (CPS) cyber-infrastructure through the use of hierarchical parametric assume-guarantee contracts. A Fischertechnik Sorting Line with Color Detection training model is used to showcase our framework.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:08ZZubdj9fEC", "title": "Towards overhead-free interface theory for compositional hierarchical real-time systems", "authors": ["Jin Hyun Kim", "Kyong Hoon Kim", "Arvind Easwaran", "Insup Lee"], "description": "A significant amount of research has been conducted in the past on compositional real-time scheduling as it has become a useful foundational theory for real-time operating systems and hypervisors. However, compositional frameworks suffer from abstraction overhead in composing components. In this paper, we decompose the abstraction overhead into: 1) supply abstraction overhead associated with the supply from a resource provider and 2) demand abstraction overhead associated with the component workload. Then, we provide sufficient conditions for each abstraction overhead to be eliminated. In addition, this paper provides a heuristic technique that transforms a component to satisfy the sufficient conditions so that the abstraction overhead can be minimized. In experiments, we show that our technique outperforms two prior overhead-reducing techniques. The reduction in overhead is about 10% on average …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:kz9GbA2Ns4gC", "title": "Demo Abstract: Real-Time Out-of-Distribution Detection on a Mobile Robot", "authors": ["Michael Yuhas", "Arvind Easwaran"], "description": "In a cyber-physical system such as an autonomous vehicle (AV), machine learning (ML) models can be used to navigate and identify objects that may interfere with the vehicle's operation. However, ML models are unlikely to make accurate decisions when presented with data outside their training distribution. Out-of-distribution (OOD) detection can act as a safety monitor for ML models by identifying such samples at run time. However, in safety critical systems like AVs, OOD detection needs to satisfy real-time constraints in addition to functional requirements. In this demonstration, we use a mobile robot as a surrogate for an AV and use an OOD detector to identify potentially hazardous samples. The robot navigates a miniature town using image data and a YOLO object detection network. We show that our OOD detector is capable of identifying OOD images in real-time on an embedded platform concurrently performing object detection and lane following. We also show that it can be used to successfully stop the vehicle in the presence of unknown, novel samples.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 2, 0]}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:EkHepimYqZsC", "title": "Robust out-of-distribution motion detection and localization in autonomous CPS: wip abstract", "authors": ["Yeli Feng", "Arvind Easwaran"], "description": "Highly complex deep learning models are increasingly integrated into modern cyber-physical systems (CPS), many of which have strict safety requirements. One problem arising from this is that deep learning lacks interpretability, operating as a black box. The reliability of deep learning is heavily impacted by how well the model training data represents runtime test data, especially when the input space dimension is high as natural images. In response, we propose a robust out-of-distribution (OOD) detection framework. Our approach detects unusual movements from driving video in real-time by combining classical optic flow operation with representation learning via variational autoencoder (VAE). We also design a method to locate OOD factors in images. Evaluation on a driving simulation data set shows that our approach is statistically more robust than related works.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:JQOojiI6XY0C", "title": "Decoric: Decentralized connected resilient iot clustering", "authors": ["Nitin Shivaraman", "Saravanan Ramanathan", "Shreejith Shanker", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "Maintaining peer-to-peer connectivity with low energy overhead is a key requirement for several emerging Internet of Things (IoT) applications. It is also desirable to develop such connectivity solutions for non-static network topologies, so that resilience to device failures can be fully realized. De-centralized clustering has emerged as a promising technique to address this critical challenge. Clustering of nodes around cluster heads (CHs) provides an energy-efficient two-tier framework for peer-to-peer communication. At the same time, decentralization ensures that the framework can quickly adapt to a dynamically changing network topology. Although some decentralized clustering solutions have been proposed in the literature, they either lack guarantees on connectivity or incur significant energy overhead to maintain the clusters. In this paper, we present Decentralized Connected Resilient IoT Clustering (DeCoRIC …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:_B80troHkn4C", "title": "Linearization based Safety Verification of a Glucose Control Protocol", "authors": ["Ankita Samaddar", "Zahra RahimiNasab", "Arvind Easwaran", "Ansuman Banerjee", "Xue Bai"], "description": "Medical cyber-physical systems in which multiple medical devices co-ordinate with each other and provide closed-loop control to the patient, have come into prominence in the recent past. One of the main challenges for such systems is guaranteeing their safety even in the presence of significant physiological variabilities among patients. Formal verification based on well-established models of patient physiology has emerged as a potential solution to this problem. However, such techniques face a significant hurdle in terms of scalability due to two main reasons; non-linearity in the physiological models, and large variations in the model parameters due to intra and inter-patient variabilities. In this work, we considered a case-study system of pre-operative and intra-operative care for diabetic patients based on a well-established insulin-infusion protocol. The system comprises a physiological model of the glucose …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:fQNAKQ3IYiAC", "title": "Resilience bounds of sensing-based network clock synchronization", "authors": ["Rui Tan", "Linshan Jiang", "Arvind Easwaran"], "description": "Recent studies exploited external periodic synchronous signals to synchronize a pair of network nodes to address a threat of delaying the communications between the nodes. However, the sensing-based synchronization may yield faults due to nonmalicious signal and sensor noises. This paper considers a system of N nodes that will fuse their peer-to-peer synchronization results to correct the faults. Our analysis gives the lower bound of the number of faults that the system can tolerate when N is up to 12. If the number of faults is no greater than the lower bound, the faults can be identified and corrected. We also prove that the system cannot tolerate more than N - 2 faults. Our results can guide the design of resilient sensing-based clock synchronization systems.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:vRqMK49ujn8C", "title": "Predictability and Performance Aware Replacement Policy PVISAM for Unified Shared Caches in Real-time Multicores", "authors": ["Mohammad Shihabul Haque", "Arvind Easwaran"], "description": "Missing the deadline of an application task can be catastrophic in real-time systems. Therefore, to ensure timely completion of tasks, offline worst-case execution time and schedulability analysis is often performed for such real-time systems. One of the important inputs to this analysis is a safe upper bound of misses in each processor cache memory used by the system. Cache miss prediction techniques have matured significantly for private caches in single-core processors; however, remained as a challenge for unified, shared caches in multicore processors. According to prior studies, a task's miss upper bound on a shared cache can be predicted using available private cache prediction techniques only if the shared cache maintains core-based independent static partitions. The problem is, such partitions require the use of infeasible “write-update consistency protocol” and wastes valuable cache space by duplicate …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:O3NaXMp0MMsC", "title": "Techniques for Achieving Time-Predictability in Multicores-A Survey", "authors": ["A Vasudevan", "ARVIND EASWARAN"], "description": "Cyber-physical systems (CPS) are embedded computing systems in which the cyber world of computation and communication closely interacts with the physical world of sensors and actuators. These systems are abundant in many industries including avionics, automotive, healthcare, consumer applications, etc. One such example is the adaptive cruise control application used in modern cars. This application automatically adjusts the vehicle’s speed to maintain a safe distance from vehicles ahead. The control is based on real-time data from on-board sensors and actuators include brakes. Many applications in CPS are real-time, meaning its correctness not only depends on its logical correctness, but also on the time within which the operation is performed. Therefore, these systems have to meet their timeliness requirements. Real-time Applications (RTA) are classified as hard, soft and firm, based on the …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:tKAzc9rXhukC", "title": "Resource sharing in global fixed-priority preemptive multiprocessor scheduling", "authors": ["Björn Andersson", "A Easwaran"], "description": "In this paper we consider global fixed-priority preemptive multiprocessor scheduling of constrained-deadline sporadic tasks that share resources in a non-nested manner. We develop a novel resource-sharing protocol and a corresponding schedulability test for this system. We also develop the first schedulability analysis of priority inheritance protocol for the aforementioned system. Finally, we show that these protocols are efficient (based on the developed schedulability tests) for a class of priority-assignments called reasonable priorityassignments.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:hqOjcs7Dif8C", "title": "Simulation relations, interface complexity, and resource optimality for real-time hierachical systems", "authors": ["Arvind Easwaran", "Insup Lee", "Oleg Sokolsky", "Madhukar Anand", "Linh TX Phan"], "description": "Compositional schedulability analysis of hierarchical real-time systems is a well-studied problem. Various techniques have been developed to abstract resource requirements of components in such systems, and schedulability has been addressed using these abstract representations (also called component interfaces). These approaches for compositional analysis incur resource overheads when they abstract components into interfaces. In this talk, we define notions of resource schedulability and optimality for component interfaces, and compare various approaches.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:Dip1O2bNi0gC", "title": "Online Schedule Randomization to Mitigate Timing Attacks in 5G Periodic URLLC Communications", "authors": ["Ankita Samaddar", "Arvind Easwaran"], "description": "Ultra-reliable low-latency communication (URLLC) in 5G networks is designed to support time-critical applications such as industrial control systems (ICSs), where user equipment (UEs) communicate with a base station (BS) with very high reliability and low latency. Most of these communications in ICSs are periodic and associated with hard deadlines. To provide a reliable service while satisfying the hard deadlines, the BS usually reserves slots and frequencies and precomputes the schedule for such UEs. The same schedule repeats over time which makes the slots and frequencies predictable. However, an attacker can exploit this aspect and launch timing attacks disrupting specific communication, thereby, undermining the safety of the system. To mitigate such attacks, we present an online strategy that randomizes the scheduled slots and frequencies over time without violating the flow deadlines. We use …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}, "topic": "Network Security", "agg_topic": "Wireless Communication", "final_topic": "Wireless Communication and Networking"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:EYYDruWGBe4C", "title": "Deadline-constrained multi-resource task mapping and allocation for edge-cloud systems", "authors": ["Chuanchao Gao", "Aryaman Shaan", "Arvind Easwaran"], "description": "In an edge-cloud system, mobile devices can offload their computation intensive tasks to an edge or cloud server to guarantee the quality of service or satisfy task deadline requirements. However, it is challenging to determine where tasks should be offloaded and processed, and how much network and computation resources should be allocated to them, such that a system with limited resources can obtain a maximum profit while meeting the deadlines. A key challenge in this problem is that the network and computation resources could be allocated on different servers, since the server to which a task is offloaded (e.g., a server with an access point) may be different from the server on which the task is eventually processed. To address this challenge, we first formulate the task mapping and resource allocation problem as a non-convex Mixed-Integer Nonlinear Programming (MINLP) problem, known as NP-hard. We …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 0, 0]}, "topic": "Distributed System", "agg_topic": "Edge Computing", "final_topic": "Computing"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:uc_IGeMz5qoC", "title": "Decentralized cyber-physical system", "authors": null, "description": "The disclosure relates to a decentralized cyber-physical system including a managing unit and a plurality of components. The managing unit includes a root resilient manager including a root contract and a sub-contract generator. The sub-contract generator is configured to decompose the root contract into a plurality of sub-contracts and assign the plurality of sub-contracts to the plurality of components, respectively. Each component includes at least one observer configured to monitor if the property of the individual component violates the sub-contracts corresponding thereto. When one of the plurality of sub-contracts violates during the runtime of the decentralized cyber-physical system, the root resilience manager issues an alarm.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}, "topic": "Distributed System", "agg_topic": "Edge Computing", "final_topic": "Computing"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:oNZyr7d5Mn4C", "title": "A Unified Perspective on Adversarial and Out-of-Distribution Detection in the Open World", "authors": ["Yeli Feng", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "Deep neural networks (DNN) have achieved near-human classification capability when testing samples are drawn from their training data distribution. However, numerous research also revealed that the performance of DNN can degrade severely when testing samples are maliciously manipulated or out of distribution (OOD). In response, research in both adversarial defense and OOD detection have become very prevalent independently. This paper investigates the interplay between these two approaches and attempts to unify them to increase the robustness of classification systems in the open world, where inputs could be in-distribution (ID), adversarial, OOD, or adversarial-OOD. We find that existing defensive training methods, adversarial or data augmentation based, trade classification and OOD detection performances for robustness to adversaries. We propose an algebraic transformation based data augmentation technique that reduces DNN’s sensitivity to adversarial attacks. Furthermore, we formulate a multi-level semantics backed detection metric to enhance OOD detection capability by utilizing multi-task training. In combination, our defensive training method, SVrandom+, mitigates the trade-off between performance and robustness. In experiments our method achieved a true positive rate (TPR) of 89.2% for OOD detection and an error of 9.3% for classification in the open world setting. Furthermore, its TPR is higher by 16.7%, and classification error is lower by 2.5 times than existing gradient based adversarial training.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}, "topic": "Adversarial Defense and Out-of-Distribution Detection", "agg_topic": "Cybersecurity and Blockchain Technology", "final_topic": "Blockchain Technology"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:zLWjf1WUPmwC", "title": "Monitoring Cumulative Cost Properties", "authors": ["Omar Al-Bataineh", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "This paper considers the problem of decentralized monitoring of a class of non-functional properties (NFPs) with quantitative operators, namely cumulative cost properties. The decentralized monitoring of NFPs can be a non-trivial task for several reasons: (i) they are typically expressed at a high abstraction level where inter-event dependencies are hidden, (ii) NFPs are difficult to be monitored in a decentralized way, and (iii) lack of effective decomposition techniques. We address these issues by providing a formal framework for decentralised monitoring of LTL formulas with quantitative operators. The presented framework employs the tableau construction and a formula unwinding technique (i.e., a transformation technique that preserves the semantics of the original formula) to split and distribute the input LTL formula and the corresponding quantitative constraint in a way such that monitoring can be performed in a …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:yB1At4FlUx8C", "title": "Online cycle detection for models with mode-dependent input and output dependencies", "authors": ["Heejong Park", "Arvind Easwaran", "Etienne Borde"], "description": "In the fields of co-simulation and component-based modelling, designers import models as building blocks to create a composite model that provides more complex functionalities. Modelling tools perform instantaneous cycle detection (ICD) on the composite models having feedback loops to reject the models if the loops are mathematically unsound and to improve simulation performance. In this case, the analysis relies heavily on the availability of dependency information from the imported models. However, the cycle detection problem becomes harder when the model’s input to output dependencies are mode-dependent, i.e. changes for certain events generated internally or externally as inputs. The number of possible modes created by composing such models increases significantly and unknown factors such as environmental inputs make the offline (statical) ICD a difficult task. In this paper, an online ICD …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:NJ774b8OgUMC", "title": "C-Sync: The resilient time synchronization protocol", "authors": ["Nitin Shivaraman", "Patrick Schuster", "Saravanan Ramanathan", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "Time synchronization is paramount for communication in Internet of Things (IoT) networks. Existing synchronization protocols in the IoT are designed to be accurate, energy-efficient and scalable with absolute trust on the time source(s). If a byzantine node becomes a time source, it can cause synchronization errors with false time, leading to system mal-functions or network crashes. In this paper, we introduce C-Sync: a clustering time synchronization protocol for decentralized IoT networks that incorporates resilience against byzantine nodes. We show that C-sync achieves a worst-case synchronization accuracy of a few tens of microseconds (µs).", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:W5xh706n7nkC", "title": "WiP Abstract: Mobility-based Load Balancing for IoT-enabled Devices in Smart Grids", "authors": ["Nitin Shivaraman", "Jakob Fittler", "Saravanan Ramanathan", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "There is an unprecedented load variability in the smart grids due to device (e.g. electric vehicles) mobility across different grid-locations. As a consequence, utility service providers have started exploring solutions such as dynamic pricing mechanisms, grid extensions and redistribution across micro-grids. However, most of these solutions do not exploit the transient nature of mobile devices. In this work, we propose an alternate mobility-based load balancing mechanism that exploits device-level flexibility. With recent advancements in Internet of Things (IoT) technology, we assume these devices to be equipped with IoT capabilities. We present an abstract model to capture the demand from these IoT-enabled devices in the form of a utility function. Our objective is to cater to the demand by incentivising device mobility without exceeding the peak load capacity across all grid-locations such that the overall utility of the …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:VLnqNzywnoUC", "title": "HOLISTIC, REAL-TIME OPTIMIZATION OF THE OPERATIONS OF DISTRICT COOLING SYSTEMS VIA DEEP REINFORCEMENT LEARNING AND MIXED INTEGER LINEAR PROGRAMMING", "authors": ["Zhonglin Chiam", "Arvind Easwaran", "David Mouquet", "Mohit Gupta"], "description": "The holistic optimization of district cooling systems is a computationally intensive undertaking, owing to the sheer number of conflicting decision variables and nonconvex nature of the problem. This is the primary reason which inhibits the real-time deployment of optimization algorithms for the operations of district cooling systems. To overcome this challenge, we adopt a model-based, decomposed approach involving the concurrent use of reinforcement learning and mixed integer linear program to holistically optimize the thermal and physical interactions while still capturing the tight coupling between the components of the system. Resolution speed and solution accuracy are paramount for a realtime optimization algorithm thus, the critical advantage of the proposed approach is two-fold–the mixed integer linear program drastically reduces the action space of the reinforcement learning problem, promoting accuracy and when trained, the agent neural network can then rapidly determine the optimal values of the remaining actions, improving resolution speed. The current work makes the two ensuing vital contributions:(1) we introduced a decomposed optimization approach with resolution speeds which are compatible with real-time deployment,(2) through the application on a real test-case, we compare both the resolution time and solution quality against an approach used in our previous work, which deployed the genetic algorithm instead of a reinforcement learner. Results indicate that the impact on solution quality is below 7.52%, thereby, validating the feasibility of the proposed approach.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:LPZeul_q3PIC", "title": "Design and analysis for dual priority scheduling", "authors": ["Xiaozhe Gu", "Arvind Easwaran", "Risat Pathan"], "description": "This paper considers Dual Priority (DP) scheduling of constrained deadline sporadic tasks on uniprocessor. The initial fixed priority of each job of a task is promoted to a higher priority (called, promoted priority) after a fixed time interval (called, promotion point) relative to the release time of that job. DP scheduling alters the default preemptive behavior of traditional fixed priority (FP) scheduling to efficiently utilize the processor as close as possible to that of the optimal earliest deadline first (EDF) scheduler. In this paper, we address some of the main challenges of DP scheduling including derivation of a sufficient schedulability test, determination of promotion point of each task 1 . To the best of our knowledge, this test is the first schedulability test for DP scheduling applicable to constrained deadline sporadic tasks. The test is applicable for any given promotion points of the tasks and has pseudo-polynomial time …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:sSrBHYA8nusC", "title": "A self-reconfiguring cache architecture to improve control quality in cyber-physical systems", "authors": ["Mohammad Shihabul Haque", "Sriram Vasudevan", "Alamuri Sriram Nihar", "Arvind Easwaran", "Akash Kumar", "YC Tay"], "description": "Quality of control is a critical concern in Cyber-Physical Systems (CPS) which are comprised of multiple intercommunicating control applications. Due to complex timing behaviour of these systems, poor quality of control can lead to catastrophe. Recent studies showed that, conflict miss increment in the processor cache memory shared by concurrently running control applications can degrade control quality in CPS significantly. Increasing cache associativity can help to reduce conflict misses. However, the existing reconfigurable cache architectures that allow runtime modification of cache associativity are not capable to guaranty a newly chosen associativity's suitability for the forthcoming control quality requirement. Moreover, they have timing and energy related overheads. In this regard, this paper presents a novel, self-reconfiguring cache memory architecture \"SeReMo\". When conflict misses increase significantly …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:lmc2jWPfTJgC", "title": "Jiyoon Lee", "authors": ["Jiyoon Lee"], "description": "Jiyoon Lee is a poet and translator whose most recent publication is \"Poems of Kim Yideum, Kim Haengsook, and Kim Minjeong,\" the collection of contemporary Korean poetry, for which she collaborated with Jake Levine, Don mee Choi, and Johannes Göransson (Vagabond Press, 2017). She is also the author of Foreigner’s Folly (Coconut Books, 2014), Funsize/Bitesize (Birds of Lace, 2013), and IMMA(Radioactive Moat, 2012). She is the winner of the Joanna Cargill prize (2014), and her manuscript was a finalist for the 1913 First Book Prize (2012). She was born in South Korea, and immigrated to a small town in East Texas alone as a teen. She received her MFA in Creative Writing from the University of Notre Dame, lived in NYC, and moved back to Texas, the land that keeps pulling her back.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:RHpTSmoSYBkC", "title": "Systems and methods for verifying expression folding", "authors": null, "description": "A system for verifying that a comparison model having folded expressions matches a reference model includes at least one memory device that stores a reference model and a comparison model, wherein the comparison model was previously generated based on the reference model. The reference model adheres to a first set of syntax and semantics, wherein the reference model includes a plurality of first expressions, each of the first expressions including a first operator and a first operand. The comparison model adheres to a second set of syntax and semantics, wherein the comparison model includes a second expression, the second expression including a second operator and a second operand. The system further includes a processing unit configured to match the second expression with the plurality of first expressions.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:nb7KW1ujOQ8C", "title": "Model-Driven Test Generation of Distributed Systems", "authors": ["Arvind Easwaran", "Brendan Hall", "Kevin Schweiker"], "description": "This report describes a novel test generation technique for distributed systems. Utilizing formal models and formal verification tools, spe cifically the Symbolic Analysis Laboratory (SAL) tool-suite from SRI, we present techniques to generate concurrent test vectors for distrib uted systems. These are initially explored within an informal test validation context and later extended to achieve full MC/DC coverage of  the TTEthernet protocol operating within a system-centric context.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:J-pR_7NvFogC", "title": "Schedulability analysis of hierarchical real-time systems", "authors": ["Arvind Easwaran", "Insik Shin", "Oleg Sokolsky", "Insup Lee"], "description": "Embedded systems are complex as a whole but consist of smaller independent modules interacting with each other. This structure makes embedded systems amenable to compositional design. Real-time embedded systems consist of real-time workloads having temporal deadlines. Compositional design of real-time embedded systems can be done using systems consisting of real-time components arranged in a scheduling hierarchy. Each component consists of some real-time workload and a scheduling policy for the workload. To simplify schedulability analysis for such systems, analysis can be done compositionally using interfaces that abstract the timing requirements of components. To facilitate analysis of dynam-ically changing real-time systems, the framework must support incremental analysis. In this paper, we summarize our work [19, 6] on schedulability analysis for hierarchical real-time systems. We describe a compositional analysis technique that abstracts resource requirements of components using periodic resource models. To support incremental analysis and resource bandwidth minimization, we describe an extension to this interface model. Each extended interface consists of multiple periodic resource models for different periods. This allows the selection of a periodic model that can schedule the system using minimum bandwidth. We also account for context switch overheads in these interfaces. We then describe an associative composition technique for such interfaces that supports incremental analysis.", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:HbR8gkJAVGIC", "title": "Co-Design of Out-of-Distribution Detectors for Autonomous Emergency Braking Systems", "authors": ["Michael Yuhas", "Arvind Easwaran"], "description": "Learning enabled components (LECs), while critical for decision making in autonomous vehicles (AVs), are likely to make incorrect decisions when presented with samples outside of their training distributions. Out-of-distribution (OOD) detectors have been proposed to detect such samples, thereby acting as a safety monitor, however, both OOD detectors and LECs require heavy utilization of embedded hardware typically found in AVs. For both components, there is a tradeoff between non-functional and functional performance, and both impact a vehicle's safety. For instance, giving an OOD detector a longer response time can increase its accuracy at the expense of the LEC. We consider an LEC with binary output like an autonomous emergency braking system (AEBS) and use risk, the combination of severity and occurrence of a failure, to model the effect of both components' design parameters on each other's functional and non-functional performance, as well as their impact on system safety. We formulate a co-design methodology that uses this risk model to find the design parameters for an OOD detector and LEC that decrease risk below that of the baseline system and demonstrate it on a vision based AEBS. Using our methodology, we achieve a 42.3% risk reduction while maintaining equivalent resource utilization.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Autonomous Vehic", "agg_topic": "Autonomous Technology", "final_topic": "Autonomous Technology"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:tuHXwOkdijsC", "title": "Design and analyses of functional mode changes for mixed-criticality systems", "authors": ["Vijaya Kumar Sundar", "Saravanan Ramanathan", "Arvind Easwaran"], "description": "In this paper, we propose a new model for mixed-criticality systems (MCS) that can adapt to system overload scenarios due to the occurrence of two known phenomena. First, budget overrun of tasks due to their imprecise budget estimations which is a common theme in most existing studies related to MCS. Second, a spike in the resource consumption pattern leads to a temporary system overload when tasks belonging to different modes execute together for a certain time interval when the system switches from one mode to another. Such a phenomenon is also a common theme for designing safety-critical embedded systems capable of operating in multiple functional modes. The multi-mode mixed-criticality system (MM-MCS) model, proposed in this paper, considers task degradation and offsets to handle the system overload. We derive a sufficient t schedulability test under a fixed-priority scheduling scheme for the …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Real-time System", "agg_topic": "Signal Processing and Transportation System", "final_topic": "Signal Processing"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:foquWX3nUaYC", "title": "Online Distributed Schedule Randomization to Mitigate Timing Attacks in Industrial Control Systems", "authors": ["Ankita Samaddar", "Arvind Easwaran"], "description": "Industrial control systems (ICSs) consist of a large number of control applications that are associated with periodic real-time flows with hard deadlines. To facilitate large-scale integration, remote control and co-ordination, wireless sensor actuator networks (WSANs) form the main communication framework in most ICSs. Among the existing WSAN protocols, the WirelessHART is the most suitable protocol for real-time applications in ICSs. The communications in a WirelessHART network is time-division multiple access (TDMA) based. To satisfy the hard deadlines of the real-time flows, the schedule in a WirelessHART network is pre-computed. The same schedule is repeated over every hyperperiod, i.e., lowest common multiple of the periods of the flows. However, a malicious attacker can exploit the repetitive behavior of the flow schedules to launch timing attacks, e.g., selective jamming attacks. To mitigate timing attacks, we propose …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Distributed System", "agg_topic": "Edge Computing", "final_topic": "Computing"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:-FonjvnnhkoC", "title": "Work-in-Progress: Deadline-Constrained Multi-Resource Allocation in Edge-Cloud System", "authors": ["Chuanchao Gao", "Arvind Easwaran"], "description": "In an edge-cloud system, end devices can offload computation intensive tasks to servers for processing, to satisfy deadline requirements of time-critical tasks, or maintain a good quality of service. Because the system has limited bandwidth and computation resource, it can be very challenging to determine where tasks should be offloaded and processed (task mapping), and how much bandwidth and computation resource should be allocated to each task (resource allocation). In this paper, we propose a task mapping and multi-resource allocation problem with both communication and computation contentions in an edge-cloud system, which aims to maximize the total profit gained by the system while meeting the deadlines of mapped tasks. Besides, the backhaul network of the proposed edge-cloud system is modeled as a directed incomplete graph with bandwidth contention on every edge of the graph. We …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Distributed System", "agg_topic": "Edge Computing", "final_topic": "Computing"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:PoWvk5oyLR8C", "title": "PAC-Based Formal Verification for Out-of-Distribution Data Detection", "authors": ["Mohit Prashant", "Arvind Easwaran"], "description": "Cyber-physical systems (CPS) like autonomous vehicles, that utilize learning components, are often sensitive to noise and out-of-distribution (OOD) instances encountered during run-time. As such, safety critical tasks depend upon OOD detection subsystems in order to restore the CPS to a known state or interrupt execution to prevent safety from being compromised. However, it is difficult to guarantee the performance of OOD detectors as it is difficult to characterize the OOD aspect of an instance, especially in high-dimensional unstructured data.To distinguish between OOD data and data known to the learning component through the training process, an emerging technique is to incorporate variational autoencoders (VAE) within systems and apply classification or anomaly detection techniques on their latent spaces. The rationale for doing so is the reduction of the data domain size through the encoding process …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:VaXvl8Fpj5cC", "title": "Out of Distribution Reasoning by Weakly-Supervised Disentangled Logic Variational Autoencoder", "authors": ["Zahra Rahiminasab", "Michael Yuhas", "Arvind Easwaran"], "description": "Out-of-distribution (OOD) detection, i.e., finding test samples derived from a different distribution than the training set, as well as reasoning about such samples (OOD reasoning), are necessary to ensure the safety of results generated by machine learning models. Recently there have been promising results for OOD detection in the latent space of variational autoencoders (VAEs). However, without disentanglement, VAEs cannot perform OOD reasoning. Disentanglement ensures a one-to-many mapping between generative factors of OOD (e.g., rain in image data) and the latent variables to which they are encoded. Although previous literature has focused on weakly-supervised disentanglement on simple datasets with known and independent generative factors. In practice, achieving full disentanglement through weak supervision is impossible for complex datasets, such as Carla, with unknown and abstract …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:M7yex6snE4oC", "title": "Behavioural cloning based RL agents for district energy management", "authors": ["Sharath Ram Kumar", "Arvind Easwaran", "Benoit Delinchant", "Rémy Rigo-Mariani"], "description": "In this work, we discuss a method to incorporate domain knowledge into a Reinforcement Learning (RL) environment through the process of behavioral cloning, in the context of a district energy management system. Prior knowledge, encoded into heuristic rule-based programs, is used to initialize a policy network for an RL agent, after which an RL algorithm is used to improve on this by optimizing against a reward function. The key ideas are implemented in the CityLearn framework, where the resulting controller is used to manage the electrical energy storage for 5 buildings in a district. We demonstrate that the resulting agents offer measurable performance gains compared to existing baselines, offering a 3.8% improvement over the underlying rule-based controller, and a 20% improvement over a pure RL based controller. We also illustrate the possibility of using imitation learning to develop agents with desirable …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Reinforcement Learning", "agg_topic": "Reinforcement Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:k8Z6L05lTy4C", "title": "Event-Driven Real-Time Multi-Objective Charging Schedule Optimization For Electric Vehicle Fleets", "authors": ["Jose Peeterson Emerson Raja", "Arvind Easwaran"], "description": "The utilization of Electric Vehicles (EVs) in car rental services is gaining momentum around the world and most commercial fleets are expected to fully adopt EVs by 2030. At the moment, the baseline solution that most fleet operators use is a Business as Usual (BAU) policy of charging at the maximum power at all times when charging EVs. Unlike petrol prices that are fairly constant, electricity prices are more volatile and can vary vastly within several minutes depending on electricity supply which is influenced by intermittent energy supplies like renewable energy and increased demand due to electrification in many industrial sectors including transportation. The battery in EVs is the most critical component as it is the most expensive component to replace and the most dangerous component with fire risks. For safe operation and battery longevity it is imperative to prevent battery capacity fade whenever the EVs are …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Optimization", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:vbGhcppDl1QC", "title": "Holistic optimization of the operation of a GCHP system: A case study on the ADREAM building in Toulouse, France", "authors": ["Zhonglin Chiam", "Ilias Papas", "Arvind Easwaran", "Corinne Alonso", "Bruno Estibals"], "description": "Ground-source heat pumps are more energy-efficient, especially when compared to their water and air source counterparts. However, when operating and design conditions are vastly different, the expected gains in efficiency could be easily negated. Under such scenarios, measures to improve energy performance are explored through performing mathematical optimization on the appropriate model of the system.Components of a heat pump system are often operated at pre-defined setpoints or independently optimized, disregarding the overall performance. Formulation of a holistic optimization problem which expresses the system in its tuneable variables, while capturing the tight-coupling between its components results in a complex mixed-integer non-linear program. Our paper concerns itself with the mathematical modeling and optimization of the hourly operation of a ground-coupled heat pump system for …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Optimization", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:MLfJN-KU85MC", "title": "A Low-Cost Lane-Following Algorithm for Cyber-Physical Robots", "authors": ["Archit Gupta", "Arvind Easwaran"], "description": "Duckiebots are low-cost mobile robots that are widely used in the fields of research and education. Although there are existing self-driving algorithms for the Duckietown platform, they are either too complex or perform too poorly to navigate a multi-lane track. Moreover, it is essential to give memory and computational resources to a Duckiebot so it can perform additional tasks such as out-of-distribution input detection. In order to satisfy these constraints, we built a low-cost autonomous driving algorithm capable of driving on a two-lane track. The algorithm uses traditional computer vision techniques to identify the central lane on the track and obtain the relevant steering angle. The steering is then controlled by a PID controller that smoothens the movement of the Duckiebot. The performance of the algorithm was compared to that of the NeurIPS 2018 AI Driving Olympics (AIDO) finalists, and it outperformed all but one finalists. The two main contributions of our algorithm are its low computational requirements and very quick set-up, with ongoing efforts to make it more reliable.", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:ML0RJ9NH7IQC", "title": "A novel load distribution strategy for aggregators using IoT-enabled mobile devices", "authors": ["Nitin Shivaraman", "Jakob Fittler", "Saravanan Ramanathan", "Arvind Easwaran", "Sebastian Steinhorst"], "description": "The rapid proliferation of Internet-of-things (IoT) as well as mobile devices such as Electric Vehicles (EVs), has led to unpredictable load at the grid. The demand to supply ratio is particularly exacerbated at a few grid aggregators (charging stations) with excessive demand due to the geographic location, peak time, etc. Existing solutions on demand response cannot achieve significant improvements based only on time-shifting the loads. Device properties such as charging modes and movement capabilities can be exploited to enable geographic migration. Additionally, the information on the spare capacity at a few aggregators can aid in re-channeling the load from other aggregators facing excess demand to allow movement of devices. In this paper, we model these flexible properties of the devices as a mixed-integer non-linear problem (MINLP) to minimize excess load and improve the utility (benefit) across all …", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:9Nmd_mFXekcC", "title": "Special issue on design of embedded software and systems (SI:: ICESS19)", "authors": ["Arvind Easwaran", "Qi Zhu", "Naijun Zhan"], "description": "Special issue on design of embedded software and systems (SI: : ICESS19): Journal of \nSystems Architecture: the EUROMICRO Journal: Vol 116, No C ACM Digital Library home \nACM home Google, Inc. (search) Advanced Search Browse About Sign in Register \nAdvanced Search Journals Magazines Proceedings Books SIGs Conferences People More \nSearch ACM Digital Library SearchSearch Advanced Search Journal of Systems \nArchitecture: the EUROMICRO Journal Periodical Home Latest Issue Archive Authors \nAffiliations Award Winners More HomeBrowse by TitlePeriodicalsJournal of Systems \nArchitecture: the EUROMICRO JournalVol. 116, No. CSpecial issue on design of embedded \nsoftware and systems (SI: ICESS19) editorial Share on Special issue on design of \nembedded software and systems (SI: ICESS19) Authors: Arvind Easwaran School of \nComputer Science and Engineering, Nanyang …", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:hkOj_22Ku90C", "title": "Demo Abstract: Contract-based Hierarchical Resilience Framework for Cyber-Physical Systems", "authors": ["Daniel Jun Xian Ng", "Arvind Easwaran", "Sidharta Andalam"], "description": "This demonstration presents a framework for building a resilient Cyber-Physical Systems (CPS) cyber-infrastructure through the use of hierarchical parametric assume-guarantee contracts. A Fischertechnik Sorting Line with Color Detection training model is used to showcase our framework.", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:UHK10RUVsp4C", "title": "Demo Abstract: Contract-based Hierarchical Resilience Framework for Cyber-Physical Systems", "authors": ["Daniel Jun Xian Ng", "Arvind Easwaran", "Sidharta Andalam"], "description": "This demonstration presents a framework for building a resilient Cyber-Physical Systems (CPS) cyber-infrastructure through the use of hierarchical parametric assume-guarantee contracts. A Fischertechnik Sorting Line with Color Detection training model is used to showcase our framework.", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:dQ2og3OwTAUC", "title": "Contract-based Hierarchical Resilience Management for Cyber-Physical Systems", "authors": ["Mohammad Shihabul Haque", "Daniel Jun Xian Ng", "Arvind Easwaran", "Karthik Thangamariappan"], "description": "Orchestrated collaborative effort of physical and cyber components to satisfy given requirements is the central concept behind Cyber-Physical Systems (CPS). To duly ensure the performance of components, a software-based resilience manager is a flexible choice to detect and recover from faults quickly. However, a single resilience manager, placed at the centre of the system to deal with every fault, suffers from decision-making overburden; and therefore, is out of the question for distributed large-scale CPS. On the other hand, prompt detection of failures and efficient recovery from them are challenging for decentralised resilience managers. In this regard, we present a novel resilience management framework that utilises the concept of management hierarchy. System design contracts play a key role in this framework for prompt fault-detection and recovery. Besides the details of the framework, an Industry 4.0 …", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:Mojj43d5GZwC", "title": "Demo Abstract: Testbed for Practical Considerations In Mixed-Criticality System Design", "authors": ["Vijaya Kumar Sundar", "Arvind Easwaran"], "description": "Increase in number of autonomous functionalities has led to design approaches where software elements requiring varied levels of execution reliability are made to share a common platform (hardware and software) and such systems are termed as Mixed-Criticality Systems (MCS). An important challenge in designing MCS is to handle uncertainties in the execution behaviour such as a budget overrun of a software element (or task) in a safe and effective manner. For this purpose, functional safety standards such as ISO 26262 [1] specify a set of rules and rigorous process which necessitate the system design to incorporate sufficient mechanisms to prevent the propagation of faults from tasks certified to lower criticality level to tasks certified to higher criticality level. A majority of the existing MCS task models (reviewed in [2]) consider criticality to denote the relative importance of a task and use it to achieve graceful degradation of the system either by suspending or degrading tasks with relatively lower criticality level than the overloading task. As pointed out in [3], notion of criticality as the relative importance of a task may be appropriate only for dual-criticality MCS models (where a task can be either high critical or low critical). For instance, it has been observed that in a system with 4 criticality levels, to handle budget overrun of any task at criticality level 4 (highest), degradation of tasks with criticality level 3 may not be acceptable. As stated in [4], the notion of criticality, relative importance and degradation of a functionality in an MCS should be loosely coupled entities. To achieve this, we consider a context-aware degradation strategy with the following …", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:tzM49s52ZIMC", "title": "Management for Cyber-Physical Systems", "authors": ["Mohammad Shihabul Haque", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "Cyber-physical Systems SG tisfy User requirements through ClOSe COllCbOrGflOn GmOng physicGl Gnd Cyber COmponents. Software-based resilience mɑnɑgement solutions Can provide flexibility in dealing with Component failures. To improve efficiency Gnd ease Of implementation, We present G. COnfrGC-based hierarchical resilience management framework. odern cyber-physical systems (CPSs) satisfy user requirements through a synergistic interaction among cyber and physical components. To maintain this synergy, component performance is not only important; it is mandatory. However, large-scale CPSs, such as Industry 4.0-based manufacturing plants, are massively distributed. In such systems, ensuring every component's functional and nonfunctional correctness is challenging.", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:SpbeaW3--B0C", "title": "Dataflow optimized overlays for FPGAs", "authors": ["Arvind Easwaran"], "description": "Dataflow Coprocessor Overlay (DaCO) is an FPGA-tuned dataflow-driven overlay architecture that offers fine-grained parallelism capable of delivering speedups of up to 2.8x on sparse, irregular computations over competing architectures (e.g. modern microprocessors and existing dataflow overlays). DaCO delivers these improvements with a custom instruction datapath that exploits the raw parallelism exposed by the dataflow triggering rule - instructions execute asynchronously as soon as their operands are available. However, this simple triggering logic can expose large amounts of irregular instruction-level parallelism that can be hard to manage. This thesis addresses this challenge in three steps: (1) design of a lightweight scheduling circuit inside each DaCO soft-processor that enables large- scale out-of-order instruction execution at runtime, (2) design of a priority-aware communication framework that delivers improved quality of service to critical communication packets, and (3) compiler support that optimizes the dataflow graph structure for improved runtime execution. DaCO is optimized for the Arria 10 AX115S (20nm SoC) FPGA board in order to take advantage of the hard on-chip floating-point DSP blocks. Overall, when benchmarked with sparse-matrix vector multiply kernels, DaCO improves throughput performance by up to 2.4x over existing in-order dataflow overlays, and delivers a peak operational throughput of up to 38 MFLOPs/processor, or a peak total throughput of 3.5 GFLOPs/sec.  The DaCO engine is composed of a custom dataflow-inspired soft-processor and a priority-aware Network on Chip (NoC) communication …", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:XiSMed-E-HIC", "title": "Abstracts from ATTD 2017 10th International Conference on Advanced Technologies & Treatments for Diabetes Paris, France—February 15–18, 2017", "authors": ["E Renard", "B Bode", "G Grunberger", "G Steil", "W Pories", "J Pickup", "IB Hirsch", "M Sperling", "L Laffel", "K Barnard", "S Amiel", "S Garg", "E Dassau", "D Maahs", "F Cameron", "L Trang", "B Buckingham", "C Levy", "G Forlenza", "D Lam", "P Clinton", "L Messer", "E Westfall", "C Levister", "YY Xie", "N Baysal", "D Howsmon", "SD Patek", "W Bequette", "FJ Doyle", "A Janež", "M Jensterle", "C Mathieu", "N Bratina", "K Dovč", "T Battelino", "O Kordonouri", "R Schiaffini", "E Dassau", "H Goldman", "A Haidar", "S Weinzimer", "R Rabasa-Lhoret", "C Mathieu", "C Gysemans", "M Peakman", "G Aleppo", "T Riddlesworth", "R Beck", "K Ruedy", "E Eyth", "R Bergenstal", "Z Mahmoudi", "K Nørgaard", "N Kjølstad Poulsen", "H Madsen", "J Bagterp Jørgensen", "R Bergenstal", "T Riddlesworth", "K Ruedy", "C Kollman", "D Price", "R Beck", "J Kesavadev", "G Krishnan", "B Saboo", "A Shankar", "AD Ashok", "G Sanal", "L Ramachandran", "S Jothydev", "J Bolinder", "R Antuna", "P Geelhoed-Duijvestijn3", "J Kroeger", "R Weitgasser", "J Lucisano", "L Kurbanyan", "S Martha", "T Routh", "T Dunn", "Y Xu", "G Hayter", "D Voormolen", "N Jugnee", "M Reddy", "S Anantharaja", "N Oliver", "E Spanudakis", "L Messer", "G Forlenza", "RP Wadwa", "E Westfall", "E Jost", "GT Alonso", "D Maahs", "R Slover", "A Cinar", "I Hajizadeh", "K Turksoy", "S Samadi", "J Feng", "M Sevil", "N Frantz", "C Lazaro Martinez", "Z Mahoney", "E Cengiz", "A Roy", "B Grosman", "N Parikh", "D Wu", "N Kurtz", "R Brazg", "R Slover", "S Garg", "J Ilany", "B Bode", "B Buckingham", "S Weinzimer", "S Anderson", "T Bailey", "R Bergenstal", "F Kaufman", "A Roy", "B Grosman", "N Parikh", "D Wu", "N Kurtz", "R Slover", "S Garg", "J Ilany", "B Bode", "B Buckingham", "S Weinzimer", "S Anderson", "T Bailey", "R Bergenstal", "F Kaufman", "T Biester", "I Muller", "K Remus", "S Bläsig", "E Atlas", "R Nimri", "K Dovc", "N Bratina", "T Battelino", "M Philip", "O Kordonouri", "T Danne"], "description": null, "publication_year": 2017, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:i2xiXl-TujoC", "title": "Evaluation of an artificial pancreas in in silico patients with online-tuned internal model control", "authors": ["Namjoon Cho", "Arpita Bhattacharjee", "Arvind Easwaran", "Melvin Khee-Shing Leow"], "description": "A fully-automated controller in the artificial pancreas (AP) system designed to regulate blood glucose concentration can give better lifestyle to a type 1 diabetic patient. This paper deals with evaluating the benefit of fully-automated online-tuned controller for the AP system over offline-tuned and semi-automated controller based on internal model control (IMC) strategy. The online-tuned controller is fully-automatic in the sense that it can automatically deal with intra- and inter-patient variabilities and compensate for unannounced meal disturbances without any prior knowledge of patient parameters, patient specific characteristics or patient specific input–output data. A data driven Volterra model of patients is used to design IMC algorithms. For online-tuned controller, the Volterra kernels of the model are computed online by recursive least squares algorithm. The IMC algorithms are evaluated using different scenarios in the UVA/Padova metabolic simulator for validation, comparison with a fully-automatic zone model predictive controller and robustness analysis. Unlike offline-tuned IMC and semi-automated IMC, the online-tuned IMC in the AP system performs satisfactorily for every patient condition without patients’ intervention. Experimental results show that the online-tuned IMC compensates unannounced meal disturbances with low frequency of hypoglycemic events and most importantly, with low insulin infusion even with variations in insulin sensitivity, in the presence of irregular amounts of meal disturbances at random times, and in the presence of very high noise levels in the sensors and actuators. Patients experience hypoglycemia 0.46%, 1 …", "publication_year": 2017, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:xtRiw3GOFMkC", "title": "Mixed Criticality on Multicore/Manycore Platforms (Dagstuhl Seminar 17131)", "authors": ["Liliana Cucu-Grosjean", "Robert Davis", "Sanjoy K Baruah", "Zoë Stephenson"], "description": "This report provides an overview of the discussions, the program and the outcomes of the second Dagstuhl Seminar on Mixed Criticality on Multicore/Manycore Platforms. The seminar brought together researchers working on mixed criticality real-time applications, industrialists from the aerospace, railway, and automotive industries, and experts in certification.", "publication_year": 2017, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:M05iB0D1s5AC", "title": "WiP Abstract: A Novel Strategy for Active Cell Balancing", "authors": ["Sriram Vasudevan", "Nitin Shivaraman", "Arvind Easwaran"], "description": "Cell imbalance in batteries results in the degradation of capacity delivery of the battery. Battery Management System (BMS) uses passive or active balancing techniques to counter this. The strength of a battery measured in terms of State- of-Charge (SoC), is limited by the capacity of its weakest cell leading to under-utilized cells and reduced lifetime. In this paper, we present a novel active cell balancing algorithm to minimize the number of transactions to transfer the capacity between the cells to achieve a balance among cells.", "publication_year": 2016, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:2P1L_qKh6hAC", "title": "Demo Abstract: Predictable SoC Architecture Based on COTS Multi-Core", "authors": ["Nitin Shivaraman", "Sriram Vasudevan", "Arvind Easwaran"], "description": "Base band stations for Long Term Evolution (LTE) communication processing tend to rely on over-provisioned resources to ensure that peak demands can be met. These systems must meet user Quality of Service expectations, but during non-peak workloads, for instance, many of the cores could be placed in low-power modes. One key property of such application-specific systems is that they execute frequent, short-lived tasks. Sophisticated resource management and task scheduling approaches suffer intolerable overhead costs in terms of time and expense, and thus lighter-weight and more efficient strategies are essential to both saving power and meeting performance expectations. To this end, we develop a flexible, non-propietary LTE workload model to drive our resource management studies. Here we describe our experimental infrastructure and present early results that underscore the promise of our …", "publication_year": 2016, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:S16KYo8Pm5AC", "title": "Mixed-criticality scheduling to minimize makespan", "authors": ["Zhishan Guo", "Arvind Easwaran", "Sanjoy Baruah"], "description": "In the mixed-criticality job model, each job is characterized by two execution time parameters, representing a smaller (less conservative) estimate and a larger (more conservative) estimate on its actual, unknown, execution time. Each job is further classified as being either less critical or more critical. The desired execution semantics are that all jobs should execute correctly provided all jobs complete upon being allowed to execute for up to the smaller of their execution time estimates, whereas if some jobs need to execute beyond their smaller execution time estimates (but not beyond their larger execution time estimates), then only the jobs classified as being more critical are required to execute correctly. The scheduling of collections of such mixed-criticality jobs upon identical multiprocessor platforms in order to minimize the makespan is considered here.", "publication_year": 2016, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:xtoqd-5pKcoC", "title": "Incremental Schedulability Analysis of Hierarchical", "authors": ["Arvind Easwaran", "Insik Shin", "Oleg Sokolsky", "Insup Lee"], "description": "Component-based real-time systems often involve hierarchical scheduling frameworks for supporting hierarchical resource sharing among components under different scheduling policies. The hierarchical framework can be generally represented as a tree of nodes, where each node represents a component consisting of some real-time workload and a scheduling policy, and resources are allocated from a parent to its children. Many studies have been proposed on compositional schedulability analysis for component-based hierarchical scheduling frameworks [22, 15, 23, 1, 4]. However, their approaches do not support incremental schedulability analysis. There have been recent studies [25, 26, 12] that support incremental schedulability analysis using the interface theory [5, 6]. However, these interface theory based techniques cannot be directly applied for the problem of finding the periodic interface, among all possible periodic interfaces with different periods, that minimizes the", "publication_year": 2006, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:KlAtU1dfN6UC", "title": "Inferring Automata and its Application to Compositional Verification WPEII: Critical Review Report", "authors": ["Arvind Easwaran"], "description": "Given an oracle which can answer membership and equivalence queries for an unknown regular language, we present algorithms for learning the regular set perfectly. For the case where the oracle cannot reset the black box automaton to a fixed initial state, we present efficient learning algorithms using homing sequences. Algorithms have been described for two different representations of the finite automaton. In the special case where the automaton is a permutation automaton, we present algorithms which can deduce the unknown regular set without the use of equivalence queries. We also describe a modified learning algorithm which can be used to learn context-free grammars from their structural descriptions. Application of these learning techniques for compositional verification of symbolic modules has also been discussed. We also describe improvements to the learning algorithm for context-free languages under certain restrictions on the result of equivalence queries.", "publication_year": 2005, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:WZBGuue-350C", "title": "Ex-Officio (TCRTS Chair)", "authors": ["Arvind Easwaran", "Liliana Cucu-Grosjean"], "description": "Organizers Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource \nCenter Press Room Advertising About Us IEEE IEEE Computer Society IEEE Computer Society \nDigital Library My Subscriptions Magazines Journals Conference Proceedings Institutional \nSubscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press \nRoom Advertising About Us Cart All Advanced Search Conference Cover Image Download \n1.Home 2.Proceedings 3.rtss 2022 Organizers 2022, pp. xv-xvi, DOI Bookmark: \n10.1109/RTSS55097.2022.00007 Keywords Authors Abstract Lists the conference organizers, \nsponsors, patrons, speakers, and/or committee members. Organizers Program Chair: Arvind \nEaswaran, Nanyang Technological University, Singapore General Chair: Liliana Cucu-Grosjean, \nInria Paris and StatInf, France Ex-Officio (TCRTS Chair): Christopher Gill, Washington …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:LI9QrySNdTsC", "title": "2022 IEEE 28th International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA)| 978-1-6654-5344-8/22/$31.00© 2022 IEEE| DOI: 10.1109/RTCSA55878 …", "authors": ["Tarek Abdelzaher", "James H Anderson", "Jatin Arora", "Mihail Asavoae", "Mohammad Ashjaei", "Pavel Badin", "Michael Bechtel", "Jürgen Becker", "Belgacem Ben Hedia", "Benjamin Binder", "Florian Brandner", "Abdulrahman Bukhari", "Alan Burns", "Nicola Capodieci", "Samarjit Chakraborty", "Li-Pin Chang", "Jian-Jia Chen", "Anika Christmann", "Masoud Daneshtalab", "Robert I Davis", "Qingxu Deng", "Michal Dobeš", "Parasara Sridhar Duggirala", "Arvind Easwaran", "Robin Edmaier", "Rolf Ernst", "Hossein Fotouhi", "Bineet Ghosh", "Christopher Gill", "Tiago Gomes", "Song Han", "Robin Hapka", "Clara Hobbs", "Seyedmehdi Hosseinimotlagh", "Hsiang-Sen Hsu", "Xiaobo Sharon Hu", "Shih-Hao Hung", "Tohru Ishihara", "Mathieu Jan", "Mohsen Karimi", "Hyoseung Kim", "Takumi Komori", "Yi-Hung Kuo", "Hao Li", "Wen-Yew Liang", "Hsiang-Jui Lin", "Zi-Jie Lin", "Cláudio Maia", "Yutaka Masuda", "Larry Miller", "Saad Mubeen", "Geoffrey Nelissen", "Daniel Jun Xian Ng", "Joseph Ng", "Sandro Pinto", "Syed Aftab Rashid", "Jan Reineke", "Yilian Ribot González", "Timo Sandmann", "Zenepe Satka", "Florian Schade", "Dawei Shen", "Chi-Sheng Shih", "Miguel Silva", "Mikael Sjödin", "Ahmet Soyyigit", "Marion Sudvarg", "Henrik Theiling", "PS Thiagarajan", "Eduardo Tovar", "Chia-Heng Tu", "Niklas Ueter", "Srivatsan Varadarajan", "Georg von der Brüggen"], "description": "Author Index Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.rtcsa 2022 Author Index 2022, pp. 235-236, \nDOI Bookmark: 10.1109/RTCSA55878.2022.00032 Keywords Authors Author IndexAbdelzaher, \nTarek 195Anderson, James H. 11Arora, Jatin 51Asavoae, Mihail 91Ashjaei, Mohammad \n220Badin, Pavel 41Bechtel, Michael 120Becker, Jürgen 228Ben Hedia, Belgacem 91Binder, \nBenjamin 91Brandner, Florian 91Bukhari, Abdulrahman 61Burns, Alan 148Capodieci, Nicola …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:b1wdh0AR-JQC", "title": "A Singular Value Approach to Robustify Deep Convolutional Neural Network", "authors": ["Yeli Feng", "Daniel Jun Xian Ng", "Arvind Easwaran"], "description": "Deep convolutional neural networks (DCNN) have achieved near-human classification capability when testing samples are drawn from their training data distribution. However, it remains a challenge for DCNN’s performance to be robust when inputs are maliciously manipulated or out-of-distribution. This paper explores a Singular Value Decomposition (SVD) based data augmentation technique to train adversarially robust DCNN models. We show that, under a mixture of different types of adversarial attacks, the classification accuracy of a CIFAR100 model trained with the proposed data augmentation method is 8.8% higher than the best model on the RobustBench leaderboard. As simple as SVD is, it effectively alleviates adversarial perturbations from images during testing. We show that under miscellaneous adversarial attacks, SVD based input defense method improves the accuracy of robust ImageNet models on the RobustBench leaderboard by 4-6%, the best among existing input defense methods in comparison.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:BwyfMAYsbu0C", "title": "Gabriel Parmer Roberto Passerone Nuno Pereira Linh Thi Xuan Phan", "authors": ["Luca Abeni", "Masud Ahmed", "Bader Al-Ahmad", "Luis Almeida", "Mikael Åsberg", "Neil Audsley", "Philip Axer", "Paulo Baltarejo Sousa", "Mario Bambagini", "Laura Barros Bastante", "Tseesuren Batsuuri", "Moris Behnam", "Sven Buente", "Julie Chambon", "Bekim Cilku", "Rodrigo Coehlo", "Dakshina Dasari", "Farhana Dewan", "Robert Diemer", "Benedikt Dietrich", "Bjoern Doebel", "Arvind Easwaran", "Christian El Salloum", "Benjamin Engel", "Dario Faggioli", "Daniele Fontanelli", "Torsten Frenzel", "Shelby Funk", "Joe Gaudet", "Martin Geier", "Joël Goossens", "Raphael Guerra", "Mike Holenderski", "Benedikt Huber", "Giancarlo Iannizzotto", "Matthias Ivers", "Petr Jurcik", "Roland Kammerer", "Susanne Kandl", "Ugur Keskin", "Anis Koubaa", "Jinkyu Lee", "Minsub Lee", "Benjamin Lesage", "Xue Liu", "Yue Lu", "Anwar Mamat", "Ricardo Marau", "José Marinho", "Alejandro Masrur", "Anand Meher", "Meha Mehta", "Patrick Meumeu Yomsi", "Pierre Michaud", "Sibin Mohan", "Theepan Moorthy", "Mircea Negrean", "Vincent Nélis", "Farhang Nemati", "Luis Nogueira", "Daniel Medina Ortega", "Javier Orozco", "José Carlos Palencia", "Wolfgang Puffitsch", "Paul Regnier", "Michael Roitzsch", "Keivan Ronasi", "Jonas Rox", "Luca Santinelli", "Abhik Sarkar", "Martin Schäfer", "Simon Schliecker", "Reinhard Schneider", "Stefan Schorr", "Maurice Sebastian", "Ramon Serna", "Michal Sojka", "Ondrej Spinka", "Julian Stecklina", "Udo Steinberg", "Premysl Sucha", "Maliha Sultana", "Emanuele Toscano", "Jiri Trdlicka", "Luca Valcarenghi", "Cuong Viet", "Shaohui Wang", "Yunbo Wang", "Armin Wasicek", "Libor Waszniowski", "Carsten Weinhold", "Jack Whitham"], "description": "list-reviewer Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource \nCenter Press Room Advertising About Us Cart All Advanced Search Conference Cover Image \nDownload 1.Home 2.Proceedings 3.ecrts 2010 list-reviewer 2010, pp. xi-xi, DOI Bookmark: \n10.1109/ECRTS.2010.6 Keywords Authors Abstract The conference offers a note of thanks and \nlists its reviewers. Reviewers Luca Abeni Masud Ahmed Bader Al-Ahmad Luis Almeida Mikael \nÅsberg Neil Audsley Philip Axer Paulo Baltarejo Sousa Mario Bambagini Laura Barros \nBastante Tseesuren Batsuuri Moris Behnam Sven Buente Julie Chambon Bekim Cilku Rodrigo …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:4MWp96NkSFoC", "title": "Program Committee Members (Main Conference)", "authors": ["LIGM Yasmina Abdeddaïm", "Amir Aminifar", "Jim Anderson", "Fatima Anwar", "Shunsuke Aoki", "Takuya Azumi", "Stanley Bak", "Clément Ballabriga", "Sanjoy Baruah", "Gedare Bloom", "Rakesh Bobba", "Florian Brandner", "Daniel Bristot de Oliveira", "Artem Burmyakov", "Nicola Capodieci", "Daniel Casini", "Sudipta Chattopadhyay", "Kuan-Hsun Chen", "Dakshina Dasari", "Soumyajit Dey", "Arvind Easwaran", "Pontus Ekberg", "Rolf Ernst", "Dario Faggioli", "Nathan Fisher", "Miriam García", "Georgia Giannopoulou", "Joël Goossens", "Ann Gordon-Ross", "Dip Goswami", "Giovani Gracioli", "Ian Gray", "Arpan Gujarati", "Dolvara Gunatilaka", "Soonhoi Ha", "Monowar Hasan", "Mohamed Hassan", "Pi-Cheng Hsiu", "Tingting Hu", "Chadlia Jerad", "Prachi Joshi", "Mehdi Kargahi"], "description": "Program Committee Members Toggle navigation IEEE Computer Society Digital Library Jobs \nTech News Resource Center Press Room Advertising About Us IEEE IEEE Computer Society \nIEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.rtss 2021 Program Committee Members \n2021, pp. 20-22, DOI Bookmark: 10.1109/RTSS52674.2021.00011 Keywords Authors Abstract \nProvides a listing of current committee members and society officers. Program Committee \nMembers (Main Conference) ● Yasmina Abdeddaïm LIGM, Université Gustave Eiffel, ESIEE \nParis France ● Amir Aminifar, Lund University, Sweden ● Jim Anderson, The University of …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:vDijr-p_gm4C", "title": "Thüm, Thomas 124", "authors": ["Diego F Aranha", "Lukas Armborst", "Gina Belmonte", "Marcello M Bersani", "Jalil Boudjadar", "Giovanna Broccia", "Marie Christine", "Vincenzo Ciancia", "Arvind Easwaran", "Michalis Famelis", "Roberta Gori", "Sylvain Hallé", "Marieke Huisman", "Besma Khaireddine", "Raphaël Khoury", "Alexander Knüppel", "Nikolai Kosmatov", "Tomas Kulik", "Diego Latella", "Pascale Le Gall", "Mieke Massink", "Paolo Milazzo", "Ali Mili", "Lucia Nasti", "Virgile Prevosto", "Erick Raelijohn", "Louis Rilling", "Virgile Robles", "Matteo Rossi", "Houari Sahraoui", "Pierluigi San Pietro", "Ina Schaefer", "Leon Schaer", "Robert L Smith", "Rania Taleb"], "description": "Author Index Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource \nCenter Press Room Advertising About Us Cart All Advanced Search Conference Cover Image \nDownload 1.Home 2.Proceedings 3.formalise 2021 Author Index 2021, pp. 141-141, DOI \nBookmark: 10.1109/FormaliSE52586.2021.00020 Keywords Authors Abstract Presents an \nindex of the authors whose articles are published in the conference proceedings record. Author \nIndexAl-Bataineh, Omar 19Aranha, Diego F. 75Armborst, Lukas 111Belmonte, Gina 1Bersani, \nMarcello M. 97Boudjadar, Jalil 75Broccia, Giovanna 1Christine, Marie 130Ciancia, Vincenzo …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:0KyAp5RtaNEC", "title": "Program Committee Members (Main Conference)", "authors": ["Kunal Agrawal", "Mohammad Al Faruque", "Sebastian Altmeyer", "James H Anderson", "Fatima Anwar", "Sanjoy Baruah", "Marko Bertogna", "Alessandro Biondi", "Steffen Bondorf", "Björn Brandenburg", "David Broman", "Giorgio Buttazzo", "Marco Caccamo", "Samarjit Chakraborthy", "Yuan-Hao Chang", "Tam Chantem", "Robert Davis", "Dionisio de Niz", "Patricia Derler", "Zheng Dong", "Arvind Easwaran", "Pontus Ekberg", "Petru Eles", "Rolf Ernst", "Heiko Falk", "Georgia Giannopoulou", "Jöel Goossens", "Ann Gorden-Ross", "Dip Goswami", "Nan Guan", "Zhishan Guo", "Soonhoi Ha", "Arne Hamann", "Song Han", "Bob Iannucci", "Avik Juneja", "Hyoseung Kim", "Fanxin Kong", "Chang-Gun Lee", "Jinkyu Lee", "Jing Li"], "description": "Program Committee Members Toggle navigation IEEE Computer Society Digital Library Jobs \nTech News Resource Center Press Room Advertising About Us IEEE IEEE Computer Society \nIEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.rtss 2020 Program Committee Members \n2020, pp. 17-19, DOI Bookmark: 10.1109/RTSS49844.2020.00009 Keywords Authors Program \nCommittee Members (Main Conference) • Kunal Agrawal, Washington University in St. Louis, \nUSA • Mohammad Al Faruque, University of California Irvine, USA • Sebastian Altmeyer, \nUniversity of Augsburg, Germany • James H. Anderson, University of North Carolina at Chapel …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:nrtMV_XWKgEC", "title": "CPSNA 2015 Steering Committee", "authors": ["Thomas Nolte", "Songhwai Oh", "Shinpei Kato", "Tatsuo Nakajima", "Chi‐Sheng Daniel Shih", "Arvind Easwaran", "Victor Lee", "Insup Lee"], "description": "Author Index Page 1 Author Index Abdel-Hamid, Amr Noaman................................ 65 Larsen, \nLars Bo................................................... 40 AlGhafees, Mohammad.................................... 102 \nLaukkanen, Eero................................................. 11 Amagai, Yukio................................................... \n107 Oliveira, Frederico............................................... 50 Aoyama, Mikio................................................... \n107 Øvad, Tina........................................................... 40 Arvonen, Teemu.................................................. \n11 Paasivaara, Maria............................................... 11 Biddle, Robert..................................................... \n21 Parnin, Chris......................................................... 1 Braz, Alan............................................................ \n97 Rahman, Akond Ashfaque Ur............................... 1 Brown, Judith M. ................................................ \n21 Ralph, Paul.......................................................... 60 Chagas, Aline...................................................... \n87 Rauf, Abdul....................................................... 102 de Toledo, Rodrigo..............…", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:z_wVstp3MssC", "title": "Scalable Framework for Holistic Optimization of District Cooling Systems (DCS)", "authors": ["Arvind Easwaran", "Chiam Zhonglin", "David Mouquet"], "description": "Title Of Presentation (Verdana font size 28, bold) Page 1 Scalable Framework for Holistic \nOptimization of District Cooling Systems (DCS) Arvind Easwaran Assistant Professor Chiam \nZhonglin PhD Student School of Computer Science & Engineering, Energy Research \nInstitute, Nanyang Technological University Monday, 2nd July 2018 1 David Mouquet \nModélisation Expert Départ. Innovation Numérique, Veolia Environment Research & \nInnovation Page 2 Overview • District Cooling Systems • Related work • Research \nMotivation 1. Introduction • Framework description • Case study application • Chilled water \nstorage (On-going) 2. DCS Optimization Framework • Network delays • Coupling with \nMachine Learning 3. Future work 2 Page 3 1. Introduction 3 Page 4 1.1 What are District \nCooling Systems? • Context: – Up to 60% of energy is used for cooling in buildings. Office \nResidential 4 Page 5 1.1 What are District Cooling …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:uJ-U7cs_P_0C", "title": "Efficient Techniques for Holistic Operational Optimisation of Urban Energy Systems", "authors": ["Arvind Easwaran"], "description": "Efficient Techniques for Holistic Operational Optimisation of Urban Energy Systems Page 1 \nEfficient Techniques for Holistic Operational Optimisation of Urban Energy Systems Arvind \nEaswaran Associate Professor School of Computer Science & Engineering Energy Research \nInstitute @ NTU Email: arvinde@ntu.edu.sg Joint work with my PhD students: Zhonglin Chiam \n& Mainak Dan Page 2 Overview • Urban & Multi Energy Systems • Related work • Research \nGaps and Motivation 1. Introduction • Building-level HVAC modelling • Optimisation framework \nusing MILP • Case study and results from France 2. Fine-Grained Optimisation • Cluster-level \nmulti energy system modelling • Optimisation framework using GA+QP • Case study and \nresults from Singapore 3. Coarse-Grained Optimisation 2 Page 3 1. Introduction 3 Page 4 1.1 \nUrban Energy Systems • Context – Urban areas house 50% of world population – Expected …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:evX43VCCuoAC", "title": "Message from the General and Program co-Chairs", "authors": ["Jaewoo Lee", "Kilho Lee", "Sudipta Chattopadhyay", "Hoon Sung Chwa", "Zhishan Guo", "Hyosu Kim", "Anish Byanjankar", "Sangeun Oh", "Insik Shin", "Arvind Easwaran"], "description": "RTCSA-2020, the International Conference on Embedded and Real-time Computing Systems and Applications (RTCSA), brings together researchers from academia and industry to advance the state-of-the-art in embedded and real-time computing systems and applications. RTCSA started as a workshop in 1994, became a conference in 1998, and since then the technical program has been improving steadily. RTCSA became an IEEE conference in 2005 and is one of the major conferences in the real-time and embedded systems community.This year, for the 26th edition, we will be celebrating a fully virtual event (thanks to the prevailing COVID-19 global situation) with an exciting technical program. The program includes two keynote talks: 1) Gernot Heiser from UNSW, Sydney, will talk about the verified sel4 microkernel, and 2) Tulika Mitra from NUS, Singapore, will talk about heterogeneous computing in …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:kzcrU_BdoSEC", "title": "Adepu, Sridhar 30 Alanwar, Amr 206 Al Faruque, Mohammad Abdullah 186, 188 Allen, Joey 9", "authors": ["Nathan Allen", "Matthias Althoff", "Abdullah Al Zishan", "Aaron D Ames", "Mahmoud Ammar", "Omid Ardakanian", "Hamid Bagheri", "Balaji Balasubramaniam", "Ezio Bartocci", "Anomadarshi Barua", "Justin Bradley", "Ferdinand Brasser", "Philip Brisk", "Linda Bushnell", "Feiyang Cai", "Ben W Carabelli", "John Charles Chaput", "Sujit Rokka Chhetri", "Andrew Clark", "Bruno Crispo", "Shilong Dai", "Lucas Davi", "Parasara Sridhar Duggirala", "Frank Dürr", "Arvind Easwaran", "Sebastian Elbaum", "Sina Faezi", "Xueli Fan", "Farhad Farokhi", "Lu Feng", "Jakob Fittler", "Daniel D Fong", "Qitong Gao", "Ilija Jovanov", "Karthik Kamaravelu", "Abolfazl Karimi", "Pramod Khargonekar", "Filip Klaesson", "Xenofon Koutsoukos", "Fernando A Kuipers", "Naomi Kuze", "Abolfazl Lavaei", "Wenke Lee", "Vuk Lesi", "Na Li", "Eli Lifland", "Jie Liu", "Xusheng Luo", "Meiyi Ma", "Arnav Vaibhav Malawade", "Ankur Mehta", "Sara Mohammadinejad", "Shana Moothedath", "Richard M Murray", "Deepan Muthirayan", "Michael Naumann", "Petter Nilsson", "Luyao Niu", "Miroslav Pajic", "Antonis Papachristodoulou", "Kurian Polachan", "Radha Poovendran", "Aniruddh G Puranic", "Saravanan Ramanathan"], "description": "Author Index Page 1 Author Index Adepu, Sridhar 30 Alanwar, Amr 206 Al Faruque, \nMohammad Abdullah 186, 188 Allen, Joey 9 Allen, Nathan 259 Althoff, Matthias 206 Al Zishan, \nAbdullah 63 Ames, Aaron D. 196 Ammar, Mahmoud 247 Ardakanian, Omid 63 Bagheri, Hamid \n151 Balasubramaniam, Balaji 151 Bartocci, Ezio 51 Barua, Anomadarshi 188 Bradley, Justin \n151 Brasser, Ferdinand 30 Brisk, Philip 186 Bushnell, Linda 9, 162 Cai, Feiyang 174 Carabelli, \nBen W. 236 Chaput, John Charles 186 Chhetri, Sujit Rokka 186 Clark, Andrew 162 Crispo, \nBruno 247 Dai, Shilong 141 Davi, Lucas 30 Duggirala, Parasara Sridhar 41 Dürr, Frank 236 \nEaswaran, Arvind 20, 192 Elbaum, Sebastian 151 Faezi, Sina 186 Fan, Xueli 184 Farokhi, \nFarhad 1 Feng, Lu 51 Fittler, Jakob 192 Fong, Daniel D 119 Gao, Qitong 108 Garcia, Luis 30 \nGhiasi, Soheil 119 Grill, Warren 108 Grover, William 186 He, Liang 141 Jovanov, Ilija 108 …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:VL0QpB8kHFEC", "title": "2019 Index IEEE Embedded Systems Letters Vol. 11", "authors": ["S Andalam", "G Ansaloni", "G Ascheid", "F Asplund", "S Asyaban", "D Atienza", "K Baital", "T Ballenthin", "S Basu", "JM Bermudo Mera", "R Burlacu", "O Cadenas", "A Canedo", "A Chakrabarti", "LP Dantas", "RJ de Azevedo", "K Desnos", "S Dey", "B Dreyer", "Y Du", "A Dubey", "L Duch", "A Easwaran", "HM El-Bakry", "SM El-Sayed", "J Ellul", "WM Elsayed", "JF Eusse", "MAA Faruque", "D Fong", "W Fornaciari", "V Freschi", "G Fuhr", "M Gay", "S Ghiasi", "SK Ghosh", "SP Gimenez", "T Grass", "X Guan"], "description": "2019 Index IEEE Embedded Systems Letters Vol. 11 Page 1 129 IEEE EMBEDDED \nSYSTEMS LETTERS, VOL. 11, NO. 4, DECEMBER 2019 This index covers all technical \nitems—papers, correspondence, reviews, etc.—that appeared in this periodical during 2019, \nand items from previous years that were commented upon or corrected in 2019. \nDepartments and other items may also be covered if they have been judged to have \narchival value. The Author Index contains the primary entry for each item, listed under the \nfirst author’s name. The primary entry includes the coauthors’ names, the title of the paper or \nother item, and its location, specified by the publication abbreviation, year, month, and \ninclusive pagination. The Subject Index contains entries describing the item under all \nappropriate subject headings, plus the first author’s name, the publication abbreviation, \nmonth, and year, and inclusive pages. Note that the …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:PELIpwtuRlgC", "title": "IEEE ISORC 2019 Message from the General Chairs", "authors": ["Marisol García-Valls", "Abhishek Dubey", "Arvind Easwaran"], "description": "On behalf of the organizing committee members, we welcome you to the 22nd International Symposium on Real-Time Computing (ISORC 2019), this year taking place in the city of Valencia, Spain, from 7-9 May 2019. We welcome you in the Mediterranean city of Valencia to spend an exciting time for science and also social gathering around the conference themes.Since its origin back in 1998, ISORC addresses the most interesting topics around real-time applications, object-oriented and component technology for distributed systems, and distribution middleware design. The conference has evolved over the years to address the many emerging challenges that new applications and systems bring to the scientific and technological arena. This event requires the involvement of a number of people that we wish to thank individually. In the first place, we warmly thank the PC chairs, Aniruddha Gokhale, Weichen Liu, and Mathias Pacher for their effort and time in putting together an outstanding pool of reviewers and for handling the review process of the submitted contributions to select the final set of papers that will be presented. Also, we want to thank the Poster/Demo chairs, Prof. Luis Lino Ferreira and Di Liu, who have organized a track on posters and demos for the first time in ISORC. Thanks also to this years’ publicity chairs, Tommaso Cucinotta and Zhenkai Zhang (the latter also acting as Web chair) for their involvement in reaching out to the scientific and technological community. Besides, we thank the steering committee chairs, Uwe Brinkschulte and Rob Pettit, for their guidance. A sincere “thank you” to all authors that are fundamental for a …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:5ugPr518TE4C", "title": "A Hardware Compensation Mechanism for Embedded Energy Harvesting Emulation.... E. Lattanzi and V. Freschi 25 Dynamic Scheduling of Real-Time Tasks in Heterogeneous Multicore …", "authors": ["S Wang", "C Xiao", "W Liu", "S Andalam", "DJX Ng", "A Easwaran", "K Thangamariappan", "M Motamedi", "D Fong", "S Ghiasi", "S Asyaban", "M Kargahi"], "description": "Presents the table of contents for this issue of the publication.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:q3oQSFYPqjQC", "title": "RTCSA 2018", "authors": ["Hoon Sung Chwa", "Konstantinos Bletsas", "Kyoung-Don Kang", "Jen-Wei Hsieh", "Li-Pin Chang", "Marko Bertogna", "Bjorn Andersson", "Alessio Bechini", "Euiseong Seo", "Zili Shao", "Tom Spink", "Zonghua Gu", "Alejandro Masrur", "Jaewoo Lee", "Chang-Gun Lee", "Jingtong Hu", "Hiroyuki Tomiyama", "Björn Brandenburg", "Marco Caccamo", "Tam Chantem", "Liliana Cucu-Grosjean", "Arvind Easwaran", "Pontus Ekberg", "Nathan Fisher", "Kyungtae Kang", "Hyoseung Kim", "Jinkyu Lee", "Renato Mancuso", "Thomas Nolte", "Claire Pagetti", "Harini Ramaprasad", "Christine Rochange", "Qixin Wang", "Richard West", "Chun Jason Xue", "Tatsuo Nakajima", "Miroslav Pajic", "Mo Sha", "Hideyuki Kawashima", "Hossein Fotouhi", "Ren Ohmura", "Ye-Qiong Song", "Yutaka Arakawa"], "description": "Provides a listing of current committee members and society officers.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:eflP2zaiRacC", "title": "Program Committee Members (Main Conference)", "authors": ["Ahlem Mifdaoui", "Arne Hamann", "Arvind Easwaran", "Avinash Malik", "Björn Brandenburg", "Bryan Ward", "Chang-Gun Lee", "Chris Gill", "Christine Rochange", "Claire Maiza", "Dakai Zhu", "Daniel Lohmann", "Dionisio de Niz", "Enrico Bini", "Gedare Bloom", "Geoffrey Nelissen", "George Lima", "Gerhard Fohler", "Haibo Zeng", "Hiren Patel", "Ian Gray", "Jiming Chen", "Jinkyu Lee", "Joël Goossens", "Julio Medina", "Krithi Ramamritham", "Leandro Indrusiak", "Lei Ju", "Liliana Cucu-Grosjean", "Lucia Lo Bello", "Marisol García Valls", "Martin Schoeberl", "Martina Maggio", "Mitra Nasri", "Moris Behnam", "Renato Mancuso", "Richard West"], "description": "Program Committee Members Toggle navigation IEEE Computer Society Digital Library Jobs \nTech News Resource Center Press Room Advertising About Us IEEE IEEE Computer Society \nIEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.rtss 2018 Program Committee Members 2018, \npp. 16-17, DOI Bookmark: 10.1109/RTSS.2018.00009 Keywords Authors Program Committee \nMembers (Main Conference) Ahlem Mifdaoui, University of Toulouse/ ISAE-Supaéro, France \nAlessandro Biondi, SSSA, Italy Arne Hamann, Robert Bosch, Germany Arvind Easwaran, \nNanyang Technological University, Singapore Avinash Malik, University of Auckland, New …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:8AbLer7MMksC", "title": "Message from the ISORC 2018 General Co-Chairs", "authors": ["Arvind Easwaran", "Joel Sherill", "Paul Townend"], "description": "On behalf of the members of the organizing committee, we wish you a warm welcome to the 21st International Symposium on Real-Time Computing (ISORC 2018), being held in Singapore from 29–31 May 2018. This year, ISORC will be held in the beautiful Yunnan garden campus of Nanyang Technological University (NTU), which is a 200-hectare lush green campus located in the west end of Singapore.Founded in 1998 (first meeting in Kyoto, Japan) to address research into the application of real-time object-oriented distributed technology, ISORC has continually evolved to meet the latest challenges faced by researchers and practitioners in the real-time domain, with an emphasis on object-, component-and service-oriented systems and solutions. This year, the ISORC steering committee and Program Chairs have-in addition to ISORC’s traditional areas-chosen the theme of “Decentralized time-sensitive …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:B3FOqHPlNUQC", "title": "ISORC 2018 Reviewers", "authors": ["Lucia Lo Bello", "Uwe Brinkschulte", "António Casimiro", "Acangelo Castiglione", "Yao Chen", "Abhishek Dubey", "Arvind Easwaran", "Paul Ezhilchelvan", "Chris D Gill", "Aniruddha Gokhale", "Zonghua Gu", "Nan Guan", "Vana Kalogeraki", "Gabor Karsai", "Chang-Gun Lee", "Jinkyu Lee", "Miguel Angel de Miguel", "Sibin Mohan", "Tatsuo Nakajima", "Yukikazu Nakamoto", "Roman Obermaisser", "Mathias Pacher", "Robert Pettit", "Andreas Polze", "Binoy Ravindran", "Stefano Russo"], "description": "ISORC 2018 Reviewers Toggle navigation IEEE Computer Society Digital Library Jobs Tech \nNews Resource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.isorc 2018 ISORC 2018 Reviewers 2018, pp. \n12-13, DOI Bookmark: 10.1109/ISORC.2018.00008 Keywords Authors Abstract The conference \noffers a note of thanks and lists its reviewers. ISORC 2018 Reviewers We thank the following \npeople for being part of the program committee and helping review and decide the ISORC \n2018 program. Lucia Lo Bello, University of Catania, Italy Uwe Brinkschulte, University of …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=B_ouhTgAAAAJ&cstart=100&pagesize=100&citation_for_view=B_ouhTgAAAAJ:tS2w5q8j5-wC", "title": "ISORC 2018", "authors": ["Andreas Lund", "Uwe Brinkschulte", "Tórur Biskopstø Strøm", "Martin Schoeberl", "Saravanan Ramanathan", "Arvind Easwaran", "Sidharta Andalam", "Daniel Jun Xian"], "description": "Table of contents Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.isorc 2018 Table of contents 2018, pp. 5-8, \nDOI Bookmark: 10.1109/ISORC.2018.00004 Keywords Authors Abstract Presents the table of \ncontents/splash page of the proceedings record. 2018 IEEE 21st InternationalSymposium on \nReal-TimeDistributed ComputingISORC 2018 Table of Contents Message from the ISORC 2018 \nGeneral Co-Chairs ixMessage from the ISORC 2018 Program Chairs xISORC 2018 Organizing …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}]