[{"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:mVmsd5A6BfQC", "title": "Story Generation with Crowdsourced Plot Graphs", "authors": ["Boyang Li", "Stephen Lee-Urban", "George Johnston", "Mark O Riedl"], "description": "Story generation is the problem of automatically selecting a sequence of events that meet a set of criteria and can be told as a story. Story generation is knowledge-intensive; traditional story generators rely on a priori defined domain models about fictional worlds, including characters, places, and actions that can be performed. Manually authoring the domain models is costly and thus not scalable. We present a novel class of story generation system that can generate stories in an unknown domain. Our system (a) automatically learns a domain model by crowdsourcing a corpus of narrative examples and (b) generates stories by sampling from the space defined by the domain model. A large-scale evaluation shows that stories generated by our system for a previously unknown topic are comparable in quality to simple stories authored by untrained humans", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [6, 12, 14, 30, 36, 29, 36, 32, 26, 22, 15, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:CaZNVDsoPx4C", "title": "Heterogeneous knowledge transfer in video emotion recognition, attribution and summarization", "authors": ["Baohan Xu", "Yanwei Fu", "Yu-Gang Jiang", "Boyang Li", "Leonid Sigal"], "description": "Emotion is a key element in user-generated video. However, it is difficult to understand emotions conveyed in such videos due to the complex and unstructured nature of user-generated content and the sparsity of video frames expressing emotion. In this paper, for the first time, we propose a technique for transferring knowledge from heterogeneous external sources, including image and textual data, to facilitate three related tasks in understanding video emotion: emotion recognition, emotion attribution and emotion-oriented summarization. Specifically, our framework (1) learns a video encoding from an auxiliary emotional image dataset in order to improve supervised video emotion recognition, and (2) transfers knowledge from an auxiliary textual corpora for zero-shot recognition of emotion classes unseen during training. The proposed technique for knowledge transfer facilitates novel applications of emotion …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 10, 12, 26, 14, 17, 19, 16, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:DrR-2ekChdkC", "title": "VisualGPT: Data-efficient adaptation of pretrained language models for image captioning", "authors": ["Jun Chen", "Han Guo", "Kai Yi", "Boyang Li", "Mohamed Elhoseiny"], "description": "The limited availability of annotated data often hinders real-world applications of machine learning. To efficiently learn from small quantities of multimodal data, we leverage the linguistic knowledge from a large pre-trained language model (PLM) and quickly adapt it to new domains of image captioning. To effectively utilize a pretrained model, it is critical to balance the visual input and prior linguistic knowledge from pretraining. We propose VisualGPT, which employs a novel self-resurrecting encoder-decoder attention mechanism to quickly adapt the PLM with a small amount of in-domain image-text data. The proposed self-resurrecting activation unit produces sparse activations that prevent accidental overwriting of linguistic knowledge. When trained on 0.1%, 0.5% and 1% of the respective training sets, VisualGPT surpasses the best baseline by up to 10.0% CIDEr on MS COCO and 17.9% CIDEr on Conceptual Captions. Furthermore, VisualGPT achieves the state-of-the-art result on IU X-ray, a medical report generation dataset. Our code is available at https://github. com/Vision-CAIR/VisualGPT.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [24, 63, 10]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:prdVHNxh-e8C", "title": "Joint event detection and description in continuous video streams", "authors": ["Huijuan Xu", "Boyang Li", "Vasili Ramanishka", "Leonid Sigal", "Kate Saenko"], "description": "Dense video captioning is a fine-grained video understanding task that involves two sub-problems: localizing distinct events in a long video stream, and generating captions for the localized events. We propose the Joint Event Detection and Description Network (JEDDi-Net), which solves the dense video captioning task in an end-to-end fashion. Our model continuously encodes the input video stream with three-dimensional convolutional layers, proposes variable-length temporal events based on pooled features, and generates their captions. Proposal features are extracted within each proposal segment through 3D Segment-of-Interest pooling from shared video feature encoding. In order to explicitly model temporal relationships between visual events and their captions in a single video, we also propose a two-level hierarchical captioning module that keeps track of context. On the large-scale ActivityNet Captions …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [10, 17, 18, 13, 7, 4]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:4TOpqqG69KYC", "title": "Crowdsourcing Narrative Intelligence", "authors": ["Boyang Li", "Stephen Lee-Urban", "Darren Scott Appling", "Mark O Riedl"], "description": "Narrative intelligence is an important part of human cognition, especially in sensemaking and communicating with people. Humans draw on a lifetime of relevant experiences to explain stories, to tell stories, and to help choose the most appropriate actions in real-life settings. Manual authoring the required knowledge presents a significant bottleneck in the creation of systems demonstrating narrative intelligence. In this paper, we describe a novel technique for automatically learning script-like narrative knowledge from crowdsourcing. By leveraging human workers’ collective understanding of social and procedural constructs, we can learn a potentially unlimited range of scripts regarding how real-world situations unfold. We present quantitative evaluations of the learned primitive events and the temporal ordering of events, which suggest we can identify orderings between events with high accuracy.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 8, 5, 6, 8, 5, 6, 10, 7, 5, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:u5HHmVD_uO8C", "title": "An offline planning approach to game plotline adaptation", "authors": ["Boyang Li", "Mark O Riedl"], "description": "Role-playing games, and other types of contemporary video games, usually contain a main storyline consisting of several causally related quests. As players have different motivations, tastes and preferences, it can be beneficial to customize game plotlines. In this paper, we present an offline algorithm for adapting human-authored game plotlines for computer role-playing games to suit the unique needs of individual players, thereby customizing gaming experiences and enhancing re-playability. Our approach uses an plan refinement technique based on partial-order planning to (a) optimize the global structure of the plotline according to input from a player model,(b) maintain plotline coherence, and (c) facilitate authorial intent by preserving as much of the original plotline as possible. A theoretical analysis of the authorial leverage and a user study suggest the benefits of this approach.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 9, 8, 6, 9, 5, 5, 5, 4, 4, 5, 4, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:otzGkya1bYkC", "title": "Video Emotion Recognition with Transferred Deep Feature Encodings", "authors": ["Baohan Xu", "Yanwei Fu", "Yu-Gang Jiang", "Boyang Li", "Leonid Sigal"], "description": "Despite growing research interest, emotion understanding for user-generated videos remains a challenging problem. Major obstacles include the diversity and complexity of video content, as well as the sparsity of expressed emotions. For the first time, we systematically study large-scale video emotion recognition by transferring deep feature encodings. In addition to the traditional, supervised recognition, we study the problem of zero-shot emotion recognition, where emotions in the test set are unseen during training. To cope with this task, we utilize knowledge transferred from auxiliary image and text corpora. A novel auxiliary Image Transfer Encoding (ITE) process is proposed to efficiently encode and generate video representation. We also thoroughly investigate different configurations of convolutional neural networks. Comprehensive experiments on multiple datasets demonstrate the effectiveness of our …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 6, 7, 18, 12, 11, 6, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:PYBJJbyH-FwC", "title": "Game Engine Learning from Video", "authors": ["Matthew Guzdial", "Boyang Li", "Mark O Riedl"], "description": "Intelligent agents need to be able to make predictions about their environment. In this work we present a novel approach to learn a forward simulation model via simple search over pixel input. We make use of a video game, Super Mario Bros., as an initial test of our approach as it represents a physics system that is significantly less complex than reality. We demonstrate the significant improvement of our approach in predicting future states compared with a baseline CNN and apply the learned model to train a game playing agent. Thus we evaluate the algorithm in terms of the accuracy and value of its output model.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 10, 8, 17, 8, 7, 7, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:9yKSN-GCB0IC", "title": "Creating an immersive game world with evolutionary fuzzy cognitive maps", "authors": ["Yundong Cai", "Chunyan Miao", "Ah-Hwee Tan", "Zhiqi Shen", "Boyang Li"], "description": "Increasingly, developers are creating serious games to enhance user experiences in education and training. To bridge the gap between game experiences in the virtual environment and in real life, it's crucial to generate believable characters and contexts in real time. However, numerous variables must be simulated for a large-scale serious game. These variables are involved in complex causal relationships, and their values change over time. Because conventional models haven't addressed world modeling well, researchers created the Evolutionary Fuzzy Cognitive Map (E-FCM) to model the characters' variables and contexts with the causalities among them in serious games. As an extension of FCM, E-FCM models not only fuzzy causal relationships but also probabilistic causal relationships among the variables. It also allows asynchronous updates of the variables, so that they can evolve dynamically and …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 4, 5, 6, 0, 6, 6, 4, 4, 4, 1, 5, 7, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:_FxGoFyzp5QC", "title": "Goal-Driven Conceptual Blending: A Computational Approach for Creativity", "authors": ["Boyang Li", "Alexander Zook", "Nicholas Davis", "Mark O Riedl"], "description": "Conceptual blending has been proposed as a creative cognitive process, but most theories focus on the analysis of existing blends rather than mechanisms for the efficient construction of novel blends. While conceptual blending is a powerful model for creativity, there are many challenges related to the computational application of blending. Inspired by recent theoretical research, we argue that contexts and context-induced goals provide insights into algorithm design for creative systems using conceptual blending. We present two case studies of creative systems that use goals and contexts to efficiently produce novel, creative artifacts in the domains of story generation and virtual characters engaged in pretend play respectively.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 7, 5, 5, 7, 4, 9, 4, 3, 7, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:EPG8bYD4jVwC", "title": "An empirical study on the relation between network interpretability and adversarial robustness", "authors": ["Adam Noack", "Isaac Ahern", "Dejing Dou", "Boyang Li"], "description": "Deep neural networks (DNNs) have had many successes, but they suffer from two major issues: (1) a vulnerability to adversarial examples and (2) a tendency to elude human interpretation. Interestingly, recent empirical and theoretical evidence suggests that these two seemingly disparate issues are actually connected. In particular, robust models tend to provide more interpretable gradients than non-robust models. However, whether this relationship works in the opposite direction remains obscure. With this paper, we seek empirical answers to the following question: can models acquire adversarial robustness when they are trained to have interpretable gradients? We introduce a theoretically inspired technique called Interpretation Regularization (IR), which encourages a model’s gradients to (1) match the direction of interpretable target salience maps and (2) have small magnitude. To assess model performance …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [11, 13, 12, 4]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:PVgj2kMGcgYC", "title": "Crowdsourcing Open Interactive Narrative", "authors": ["Matthew Guzdial", "Brent Harrison", "Boyang Li", "Mark O Riedl"], "description": "Interactive narrative is a form of digital interactive experience in which users influence a dramatic storyline through their actions. Artificial intelligence approaches to interactive narrative use a domain model to determine how the narrative should unfold based on user actions. However, domain models for interactive narrative require artificial intelligence and knowledge representation expertise. We present open interactive narrative, the problem of generating an interactive narrative experience about any possible topic. We present an open interactive narrative system—Scherazade IF—that learns a domain model from crowdsourced example stories so that the player can perform different actions and still receive a coherent story experience. We report on an evaluation of our system showing near-human level authoring.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 3, 9, 5, 9, 4, 0, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:2ywjKiB__4kC", "title": "Is gpt-3 a good data annotator?", "authors": ["Bosheng Ding", "Chengwei Qin", "Linlin Liu", "Lidong Bing", "Shafiq Joty", "Boyang Li"], "description": "GPT-3 (Generative Pre-trained Transformer 3) is a large-scale autoregressive language model developed by OpenAI, which has demonstrated impressive few-shot performance on a wide range of natural language processing (NLP) tasks. Hence, an intuitive application is to use it for data annotation. In this paper, we investigate whether GPT-3 can be used as a good data annotator for NLP tasks. Data annotation is the process of labeling data that could be used to train machine learning models. It is a crucial step in the development of NLP systems, as it allows the model to learn the relationship between the input data and the desired output. Given the impressive language capabilities of GPT-3, it is natural to wonder whether it can be used to effectively annotate data for NLP tasks. In this paper, we evaluate the performance of GPT-3 as a data annotator by comparing it with traditional data annotation methods and analyzing its output on a range of tasks. Through this analysis, we aim to provide insight into the potential of GPT-3 as a general-purpose data annotator in NLP.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 38, 0]}, "topic": "Natural Language Processing (NLP)", "agg_topic": "Natural Language Processing", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:2tRrZ1ZAMYUC", "title": "Scheherazade: Crowd-Powered Interactive Narrative Generation", "authors": ["Boyang Li", "Mark O Riedl"], "description": "Interactive narrative is a form of storytelling in which users affect a dramatic storyline through actions by assuming the role of characters in a virtual world. This extended abstract outlines the Scheherazade-IF system, which uses crowdsourcing and artificial intelligence to automatically construct text-based interactive narrative experiences.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 4, 7, 7, 6, 4, 3, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:-95Q15plzcUC", "title": "NormLime: A new feature importance metric for explaining deep neural networks", "authors": ["Isaac Ahern", "Adam Noack", "Luis Guzman-Nateras", "Dejing Dou", "Boyang Li", "Jun Huan"], "description": "The problem of explaining deep learning models, and model predictions generally, has attracted intensive interest recently. Many successful approaches forgo global approximations in order to provide more faithful local interpretations of the model's behavior. LIME develops multiple interpretable models, each approximating a large neural network on a small region of the data manifold and SP-LIME aggregates the local models to form a global interpretation. Extending this line of research, we propose a simple yet effective method, NormLIME for aggregating local models into global and class-specific interpretations. A human user study strongly favored class-specific interpretations created by NormLIME to other feature importance metrics. Numerical experiments confirm that NormLIME is effective at recognizing important features.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 9, 7, 6, 13, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:WHdLCjDvYFkC", "title": "Collaborative Storytelling between Robot and Child: A Feasibility Study", "authors": ["Ming Sun", "Iolanda Leite", "Jill Fain Lehman", "Boyang Li"], "description": "Joint storytelling is a common parent-child activity and brings multiple benefits such as improved language learning for children. Most existing storytelling robots offer rigid interaction with children and do not contribute to children's stories. In this paper, we envision a robot that collaborates with a child to create oral stories in a highly interactive manner. We performed a Wizard-of-Oz feasibility study, which involved 78 children between 4 and 10 years old, to compare two collaboration strategies: (1) inserting new story content and relating it to the existing story and (2) inserting content without relating it to the existing story. We hypothesize the first strategy can foster true collaboration and create rapport, whereas the second is a safe strategy when the robot cannot understand the story. We observed that, although the first strategy creates a heavier cognitive load, it was as enjoyable as the second. We also observed …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 1, 3, 11, 11, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:QyXJ3EUuO1IC", "title": "A multi-task neural approach for emotion attribution, classification, and summarization", "authors": ["Guoyun Tu", "Yanwei Fu", "Boyang Li", "Jiarui Gao", "Yu-Gang Jiang", "Xiangyang Xue"], "description": "Emotional content is a crucial ingredient in user-generated videos. However, the sparsity of emotional expressions in the videos poses an obstacle to visual emotion analysis. In this paper, we propose a new neural approach, Bi-stream Emotion Attribution-Classification Network (BEAC-Net), to solve three related emotion analysis tasks: emotion recognition, emotion attribution, and emotion-oriented summarization, in a single integrated framework. BEAC-Net has two major constituents, an attribution network and a classification network. The attribution network extracts the main emotional segment that classification should focus on in order to mitigate the sparsity issue. The classification network utilizes both the extracted segment and the original video in a bi-stream architecture. We contribute a new dataset for the emotion attribution task with human-annotated ground-truth labels for emotion segments. Experiments …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 7, 11, 7, 7, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:mWEH9CqjF64C", "title": "Noise-resistant Deep Metric Learning with Ranking-based Instance Selection", "authors": ["Chang Liu", "Han Yu", "Boyang Li", "Zhiqi Shen", "Zhanning Gao", "Peiran Ren", "Xuansong Xie", "Lizhen Cui", "Chunyan Miao"], "description": "The existence of noisy labels in real-world data negatively impacts the performance of deep learning models. Although much research effort has been devoted to improving robustness to noisy labels in classification tasks, the problem of noisy labels in deep metric learning (DML) remains open. In this paper, we propose a noise-resistant training technique for DML, which we name Probabilistic Ranking-based Instance Selection with Memory (PRISM). PRISM identifies noisy data in a minibatch using average similarity against image features extracted by several previous versions of the neural network. These features are stored in and retrieved from a memory bank. To alleviate the high computational cost brought by the memory bank, we introduce an acceleration method that replaces individual data points with the class centers. In extensive comparisons with 12 existing approaches under both synthetic and real-world label noise, PRISM demonstrates superior performance of up to 6.06% in Precision@ 1.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [3, 16, 12, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:2osOgNQ5qMEC", "title": "Evolutionary organizational search", "authors": ["Boyang Li", "Han Yu", "Zhiqi Shen", "Chunyan Miao"], "description": "In this paper, we proposed Evolutionary Organizational Search (EOS), an optimization method for the organizational control of multi-agent systems (MASs) based on genetic programming (GP). EOS adds to the existing armory a metaheuristic extension, which is capable of efficient search and less vulnerable to stalling at local optima than greedy methods due to its stochastic nature. EOS employs a flexible genotype which can be applied to a wide range of tree-shaped organizational forms. EOS also considers special constraints of MASs. A novel mutation operator, the redistribution operator, was proposed. Experiments optimizing an information retrieval system illustrated the adaptation of solutions generated by EOS to environmental changes.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 1, 3, 5, 6, 8, 0, 1, 1, 1, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&citation_for_view=QwL4z2UAAAAJ:wKETBy42zhYC", "title": "Predicting personality from book preferences with user-generated content labels", "authors": ["Ng Annalyn", "Maarten W Bos", "Leonid Sigal", "Boyang Li"], "description": "Psychological studies have shown that personality traits are associated with book preferences. However, past findings based on questionnaires are limited to conventional book genres and do not capture niche content (e.g., family drama) and reading behaviors (e.g., backburners). For a more comprehensive measure of book content, this study harnesses a massive archive of content labels, also known as `tags', created by users of a book review website, Goodreads.com. Combined with data on preferences and personality scores collected from Facebook users, the tag labels achieve high accuracy in personality prediction by psychological standards. Additionally, we group tags into broader genres to check their validity against past findings. Our results are robust across both tag-level and genre-level analyses and are consistent with existing literature. Moreover, user-generated tag labels reveal unexpected …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 3, 4, 6, 6, 7, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:kVjdVfd2voEC", "title": "Deep static and dynamic level analysis: A study on Infinite Mario", "authors": ["Matthew Guzdial", "Nathan Sturtevant", "Boyang Li"], "description": "Automatic analysis of game levels can provide as-sistance to game designers and procedural content generation. We introduce a static-dynamic scale to categorize level analysis strategies, which captures the extent that the analysis depends on player simulation. Due to its ability to automatically learn intermediate representations for the task, a convolutional neural network (CNN) provides a general tool for both types of analysis. In this paper, we explore the use of CNN to analyze 1,437 Infinite Mario levels. We further propose a deep reinforcement learning technique for dynamic analysis, which allows the simulated player to pay a penalty to reduce error in its control. We empirically demonstrate the effectiveness of our techniques and complementarity of dynamic and static analysis.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 8, 5, 4, 3, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:cK4Rrx0J3m0C", "title": "Semi-situated learning of verbal and nonverbal content for repeated human-robot interaction", "authors": ["Iolanda Leite", "André Pereira", "Allison Funkhouser", "Boyang Li", "Jill Fain Lehman"], "description": "Content authoring of verbal and nonverbal behavior is a limiting factor when developing agents for repeated social interactions with the same user. We present PIP, an agent that crowdsources its own multimodal language behavior using a method we call semi-situated learning. PIP renders segments of its goal graph into brief stories that describe future situations, sends the stories to crowd workers who author and edit a single line of character dialog and its manner of expression, integrates the results into its goal state representation, and then uses the authored lines at similar moments in conversation. We present an initial case study in which the language needed to host a trivia game interaction is learned pre-deployment and tested in an autonomous system with 200 users \"in the wild.\" The interaction data suggests that the method generates both meaningful content and variety of expression.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 8, 7, 3, 2, 3, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:YsMSGLbcyi4C", "title": "Robust and Authorable Multiplayer Storytelling Experiences", "authors": ["Mark Riedl", "Boyang Li", "Hua Ai", "Ashwin Ram"], "description": "Interactive narrative systems attempt to tell stories to players capable of changing the direction and/or outcome of the story. Despite the growing importance of multiplayer social experiences in games, little research has focused on multiplayer interactive narrative experiences. We performed a preliminary study to determine how human directors design and execute multiplayer interactive story experiences in online and real world environments. Based on our observations, we developed the Multiplayer Storytelling Engine that manages a story world at the individual and group levels. Our flexible story representation enables human authors to naturally model multiplayer narrative experiences. An intelligent execution algorithm detects when the author's story representation fails to account for player behaviors and automatically generates a branch to restore the story to the authors' original intent, thus balancing authorability against robust multiplayer execution.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 1, 0, 0, 4, 2, 3, 4, 0, 1, 1, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:d1gkVwhDpl0C", "title": "Memetic gradient search", "authors": ["Boyang Li", "Yew-Soon Ong", "Minh Nghia Le", "Chi Keong Goh"], "description": "This paper reviews the different gradient-based schemes and the sources of gradient, their availability, precision and computational complexity, and explores the benefits of using gradient information within a memetic framework in the context of continuous parameter optimization, which is labeled here as memetic gradient search. In particular, we considered a quasi-Newton method with analytical gradient and finite differencing, as well as simultaneous perturbation stochastic approximation, used as the local searches. Empirical study on the impact of using gradient information showed that memetic gradient search outperformed the traditional GA and analytical, precise gradient brings considerable benefit to gradient-based local search (LS) schemes. Though gradient-based searches can sometimes get trapped in local optima, memetic gradient searches were still able to converge faster than the conventional GA.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 1, 5, 2, 1, 2, 4, 3, 1, 0, 1, 0, 2, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:ubry08Y2EpUC", "title": "Multiplicative Representations for Unsupervised Semantic Role Induction", "authors": ["Yi Luan", "Yangfeng Ji", "Hannaneh Hajishirzi", "Boyang Li"], "description": "In unsupervised semantic role labeling, identifying the role of an argument is usually informed by its dependency relation with the predicate. In this work, we propose a neural model to learn argument embeddings from the context by explicitly incorporating dependency relations as multiplicative factors, which bias argument embeddings according to their dependency roles. Our model outperforms existing state-of-the-art embeddings in unsupervised semantic role induction on the CoNLL 2008 dataset and the SimLex999 word similarity task. Qualitative results demonstrate our model can effectively bias argument embeddings based on their dependency role.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 5, 5, 6, 1, 3, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:zYLM7Y9cAGgC", "title": "Automated Scenario Adaptation in Support of Intelligent Tutoring Systems", "authors": ["James Niehaus", "Boyang Li", "Mark O Riedl"], "description": "Learners may develop expertise by experiencing numerous different but relevant situations. Computer games and virtual simulations can facilitate these training opportunities, however, because of the relative difficulty in authoring new scenarios, the increasing need for new and different scenarios becomes a bottleneck in the learning process. Furthermore, a one-size-fits-all scenario may not address all of the abilities, needs, or goals of a particular learner. To address these issues we present a novel technique, Automated Scenario Adaptation, to automatically“rewrite” narrative scenario content to suit individual learners’ needs and abilities and to incorporate recent changes from real world learning needs. Scenario adaptation acts as problem generation for intelligent tutoring systems, producing greater learning opportunities that facilitate engagement and continued learner involvement.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 6, 4, 3, 3, 1, 3, 1, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:kJDgFkosVoMC", "title": "Plug-and-Play VQA: Zero-shot VQA by Conjoining Large Pretrained Models with Zero Training", "authors": ["Anthony Meng Huat Tiong", "Junnan Li", "Boyang Li", "Silvio Savarese", "Steven CH Hoi"], "description": "Visual question answering (VQA) is a hallmark of vision and language reasoning and a challenging task under the zero-shot setting. We propose Plug-and-Play VQA (PNP-VQA), a modular framework for zero-shot VQA. In contrast to most existing works, which require substantial adaptation of pretrained language models (PLMs) for the vision modality, PNP-VQA requires no additional training of the PLMs. Instead, we propose to use natural language and network interpretation as an intermediate representation that glues pretrained models together. We first generate question-guided informative image captions, and pass the captions to a PLM as context for question answering. Surpassing end-to-end trained baselines, PNP-VQA achieves state-of-the-art results on zero-shot VQAv2 and GQA. With 11B parameters, it outperforms the 80B-parameter Flamingo model by 8.5% on VQAv2. With 738M PLM parameters …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 23, 0]}, "topic": "Visual Question Answering (VQA)", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:hqOjcs7Dif8C", "title": "Automatically learning to tell stories about social situations from the crowd", "authors": ["Boyang Li", "Stephen Lee-Urban", "Darren Scott Appling", "Mark O Riedl"], "description": "Narrative intelligence is the use of narrative to make sense of the world and to communicate with other people. The generation of stories involving social and cultural situations (eating at a restaurant, going on a date, etc.) requires an extensive amount of experiential knowledge. While this knowledge can be encoded in the form of scripts, schemas, or frames, the manual authoring of these knowledge structures presents a significant bottleneck in the creation of systems demonstrating narrative intelligence. In this paper we describe a technique for automatically learning robust, script-like knowledge from crowdsourced narratives. Crowdsourcing, the use of anonymous human workers, provides an opportunity for rapidly acquiring a corpus of highly specialized narratives about sociocultural situations. We describe a three-stage approach to script acquisition and learning. First, we query human workers to write natural language narrative examples of a given situation. Second, we learn the set of possible events that can occur in a situation by finding semantic similarities between the narrative examples. Third, we learn the relevance of any event to the situation and extract a probable temporal ordering between events. We describe how these scripts, which we call plot graphs, can be utilized to generate believable stories about social situations.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [5, 2, 6, 2, 1, 0, 2, 1, 2, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:AYInfyleIOsC", "title": "From Images to Textual Prompts: Zero-shot Visual Question Answering with Frozen Large Language Models", "authors": ["Jiaxian Guo", "Junnan Li", "Dongxu Li", "Anthony Meng Huat Tiong", "Boyang Li", "Dacheng Tao", "Steven Hoi"], "description": "Large language models (LLMs) have demonstrated excellent zero-shot generalization to new language tasks. However, effective utilization of LLMs for zero-shot visual question-answering (VQA) remains challenging, primarily due to the modality disconnection and task disconnection between LLM and VQA task. End-to-end training on vision and language data may bridge the disconnections, but is inflexible and computationally expensive. To address this issue, we propose Img2Prompt, a plug-and-play module that provides the prompts that can bridge the aforementioned modality and task disconnections, so that LLMs can perform zero-shot VQA tasks without end-to-end training. In order to provide such prompts, we further employ LLM-agnostic models to provide prompts that can describe image content and self-constructed question-answer pairs, which can effectively guide LLM to perform zero-shot VQA tasks. Img2Prompt offers the following benefits: 1) It can flexibly work with various LLMs to perform VQA. 2) Without the needing of end-to-end training, it significantly reduces the cost of deploying LLM for zero-shot VQA tasks. 3) It achieves comparable or better performance than methods relying on end-to-end training. For example, we outperform Flamingo by 5.6% on VQAv2. On the challenging A-OKVQA dataset, our method even outperforms few-shot methods by as much as 20%.", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [22, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:LXmCCkuhhTsC", "title": "Proof of Learning (PoLe): empowering neural network training with consensus building on blockchains", "authors": ["Yuan Liu", "Yixiao Lan", "Boyang Li", "Chunyan Miao", "Zhihong Tian"], "description": "The advent of neural network (NN) based deep learning, especially the recent development of the automatic design of networks, has brought unprecedented performance gains at heavy computational cost. On the other hand, in order to generate a new consensus block, Proof of Work (PoW) based blockchain systems routinely perform a huge amount of computation that does not achieve practical purposes but to solving a difficult cryptographic hash puzzle problem.In this study, we propose a new consensus mechanism, Proof of Learning (PoLe), which directs the computation spent for block consensus toward optimization of neural networks. In our design, the training and testing data are released to the entire blockchain network and the consensus nodes train NN models on the data, which serves as the proof of learning. As a core component of PoLe, we design a secure mapping layer (SML) to prevent consensus …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 7, 14, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:oi2SiIJ9l4AC", "title": "Proof of Learning (PoLe): Empowering machine learning with consensus building on blockchains", "authors": ["Yixiao Lan", "Yuan Liu", "Boyang Li", "Chunyan Miao"], "description": "The consensus algorithm is the core component of a blockchain system, which determines the efficiency, security, and scalability of the blockchain network. The representative consensus algorithm is the proof of work (PoW) proposed in Bitcoin, where the consensus process consumes large amount of compute in solving meaningless Hash puzzel. Meanwhile, the deep learning (DL) has brought unprecedented performance gains at heavy computate cost. In this demo, we channels the otherwise wasted computational power to the practical purpose of training neural network models, through the proposed proof of learning (PoL) consensus algorithm. In PoLe, the training/testing data are released to the entire blockchain network (BCN) and the consensus nodes train NN models on the data, which serves as the proof of learning. When the consensus on the BCN considers a NN model to be valid, a new block is appended to the blockchain. Through our system, we investigate the potential of enpowering machine learning with consensus building on blockchains.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [3, 10, 9, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:qe6vwMD2xtsC", "title": "Efficient self-supervised vision pretraining with local masked reconstruction", "authors": ["Jun Chen", "Ming Hu", "Boyang Li", "Mohamed Elhoseiny"], "description": "Self-supervised learning for computer vision has achieved tremendous progress and improved many downstream vision tasks such as image classification, semantic segmentation, and object detection. Among these, generative self-supervised vision learning approaches such as MAE and BEiT show promising performance. However, their global masked reconstruction mechanism is computationally demanding. To address this issue, we propose local masked reconstruction (LoMaR), a simple yet effective approach that performs masked reconstruction within a small window of 77 patches on a simple Transformer encoder, improving the trade-off between efficiency and accuracy compared to global masked reconstruction over the entire image. Extensive experiments show that LoMaR reaches 84.1% top-1 accuracy on ImageNet-1K classification, outperforming MAE by 0.5%. After finetuning the pretrained LoMaR on 384384 images, it can reach 85.4% top-1 accuracy, surpassing MAE by 0.6%. On MS COCO, LoMaR outperforms MAE by 0.5  on object detection and 0.5  on instance segmentation. LoMaR is especially more computation-efficient on pretraining high-resolution images, e.g., it is 3.1 faster than MAE with 0.2% higher classification accuracy on pretraining 448448 images. This local masked reconstruction learning mechanism can be easily integrated into any other generative self-supervised learning approach. Our code will be publicly available.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [4, 17, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:5bg8sr1QxYwC", "title": "HyDRA: Hypergradient Data Relevance Analysis for Interpreting Deep Neural Networks", "authors": ["Yuanyuan Chen", "Boyang Li", "Han Yu", "Pengcheng Wu", "Chunyan Miao"], "description": "The behaviors of deep neural networks (DNNs) are notoriously resistant to human interpretations. In this paper, we propose Hypergradient Data Relevance Analysis, or HyDRA, which interprets the predictions made by DNNs as effects of their training data. Existing approaches generally estimate data contributions around the final model parameters and ignore how the training data shape the optimization trajectory. By unrolling the hypergradient of test loss wrt the weights of training data, HyDRA assesses the contribution of training data toward test data points throughout the training trajectory. In order to accelerate computation, we remove the Hessian from the calculation and prove that, under moderate conditions, the approximation error is bounded. Corroborating this theoretical claim, empirical results indicate the error is indeed small. In addition, we quantitatively demonstrate that HyDRA outperforms influence functions in accurately estimating data contribution and detecting noisy data labels. The source code is available at https://github. com/cyyever/aaai_hydra.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [5, 10, 6, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:-mN3Mh-tlDkC", "title": "A Neural Multi-sequence Alignment TeCHnique (NeuMATCH)", "authors": ["Pelin Dogan", "Boyang Li", "Leonid Sigal", "Markus Gross"], "description": "The alignment of heterogeneous sequential data (video to text) is an important and challenging problem. Standard techniques for this task, including Dynamic Time Warping (DTW) and Conditional Random Fields (CRFs), suffer from inherent drawbacks. Mainly, the Markov assumption implies that, given the immediate past, future alignment decisions are independent of further history. The separation between similarity computation and alignment decision also prevents end-to-end training. In this paper, we propose an end-to-end neural architecture where alignment actions are implemented as moving data between stacks of Long Short-term Memory (LSTM) blocks. This flexible architecture supports a large variety of alignment tasks, including one-to-one, one-to-many, skipping unmatched elements, and (with extensions) non-monotonic alignment. Extensive experiments on semi-synthetic and real datasets show that our algorithm outperforms state-of-the-art baselines.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 5, 4, 5, 2, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:LgRImbQfgY4C", "title": "Storytelling with adjustable narrator styles and sentiments", "authors": ["Boyang Li", "Mohini Thakkar", "Yijie Wang", "Mark O Riedl"], "description": "Most storytelling systems to date rely on manually coded knowledge, the cost of which usually restricts such systems to operate within a few domains where knowledge has been engineered. Open Story Generation systems are capable of learning knowledge necessary for telling stories in a given domain. In this paper, we describe a technique that generates and communicates stories in language with diverse styles and sentiments based on automatically learned narrative knowledge. Diversity in storytelling style may facilitate different communicative goals and focalization in narratives. Our approach learns from large-scale data sets such as the Google N-Gram Corpus and Project Gutenberg books in addition to crowdsourced stories to instill storytelling agents with linguistic and social behavioral knowledge. A user study shows our algorithm strongly agrees with human judgment on the interestingness …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 1, 6, 5, 2, 1, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:tH6gc1N1XXoC", "title": "Data-Driven Alibi Story Telling for Social Believability", "authors": ["Boyang Li", "Mohini Thakkar", "Yijie Wang", "Mark O Riedl"], "description": "As computer games adopt larger, more life-like virtual worlds, socially believable characters become progressively more important. Socially believable non-player characters (NPCs) must be able to act in social situations and communicate with human players. In this paper, we address one aspect of social believability: the construction and telling of alibi stories, or an artificial background that explains what a character has been doing while not in the presence of the human player. We describe a technique for generating alibi stories and communicating the alibi stories via natural language. Our approach uses machine learning to overcome knowledge engineering bottlenecks necessary to instill intelligent characters with social behavioral knowledge. Alibi stories are subsequently generated from learned social behavioral knowledge. By leveraging the Google N-Gram Corpus and Project Gutenberg books, natural language is generated with a discourse planner and text generation that incorporate different expressivity and sentiment, which can be employed to create NPCs with a variety of personal traits.", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 4, 4, 3, 4, 1, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:u-x6o8ySG0sC", "title": "The national weather sensor grid", "authors": ["Hock Beng Lim", "Keck Voon Ling", "Wenqiang Wang", "Yuxia Yao", "Mudasser Iqbal", "Boyang Li", "Xiaonan Yin", "Tarun Sharma"], "description": "With the rapid advances in technologies such as MEMS sensors, low-power embedded processing and wireless networking, sensor networks are becoming more powerful in terms of data acquisition and processing capabilities. Sensor networks can now be deployed in the physical world for various important applications such as environmental monitoring, weather monitoring and modeling, military surveillance, healthcare monitoring, tracking of goods and manufacturing processes, smart homes and offices, etc.", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 2, 1, 1, 0, 0, 1, 2, 2, 1, 2, 2, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:sJsF-0ZLhtgC", "title": "Learning Knowledge to Support Domain-independent Narrative Intelligence", "authors": ["Boyang Li"], "description": "Our dreams and stories may contain implicit aspects of our lives even without our awareness.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 3, 3, 3, 4, 1, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:7wO8s98CvbsC", "title": "Predicting the Quality of Short Narratives from Social Media", "authors": ["Tong Wang", "Ping Chen", "Boyang Li"], "description": "An important and difficult challenge in building computational models for narratives is the automatic evaluation of narrative quality. Quality evaluation connects narrative understanding and generation as generation systems need to evaluate their own products. To circumvent difficulties in acquiring annotations, we employ upvotes in social media as an approximate measure for story quality. We collected 54,484 answers from a crowd-powered question-and-answer website, Quora, and then used active learning to build a classifier that labeled 28,320 answers as stories. To predict the number of upvotes without the use of social network features, we create neural networks that model textual regions and the interdependence among regions, which serve as strong benchmarks for future research. To our best knowledge, this is the first large-scale study for automatic evaluation of narrative quality.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 2, 3, 2, 5, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:IjCSPb-OGe4C", "title": "Distributed Creative Cognition In Digital Filmmaking", "authors": ["Nicholas Davis", "Boyang Li", "Brian O’Neill", "Mark Riedl", "Michael Nitsche"], "description": "This paper reports on an empirical study that uses a Grounded Theory approach to investigate the creative practices of Machinima filmmakers. Machinima is a new digital film production technique that uses the 3D graphics and real time rendering capability of video game engines to create films. In contrast to practices used in traditional film production, we've found that Machinima filmmakers explore and evaluate ideas in real time. These filmmakers generate vague and underspecified mental images, which are then explored and refined using the real time rendering capabilities of game engines. The game engine assists the filmmaker to fill in indeterminate details, which allows creative exploration of scenes through playfully experimenting with parameters such as camera angle and position, lighting, and character position. Creative exploration distributes the cognitive task of evaluation between the human user and …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 6, 1, 3, 1, 1, 0, 1, 2, 1, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:SnGPuo6Feq8C", "title": "Latent-Optimized Adversarial Neural Transfer for Sarcasm Detection", "authors": ["Xu Guo", "Boyang Li", "Han Yu", "Chunyan Miao"], "description": "The existence of multiple datasets for sarcasm detection prompts us to apply transfer learning to exploit their commonality. The adversarial neural transfer (ANT) framework utilizes multiple loss terms that encourage the source-domain and the target-domain feature distributions to be similar while optimizing for domain-specific performance. However, these objectives may be in conflict, which can lead to optimization difficulties and sometimes diminished transfer. We propose a generalized latent optimization strategy that allows different losses to accommodate each other and improves training dynamics. The proposed method outperforms transfer learning and meta-learning baselines. In particular, we achieve 10.02% absolute performance gain over the previous state of the art on the iSarcasm dataset.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 10, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:MXK_kJrjxJIC", "title": "Toward Autonomous Crowd-Powered Creation of Interactive Narratives", "authors": ["Boyang Li", "Stephen Lee-Urban", "Mark O Riedl"], "description": "Interactive narrative is a form of storytelling that adapts to actions performed by users who assume the roles of story characters. To date, interactive narratives are built by hand. In this paper, we introduce Scheherazade, an intelligent system that automatically creates an interactive narrative about any topic from crowdsourced narratives. Our system leverages the experience and creativity of humans by crowdsourcing a corpus of linear narrative examples. It then constructs an executable plot graph, which is a knowledge structure that defines the legal space of an interactive narrative, by learning the plot events, execution precedence, and event separations. We demonstrate the system can successfully construct an interactive narrative based on noisy human input.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 5, 0, 2, 1, 0, 3, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:Se3iqnhoufwC", "title": "Learning Sociocultural Knowledge via Crowdsourced Examples", "authors": ["Boyang Li", "Darren Scott Appling", "Stephen Lee-Urban", "Mark O Riedl"], "description": "Computational systems can use sociocultural knowledge to understand human behavior and interact with humans in more natural ways. However, such systems are limited by their reliance on hand-authored sociocultural knowledge and models. We introduce an approach to automatically learn robust, script-like sociocultural knowledge from crowdsourced narratives. Crowdsourcing, the use of anonymous human workers, provides an opportunity for rapidly acquiring a corpus of examples of situations that are highly specialized for our purpose yet sufficiently varied, from which we can learn a versatile script. We describe a semiautomated process by which we query human workers to write natural language narrative examples of a given situation and learn the set of events that can occur and the typical even ordering.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 4, 3, 2, 2, 0, 0, 0, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:v1_lew4L6wgC", "title": "PLOTSHOT: Generating Discourse-constrained Stories around Photos", "authors": ["Rogelio E Cardona-Rivera", "Boyang Li"], "description": "Story generators typically adopt a pipelined model of generation wherein fabula structure is decided independently and prior to discourse structure. In this paper, we propose a novel story generator, PlotShot, capable of reasoning over discourse materials during fabula generation such that these materials meaningfully constrain the development of a causally and intentionally coherent story. PlotShot incorporates user-supplied photographs as optional story states through an oversubscription planning paradigm. Further, to leverage existing work on planning-based models of generation, we present a technique to compile the photo story planning problem to classical narrative planning. Our system attempts to maximize quality of an illustrated story by analyzing the affinity between a photo and the action it is meant to depict. An evaluation of generated artifacts shows advantage over heuristic baseline techniques.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 7, 2, 1, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:TlpoogIpr_IC", "title": "Exploring Long Tail Visual Relationship Recognition with Large Vocabulary", "authors": ["Sherif Abdelkarim", "Aniket Agarwal", "Panos Achlioptas", "Jun Chen", "Jiaji Huang", "Boyang Li", "Kenneth Church", "Mohamed Elhoseiny"], "description": "Several approaches have been proposed in recent literature to alleviate the long-tail problem, mainly in object classification tasks. In this paper, we make the first large-scale study concerning the task of Long-Tail Visual Relationship Recognition (LTVRR). LTVRR aims at improving the learning of structured visual relationships that come from the long-tail (eg,\" rabbit grazing on grass\"). In this setup, the subject, relation, and object classes each follow a long-tail distribution. To begin our study and make a future benchmark for the community, we introduce two LTVRR-related benchmarks, dubbed VG8K-LT and GQA-LT, built upon the widely used Visual Genome and GQA datasets. We use these benchmarks to study the performance of several state-of-the-art long-tail models on the LTVRR setup. Lastly, we propose a visiolinguistic hubless (VilHub) loss and a Mixup augmentation technique adapted to LTVRR setup, dubbed as RelMix. Both VilHub and RelMix can be easily integrated on top of existing models and despite being simple, our results show that they can remarkably improve the performance, especially on tail classes. Benchmarks, code, and models have been made available at: https://github. com/Vision-CAIR/LTVRR.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 7, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:PyEswDtIyv0C", "title": "Dialog knowledge acquisition system and method", "authors": null, "description": "A dialog knowledge acquisition system includes a hardware processor, a memory, and hardware processor controlled input and output modules. The memory stores a dialog manager configured to instantiate a persistent interactive personality (PIP), and a dialog graph having linked dialog state nodes. The dialog manager receives dialog initiation data, identifies a first state node on the dialog graph corresponding to the dialog initiation data, determines a dialog interaction by the PIP based on the dialog initiation data and the first state node, and renders the dialog interaction. The dialog manager also receives feedback data corresponding to the dialog interaction, identifies a second state node based on the dialog initiation data, the dialog interaction, and the feedback data, and utilizes the dialog initiation data, the first state node, the dialog interaction, the feedback data, and the second state node to train the dialog …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 0, 1, 11]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:jU7OWUQzBzMC", "title": "Annotating High-Level Structures of Short Stories and Personal Anecdotes", "authors": ["Boyang Li", "Beth Cardier", "Tong Wang", "Florian Metze"], "description": "Stories are a vital form of communication in human culture; they are employed daily to persuade, to elicit sympathy, or to convey a message. Computational understanding of human narratives, especially high-level narrative structures, remain limited to date. Multiple literary theories for narrative structures exist, but operationalization of the theories has remained a challenge. We developed an annotation scheme by consolidating and extending existing narratological theories, including Labov and Waletsky's (1967) functional categorization scheme and Freytag's (1863) pyramid of dramatic tension, and present 360 annotated short stories collected from online sources. In the future, this research will support an approach that enables systems to intelligently sustain complex communications with humans.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 0, 3, 4, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:buQ7SEKw-1sC", "title": "An evolutionary framework for multi-agent organizations", "authors": ["Boyang Li", "Han Yu", "Zhiqi Shen", "Lizhen Cui", "Victor R Lesser"], "description": "The organizational design of a multi-agent system (MAS) is important for its efficiency, adaptability and robustness. However, finding suitable organizational structures for different MASs is a challenging problem. In this paper, we propose a Framework of Evolutionary Optimization for Agent Organizations (FEVOR) based on Genetic Programming for optimizing tree-structured MASs. FEVOR employs a flexible representation of organizations and may be applied to a wide range of organizational forms such as pure hierarchies, holarchies, and federations. Compared to existing work, FEVOR is capable of efficient quantitative search and less vulnerable to stalling at local optima due to its non-greedy nature. Extensive experiments for optimizing an information retrieval system have been conducted to demonstrate the advantages of FEVOR in generating suitable MAS organizations for adaptive environments.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 1, 3, 2, 1, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:F2UWTTQJPOcC", "title": "Long-tail visual relationship recognition with a visiolinguistic hubless loss", "authors": ["Sherif Abdelkarim", "Panos Achlioptas", "Jiaji Huang", "Boyang Li", "Kenneth Church", "Mohamed Elhoseiny"], "description": "Scaling up the vocabulary and complexity of current visual understanding systems is necessary in order to bridge the gap between human and machine visual intelligence. However, a crucial impediment to this end lies in the difficulty of generalizing to data distributions that come from real-world scenarios. Typically such distributions follow Zipf's law which states that only a small portion of the collected object classes will have abundant examples (head); while most classes will contain just a few (tail). In this paper, we propose to study a novel task concerning the generalization of visual relationships that are on the distribution's tail, i.e. we investigate how to help AI systems to better recognize rare relationships like <S:dog, P:riding, O:horse>, where the subject S, predicate P, and/or the object O come from the tail of the corresponding distributions. To achieve this goal, we first introduce two large-scale visual-relationship detection benchmarks built upon the widely used Visual Genome and GQA datasets. We also propose an intuitive evaluation protocol that gives credit to classifiers who prefer concepts that are semantically close to the ground truth class according to wordNet- or word2vec-induced metrics. Finally, we introduce a visiolinguistic version of a Hubless loss which we show experimentally that it consistently encourages classifiers to be more predictive of the tail classes while still being accurate on head classes. Our code and models are available on http://bit.ly/LTVRR.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 1, 2, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:QIV2ME_5wuYC", "title": "Crowdsourcing Interactive Fiction Games", "authors": ["Boyang Li", "Stephen Lee-Urban", "Mark O Riedl"], "description": "Procedural generation of games has become an active research field. We present a system that automatically generates an interactive fiction (IF) by learning from crowdsourced corpora of example stories. We ask crowd workers from Amazon Mechanical Turk to write short stories about a given situation with simple language, from which a plot graph is learned, containing plot events, temporal precedence and mutual exclusion relations between the events. The plot graph describes an IF where players and non-player characters choose from executable events as determined by the plot graph. We demonstrate an IF learned from the domain of bank robbery.", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 1, 1, 2, 2, 2, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:qjMakFHDy7sC", "title": "Teachable agents in virtual learning environments: A case study", "authors": ["Han Yu", "Chunyan Miao", "Xuehong Tao", "Zhiqi Shen", "Yundong Cai", "Boyang Li", "Yuan Miao"], "description": "As intelligent agent and virtual world technologies advanced to new heights in the current decade, researchers from diverse fields have started to look into possible ways of applying these emerging technologies to improve e-learning systems. Nevertheless, most attempts focused on using pedagogical agents to achieve traditional e-learning goals which place heavy emphasis on learning outcomes. In this paper, we leverage on our previous research results–the Multi-Agent Development Environment (MADE)-which drastically reduced to the technical hurdle of incorporating pedagogical agents into VLEs. We present a VLE augmented with teachable agents designed based on the experiential learning model (ELM) to facilitate the learning of high school science topics and demonstrate the efficacy of MADE in designing complex learning activities, designing teachable agents that complement immersive experiential …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 2, 0, 4, 4, 0, 0, 0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:Tyk-4Ss8FVUC", "title": "A Phone That Cures Your Flu: Generating Imaginary Gadgets in Fictions with Planning and Analogies", "authors": ["Boyang Li", "Mark O Riedl"], "description": "Most computational story generation systems lack the ability to generate new types of imaginary objects that play functional roles in stories, such as lightsabers in Star Wars. We present an algorithm that generates such imaginary objects, which we call gadgets, in order to extend the ontological expressivity of existing, planning-based story generation systems. The behavior of a gadget is represented as a plan including typical events that happen when the gadget is used. Our algorithm creates gadgets by extrapolating and merging one or more commonly known objects in order to achieve a narrative goal provided by an existing story generator. We extend partial-order planning to establish open conditions based on analogies between concepts related respectively to common objects and the gadget. We show the algorithm is capable of generating gadgets created by human.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 1, 2, 0, 2, 0, 2, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:_OXeSy2IsFwC", "title": "Emotional agent in serious game (DINO)", "authors": ["HL Zhang", "Zhiqi Shen", "Xuehong Tao", "Chunyan Miao", "Boyang Li", "Ailiya", "Yundong Cai"], "description": "In this paper, we introduce an novel emotional agent system in 3D virtual world based on OCC (Ortony, Clore and Collins) theory, FCM (Fuzzy Cognitive Map) and GoalNet. The agent system is designed based on Goal Net model. Emotional modeling and decision making are based on OCC and FCM inference. Emotions modeled by the OCC model are incorporated into FCM inference. It has been shown emotion has a great impact in decision making. The proposed agent system has been applied to design human-like dinosaur agents in the research project “Immersion and Embodied Learning: Traces of Dinosaurs in Earth System Science” supported by National Research Foundation (NRF) Singapore. In this project, we have developed an agent mediated immersive Interactive Digital Media that appropriately recreates and replays the traces of Earth’s history using intelligent agent technology and 3D multi-user environment. The virtual world and emotional dinosaur agents are shown in the demo. The experiments conducted by students in secondary schools in Singapore have shown the emotional agents enable deep learning of earth science.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 3, 1, 1, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:g5Ck-dwhA_QC", "title": "Semi-supervised federated heterogeneous transfer learning", "authors": ["Siwei Feng", "Boyang Li", "Han Yu", "Yang Liu", "Qiang Yang"], "description": "Federated learning (FL) is a privacy-preserving paradigm that collaboratively train machine learning models with distributed data stored in different silos without exposing sensitive information. Different from most existing FL approaches requiring data from different parties share either the same feature space or sample ID space, federated transfer learning (FTL), which is a recently proposed FL concept, is designed for situations where data from different parties differ not only in samples but also in feature space. However, like most traditional FL approaches, FTL methods also suffer from issues caused by insufficiency of overlapping data. In this paper, we propose a novel FTL framework referred to as Semi-Supervised Federated Heterogeneous Transfer Learning (SFHTL) to leverage on the unlabeled non-overlapping samples to reduce model overfitting as a result of insufficient overlapping training samples in FL …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [5, 5, 0]}, "topic": "Federated Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:Y0pCki6q_DkC", "title": "Creating customized game experiences by leveraging human creative effort: A planning approach", "authors": ["Boyang Li", "Mark O Riedl"], "description": "The task of entertaining people has, until very recently, been the exclusive domain of humans. However, recent advances in Artificial Intelligence (AI) suggest that intelligent systems may be used to create dynamic and engaging real-time entertainment experiences. In this paper we consider a novel technique called Experience Adaptation. Experience Adaptation is an offline process that leverages human creative ability by taking human-authored specifications of desired user experiences and autonomously “re-writing” them based on unique requirements of individual users. In this chapter, we illustrate Experience Adaptation in the context of computer-based role-playing games in which player experience is highly dependent on an unfolding plotline. Our approach uses a plan refinement technique based on partial-order planning to (a) optimize the global structure of the plotline according to input from a …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 5, 1, 2, 0, 0, 0, 0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:wvYxNZNCP7wC", "title": "Initialization Matters: Regularizing Manifold-informed Initialization for Neural Recommendation Systems", "authors": ["Yinan Zhang", "Boyang Li", "Yong Liu", "Hao Wang", "Chunyan Miao"], "description": "Proper initialization is crucial to the optimization and the generalization of neural networks. However, most existing neural recommendation systems initialize the user and item embeddings randomly. In this work, we propose a new initialization scheme for user and item embeddings called Laplacian Eigenmaps with Popularity-based Regularization for Isolated Data (LEPORID). LEPORID endows the embeddings with information regarding multi-scale neighborhood structures on the data manifold and performs adaptive regularization to compensate for high embedding variance on the tail of the data distribution. Exploiting matrix sparsity, LEPORID embeddings can be computed efficiently. We evaluate LEPORID in a wide range of neural recommendation models. In contrast to the recent surprising finding that the simple K-nearest-neighbor (KNN) method often outperforms neural recommendation systems, we show …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:-7ulzOJl1JYC", "title": "Understanding Actors and Evaluating Personae with Gaussian Embeddings", "authors": ["Hannah Kim", "Denys Katerenchuk", "Daniel Billet", "Jun Huan", "Haesun Park", "Boyang Li"], "description": "Understanding narrative content has become an increasingly popular topic. Nonetheless, research on identifying common types of narrative characters, or personae, is impeded by the lack of automatic and broad-coverage evaluation methods. We argue that computationally modeling actors provides benefits, including novel evaluation mechanisms for personae. Specifically, we propose two actor-modeling tasks, cast prediction and versatility ranking, which can capture complementary aspects of the relation between actors and the characters they portray. For an actor model, we present a technique for embedding actors, movies, character roles, genres, and descriptive keywords as Gaussian distributions and translation vectors, where the Gaussian variance corresponds to actors’ versatility. Empirical results indicate that (1) the technique considerably outperforms TransE (Bordes et al. 2013) and ablation baselines and (2) automatically identified persona topics (Bamman, O’Connor, and Smith 2013) yield statistically significant improvements in both tasks, whereas simplistic persona descriptors including age and gender perform inconsistently, validating prior research.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 3, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:owLR8QvbtFgC", "title": "Learning and Reusing Dialog for Repeated Interactions with a Situated Social Agent", "authors": ["James Kennedy", "Iolanda Leite", "André Pereira", "Ming Sun", "Boyang Li", "Rishub Jain", "Ricson Cheng", "Eli Pincus", "Elizabeth J Carter", "Jill Fain Lehman"], "description": "Content authoring for conversations is a limiting factor in creating verbal interactions with intelligent virtual agents. Building on techniques utilizing semi-situated learning in an incremental crowdworking pipeline, this paper introduces an embodied agent that self-authors its own dialog for social chat. In particular, the autonomous use of crowdworkers is supplemented with a generalization method that borrows and assesses the validity of dialog across conversational states. We argue that the approach offers a community-focused tailoring of dialog responses that is not available in approaches that rely solely on statistical methods across big data. We demonstrate the advantages that this can bring to interactions through data collected from 486 conversations between a situated social agent and 22 users during a 3 week long evaluation period.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 0, 0, 2, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:CB2v5VPnA5kC", "title": "Scheduling Live Interactive Narratives with Mixed-Integer Linear Programming", "authors": ["Sasha Azad", "Jingyang Xu", "Haining Yu", "Boyang Li"], "description": "A live interactive narrative (LIN) is an experience where multiple players take on fictional roles and interact with real-world objects and actors to participate in a pre-authored narrative. Temporal properties of LINs are important to its viability and aesthetic quality and hence deserve special design consideration. In this paper, we tackle the largely overlooked problem of scheduling a multiplayer interactive narrative and propose the Live Interactive Narrative Scheduling Problem (LINSP), which handles reasoning under temporal uncertainty, resource scheduling, and non-linear plot choices. We present a mixed-integer linear programming formulation of the problem and empirically evaluates its scalability over large narrative instances.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 3, 0, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:X9ykpCP0fEIC", "title": "Improving the Sample Efficiency of Prompt Tuning with Domain Adaptation", "authors": ["Xu Guo", "Boyang Li", "Han Yu"], "description": "Prompt tuning, or the conditioning of a frozen pretrained language model (PLM) with soft prompts learned from data, has demonstrated impressive performance on a wide range of NLP tasks. However, prompt tuning requires a large training dataset to be effective and is outperformed by finetuning the entire PLM in data-scarce regimes. Previous work \\citep{gu-etal-2022-ppt,vu-etal-2022-spot} proposed to transfer soft prompts pretrained on the source domain to the target domain. In this paper, we explore domain adaptation for prompt tuning, a problem setting where unlabeled data from the target domain are available during pretraining. We propose bOosting Prompt TunIng with doMain Adaptation (OPTIMA), which regularizes the decision boundary to be smooth around regions where source and target data distributions are similar. Extensive experiments demonstrate that OPTIMA significantly enhances the transferability and sample-efficiency of prompt tuning compared to strong baselines. Moreover, in few-shot settings, OPTIMA exceeds full-model tuning by a large margin.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [2, 4, 0]}, "topic": "Natural Language Processing(NLP)", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:FiDNX6EVdGUC", "title": "Alignment of video and textual sequences for metadata analysis", "authors": null, "description": "Systems, methods and computer program products related to aligning heterogeneous sequential data. A first sequential data stream and a second sequential data stream are received. An action related to aligning the first sequential data stream and the second sequential data stream is determined using an alignment neural network. The alignment neural network includes a fully connected layer that receives as input: data from the first sequential data stream, data from the second sequential data stream, and data relating to a previously determined action by the alignment neural network related to aligning the first sequential data stream and the second sequential data stream.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 1, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:W7OEmFMy1HYC", "title": "Creative Gadget Design in Fictions: Generalized Planning in Analogical Spaces", "authors": ["Boyang Li", "Mark O Riedl"], "description": "Science-fiction and fantasy stories often contain objects never envisioned previously. Inventing gadgets like lightsabers or mythical creatures like griffins is a creative task. Traditional computational storytelling systems are limited in their expressivity because they cannot create new types of objects or gadgets. The Japanese manga series Doraemon exemplifies the role of new and creative gadgets in creating fun and successful stories. We surveyed five volumes of Doraemon and identified 9 cognitive strategies of gadget creation, unified in a 5-step process. We present an algorithm to create new types of gadgets in the context of story generation. The algorithm is a combination of partial-order planning and analogical reasoning. Although Doraemon is our motivating example, we can also generate gadgets commonly seen in other science fictions and fairy tales.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 0, 2, 1, 0, 1, 0, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:KlAtU1dfN6UC", "title": "Planning for Individualized Experiences with Quest-Centric Game Adaptation", "authors": ["Boyang Li", "Mark O Riedl"], "description": "Planning has been extensively used to build competent opponents in games for human players. In this paper, we focus not on winning strategies but on creating an enjoyable overall gaming experience by adapting human-authored game narratives and customizing them to the players’ motivation, tastes and needs. We discuss the benefits of modeling game narratives as plans and analyze causal structures to build novel computational models of narrative coherence. A planning approach to the narrative adaptation problem is presented. The planner takes a complete storyline comprised of several quests and iteratively searches for modifications, deleting and inserting quests and events, until it meets the user’s preferences. A user study strongly suggested the proposed notion of narrative coherence has positive influences on story aesthetics.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:sA9dB-pw3HoC", "title": "Federated learning for personalized humor recognition", "authors": ["Xu Guo", "Han Yu", "Boyang Li", "Hao Wang", "Pengwei Xing", "Siwei Feng", "Zaiqing Nie", "Chunyan Miao"], "description": "Computational understanding of humor is an important topic under creative language understanding and modeling. It can play a key role in complex human-AI interactions. The challenge here is that human perception of humorous content is highly subjective. The same joke may receive different funniness ratings from different readers. This makes it highly challenging for humor recognition models to achieve personalization in practical scenarios. Existing approaches are generally designed based on the assumption that users have a consensus on whether a given text is humorous or not. Thus, they cannot handle diverse humor preferences well. In this article, we propose the FedHumor approach for the recognition of humorous content in a personalized manner through Federated Learning (FL). Extending a pre-trained language model, FedHumor guides the fine-tuning process by considering diverse distributions …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [3, 3, 0]}, "topic": "Natural Language Processing", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:silx2ntsSuwC", "title": "Synopses of movie narratives: a video-language dataset for story understanding", "authors": ["Yidan Sun", "Qin Chao", "Yangfeng Ji", "Boyang Li"], "description": "Despite recent advances of AI, story understanding remains an open and under-investigated problem. We collect, preprocess, and publicly release a video-language story dataset, Synopses of Movie Narratives (SyMoN), containing 5,193 video summaries of popular movies and TV series with a total length of 869 hours. SyMoN captures naturalistic storytelling videos made by human creators and intended for a human audience. As a prototypical and naturalistic story dataset, SyMoN features high coverage of multimodal story events and abundant mental-state descriptions. Its use of storytelling techniques cause cross-domain semantic gaps that provide appropriate challenges to existing models. We establish benchmarks on video-text retrieval and zero-shot alignment on movie summary videos, which showcase the importance of in-domain data and long-term memory in story understanding. With SyMoN, we hope to lay the groundwork for progress in multimodal story understanding.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [2, 2, 0]}, "topic": "Natural Language Processing", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:1lhNe0rCu4AC", "title": "Humor: A Dynamic and Dual-Process Theory with Computational Considerations", "authors": ["Boyang Li"], "description": "The cognitive mechanism of humor has been studied for centuries, with multiple seemingly incompatible theories proposed. However, none of existing theories is capable of explaining all empirical evidence. Recent research suggests emotional appraisals are tightly coupled and closely interact with other types of cognitive processes to create complex emotions and affects. This entangled nature contributes to the difficulty of humor research. In this paper, I attempt to provide a single, unified framework of humor, grounded in recent theoretical developments on emotion and dualprocess cognition. I propose that humor comprehension consists of a quick succession of four major stages: surprise, reflection, dismissal, and compensation. The theory provides a modern update on existing theories of humor and is capable of explaining several phenomena that cannot be easily explained by existing theories. Finally, I outline a computational system that recognizes humor in the form of puns.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 0, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:L1USKYWJimsC", "title": "Systems and methods for determining semantic roles of arguments in sentences", "authors": null, "description": "There is provided a system including a non-transitory memory storing an executable code and a hardware processor executing the executable code to receive an input sentence including a first predicate and at least a first argument depending from the first predicate, identify the first predicate, identify the first argument based on the first predicate, apply a dependency multiplication to determine a semantic role of the first argument based on the first predicate, and assign the first argument to an argument cluster including one or more similar arguments based on the semantic role of the first argument.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 1, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:aIdbFUkbNIkC", "title": "Long tail visual relationship recognition with hubless regularized relmix", "authors": ["Sherif Abdelkarim", "Aniket Agarwal", "Panos Achlioptas", "Jun Chen", "Jiaji Huang", "Boyang Li", "Kenneth Church", "Mohamed Elhoseiny"], "description": null, "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 1, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:uDGL6kOW6j0C", "title": "A Dynamic and Dual-Process Theory of Humor", "authors": ["Boyang Li"], "description": "The cognitive mechanism of humor has been studied for centuries, with multiple seemingly incompatible theories proposed. Recent research in emotions suggests human emotions are tightly coupled and closely interact with other types of cognitive processes. This entangled nature contributes to the difficulty of humor research. In this paper, I attempt to provide a single, unified framework of humor, grounded in recent developments on emotion and dual-process cognition. I propose that humor comprehension consists of a four-step dynamic process: surprise, reflection, dismissal and compensation. The proposed theory provides a modern update on existing theories of humor, and is capable of explaining several phenomena that cannot be easily explained by existing theories. I also discuss the implication of the theory on creating computational systems that can create or perceive humor.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 1, 1, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:GFxP56DSvIMC", "title": "Learning chinese characters with gestures", "authors": ["Jun Ji", "Han Yu", "Boyang Li", "Zhiqi Shen", "Chunyan Miao"], "description": "As China’s economy continues to grow rapidly, there is increasing worldwide interest in learning the Chinese language. A significant common obstacle is learning to write the numerous Chinese characters, which bear little resemblance to Western alphabets. This research explores gesture-based interaction that allows the users to practice writing Chinese characters, each within a few minutes, and cultivates an in-depth and embodied understanding of the spatial organization and writing order of the strokes in the characters. We implement a prototype system based on Microsoft Kinect and report a study involving ten users. The user study demonstrates the success of our design in preventing unintentional commands with sporadic input. We identify design challenges of writing Chinese characters via 3-dimensional gestures without haptic feedback and discuss potential solutions.", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 2, 0, 1, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:eAlLMO4JVmQC", "title": "History-Aware Hierarchical Transformer for Multi-session Open-domain Dialogue System", "authors": ["Tong Zhang", "Yong Liu", "Boyang Li", "Zhiwei Zeng", "Pengwei Wang", "Yuan You", "Chunyan Miao", "Lizhen Cui"], "description": "With the evolution of pre-trained language models, current open-domain dialogue systems have achieved great progress in conducting one-session conversations. In contrast, Multi-Session Conversation (MSC), which consists of multiple sessions over a long term with the same user, is under-investigated. In this paper, we propose History-Aware Hierarchical Transformer (HAHT) for multi-session open-domain dialogue. HAHT maintains a long-term memory of history conversations and utilizes history information to understand current conversation context and generate well-informed and context-relevant responses. Specifically, HAHT first encodes history conversation sessions hierarchically into a history memory. Then, HAHT leverages historical information to facilitate the understanding of the current conversation context by encoding the history memory together with the current context with attention-based mechanisms. Finally, to explicitly utilize historical information, HAHT uses a history-aware response generator that switches between a generic vocabulary and a history-aware vocabulary. Experimental results on a large-scale MSC dataset suggest that the proposed HAHT model consistently outperforms baseline models. Human evaluation results support that HAHT generates more human-like, context-relevant and history-relevant responses than baseline models.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 3, 0]}, "topic": "Natural Language Processing", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:SIv7DqKytYAC", "title": "Toward Knowledge-Enriched Conversational Recommendation Systems", "authors": ["Tong Zhang", "Yong Liu", "Boyang Li", "Peixiang Zhong", "Chen Zhang", "Hao Wang", "Chunyan Miao"], "description": "Conversational Recommendation Systems recommend items through language based interactions with users. In order to generate naturalistic conversations and effectively utilize knowledge graphs (KGs) containing background information, we propose a novel Bag-of-Entities loss, which encourages the generated utterances to mention concepts related to the item being recommended, such as the genre or director of a movie. We also propose an alignment loss to further integrate KG entities into the response generation network. Experiments on the large-scale REDIAL dataset demonstrate that the proposed system consistently outperforms state-of-the-art baselines.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 3, 0]}, "topic": "Natural Language Processing", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:uVUOdF_882EC", "title": "Searching for Stage-wise Neural Graphs In the Limit", "authors": ["Xin Zhou", "Dejing Dou", "Boyang Li"], "description": "Search space is a key consideration for neural architecture search. Recently, Xie et al. (2019) found that randomly generated networks from the same distribution perform similarly, which suggests we should search for random graph distributions instead of graphs. We propose graphon as a new search space. A graphon is the limit of Cauchy sequence of graphs and a scale-free probabilistic distribution, from which graphs of different number of nodes can be drawn. By utilizing properties of the graphon space and the associated cut-distance metric, we develop theoretically motivated techniques that search for and scale up small-capacity stage-wise graphs found on small datasets to large-capacity graphs that can handle ImageNet. The scaled stage-wise graphs outperform DenseNet and randomly wired Watts-Strogatz networks, indicating the benefits of graphon theory in NAS applications.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:UuEBAcK4md4C", "title": "Improving tail-class representation with centroid contrastive learning", "authors": ["Anthony Meng Huat Tiong", "Junnan Li", "Guosheng Lin", "Boyang Li", "Caiming Xiong", "Steven CH Hoi"], "description": "In vision domain, large-scale natural datasets typically exhibit long-tailed distribution which has large class imbalance between head and tail classes. This distribution poses difficulty in learning good representations for tail classes. Recent developments have shown good long-tailed model can be learnt by decoupling the training into representation learning and classifier balancing. However, these works pay insufficient consideration on the long-tailed effect on representation learning. In this work, we propose interpolative centroid contrastive learning (ICCL) to improve long-tailed representation learning. ICCL interpolates two images from a class-agnostic sampler and a class-aware sampler, and trains the model such that the representation of the interpolative image can be used to retrieve the centroids for both source classes. We demonstrate the effectiveness of our approach on multiple long-tailed image …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [2, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:WAzi4Gm8nLoC", "title": "Federated learning with diversified preference for humor recognition", "authors": ["Xu Guo", "Pengwei Xing", "Siwei Feng", "Boyang Li", "Chun-yan Miao"], "description": "Understanding humor is critical to creative language modeling with many applications in human-AI interaction. However, the perception of humor is personal due to different humor preferences. Thus, a given passage can be regarded as funny to different degrees by different readers. This makes training humorous text recognition models that can adapt to diverse humor preferences highly challenging. In this paper, we propose the FedHumor approach to recognize humorous text contents in a personalized manner through federated learning (FL). It is a federated BERT model capable of jointly considering the overall distribution of humor scores with humor labels by individuals for given texts. Extensive experiments demonstrate significant advantages of FedHumor in recognizing humor contents accurately for people with diverse humor preferences compared to 9 state-of-the-art humor recognition approaches.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:T_ojBgVMvoEC", "title": "Mitigating and Evaluating Static Bias of Action Representations in the Background and the Foreground", "authors": ["Haoxin Li", "Yuan Liu", "Hanwang Zhang", "Boyang Li"], "description": "In video action recognition, shortcut static features can interfere with the learning of motion features, resulting in poor out-of-distribution (OOD) generalization. The video background is clearly a source of static bias, but the video foreground, such as the clothing of the actor, can also provide static bias. In this paper, we empirically verify the existence of foreground static bias by creating test videos with conflicting signals from the static and moving portions of the video. To tackle this issue, we propose a simple yet effective technique, StillMix, to learn robust action representations. Specifically, StillMix identifies bias-inducing video frames using a 2D reference network and mixes them with videos for training, serving as effective bias suppression even when we cannot explicitly extract the source of bias within each video frame or enumerate types of bias. Finally, to precisely evaluate static bias, we synthesize two new benchmarks, SCUBA for static cues in the background, and SCUFO for static cues in the foreground. With extensive experiments, we demonstrate that StillMix mitigates both types of static bias and improves video representations for downstream applications.", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:zdjWy_NXXwUC", "title": "A Survey of Computer Vision Technologies In Urban and Controlled-environment Agriculture", "authors": ["Jiayun Luo", "Boyang Li", "Cyril Leung"], "description": "In the evolution of agriculture to its next stage, Agriculture 5.0, artificial intelligence will play a central role. Controlled-environment agriculture, or CEA, is a special form of urban and suburban agricultural practice that offers numerous economic, environmental, and social benefits, including shorter transportation routes to population centers, reduced environmental impact, and increased productivity. Due to its ability to control environmental factors, CEA couples well with computer vision (CV) in the adoption of real-time monitoring of the plant conditions and autonomous cultivation and harvesting. The objective of this paper is to familiarize CV researchers with agricultural applications and agricultural practitioners with the solutions offered by CV. We identify five major CV applications in CEA, analyze their requirements and motivation, and survey the state of the art as reflected in 68 technical papers using deep learning methods. In addition, we discuss five key subareas of computer vision and how they related to these CEA problems, as well as nine vision-based CEA datasets. We hope the survey will help researchers quickly gain a bird-eye view of the striving research area and will spark inspiration for new research and development.", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:8Xgff_V0N9gC", "title": "Minimalist and High-performance Conversational Recommendation with Uncertainty Estimation for User Preference", "authors": ["Yinan Zhang", "Boyang Li", "Yong Liu", "You Yuan", "Chunyan Miao"], "description": "Conversational recommendation system (CRS) is emerging as a user-friendly way to capture users' dynamic preferences over candidate items and attributes. Multi-shot CRS is designed to make recommendations multiple times until the user either accepts the recommendation or leaves at the end of their patience. Existing works are trained with reinforcement learning (RL), which may suffer from unstable learning and prohibitively high demands for computing. In this work, we propose a simple and efficient CRS, MInimalist Non-reinforced Interactive COnversational Recommender Network (MINICORN). MINICORN models the epistemic uncertainty of the estimated user preference and queries the user for the attribute with the highest uncertainty. The system employs a simple network architecture and makes the query-vs-recommendation decision using a single rule. Somewhat surprisingly, this minimalist approach outperforms state-of-the-art RL methods on three real-world datasets by large margins. We hope that MINICORN will serve as a valuable baseline for future research.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 0, 0]}, "topic": "Conversational Recommendation System", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:Ak0FvsSvgGUC", "title": "From Data to Storytelling Agents", "authors": ["Boyang Li", "Mohini Thakkar", "Yijie Wang", "Mark O Riedl"], "description": "The ability to craft, tell, and understand stories is important for virtual agents that wish to communicate with human users and simulate human capabilities. We provide an overview of an end-to-end storytelling system named Scheherazade, which learns domain-specific narrative knowledge from crowdsourced stories, generates stories and discourses, and presents stories in natural language with diverse personal styles and sentiments. Extending previous work, this paper addresses discourse planning and text generation. Discourse planning selectively omits events using typicality of events derived from graph structures. Text generation considers language features computed directly from large-scale data sets such as the Google N-Gram Corpus and Project Gutenberg books. Learning from these data sets instills virtual agents with linguistic and social behavioral knowledge.", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:YOwf2qJgpHMC", "title": "Narrative Intelligence Without (Domain) Boundaries", "authors": ["Boyang Li"], "description": "Narrative Intelligence (NI) can help computational systems interact with users, such as through story generation, interactive narratives, and believable virtual characters. However, existing NI techniques generally require manually coded domain knowledge, restricting their scalability. An approach that intelligently, automatically and economically acquires script-like knowledge in any domain with strategic crowdsourcing will ease this bottleneck and broaden the application territory of narrative intelligence. This doctoral consortium paper defines the research problem, describes its significance, proposes a feasible research plan towards a Ph. D. dissertation, and reports on its current progress.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:UeHWp8X0CEIC", "title": "Creating Customized Virtual Experiences by Leveraging Human Creative Effort: A Desideratum", "authors": ["Mark O Riedl", "Boyang Li"], "description": "The task of entertaining people has, until very recently, been the exclusive domain of humans. However, recent work in the area of computational creativity, story generation, interactive storytelling, and autonomous believable agents suggests that AI may be used to create dynamic, interactive, and engaging real-time entertainment experiences. In this paper we consider the role of a novel technique called Experience Adaptation in the process of creating and delivering customized entertaining experiences. Experience Adaptation is an offline process that leverages human creative ability by taking human-authored storylines–in this case specifications of desired future experiences–and autonomously “re-writing” them based on unique requirements of individual users. With Experience Adaptation, we are working toward effectively scaling up entertainment computing.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:z6xuaG2dYH0C", "title": "May I Ask a Follow-up Question? Understanding the Benefits of Conversations in Neural Network Explainability", "authors": ["Tong Zhang", "X Jessie Yang", "Boyang Li"], "description": "Research in explainable AI (XAI) aims to provide insights into the decision-making process of opaque AI models. To date, most XAI methods offer one-off and static explanations, which cannot cater to the diverse backgrounds and understanding levels of users. With this paper, we investigate if free-form conversations can enhance users' comprehension of static explanations, improve acceptance and trust in the explanation methods, and facilitate human-AI collaboration. Participants are presented with static explanations, followed by a conversation with a human expert regarding the explanations. We measure the effect of the conversation on participants' ability to choose, from three machine learning models, the most accurate one based on explanations and their self-reported comprehension, acceptance, and trust. Empirical results show that conversations significantly improve comprehension, acceptance, trust, and collaboration. Our findings highlight the importance of customized model explanations in the format of free-form conversations and provide insights for the future design of conversational explanations.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Explainable AI (XAI)", "agg_topic": "Explainable AI", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:L_l9e5I586QC", "title": "Training Multimedia Event Extraction With Generated Images and Captions", "authors": ["Zilin Du", "Yunxin Li", "Xu Guo", "Yidan Sun", "Boyang Li"], "description": "Contemporary news reporting increasingly features multimedia content, motivating research on multimedia event extraction. However, the task lacks annotated multimodal training data and artificially generated training data suffer from the distribution shift from the real-world data. In this paper, we propose Cross-modality Augmented Multimedia Event Learning (CAMEL), which successfully utilizes artificially generated multimodal training data and achieves state-of-the-art performance. Conditioned on unimodal training data, we generate multimodal training data using off-the-shelf image generators like Stable Diffusion and image captioners like BLIP. In order to learn robust features that are effective across domains, we devise an iterative and gradual annealing training strategy. Substantial experiments show that CAMEL surpasses state-of-the-art (SOTA) baselines on the M2E2 benchmark. On multimedia events in particular, we outperform the prior SOTA by 4.2\\% F1 on event mention identification and by 9.8\\% F1 on argument identification, which demonstrates that CAMEL learns synergistic representations from the two modalities.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Natural Language Processing", "agg_topic": "Natural Language Processing (NLP)", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:C33y2ycGS3YC", "title": "Movie Box Office Prediction With Self-Supervised and Visually Grounded Pretraining", "authors": ["Qin Chao", "Eunsoo Kim", "Boyang Li"], "description": "Investments in movie production are associated with a high level of risk as movie revenues have long-tailed and bimodal distributions. Accurate prediction of box-office revenue may mitigate the uncertainty and encourage investment. However, learning effective representations for actors, directors, and user-generated content-related keywords remains a challenging open problem. In this work, we investigate the effects of self-supervised pretraining and propose visual grounding of content keywords in objects from movie posters as a pertaining objective. Experiments on a large dataset of 35,794 movies demonstrate significant benefits of self-supervised training and visual grounding. In particular, visual grounding pretraining substantially improves learning on movies with content keywords and achieves 14.5% relative performance gains compared to a finetuned BERT model with identical architecture.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:MIg0yeAD4ggC", "title": "InstructBLIP: Towards General-purpose Vision-Language Models with Instruction Tuning", "authors": ["Wenliang Dai", "Junnan Li", "Dongxu Li", "Anthony Meng Huat Tiong", "Junqi Zhao", "Weisheng Wang", "Boyang Li", "Pascale Fung", "Steven Hoi"], "description": null, "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:eGYfIraVYiQC", "title": "Smart Decision-Support System for Pig Farming", "authors": ["Hao Wang", "Boyang Li", "Haoming Zhong", "Ahong Xu", "Yingjie Huang", "Jingfu Zou", "Yuanyuan Chen", "Pengcheng Wu", "Yiqiang Chen", "Cyril Leung", "Chunyan Miao"], "description": "There are multiple participants, such as farmers, wholesalers, retailers, financial institutions, etc., involved in the modern food production process. All of these participants and stakeholders have a shared goal, which is to gather information on the food production process so that they can make appropriate decisions to increase productivity and reduce risks. However, real-time data collection and analysis continue to be difficult tasks, particularly in developing nations, where agriculture is the primary source of income for the majority of the population. In this paper, we present a smart decision-support system for pig farming. Specifically, we first adopt rail-based unmanned vehicles to capture pigsty images. We then conduct image stitching to avoid double-counting pigs so that we can use image segmentation method to give precise masks for each pig. Based on the segmentation masks, the pig weights can be estimated, and data can be integrated in our developed mobile app. The proposed system enables the above participants and stakeholders to have real-time data and intelligent analysis reports to help their decision-making.", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Artificial Intelligenc", "agg_topic": "Chemistry and Artificial Intelligenc", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:jSAVyFp_754C", "title": "Noise-Resistant Deep Metric Learning with Probabilistic Instance Filtering", "authors": ["Chang Liu", "Han Yu", "Boyang Li", "Zhiqi Shen", "Zhanning Gao", "Peiran Ren", "Xuansong Xie", "Lizhen Cui", "Chunyan Miao"], "description": "Noisy labels are commonly found in real-world data, which cause performance degradation of deep neural networks. Cleaning data manually is labour-intensive and time-consuming. Previous research mostly focuses on enhancing classification models against noisy labels, while the robustness of deep metric learning (DML) against noisy labels remains less well-explored. In this paper, we bridge this important gap by proposing Probabilistic Ranking-based Instance Selection with Memory (PRISM) approach for DML. PRISM calculates the probability of a label being clean, and filters out potentially noisy samples. Specifically, we propose a novel method, namely the von Mises-Fisher Distribution Similarity (vMF-Sim), to calculate this probability by estimating a von Mises-Fisher (vMF) distribution for each data class. Compared with the existing average similarity method (AvgSim), vMF-Sim considers the variance of each class in addition to the average similarity. With such a design, the proposed approach can deal with challenging DML situations in which the majority of the samples are noisy. Extensive experiments on both synthetic and real-world noisy dataset show that the proposed approach achieves up to 8.37% higher Precision@1 compared with the best performing state-of-the-art baseline approaches, within reasonable training time.", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:-nhnvRiOwuoC", "title": "Alignment of video and textual sequences for metadata analysis", "authors": null, "description": "Systems, methods and computer program products related to aligning heterogeneous sequential data are disclosed. Video data in a media presentation and textual data corresponding to content of the media presentation are received. An action related to aligning the video data and the textual data is determined using an alignment neural network, such that the video data and the textual data are at least partially aligned following the action. The alignment neural network includes a first fully connected layer that receives as input the video data, the textual data, and data relating to a previously determined action by the alignment neural network related to aligning the video data and the textual data. The determined action related to aligning the video data and the textual data is performed.", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:0aBXIfxlw9sC", "title": "Vision-CAIR/VisualGPT: Code Repository", "authors": ["Jun Chen", "Han Guo", "Kai Yi", "Boyang Li", "Mohamed Elhoseiny"], "description": null, "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:eO3_k5sD8BwC", "title": "Supplemental Material for HYDRA: Hypergradient Data Relevance Analysis for Interpreting Deep Neural Networks", "authors": ["Yuanyuan Chen", "Boyang Li", "Han Yu", "Pengcheng Wu", "Chunyan Miao"], "description": "MNIST and Fashion-MNIST are divided into training sets of 50,000, validation sets of 10,000, and test sets of 10,000 samples, respectively. CIFAR-10 is divided into a training set of 40,000, a validation set of 10,000, and a test set of 10,000 samples, respectively. LeNet-5 consists of 61,706 trainable parameters. We replace all of the tanh activation function with ReLU in our experiments. We also use the DenseNet-40 model with a growth rate of 12, which contains 176,122 trainable parameters.", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:raTqNPD5sRQC", "title": "Data-efficient Alignment of Multimodal Sequences by Aligning Gradient Updates and Internal Feature Distributions", "authors": ["Jianan Wang", "Boyang Li", "Xiangyu Fan", "Jing Lin", "Yanwei Fu"], "description": "The task of video and text sequence alignment is a prerequisite step toward joint understanding of movie videos and screenplays. However, supervised methods face the obstacle of limited realistic training data. With this paper, we attempt to enhance data efficiency of the end-to-end alignment network NeuMATCH [15]. Recent research [56] suggests that network components dealing with different modalities may overfit and generalize at different speeds, creating difficulties for training. We propose to employ (1) layer-wise adaptive rate scaling (LARS) to align the magnitudes of gradient updates in different layers and balance the pace of learning and (2) sequence-wise batch normalization (SBN) to align the internal feature distributions from different modalities. Finally, we leverage random projection to reduce the dimensionality of input features. On the YouTube Movie Summary dataset, the combined use of these technique closes the performance gap when the pretraining on the LSMDC dataset is omitted and achieves the state-of-the-art result. Extensive empirical comparisons and analysis reveal that these techniques improve optimization and regularize the network more effectively than two different setups of layer normalization.", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:w0F2JDEymm0C", "title": "Joint understanding of actors, literary characters, and movies", "authors": null, "description": "Systems, methods, and articles of manufacture are disclosed for learning models of movies, keywords, actors, and roles, and querying the same. In one embodiment, a recommendation application optimizes a model based on training data by initializing the mean and co-variance matrices of Gaussian distributions representing movies, keywords, and actors to random values, and then performing an optimization to minimize a margin loss function using symmetrical or asymmetrical measures of similarity between entities. Such training produces an optimized model with the Gaussian distributions representing movies, keywords, and actors, as well as shift vectors that change the means of movie Gaussian distributions and model archetypical roles. Subsequent to training, the same similarity measures used to train the model are used to query the model and obtain rankings of entities based on similarity to terms in the …", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:1DsIQWDZLl8C", "title": "Supplementary Material for A Neural Multi-sequence Alignment TeCHnique (NeuMATCH)", "authors": ["Pelin Dogan", "Boyang Li", "Leonid Sigal", "Markus Gross"], "description": "In this supplementary material, we first give details on the segmentation of videos into clips. Next, we show more alignment results computed by our approach on the datasets HM-1, HM-2, and YMS that require one-to-many matching and contain clips that do not match any sentences (ie, null clips). For illustration purposes, each figure below represents only a small portion (6-12 consecutive clips) of the entire aligned sequence. Each frame represents a video clip. The aligned sentences are shown with wide brackets below or above the clips.", "publication_year": 2018, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:7H_MAutzIkAC", "title": "The AIIDE 2015 workshop program", "authors": ["Camille Barot", "Michael Buro", "Michael Cook", "Mirjam Palosaari Eladhari", "Antonios Liapis", "Magnus Johansson", "Josh McCoy", "Santiago Ontañón", "Jonathan Rowe", "Emmett Tomai", "Harko Verhagen", "Alexander Zook"], "description": "The workshop program at the Eleventh Annual AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment was held November 14–15, 2015 at the University of California, Santa Cruz, USA. The program included 4 workshops (one of which was a joint workshop): Artificial Intelligence in Adversarial Real-Time Games, Experimental AI in Games, Intelligent Narrative Technologies and Social Believability in Games, and Player Modeling. This article contains the reports of three of the four workshops.", "publication_year": 2016, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:WC23djZS0W4C", "title": "It's a Funny Story", "authors": ["Peter J Ludovice", "Boyang Albert Li", "Ed Greco", "Jon Gaul"], "description": null, "publication_year": 2015, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:-6RzNnnwWf8C", "title": "Supplementary Material: Mitigating and Evaluating Static Bias of Action Representations in the Background and the Foreground", "authors": ["Haoxin Li", "Yuan Liu", "Hanwang Zhang", "Boyang Li"], "description": "No 25.25 72.83 44.65 81.94 36.58 85.03 Mixup 27.64 74.48 47.16 81.85 36.62 82.06 VideoMix 29.37 72.50 42.59 72.21 32.68 76.07 SDN 27.14 71.14 48.47 83.83 34.87 81.88 BE 26.67 72.99 46.62 81.73 35.99 85.30 ActorCutMix 29.02 74.02 56.88 79.60 36.97 81.07 FAME 29.50 73.83 28.21 71.70 39.61 81.56 StillMix 30.77 85.51 57.30 88.80 47.38 92.46 is difficult to separate the pixels of foreground motion and foreground static cues for debiasing foreground static bias. As a result, in this paper, we propose StillMix to debias without the need to explicitly extract foreground static cues within a frame. In addition, due to this difficulty, it is hard to create test videos by simply replacing the foreground static cues and preserving the foreground motion. Thus, we alternatively create videos with conflicting foreground cues (Figure 1 of the main paper) and SCUFO videos (Sec. 4 of the main paper) to evaluate foreground static bias.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QwL4z2UAAAAJ&cstart=20&pagesize=80&citation_for_view=QwL4z2UAAAAJ:Xz60mAmATU4C", "title": "VisualGPT Supplementary", "authors": ["Jun Chen", "Han Guo", "Kai Yi", "Boyang Li", "Mohamed Elhoseiny"], "description": "Image and Word Features. Following [1], we use a Faster R-CNN networks [10] with ResNet-101 [5] as a backbone to train on Visual Genome dataset [8], and we extract a 2048-dimensional feature vector for each object. We use the Byte Pair Encoding (BPE)[12], which effectively incorporate sub-word information and is beneficial for dealing with out-of-vocabulary words. We employ learnable positional encoding and initialize token embedding from pretrained weights of GPT-2. Architecture and Hyperparameters. We have 3 layers in the encoder and 12 layers in the decoder with 12 heads in each layer. The hidden size D in each layer is 768. We load the GPT-2 (small) pretrained weights, which has 117M parameters into the decoder. We use the learning rate of 1e− 4 under XE loss and 1e− 5 during the reinforcement learning. We train the models with the AdamW optimizer [9] and a batch size 25. The beam size is equal to 5. The threshold τ is tuned on the validation set for different training data. Training Details. We train all the models in two steps. We first train the models with cross-entropy (XE) loss and then finetune them using reinforcement learning. The crossentropy loss LXE is the traditional autoregressive classification loss", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}]