{"2020": {"summary": "No Publications Found in 2020!", "intermediate_results": {}}, "2021": {"summary": "In the past year, Professor X has conducted research on the development of Foodscover, a mobile application designed to tackle food waste in the retail sector. The application offers surplus food to the public at discounted prices, ultimately aiming to reduce food waste and promote sustainability in the industry.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=Rog8AvUAAAAJ&cstart=20&pagesize=80&citation_for_view=Rog8AvUAAAAJ:LgRImbQfgY4C": "The article discusses the development of a mobile application called Foodscover, which aims to reduce food waste in the retail sector by offering surplus food at a discounted price to the general public."}}, "2022": {"summary": "Professor X has conducted research on a mobile application called PoseBuddy, which utilizes computer vision technology to offer tailored workout plans and instant feedback to users. By addressing the constraints of location and time, this innovative tool aims to encourage physical activity and enhance personal fitness.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=Rog8AvUAAAAJ&cstart=20&pagesize=80&citation_for_view=Rog8AvUAAAAJ:2tRrZ1ZAMYUC": "The research article introduces a mobile application called PoseBuddy that uses computer vision to provide personalized workout plans and real-time feedback for users. It aims to promote physical activity and overcome the limitations of venue and time."}}, "2023": {"summary": "Professor X has conducted research in various areas, including the development of an AI-based mobile application for real-time animal sound recognition, the creation of Voyager, a travel safety app, the design of the iWILL app for emergency assistance, and the implementation of interactive course materials in higher education. Their work focuses on leveraging technology to enhance user experiences and address important issues in animal conservation, travel safety, emergency response, and online education.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=Rog8AvUAAAAJ&cstart=20&pagesize=80&citation_for_view=Rog8AvUAAAAJ:wMgC3FpKEyYC": "This research article discusses the development of an AI-based application for real-time animal sound recognition using pre-trained and custom-trained machine learning models deployed on mobile devices.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=Rog8AvUAAAAJ&cstart=20&pagesize=80&citation_for_view=Rog8AvUAAAAJ:QD3KBmkZPeQC": "The research article discusses the development of a mobile application called Voyager that aims to provide users with information about the dangers and safety culture of their travel, addressing the risks that tourists face while visiting tourist attractions around the world.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=Rog8AvUAAAAJ&cstart=20&pagesize=80&citation_for_view=Rog8AvUAAAAJ:jL-93Qbq4QoC": "The iWILL mobile application is designed to provide prompt and efficient assistance during emergencies by alerting nearby CPR-trained individuals and displaying nearby Automated External Defibrillators (AEDs) on a map.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=Rog8AvUAAAAJ&cstart=20&pagesize=80&citation_for_view=Rog8AvUAAAAJ:4xDN1ZYqzskC": "This research article explores the implementation of interactive course materials in higher education to enhance learning experiences and support online teaching."}}}