[{"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:kNdYIx-mwKoC", "title": "Online palmprint identification", "authors": ["David Zhang", "Wai-Kin Kong", "Jane You", "Michael Wong"], "description": "Biometrics-based personal identification is regarded as an effective method for automatically recognizing, with a high confidence, a person's identity. This paper presents a new biometric approach to online personal identification using palmprint technology. In contrast to the existing methods, our online palmprint identification system employs low-resolution palmprint images to achieve effective personal identification. The system consists of two parts: a novel device for online palmprint image acquisition and an efficient algorithm for fast palmprint recognition. A robust image coordinate system is defined to facilitate image alignment for feature extraction. In addition, a 2D Gabor phase encoding scheme is proposed for palmprint feature extraction and representation. The experimental results demonstrate the feasibility of the proposed system.", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 29, 62, 62, 81, 102, 112, 135, 137, 132, 142, 132, 110, 121, 109, 101, 105, 75, 58, 62, 38, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:3fE2CSJIrl8C", "title": "Competitive coding scheme for palmprint verification", "authors": ["AW-K Kong", "David Zhang"], "description": "There is increasing interest in the development of reliable, rapid and non-intrusive security control systems. Among the many approaches, biometrics such as palmprints provide highly effective automatic mechanisms for use in personal identification. This paper presents a new method for extracting features from palmprints using the competitive coding scheme and angular matching. The competitive coding scheme uses multiple 2-D Gabor filters to extract orientation information from palm lines. This information is then stored in a feature vector called the competitive code. The angular matching with an effective implementation is then defined for comparing the proposed codes, which can make over 9,000 comparisons within 1s. In our testing database of 7,752 palmprint samples from 386 palms, we can achieve a high genuine acceptance rate of 98.4% and a low false acceptance rate of 3/spl times/10/sup -6/%. The …", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 7, 14, 24, 28, 40, 46, 49, 66, 62, 55, 61, 61, 52, 57, 41, 29, 34, 25, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:d1gkVwhDpl0C", "title": "A survey of palmprint recognition", "authors": ["Adams Kong", "David Zhang", "Mohamed Kamel"], "description": "Palmprint recognition has been investigated over 10 years. During this period, many different problems related to palmprint recognition have been addressed. This paper provides an overview of current palmprint research, describing in particular capture devices, preprocessing, verification algorithms, palmprint-related fusion, algorithms especially designed for real-time palmprint identification in large databases and measures for protecting palmprint systems and users’ privacy. Finally, some suggestion is offered.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [11, 32, 44, 52, 66, 74, 58, 74, 51, 58, 61, 25, 33, 24, 11, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:KlAtU1dfN6UC", "title": "Palmprint feature extraction using 2-D Gabor filters", "authors": ["Wai Kin Kong", "David Zhang", "Wenxin Li"], "description": "Biometric identification is an emerging technology that can solve security problems in our networked society. A few years ago, a new branch of biometric technology, palmprint authentication, was proposed (Pattern Recognition 32(4) (1999) 691) whereby lines and points are extracted from palms for personal identification. In this paper, we consider the palmprint as a piece of texture and apply texture-based feature extraction techniques to palmprint authentication. A 2-D Gabor filter is used to obtain texture information and two palmprint images are compared in terms of their hamming distance. The experimental results illustrate the effectiveness of our method.", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 6, 19, 14, 32, 33, 23, 30, 32, 46, 44, 46, 21, 32, 28, 26, 21, 24, 13, 22, 6, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:u5HHmVD_uO8C", "title": "Palmprint identification using feature-level fusion", "authors": ["Adams Kong", "David Zhang", "Mohamed Kamel"], "description": "In this paper, we propose a feature-level fusion approach for improving the efficiency of palmprint identification. Multiple elliptical Gabor filters with different orientations are employed to extract the phase information on a palmprint image, which is then merged according to a fusion rule to produce a single feature called the Fusion Code. The similarity of two Fusion Codes is measured by their normalized hamming distance. A dynamic threshold is used for the final decisions. A database containing 9599 palmprint images from 488 different palms is used to validate the performance of the proposed method. Comparing our previous non-fusion approach and the proposed method, improvement in verification and identification are ensured.", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 8, 28, 23, 32, 31, 26, 32, 33, 27, 35, 45, 35, 21, 20, 7, 6, 16, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:Zph67rFs4hoC", "title": "Accurate iris segmentation based on novel reflection and eyelash detection model", "authors": ["WK Kong", "Dapeng Zhang"], "description": "The authors propose a novel noise detection model for accurate segmentation of an iris. Eyelash, eyelid and reflection are three main noises. Eyelid has already been solved by a traditional eye model; however, eyelash and reflection have not been tackled. To determinate a pixel in an eyelash, the model presented follows the three criteria: 1) separable eyelash condition; 2) non-informative condition; and 3) connective criterion. The first and second conditions handle separable and multiple eyelashes respectively. The last criterion avoids misclassification of strong iris texture as a single and separable eyelash. For reflection, strong reflection points are detected by a threshold and the weak reflection points around the strong points are determined by connective criterion and statistical test. A number of images are selected to evaluate the accuracy and necessity of our noise detection model and the results are …", "publication_year": 2001, "citations_by_year": {"year": [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 3, 15, 17, 15, 16, 26, 32, 22, 29, 39, 45, 26, 21, 23, 9, 13, 18, 10, 6, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:u-x6o8ySG0sC", "title": "An analysis of biohashing and its variants", "authors": ["Adams Kong", "King-Hong Cheung", "David Zhang", "Mohamed Kamel", "Jane You"], "description": "As a result of the growing demand for accurate and reliable personal authentication, biometric recognition, a substitute for or complement to existing authentication technologies, has attracted considerable attention. It has recently been reported that, along with its variants, BioHashing, a new technique that combines biometric features and a tokenized (pseudo-) random number (TRN), has achieved perfect accuracy, having zero equal error rates (EER) for faces, fingerprints and palmprints. There are, however, anomalies in this approach. These are identified in this paper, in which we systematically analyze the details of the approach and conclude that the claim of having achieved a zero EER is based upon an impractical hidden assumption. We simulate the claimants’ experiments and find that it is not possible to achieve their reported performance without the hidden assumption and that, indeed, the results are …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 15, 14, 15, 29, 24, 27, 36, 24, 27, 15, 24, 16, 15, 15, 22, 14, 6, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:ULOm3_A8WrAC", "title": "On hierarchical palmprint coding with multiple features for personal identification in large databases", "authors": ["Jane You", "Wai-Kin Kong", "David Zhang", "King Hong Cheung"], "description": "Automatic personal identification is a significant component of security systems with many challenges and practical applications. The advances in biometric technology have led to the very rapid growth in identity authentication. This paper presents a new approach to personal identification using palmprints. To tackle the key issues such as feature extraction, representation, indexing, similarity measurement, and fast search for the best match, we propose a hierarchical multifeature coding scheme to facilitate coarse-to-fine matching for efficient and effective palmprint verification and identification in a large database. In our approach, four-level features are defined: global geometry-based key point distance (Level-1 feature), global texture energy (Level-2 feature), fuzzy \"interest\" line (Level-3 feature), and local directional texture energy (Level-4 feature). In contrast to the existing systems that employ a fixed mechanism …", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 8, 12, 12, 12, 16, 8, 8, 8, 9, 17, 10, 11, 11, 7, 9, 6, 1, 2, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:2osOgNQ5qMEC", "title": "A study of identical twins’ palmprints for personal verification", "authors": ["Adams Wai-Kin Kong", "David Zhang", "Guangming Lu"], "description": "Automatic biometric systems based on human characteristics for personal identification have attracted great attention. Their performance highly depends on the distinctive information in the biometrics. Identical twins having the closest genetics-based relationship are expected to have maximum similarity in their biometrics. Classifying identical twins is a challenging problem for some automatic biometric systems. Palmprint has been studied for personal identification for over seven years. Most of the previous research concentrates on algorithm development. In this paper, we systemically examine palmprints from the same DNA for automatic personal identification and to uncover the genetically related palmprint features. The experimental results show that the three principal lines and some portions of weak lines are genetically related features but our palms still contain rich genetically unrelated features for classifying …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 3, 4, 11, 9, 19, 16, 16, 16, 15, 21, 6, 8, 9, 4, 5, 3, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:_kc_bZDykSQC", "title": "Palmprint texture analysis based on low-resolution images for personal authentication", "authors": ["Wai Kin Kong", "David Zhang"], "description": "Biometrics identification is an emerging solution for solving security problems in our networked society. A new branch of biometric approach -palmprint technology, whereby the lines and points can be extracted from our palm for personal authentication- was proposed several years ago. In this paper, we develop a new feature extraction method based on low-resolution palmprint images. A 2-D Gabor filter is used to obtain the texture information and two palmprint images are compared in term of their hamming distance. The experimental results illustrate the effectiveness of our method.", "publication_year": 2002, "citations_by_year": {"year": [2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 10, 3, 1, 9, 7, 9, 9, 16, 9, 11, 3, 13, 7, 10, 3, 6, 2, 1, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:YOwf2qJgpHMC", "title": "Detecting eyelash and reflection for accurate iris segmentation", "authors": ["Wai-Kin Kong", "David Zhang"], "description": "Accurate iris segmentation is presented in this paper, which is composed of two parts, reflection detection and eyelash detection. Eyelashes are classified into two categories, separable and multiple. An edge detector is applied to detect separable eyelashes, and intensity variances are used to recognize multiple eyelashes. Reflection is also divided into two types, strong and weak. A threshold and statistical model is proposed to recognize the strong and weak reflection, respectively. We have developed an iris recognition approach for testing the effectiveness of the proposed segmentation method. The results show that the proposed method can reduce recognition error for the iris recognition approach.", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 4, 6, 11, 13, 12, 14, 13, 4, 12, 6, 6, 7, 2, 2, 7, 0, 4, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:9yKSN-GCB0IC", "title": "Feature-level fusion for effective palmprint authentication", "authors": ["Adams Wai-Kin Kong", "David Zhang"], "description": "A feature-level fusion approach is proposed for improving the efficiency of palmprint identification. Multiple Gabor filters are employed to extract the phase information on a palmprint image, which is then merged according to a fusion rule to produce a single feature called the Fusion Code. The similarity of two Fusion Codes is measured by their normalized hamming distance. A database containing 7,752 palmprint images from 386 different palms is used to validate the performance of the proposed method. Empirically comparing our previous non-fusion approach and the proposed method, improvement in verification is ensured", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 8, 9, 11, 5, 10, 7, 7, 9, 6, 8, 6, 5, 6, 2, 6, 2, 1, 1, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:JoZmwDi-zQgC", "title": "Palmprint recognition in uncontrolled and uncooperative environment", "authors": ["Wojciech Michal Matkowski", "Tingting Chai", "Adams Wai Kin Kong"], "description": "Online palmprint recognition and latent palmprint identification are two branches of palmprint studies. The former uses middle-resolution images collected by a digital camera in a well-controlled or contact-based environment with user cooperation for commercial applications and the latter uses high-resolution latent palmprints collected in crime scenes for forensic investigation. However, these two branches do not cover some palmprint images which have the potential for forensic investigation. Due to the prevalence of smartphone and consumer camera, more evidence is in the form of digital images taken in uncontrolled and uncooperative environment, e.g., child pornographic images and terrorist images, where the criminals commonly hide or cover their face. However, their palms can be observable. To study palmprint identification on images collected in uncontrolled and uncooperative environment, a new …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 16, 14, 26, 26, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:XD-gHx7UXLsC", "title": "Transattunet: Multi-level attention-guided u-net with transformer for medical image segmentation", "authors": ["Bingzhi Chen", "Yishu Liu", "Zheng Zhang", "Guangming Lu", "Adams Wai Kin Kong"], "description": "Accurate segmentation of organs or lesions from medical images is crucial for reliable diagnosis of diseases and organ morphometry. In recent years, convolutional encoder-decoder solutions have achieved substantial progress in the field of automatic medical image segmentation. Due to the inherent bias in the convolution operations, prior models mainly focus on local visual cues formed by the neighboring pixels, but fail to fully model the long-range contextual dependencies. In this article, we propose a novel Transformer-based Attention Guided Network called  TransAttUnet , in which the multi-level guided attention and multi-scale skip connection are designed to jointly enhance the performance of the semantical segmentation architecture. Inspired by Transformer, the self-aware attention (SAA) module with Transformer Self Attention (TSA) and Global Spatial Attention (GSA) is incorporated into TransAttUnet to …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [58, 21]}, "topic": "Medical Image Segmentation", "agg_topic": "Biomedical Informatic", "final_topic": "Biomedical Informatic"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:hC7cP41nSMkC", "title": "An analysis of iriscode", "authors": ["Adams WK Kong", "David Zhang", "Mohamed S Kamel"], "description": "IrisCode is an iris recognition algorithm developed in 1993 and continuously improved by Daugman. It has been extensively applied in commercial iris recognition systems. IrisCode representing an iris based on coarse phase has a number of properties including rapid matching, binomial impostor distribution and a predictable false acceptance rate. Because of its successful applications and these properties, many similar coding methods have been developed for iris and palmprint identification. However, we lack a detailed analysis of IrisCode. The aim of this paper is to provide such an analysis as a way of better understanding IrisCode, extending the coarse phase representation to a precise phase representation, and uncovering the relationship between IrisCode and other coding methods. Our analysis demonstrates that IrisCode is a clustering algorithm with four prototypes; the locus of a Gabor function is a 2-D …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 7, 2, 4, 12, 8, 9, 9, 5, 8, 5, 3, 5, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:mvPsJ3kp5DgC", "title": "A constrained deep neural network for ordinal regression", "authors": ["Yanzhu Liu", "Adams Wai Kin Kong", "Chi Keong Goh"], "description": "Ordinal regression is a supervised learning problem aiming to classify instances into ordinal categories. It is challenging to automatically extract high-level features for representing intraclass information and interclass ordinal relationship simultaneously. This paper proposes a constrained optimization formulation for the ordinal regression problem which minimizes the negative loglikelihood for multiple categories constrained by the order relationship between instances. Mathematically, it is equivalent to an unconstrained formulation with a pairwise regularizer. An implementation based on the CNN framework is proposed to solve the problem such that high-level features can be extracted automatically, and the optimal solution can be learned through the traditional back-propagation method. The proposed pairwise constraints make the algorithm work even on small datasets, and a proposed efficient implementation make it be scalable for large datasets. Experimental results on four real-world benchmarks demonstrate that the proposed algorithm outperforms the traditional deep learning approaches and other state-of-the-art approaches based on hand-crafted features.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 13, 18, 17, 21, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:4JMBOYKVnBMC", "title": "Method and an apparatus for determining vein patterns from a colour image", "authors": null, "description": "The present invention is directed to a method of determining vein patterns from a color image for personal identification, the method comprising forming a counterpart of the color image by applying a functional relationship obtained from optimization on the color image, wherein the counterpart of the color image comprises the vein patterns. An apparatus for determining vein patterns from a color image is also disclosed.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 7, 12, 5, 10, 15, 12, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:qjMakFHDy7sC", "title": "Three measures for secure palmprint identification", "authors": ["Adams Kong", "David Zhang", "Mohamed Kamel"], "description": "Most previous research in the area of personal authentication using the palmprint as a biometric trait has concentrated on enhancing accuracy yet resistance to attacks is also a centrally important feature of any biometric security system. In this paper, we address three relevant security issues: template re-issuances, also called cancellable biometrics,1 replay attacks, and database attacks. We propose to use a random orientation filter bank (ROFB) as a feature extractor to generate noise-like feature codes, called Competitive Codes for templates re-issuances. Secret messages are hidden in templates to prevent replay and database attacks. This technique can be regarded as template watermarking. A series of analyses is provided to evaluate the security levels of the measures.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 11, 5, 3, 4, 8, 8, 4, 1, 1, 4, 1, 2, 2, 0, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:4TOpqqG69KYC", "title": "Real-time palmprint acquisition system design", "authors": ["M Wong", "Dapeng Zhang", "W-K Kong", "G Lu"], "description": "Capturing high quality palmprint images in a very short time period is a fundamental step in palmprint research. While a palmprint scanner capable of this function is especially important for developing a real-time online palmprint identification system, limited research effort has been put into designing and implementing palmprint acquisition systems. In this paper, a novel palmprint acquisition system is presented, which is designed for various civilian applications such as access control, ATM etc. The novel contactless design on the user interface prevents the distortion of the palm skin introduced by the traditional glass plate of a palm scanner. The system is designed to have the best performance at reasonable price. It has a resolution of 150 dpi that is able to obtain palmprint features including the principal lines, wrinkles and ridge texture. The proposed system provides an important step for implementing a …", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 2, 4, 8, 3, 4, 1, 4, 2, 6, 6, 4, 2, 2, 1, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&citation_for_view=2GfXvbUAAAAJ:MXK_kJrjxJIC", "title": "Uncovering vein patterns from color skin images for forensic analysis", "authors": ["Chaoying Tang", "Adams Wai Kin Kong", "Noah Craft"], "description": "Recent technological advances have allowed for a proliferation of digital evidence images. Using these images as evidence in legal cases (e.g. child sexual abuse, child pornography and masked gunmen) can be very challenging, because the faces of criminals or victims are not visible. Although large skin marks and tattoos have been used, they are ineffective in some legal cases, because the skin exposed in evidence images neither have unique tattoos nor enough skin marks for identification. The blood vessel between the skin and the muscle covering most parts of the human body is a powerful biometric trait, because of its universality, permanence and distinctiveness. Traditionally, it was impossible to use vein patterns for forensic identification, because they were not visible in color images. This paper proposes an algorithm to uncover vein patterns from the skin exposed in color images for personal …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 8, 4, 5, 3, 3, 7, 4, 4, 5, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:e5wmG9Sq2KIC", "title": "Matching vein patterns from color images for forensic investigation", "authors": ["Hengyi Zhang", "Chaoying Tang", "Adams Wai-Kin Kong", "Noah Craft"], "description": "Child sexual abuse is a serious global problem and has gained public attention in recent years. Due to the popularity of digital cameras, many perpetrators take images of their sexual activities with child victims. Traditionally, it was difficult to use cutaneous vascular patterns for forensic identification, because they were nearly invisible in color images. Recently, this limitation was overcome using a computational method based on an optical model to uncover vein patterns from color images for forensic verification. This optical-based vein uncovering (OBVU) method is sensitive to the power of the illuminant and does not utilize skin color in images to obtain training parameters to optimize the vein uncovering performance. Prior publications have not included an automatic vein matching algorithm for forensic identification. As a result, the OBVU method only supported manual verification. In this paper, we propose two …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 6, 3, 7, 7, 3, 9, 4, 4, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Wp0gIr-vW9MC", "title": "Method of palm print identification", "authors": null, "description": "A method of biometrics identification includes obtaining an image including a portion of a hand of an individual, analyzing the image to find one or more feature parameters defining different characteristics of the hand, and comparing the feature parameters with reference information in a database. The features parameters including a geometrical features parameter, a palm line features parameter or a palm texture features parameter.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 1, 7, 3, 10, 4, 5, 2, 6, 1, 3, 2, 1, 0, 1]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:WqliGbK-hY8C", "title": "A study on giant panda recognition based on images of a large proportion of captive pandas", "authors": ["Peng Chen", "Pranjal Swarup", "Wojciech Michal Matkowski", "Adams Wai Kin Kong", "Su Han", "Zhihe Zhang", "Hou Rong"], "description": "As a highly endangered species, the giant panda (panda) has attracted significant attention in the past decades. Considerable efforts have been put on panda conservation and reproduction, offering the promising outcome of maintaining the population size of pandas. To evaluate the effectiveness of conservation and management strategies, recognizing individual pandas is critical. However, it remains a challenging task because the existing methods, such as traditional tracking method, discrimination method based on footprint identification, and molecular biology method, are invasive, inaccurate, expensive, or challenging to perform. The advances of imaging technologies have led to the wide applications of digital images and videos in panda conservation and management, which makes it possible for individual panda recognition in a noninvasive manner by using image‐based panda face recognition method …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 9, 24, 10, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:eQOLeE2rZwMC", "title": "An Analysis on Invertibility of Cancelable Biometrics based on BioHashing.", "authors": ["King Hong Cheung", "Adams Wai-Kin Kong", "Jane You", "David Zhang"], "description": "One of the aims of cancelable biometrics is to protect privacy. In order to protect privacy, cancelable biometrics are preferably to be non-invertible such that no information can be revealed from the cancelable biometrics template, which is stored in databases for personal identification/verification. One way to achieve the non-invertibility is through the use of non-invertible transforms. Recently, some new cancelable biometric approaches are proposed based on BioHashing. Those approaches are utilizing non-invertible transforms to achieve cancelable biometrics and thus non-invertibility is also attained. It is revealed that, however, if cancelable biometric templates are compromised and information about the transformation is uncovered, the process is “invertible” to the extent that the matcher may be fooled.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 2, 2, 4, 4, 4, 1, 4, 5, 2, 1, 2, 3, 7, 0, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:HE397vMXCloC", "title": "Towards touch-to-access device authentication using induced body electric potentials", "authors": ["Zhenyu Yan", "Qun Song", "Rui Tan", "Yang Li", "Adams Wai Kin Kong"], "description": "This paper presents TouchAuth, a new touch-to-access device authentication approach using induced body electric potentials (iBEPs) caused by the indoor ambient electric field that is mainly emitted from the building's electrical cabling. The design of TouchAuth is based on the electrostatics of iBEP generation and a resulting property, i.e., the iBEPs at two close locations on the same human body are similar, whereas those from different human bodies are distinct. Extensive experiments verify the above property and show that TouchAuth achieves high-profile receiver operating characteristics in implementing the touch-to-access policy. Our experiments also show that a range of possible interfering sources including appliances' electromagnetic emanations and noise injections into the power network do not affect the performance of TouchAuth. A key advantage of TouchAuth is that the iBEP sensing requires a …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 11, 9, 14, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:2P1L_qKh6hAC", "title": "A study on low resolution androgenic hair patterns for criminal and victim identification", "authors": ["Han Su", "Adams Wai Kin Kong"], "description": "Identifying criminals and victims in images (e.g., child pornography and masked gunmen) can be a challenging task, especially when neither their faces nor tattoos are observable. Skin mark patterns and blood vessel patterns are recently proposed to address this problem. However, they are invisible in low-resolution images and dense androgenic hair can cover them completely. Medical research results have implied that androgenic hair patterns are a stable biometric trait and have potential to overcome the weaknesses of skin mark patterns and blood vessel patterns. To the best of our knowledge, no one has studied androgenic hair patterns for criminal and victim identification before. This paper aims to study matching performance of androgenic hair patterns in low-resolution images. An algorithm designed for this paper uses Gabor filters to compute orientation fields of androgenic hair patterns, histograms on a …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 4, 6, 7, 4, 9, 2, 1, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:8AbLer7MMksC", "title": "Deep ordinal regression based on data relationship for small datasets.", "authors": ["Yanzhu Liu", "Adams Wai-Kin Kong", "Chi Keong Goh"], "description": "Ordinal regression aims to classify instances into ordinal categories. As with other supervised learning problems, learning an effective deep ordinal model from a small dataset is challenging. This paper proposes a new approach which transforms the ordinal regression problem to binary classification problems and uses triplets with instances from different categories to train deep neural networks such that high-level features describing their ordinal relationship can be extracted automatically. In the testing phase, triplets are formed by a testing instance and other instances with known ranks. A decoder is designed to estimate the rank of the testing instance based on the outputs of the network. Because of the data argumentation by permutation, deep learning can work for ordinal regression even on small datasets. Experimental results on the historical color image benchmark and MSRA image search datasets demonstrate that the proposed algorithm outperforms the traditional deep learning approach and is comparable with other state-ofthe-art methods, which are highly based on prior knowledge to design effective features.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 6, 5, 10, 9, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Tyk-4Ss8FVUC", "title": "An analysis on accuracy of cancelable biometrics based on biohashing", "authors": ["King-Hong Cheung", "Adams Kong", "David Zhang", "Mohamed Kamel", "Jane Toby You", "Ho-Wang Lam"], "description": "Cancelable biometrics has been proposed for canceling and re-issuing biometric templates and for protecting privacy in biometrics systems. Recently, new cancelable biometric approaches are proposed based on BioHashing, which are random transformed feature-based cancelable biometrics. In this paper, we consider the accuracy of one of the cancelable biometrics based on BioHashing and face. Through this analysis, as an illustration, we would like to raise an issue to be considered in cancelable biometrics: accuracy may be traded for biometrics being cancelable.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 6, 6, 3, 0, 1, 4, 4, 1, 3, 1, 0, 2, 1, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:zYLM7Y9cAGgC", "title": "Palmprint identification based on generalization of IrisCode", "authors": ["Adams Kong"], "description": "The development of accurate and reliable security systems is a matter of wide interest, and in this context biometrics is seen as a highly effective automatic mechanism for personal identification. Among biometric technologies,  IrisCode developed by Daugman in 1993 is regarded as a highly accurate approach, being able to support real-time personal identification of large databases. Since 1993, on the top of IrisCode, different coding methods have been proposed for iris and fingerprint identification. In this research, I extend and generalize IrisCode for real-time secure palmprint identification.  PalmCode, the first coding method for palmprint identification developed by me in 2002, directly applied IrisCode to extract phase information of palmprints as features. However, I observe that the PalmCodes from the different palms are similar, having many 45o streaks. Such structural similarities in the PalmCodes of different palms would reduce the individuality of PalmCodes and the performance of palmprint identification systems. To reduce the correlation between PalmCodes, in this thesis, I employ multiple elliptical Gabor filters with different orientations to compute different PalmCodes and merge them to produce a single feature, called Fusion Code. Experimental results demonstrate that Fusion Code performs better than PalmCode. Based on the results of Fusion Code, I further identify that the orientation fields of palmprints are powerful features. Consequently, Competitive Code, which uses real parts of six Gabor filters to estimate the orientation fields, is developed. To embed the properties of IrisCode, such as high speed matching, in Competitive …", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 3, 1, 5, 5, 2, 3, 5, 0, 3, 0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:UeHWp8X0CEIC", "title": "Revealing the secret of facehashing", "authors": ["King-Hong Cheung", "Adams Kong", "David Zhang", "Mohamed Kamel", "Jane You"], "description": "Biometric authentication has attracted substantial attention over the past few years. It has been reported recently that a new technique called FaceHashing, which is proposed for personal authentication using face images, has achieved perfect accuracy and zero equal error rates (EER). In this paper, we are going to reveal that the secret of FaceHashing in achieving zero EER is based on a false assumption. This is done through simulating the claimants’ experiments. Thus, we would like to alert the use of “safe” token.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 2, 6, 2, 5, 5, 4, 0, 1, 0, 0, 1, 0, 0, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:qUcmZB5y_30C", "title": "Analysis of brute-force break-ins of a palmprint authentication system", "authors": ["Adams Wai-Kin Kong", "David Zhang", "Mohamed Kamel"], "description": "Biometric authentication systems are widely applied because they offer inherent advantages over classical knowledge-based and token-based personal-identification approaches. This has led to the development of products using palmprints as biometric traits and their use in several real applications. However, as biometric systems are vulnerable to replay, database, and brute-force attacks, such potential attacks must be analyzed before biometric systems are massively deployed in security systems. This correspondence proposes a projected multinomial distribution for studying the probability of successfully using brute-force attacks to break into a palmprint system. To validate the proposed model, we have conducted a simulation. Its results demonstrate that the proposed model can accurately estimate the probability. The proposed model indicates that it is computationally infeasible to break into the palmprint …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 6, 2, 2, 0, 1, 4, 1, 3, 1, 6, 0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:W7OEmFMy1HYC", "title": "An evaluation of Gabor orientation as a feature for face recognition", "authors": ["Adams Kong"], "description": "Identifying a reliable feature is extremely important for all pattern recognition systems. The Gabor filter, which simultaneously captures spatial and frequency information, has been a vital component in numerous systems as a feature extractor. This filter produces three basic features - magnitude, phase, and orientation. Most face recognition methods based on Gabor filters use either the magnitude feature alone or a combination of the phase and magnitude features; very few are purely based on the phase feature, and the orientation feature is ignored. The aim of this paper is to evaluate these three basic features for face recognition using the FERET and AR face databases. The results show that the orientation feature is the most robust and distinctive feature, 20% and over 10% more accurate than the phase and magnitude features, respectively.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 4, 5, 2, 5, 4, 2, 0, 2, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Y0pCki6q_DkC", "title": "A study of brute-force break-ins of a palmprint verification system", "authors": ["Adams Kong", "David Zhang", "Mohamed Kamel"], "description": "Biometric systems are widely applied since they offer inherent advantages over traditional knowledge-based and token-based personal authentication approaches. This has led to the development of palmprint systems and their use in several real applications. Biometric systems are not, however, invulnerable. The potential attacks including replay and brute-force attacks have to be analyzed before they are massively deployed in real applications. With this in mind, this paper will consider brute-force break-ins directed against palmprint verification systems.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 3, 2, 1, 4, 6, 2, 1, 1, 2, 1, 0, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:JV2RwH3_ST0C", "title": "The individuality of relatively permanent pigmented or vascular skin marks (RPPVSM) in independently and uniformly distributed patterns", "authors": ["Arfika Nurhudatiana", "Adams Wai-Kin Kong", "Keyan Matinpour", "Deborah Chon", "Lisa Altieri", "Siu-Yeung Cho", "Noah Craft"], "description": "With recent advances in multimedia technology, the involvement of digital images/videos in crimes has been increasing significantly. Identification of individuals in these images/videos can be challenging. For example, in cases of child sexual abuse, child pornography, and masked gunmen, the faces of criminals or victims are often hidden or covered and only some body parts (e.g., back, thigh, and arm) can be observed from the digital evidence. Although tattoos and scars can be used for identification in some cases, they are neither universal nor unique. We propose a group of skin marks named Relatively Permanent Pigmented or Vascular Skin Marks (RPPVSM) as a biometric trait for forensic identification. To support the scientific underpinnings of using RPPVSM patterns as a novel biometric trait, the individuality was studied. RPPVSM on the backs of 269 male subjects were examined. We found that RPPVSM …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 3, 5, 6, 3, 2, 1, 0, 3, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:hqOjcs7Dif8C", "title": "Fundamental statistics of relatively permanent pigmented or vascular skin marks for criminal and victim identification", "authors": ["Arfika Nurhudatiana", "Adams Wai-Kin Kong", "Keyan Matinpour", "Siu-Yeung Cho", "Noah Craft"], "description": "Recent technological advances have allowed for a proliferation of digital images that may be involved in crimes. Using these images as evidence in legal cases like child pornography and masked gunmen can be challenging because usually the faces of the suspects are not visible. To perform personal identification in these images, we propose a biometric trait composed of a group of skin marks including, but not limited to, nevi, lentigines, cherry hemangiomas, and seborrheic keratoses. Due to their biological characteristics, we have grouped these as \"Relatively Permanent Pigmented or Vascular Skin Marks,\" abbreviated as RPPVSM. As statistical study of RPPVSM is essential before investigating their discriminative power, we present in this paper the fundamental statistics of RPPVSM. Back torso images were collected from 144 Caucasian, Asian, and Latino males, and a researcher trained in dermatology …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 4, 4, 4, 3, 2, 1, 0, 0, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:IjCSPb-OGe4C", "title": "Does eigenpalm work? A system and evaluation perspective", "authors": ["King-Hong Cheung", "Adams Kong", "David Zhang", "Mohamed Kamel", "Jane You"], "description": "Recently, there are keen interests in EigenPalm, which, collectively, refers to those methods that extract palmprint features directly from the appearance by means of principal component analysis (PCA) for (dis)similarity matching. Encouraging results have been reported with the use of EigenPalm. However, we find a different story under a system and evaluation perspective. In this paper, we would like to introduce three issues that should be considered: the effects of templates from two different sessions, the effects of identical twins and the effects of unseen subjects. They are missing in the previous studies of EigenPalm", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 8, 0, 0, 1, 2, 1, 1, 0, 5, 2, 1, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:W5xh706n7nkC", "title": "Transferable adversarial attack based on integrated gradients", "authors": ["Yi Huang", "Adams Wai-Kin Kong"], "description": "The vulnerability of deep neural networks to adversarial examples has drawn tremendous attention from the community. Three approaches, optimizing standard objective functions, exploiting attention maps, and smoothing decision surfaces, are commonly used to craft adversarial examples. By tightly integrating the three approaches, we propose a new and simple algorithm named Transferable Attack based on Integrated Gradients (TAIG) in this paper, which can find highly transferable adversarial examples for black-box attacks. Unlike previous methods using multiple computational terms or combining with other methods, TAIG integrates the three approaches into one single term. Two versions of TAIG that compute their integrated gradients on a straight-line path and a random piecewise linear path are studied. Both versions offer strong transferability and can seamlessly work together with the previous methods. Experimental results demonstrate that TAIG outperforms the state-of-the-art methods. The code will available at https://github.com/yihuang2016/TAIG", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [5, 18, 0]}, "topic": "Adversarial Attack", "agg_topic": "Reinforcement Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:dTyEYWd-f8wC", "title": "Probabilistic deep ordinal regression based on gaussian processes", "authors": ["Yanzhu Liu", "Fan Wang", "Adams Wai Kin Kong"], "description": "With excellent representation power for complex data, deep neural networks (DNNs) based approaches are state-of-the-art for ordinal regression problem which aims to classify instances into ordinal categories. However, DNNs are not able to capture uncertainties and produce probabilistic interpretations. As a probabilistic model, Gaussian Processes (GPs) on the other hand offers uncertainty information, which is nonetheless lack of scalability for large datasets. This paper adapts traditional GPs regression for ordinal regression problem by using both conjugate and non-conjugate ordinal likelihood. Based on that, it proposes a deep neural network with a GPs layer on the top, which is trained end-to-end by the stochastic gradient descent method for both neural network parameters and GPs parameters. The parameters in the ordinal likelihood function are learned as neural network parameters so that the proposed framework is able to produce fitted likelihood functions for training sets and make probabilistic predictions for test points. Experimental results on three real-world benchmarks--image aesthetics rating, historical image grading and age group estimation--demonstrate that in terms of mean absolute error, the proposed approach outperforms state-of-the-art ordinal regression approaches and provides the confidence for predictions.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 4, 8, 9, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:8k81kl-MbHgC", "title": "Using a knowledge-based approach to remove blocking artifacts in skin images for forensic analysis", "authors": ["Chaoying Tang", "Adams Wai-Kin Kong", "Noah Craft"], "description": "Identifying individuals in evidence images, where their faces are covered or obstructed, is a challenging task. In the legal case, United States v. Michael Joseph Pepe (2008), Craft and Kong, who served as expert witnesses, used pigmented skin marks to identify a suspect in evidence images. Their expert opinions were challenged, partially because the blocking artifacts generated by the standard JPEG algorithm adversely affect the visibility of the small skin marks. In addition to this case, a huge amount of JPEG-compressed child pornography is posted online every day. Although many methods have been developed to remove blocking artifacts, they are ineffective for our target application. In this paper, a knowledge-based (KB) approach, which simultaneously removes JPEG blocking artifacts, and recovers skin features, is proposed. Given a training set containing both original and compressed skin images, the …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 4, 3, 5, 1, 4, 2, 3, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:V3AGJWp-ZtQC", "title": "Using object information for spotting text", "authors": ["Shitala Prasad", "Adams Wai Kin Kong"], "description": "Text spotting, also called text detection, is a challenging computer vision task because of cluttered backgrounds, diverse imaging environments, various text sizes and similarity between some objects and characters, eg, tyre and’o’. However, text spotting is a vital step in numerous AI and computer vision systems, such as autonomous robots and systems for visually impaired. Due to its potential applications and commercial values, researchers have proposed various deep architectures and methods for text spotting. These methods and architectures concentrate only on text in images, but neglect other information related to text. There exists a strong relationship between certain objects and the presence of text, such as signboards or the absence of text, such as trees. In this paper, a text spotting algorithm based on text and object dependency is proposed. The proposed algorithm consists of two sub-convolutional neural networks and three training stages. For this study, a new NTU-UTOI dataset containing over 22k non-synthetic images with 277k bounding boxes for text and 42 text-related object classes is established. According to our best knowledge, it is the second largest non-synthetic text image database. Experimental results on three benchmark datasets with clutter backgrounds, COCO-Text, MSRA-TD500 and SVT show that the proposed algorithm provides comparable performance to state-of-the-art text spotting methods. Experiments are also performed on our newly established dataset to investigate the effectiveness of object information for text spotting. The experimental results indicate that the object information contributes significantly …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 7, 5, 4, 2, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:WF5omc3nYNoC", "title": "An analysis of Gabor detection", "authors": ["Adams Wai-Kin Kong"], "description": "An elementary function that is now commonly referred to Gabor function, Gabor filter and Gabor wavelet was derived from uncertainty relation for information by Gabor to overcome the representation limit of Fourier analysis. Analyzing a signal by a Gabor filter in terms of convolution or spatial filtering, two pieces of information—phase and magnitude—can be obtained. In the paper, Gabor filter is considered as a Gabor atom detector. This analysis demonstrates that when the k-value defined as k = ∥ g  ni  ∥ 2 / ∥ g  nr  ∥ 2, where g  nr  and g  ni  are respectively the real and imaginary parts of a Gabor filter g  n , is close to one, the target phase can be estimated by Gabor phase and the target magnitude can be estimated by Gabor magnitude. However, when …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 2, 2, 2, 5, 1, 1, 2, 0, 0, 2, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:u_35RYKgDlwC", "title": "On criminal identification in color skin images using skin marks (RPPVSM) and fusion with inferred vein patterns", "authors": ["Arfika Nurhudatiana", "Adams Wai-Kin Kong"], "description": "Relatively Permanent Pigmented or Vascular Skin Marks (RPPVSM) were recently introduced as a biometric trait for identification in the cases in which the evidence images show only the nonfacial body parts of the criminals or victims, such as in child sexual abuse and riots. As manual RPPVSM identification is tiring and time-consuming, an automated RPPVSM identification system is proposed in this paper. The system comprises skin segmentation, RPPVSM detection, and RPPVSM matching algorithms. The system was evaluated on 1,200 back images collected from 283 Asian and Caucasian subjects in varying pose and viewpoint conditions. The system achieved rank-1 and rank-10 identification accuracies of 76.79% and 88.97%, respectively, higher than the identification accuracies given by existing skin mark detection methods previously proposed for face recognition systems. To handle identification with …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 5, 5, 2, 2, 2, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:LkGwnXOMwfcC", "title": "A Study of identical twins’ palmprints for personal authentication", "authors": ["Adams Kong", "David Zhang", "Guangming Lu"], "description": "Biometric recognition based on human characteristics for personal identification has attracted great attention. The performance of biometric systems highly depends on the distinctive information in the biometrics. However, identical twins having the closest genetics-based relationship are expected to have maximum similarity between their biometrics. Classifying identical twins is a challenging problem for some automatic biometric systems. In this paper, we summarize the exiting experimental results about identical twins’ biometrics including face, iris, fingerprint and voice. Then, we systemically examine identical twins’ palmprints. The experimental results show that we can employ low-resolution palmprint images to distinguish identical twins.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 1, 1, 3, 0, 1, 2, 0, 2, 0, 3, 0, 4, 0, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:UebtZRa9Y70C", "title": "Palmprint authentication system for civil applications", "authors": ["David Zhang", "Guangming Lu", "Adams Wai-Kin Kong", "Michael Wong"], "description": "In this paper, we present a novel biometric authentication system to identify a person’s identity by his/her palmprint. In contrast to existing palmprint systems for criminal applications, the proposed system targets at the civil applications, which require identifying a person in a large database with high confidence in real-time. The system is constituted by four major components: User Interface Module, Acquisition Module, Recognition Module and External Module. More than 7,000 palmprint images have been collected to test the performance of the system. The system can identify 400 palms with a low false acceptance rate, 0.02%, and a high genuine acceptance rate, 98.83%. For verification, the system can operate at a false acceptance rate, 0.017% and a false rejection rate, 0.86%. The execution time for the whole process including image collection, preprocessing, feature extraction and matching is less than …", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 1, 0, 2, 0, 2, 0, 1, 6, 2, 0, 1, 1, 0, 2, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:eMMeJKvmdy0C", "title": "Giant panda face recognition using small dataset", "authors": ["Wojciech Michal Matkowski", "Adams Wai Kin Kong", "Han Su", "Peng Chen", "Rong Hou", "Zhihe Zhang"], "description": "Giant panda (panda) is a highly endangered animal. Significant efforts and resources have been put on panda conservation. To measure effectiveness of conservation schemes, estimating its population size in wild is an important task. The current population estimation approaches, including capture-recapture, human visual identification and collection of DNA from hair or feces, are invasive, subjective, costly or even dangerous to the workers who perform these tasks in wild. Cameras have been widely installed in the regions where pandas live. It opens a new possibility for non-invasive image based panda recognition. Panda face recognition is naturally a small dataset problem, because of the number of pandas in the world and the number of qualified images captured by the cameras in each encounter. In this paper, a panda face recognition algorithm, which includes alignment, large feature set extraction and …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 5, 3, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:abG-DnoFyZgC", "title": "Using multiple models to uncover blood vessel patterns in color images for forensic analysis", "authors": ["Chaoying Tang", "Hengyi Zhang", "Adams Wai-Kin Kong"], "description": "With the proliferation of digital cameras, images of crimes, such as child sexual abuse images, are increasing dramatically. Both verification and identification of criminals and victims in these images are highly difficult and often impossible for the current biometric technology because their faces, tattoos, and distinctive skin mark patterns are not always observable. Superficial blood vessels under skin are a potential solution to compensate the weaknesses of the traditional biometric traits. However, blood vessels were neglected by law enforcement agencies because they are generally invisible in color images. To use blood vessel patterns in forensic analysis, this paper proposes three computational models to uncover hidden patterns, two optimization schemes to handle illumination variations and prevent over-relying on biophysical parameters measured in ideal medical conditions, a matching algorithm to …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 2, 2, 3, 3, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:a0OBvERweLwC", "title": "A study of similarity between genetically identical body vein patterns", "authors": ["Hengyi Zhang", "Chaoying Tang", "Xiaojie Li", "Adams Wai Kin Kong"], "description": "Vein patterns have been used in commercial biometric systems for many years and are recently considered for criminal authentication. Understanding the similarity between genetically identical vein patterns is important, especially when using them in legal cases involving identical twins. Vein patterns sharing the same Deoxyribonucleic acid (DNA) sequence are generally regarded as vein patterns with maximum similarity. If they are completely distinguishable, it implies that the uniqueness of vein patterns is high. Though the genetic dependence of other biometric traits, including fingerprints, faces, palmprints, and irises, have been studied, genetically identical vein patterns have not been studied systematically. With the help of an automatic vein pattern matching algorithm, this paper analyzes and measures the similarity between genetically identical vein patterns. 234 genetically identical forearm pairs and 204 …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 1, 4, 1, 2, 3, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:ufrVoPGSRksC", "title": "Online palmprint identification system for civil applications", "authors": ["David Zhang", "Guang-Ming Lu", "Adams Wai-Kin Kong", "Michael Wong"], "description": "In this paper, a novel biometric identification system is presented to identify a person’s identity by his/her palmprint. In contrast to existing palmprint systems for criminal applications, the proposed system targets at the civil applications, which require identifying a person in a large database with high accuracy in real-time. The system is constituted by four major components: User Interface Module, Acquisition Module, Recognition Module and External Module. More than 7,000 palmprint images have been collected to test the performance of the system. The system can identify 400 palms with a low false acceptance rate, 0.02%, and a high genuine acceptance rate, 98.83%. For verification, the system can operate at a false acceptance rate, 0.017% and a false rejection rate, 0.86%. The execution time for the whole process including image collection, preprocessing, feature extraction and matching is less than 1 …", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 2, 2, 2, 1, 1, 1, 1, 0, 0, 1, 2, 0, 1, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Tiz5es2fbqcC", "title": "Tattoo detection based on CNN and remarks on the NIST database", "authors": ["Qingyong Xu", "Soham Ghosh", "Xingpeng Xu", "Yi Huang", "Adams Wai Kin Kong"], "description": "Detecting tattoo images stored in information technology (IT) devices of suspects is an important but challenging task for law enforcement agencies. Recently, the U.S. National Institute of Standards and Technology (NIST) held a challenge and released a tattoo database for the commercial and academic community in advancing research and development into automated image-based tattoo recognition technology. The best tattoo detection result in the NIST challenge was achieved by MorphoTrak with accuracy of 96.3%. This paper aims to answer three questions. 1) Is the NIST database suitable for training algorithms to detect tattoo images stored in IT devices of suspects? 2) Can convolutional neural networks (CNNs) outperform the MorphoTrak's algorithm? 3) How do training databases impact on tattoo detection performance? The NIST tattoo detection database containing 2,349 images and a database …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 4, 4, 1, 1, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Y5dfb0dijaUC", "title": "A study on wrist identification for forensic investigation", "authors": ["Wojciech Michal Matkowski", "Frodo Kin Sun Chan", "Adams Wai Kin Kong"], "description": "Criminal and victim identification based on crime scene images is an important part of forensic investigation. Criminals usually avoid identification by covering their faces and tattoos in the evidence images, which are taken in uncontrolled environments. Existing identification methods, which make use of biometric traits, such as vein, skin mark, height, skin colour, weight, race, etc., are considered for solving this problem. The soft biometric traits, including skin colour, gender, height, weight and race, provide useful information but not distinctive enough. Veins and skin marks are limited to high resolution images and some body sites may neither have enough skin marks nor clear veins. Terrorists and rioters tend to expose their wrists in a gesture of triumph, greeting or salute, while paedophiles usually show them when touching victims. However, wrists were neglected by the biometric community for forensic …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 4, 4, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:tOudhMTPpwUC", "title": "Using a CNN ensemble for detecting pornographic and upskirt images", "authors": ["Yi Huang", "Adams Wai Kin Kong"], "description": "The recent popularity of smartphones causes significant increase of upskirt filming cases in many countries and regions. To search upskirt images in suspects' IT devices and block them on social media, an effective detector is demanded, but it is neglected by both academic and commercial communities. Three commercial pornographic image detectors and one detector distributed by the U.S. National Institute of Justice are first examined on upskirt images. They classify 24.56%-41.90% of the testing upskirt images as pornographic images and the rest as normal images. These results imply that the detectors cannot be used to search upskirt images. To effectively use unbalanced training data, a convolution neural network (CNN) ensemble is proposed for classifying pornographic, upskirt and normal images. Training images for this classification problem are always unbalanced, because pornographic and normal …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 1, 5, 1, 1, 4, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:zA6iFVUQeVQC", "title": "Using leg geometry to align androgenic hair patterns in low resolution images for criminal and victim identification", "authors": ["Frodo Kin-Sun Chan", "Adams Wai-Kin Kong"], "description": "Identifying criminals and victims in digital media can be very challenging when neither their faces nor tattoos are observable. These criminals and victims can be masked gunmen, paedophiles, and victims in child pornographic images. Though skin marks and blood vessel patterns hidden in color images have been proposed to address this problem, they have different limitations. Blood vessel patterns are not suitable for subjects with high concentration of body fat or melanin and skin marks are not suitable for the cases where only low resolution images are available. A recent paper pointed out that androgenic hair, which is also called body hair, and its follicles can be used as biometric traits and demonstrated that androgenic hair patterns in low resolution images are effective for personal identification. In that study, viewpoint and pose variations were ignored, but these variations are unavoidable in real cases. To …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 4, 3, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:geHnlv5EZngC", "title": "A study of distinctiveness of skin texture for forensic applications through comparison with blood vessels", "authors": ["Frodo Kin Sun Chan", "Xiaojie Li", "Adams Wai-Kin Kong"], "description": "Skin texture without obvious features is different from other hard biometrics on the skin, such as fingerprints and palmprints. Skin texture gives an impression that it is not distinctive like other soft biometric traits. It was proposed for personal identification a decade ago but did not draw attention from the biometric community, partially due to the success of other biometric technologies for commercial applications. However, in some forensic cases, e.g., identifying masked terrorists in images, skin texture may be the only option. Faces, tattoos, and skin marks are not always available for identification. To address these forensic needs, researchers have recently attempted to visualize blood vessels hidden in color images. Their performance is highly sensitive to image quality. Skin texture that is easily captured even in low-resolution images, such as that of the forearm skin, is suitable for these forensic applications. To study …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 2, 3, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:xtRiw3GOFMkC", "title": "Using hair follicles with leg geometry to align androgenic hair patterns", "authors": ["Frodo Kin Sun Chan", "Adams Wai-Kin Kong"], "description": "Identifying criminals and victims, including but not limited to masked gunmen, rioters, paedophiles, and victims of sexual offenses in digital images can be a challenging forensic task because often, neither their faces nor tattoos are observable. Though skin marks and vein patterns provide new ways to identify them, new biometric traits are still demanded because skin marks on some subjects are limited and clear vein patterns are difficult to be obtained from people with high concentration of body fat or melanin. They can be covered by androgenic hair. A recent paper indicated that androgenic hair patterns extracted from lower legs can be used for personal identification and demonstrated their effectiveness. However, it neglected the importance of alignment before matching two patterns. To alleviate this alignment problem, leg geometry was proposed for low resolution androgenic hair patterns. For aligning …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 2, 3, 0, 0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:0EnyYjriUFMC", "title": "IrisCode decompression based on the dependence between its bit pairs", "authors": ["Adams Wai Kin Kong"], "description": "IrisCode is an iris recognition algorithm developed in 1993 and continuously improved by Daugman. Understanding IrisCode's properties is extremely important because over 60 million people have been mathematically enrolled by the algorithm. In this paper, IrisCode is proved to be a compression algorithm, which is to say its templates are compressed iris images. In our experiments, the compression ratio of these images is 1:655. An algorithm is designed to perform this decompression by exploiting a graph composed of the bit pairs in IrisCode, prior knowledge from iris image databases, and the theoretical results. To remove artifacts, two postprocessing techniques that carry out optimization in the Fourier domain are developed. Decompressed iris images obtained from two public iris image databases are evaluated by visual comparison, two objective image quality assessment metrics, and eight iris recognition …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 4, 2, 0, 0, 1, 0, 0, 0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:NJ774b8OgUMC", "title": "An image inpainting approach to short-term load forecasting", "authors": ["Yanzhu Liu", "Shreya Dutta", "Adams Wai Kin Kong", "Chai Kiat Yeo"], "description": "In current power systems, electrical energy is generated whenever there is a demand for it. Therefore, load forecasting, which estimates the active load in advance, is imperative for power system planning and operations. Based on the time horizon, load forecasting is classified as very short-term (below one day), short-term (a day to two weeks), medium-term (two weeks to three years) and long-term (over three years). This paper focuses on the short-term forecasting. The complex multi-level seasonality of load series (e.g., the load in a given hour is not only dependent on load in the previous hour, but also on the previous day.s load in the same hour, and on the previous week's load in the same day-of-the-week and hour) makes this task challenging, especially when the load data is represented in 1d numerical series. However, in multi-channel images, the patterns in spatial neighbourhood of one channel and the …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [4, 7, 0]}, "topic": "Image Processing", "agg_topic": "Computer Vision", "final_topic": "Computer Scienc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:cFHS6HbyZ2cC", "title": "A preliminary report on a full-body imaging system for effectively collecting and processing biometric traits of prisoners", "authors": ["Nhat Quang Huynh", "Xingpeng Xu", "Adams Wai Kin Kong", "Sathyan Subbiah"], "description": "Because of recent advances in imaging technology, the use of image-based evidences, such as faces and tattoos, is increasing dramatically. Face and tattoo images of prisoners are collected regularly for suspect image database establishment. New biometric traits such as skin marks, androgenic hairs, and blood vessels hidden in color images are getting more attention because they are shown to be useful for criminal and victim identification, especially when their faces and tattoos are neither observable nor available. The current manual approach of collecting images of prisoners is extremely time consuming and does not record these new biometric traits. To address this problem, an unprecedented full-body imaging system is developed. Furthermore, an automatic and systematic routine based on the system for effectively collecting prisoners' images is proposed. This paper concentrates on the system hardware …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 1, 2, 1, 0, 1, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:M05iB0D1s5AC", "title": "A statistical analysis of IrisCode and its security implications", "authors": ["Adams Wai-Kin Kong"], "description": "IrisCode has been used to gather iris data for 430 million people. Because of the huge impact of IrisCode, it is vital that it is completely understood. This paper first studies the relationship between bit probabilities and a mean of iris images (The mean of iris images is defined as the average of independent iris images.) and then uses the Chi-square statistic, the correlation coefficient and a resampling algorithm to detect statistical dependence between bits. The results show that the statistical dependence forms a graph with a sparse and structural adjacency matrix. A comparison of this graph with a graph whose edges are defined by the inner product of the Gabor filters that produce IrisCodes shows that partial statistical dependence is induced by the filters and propagates through the graph. Using this statistical information, the security risk associated with two patented template protection schemes that have been …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 4, 0, 3, 0, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:NaGl4SEjCO4C", "title": "Automated identification of relatively permanent pigmented or vascular skin marks (RPPVSM)", "authors": ["Arfika Nurhudatiana", "Adams Wai-Kin Kong", "Lisa Altieri", "Noah Craft"], "description": "In cases of child pornography and child sexual abuse, criminals are usually careful to hide or cover their faces and tattoos, thus making identification difficult. However, naturally occurring skin marks can be observed in close-up views of their back, chest, or thighs, which are usually present in evidence images. Recently, a group of skin marks named Relatively Permanent Pigmented or Vascular Skin Marks (RPPVSM) was proposed as a biometric trait for identification. Manual RPPVSM identification can be tiring and time consuming. We propose in this paper an automated RPPVSM identification system, which is composed of RPPVSM detection and matching algorithms. Three learning-based detection algorithms were developed to automatically detect RPPVSMs in color images. To evaluate these algorithms, experiments were performed on a database containing 216 back torso images from 118 subjects. The …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 3, 0, 0, 1, 1, 0, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:-_dYPAW6P2MC", "title": "A fully differentiable ligand pose optimization framework guided by deep learning and a traditional scoring function", "authors": ["Zechen Wang", "Liangzhen Zheng", "Sheng Wang", "Mingzhi Lin", "Zhihao Wang", "Adams Wai-Kin Kong", "Yuguang Mu", "Yanjie Wei", "Weifeng Li"], "description": "The recently reported machine learning- or deep learning-based scoring functions (SFs) have shown exciting performance in predicting protein–ligand binding affinities with fruitful application prospects. However, the differentiation between highly similar ligand conformations, including the native binding pose (the global energy minimum state), remains challenging that could greatly enhance the docking. In this work, we propose a fully differentiable, end-to-end framework for ligand pose optimization based on a hybrid SF called DeepRMSD+Vina combined with a multi-layer perceptron (DeepRMSD) and the traditional AutoDock Vina SF. The DeepRMSD+Vina, which combines (1) the root mean square deviation (RMSD) of the docking pose with respect to the native pose and (2) the AutoDock Vina score, is fully differentiable; thus is capable of optimizing the ligand binding pose to the energy-lowest …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [10, 0]}, "topic": "Protein-Ligand Binding Prediction", "agg_topic": "Biomedical Informatic", "final_topic": "Biomedical Informatic"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:kzcrU_BdoSEC", "title": "Automated scoring of vitiligo using superpixel‐generated computerized digital image analysis of clinical photographs: a novel and consistent way to score vitiligo", "authors": ["JJH Toh", "S Bhoi", "VWD Tan", "SY Chuah", "A Jhingan", "AWK Kong", "STG Thng"], "description": "DEAR EDITOR, Objective outcome measures for vitiligo are essential for evaluation of severity and response to treatment. The Vitiligo Area Scoring Index (VASI) is a validated tool to assess the severity of vitiligo. 1, 2 However, estimation of the area and extent of depigmentation in VASI is often subject to much inter-and intraobserver variability. 3 We aimed to develop and validate novel image analysis software designed to calculate, automatically, areas of depigmentation in vitiligo from computer image analysis of clinical photographs, thereby deriving automated VASI scores. The proposed algorithm was developed in collaboration with image analysis experts. It derives the score in three steps. Firstly, the background and undergarments of each image are identified and segmented away using segmentation methods. Next, the images are converted into superpixels using linear spectral clustering. 4 These …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 4, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:rO6llkc54NcC", "title": "A preliminary study of lower leg geometry as a soft biometric trait for forensic investigation", "authors": ["Md Rabiul Islam", "Frodo Kin-Sun Chan", "Adams Wai-Kin Kong"], "description": "Criminal and victim identification is always vital in forensic investigation. Many biometric traits, such as DNA, fingerprint, face and palm print, have been regularly used by law enforcement agencies. However, they are not applicable to legal cases where only non-facial body sites of criminals or victims in evidence images are available for identification. These cases include but are not limited to violent protests, masked gunmen and child pornography. To address this challenging identification problem, skin marks, blood vessels hidden in color images, androgenic hair patterns and tattoos have been considered. Tattoos are not always available. Skin marks and blood vessels are suitable for high resolution images. Androgenic hair patterns provide useful identification information even in low resolution images, but their performance is still far from perfect. Thus, new biometric traits are still demanded especially for low …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 4, 2, 2, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:3s1wT3WcHBgC", "title": "Vein pattern visualization through multiple mapping models and local parameter estimation for forensic investigation", "authors": ["Hamid Reza Sharifzadeh", "Hengyi Zhang", "Adams Wai-Kin Kong"], "description": "Forensic investigation methods based on some human traits, including fingerprint, face, and palm print, have been developed significantly, but some major aspects of particular crimes such as child pornography still lack of notable research efforts. Unlike common forensic identification methods, techniques for identifying criminals in child pornographic images should be developed based on partial non-facial skin observable in the images because criminals always hide their faces. Few methods published recently have shown the potential of vein patterns visualized from color images as a criminal and victim identification tool. However, these methods have two weaknesses: 1) they use single model to visualize vein patterns hidden in color images, which neglects the diversity of skin properties and 2) even though their parameters are determined automatically by an optimization, they do not adapt to fit local image …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 2, 2, 2, 0, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:k_IJM867U9cC", "title": "Visualizing vein patterns from color skin images based on image mapping for forensics analysis", "authors": ["Chaoying Tang", "Hengyi Zhang", "Adams Wai-Kin Kong", "Noah Craft"], "description": "Traditionally, it was difficult to use vein patterns in evidence images for forensic identification, because they were nearly invisible in color images. We proposed a computational method based on skin optics to uncover vein patterns from color images. However, its performance is dependent on the accuracy of the skin optical model. In this paper, we propose an algorithm based on image mapping to visualize vein patterns. It extracts information from a pair of synchronized color and near infrared (NIR) images, and uses a neural network (NN) to map RGB values to NIR intensities. In addition, an NN weight adjustment scheme is proposed to improve the robustness of the algorithm. The proposed algorithm was examined on a database with 300 pairs of color and NIR images collected from the forearms of 150 subjects. The automatic matching results from the proposed algorithm were better than those from our previous …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 1, 1, 0, 0, 2, 1, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:UHK10RUVsp4C", "title": "Giant panda behaviour recognition using images", "authors": ["Pranjal Swarup", "Peng Chen", "Rong Hou", "Pinjia Que", "Peng Liu", "Adams Wai Kin Kong"], "description": "Monitoring giant panda (Ailuropoda melanoleuca) behaviour is critical for their conservation and understanding their health conditions. Currently, captive giant panda behaviour is usually monitored by their caregivers. In previous studies, researchers observed panda behaviours for short time spans over a period. However, both caregivers and researchers cannot monitor them 24-h using traditional methods of observation. In other words, animal behaviour data are difficult to collect over long periods and are prone to errors when recorded manually. Some researchers have used wearable devices such as accelerometer ear tags and collar-mounted units with a global position system (GPS) receiver and contactless devices such as depth cameras and video cameras for understanding behaviour of other animals such as primates and American white pelicans. However, the giant panda, an icon of endangered species …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:PELIpwtuRlgC", "title": "Adversarial Signboard against Object Detector.", "authors": ["Yi Huang", "Adams Wai-Kin Kong", "Kwok-Yan Lam"], "description": "Object detector is an indispensable component in many computer vision and artificial intelligence systems, such as autonomous robot and image analyzer for profiling social media users. Analyzing its vulnerabilities is essential for detecting and preventing attacks and minimizing potential loss. Researchers have proposed a number of adversarial examples to evaluate the robustness of object detectors. All these adversarial examples change pixels inside target objects to carry out attacks but only some of them are suitable for physical attacks. According to the best knowledge of the authors, no published work successfully attacks object detector without changing pixels inside the target object. In an unpublished work, the authors designed an adversarial border which tightly surrounds target object and successfully misleads Faster R-CNN and YOLOv3 digitally and physically. Adversarial border does not change pixels inside target object but makes it look weird. In this paper, a new adversarial example named adversarial signboard, which looks like a signboard, is proposed. By putting it below a target object, it can mislead the state-of-the-art object detectors. Using stop sign as a target object, adversarial signboard is evaluated on 48 videos with totally 5416 frames. The experimental results show that adversarial signboard derived from Faster R-CNN with ResNet-101 as a backbone network can mislead Faster R-CNN with a different backbone network, Mask R-CNN, YOLOv3 and R-FCN digitally and physically.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 3, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:UxriW0iASnsC", "title": "The impact of tattoo segmentation on the performance of tattoo matching", "authors": ["Huang Yi", "Peicong Yu", "Xingpeng Xu", "Adams Wai Kin Kong"], "description": "Tattoos are an important trait for criminal and victim identification and have been widely used by law enforcement agencies around the world. To facilitate it, tattoo images of prisoners, gangsters and other suspects are collected regularly. Up until now, these tattoo images are still manually annotated by law enforcement officers and text-based searching is used to retrieve tattoos of criminals and victims. Researchers have applied image-based matching methods to tattoos. Tattoo images collected from prisoners and crime scenes always include background and body sites other than tattoos. The aim of this paper is to evaluate how these non-tattoo regions impact on the performance of the image based matching methods. In this paper, SIFT and SURF are used as the matching methods. Four experimental settings are designed and over 4000 tattoo images are used in this evaluation. The experimental results pinpoint …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 1, 3, 1, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:r0BpntZqJG4C", "title": "Modeling IrisCode and its variants as convex polyhedral cones and its security implications", "authors": ["Adams Wai-Kin Kong"], "description": "IrisCode, developed by Daugman, in 1993, is the most influential iris recognition algorithm. A thorough understanding of IrisCode is essential, because over 100 million persons have been enrolled by this algorithm and many biometric personal identification and template protection methods have been developed based on IrisCode. This paper indicates that a template produced by IrisCode or its variants is a convex polyhedral cone in a hyperspace. Its central ray, being a rough representation of the original biometric signal, can be computed by a simple algorithm, which can often be implemented in one Matlab command line. The central ray is an expected ray and also an optimal ray of an objective function on a group of distributions. This algorithm is derived from geometric properties of a convex polyhedral cone but does not rely on any prior knowledge (e.g., iris images). The experimental results show that …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 5, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:aqlVkmm33-oC", "title": "A study of aggregated 2D Gabor features on appearance-based face recognition", "authors": ["King-Hong Cheung", "Jane You", "Wai-Kin Kong", "David Zhang"], "description": "Existing approaches to holistic appearance based face recognition require a high dimensional feature space to attain fruitful performance. We have proposed a relatively low feature dimensional scheme to deal with the face recognition problem. We use the aggregated responses of 2D Gabor filters to represent face images. We have investigated the effect of \"duplicate\" images and the effect of facial expressions. Our results show that the proposed method is more robust than the PCA-based method under varying facial expressions, especially in recognizing \"duplicate\" images.", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 1, 2, 2, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Fu2w8maKXqMC", "title": "Deep multimodal sequence fusion by regularized expressive representation distillation", "authors": ["Xiaobao Guo", "Wai-Kin Adams Kong", "Alex C Kot"], "description": "Multimodal sequence learning aims to utilize information from different modalities to enhance overall performance. Mainstream works often follow an intermediate-fusion pipeline, which explores both modality-specific and modality-supplementary information for fusion. However, the unaligned and heterogeneously distributed multimodal sequences pose significant challenges to the fusion task: 1) to extract both effective unimodal and crossmodal representations and 2) to overcome the overfitting issue in joint multimodal sequence optimization. In this work, we propose regularized expressive representation distillation (RERD) that aims to seek effective multimodal representations and to enhance the generalization of fusion. First, to improve unimodal representation learning, unimodal representations are assigned to multi-head distillation encoders, where the unimodal representations are iteratively updated through …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [2, 6, 0]}, "topic": "Multimodal Sequence Learning", "agg_topic": "Biomedical Informatic", "final_topic": "Biomedical Informatic"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:LPZeul_q3PIC", "title": "A further study of low resolution androgenic hair patterns as a soft biometric trait", "authors": ["Frodo Kin Sun Chan", "Adams Wai Kin Kong"], "description": "Soft biometric traits such as skin color, tattoos, shoe size, height, and weight have been regularly used for forensic investigation, especially when hard biometric traits, e.g., faces and fingerprints are not available. Recently, a new soft biometric trait, androgenic hair also called body hair, was evaluated. The previous study showed that low resolution androgenic hair patterns have potential for forensic investigation. However, it was believed that they are not a distinctive biometric trait because of the reported accuracy. To explore discriminative information in androgenic hair patterns, in this paper, a new algorithm, which makes use of leg geometry to align lower leg images, large feature sets (about 60,000 features) extracted through multi-directional grid systems to increase discriminative power and robustness, and class-specific partial least squares (PLS) models to utilize the features effectively, is employed. To further …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 1, 1, 1, 0, 2]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:-f6ydRqryjwC", "title": "An anatomy of IrisCode for precise phase representation", "authors": ["Adams Kong", "David Zhang", "Mohamed Kamel"], "description": "IrisCode, a widely deployed iris recognition algorithm, developed in 1993 and continuously modified by Daugman has attracted considerable attentions. IrisCode using a coarse phase representation has number of properties such as rapid matching, binomial imposter distribution and predictable false acceptance rate. Although many similar coding methods have been developed for irises and palmprintgs based on IrisCode, a theoretical analysis of IrisCode has not been provided. In this paper, we aim at studying (1) the nature of IrisCode, (2) the property of the phase of Gabor function, (3) the extension of bitwise Hamming distance and (4) the theoretical foundation of the binomial imposter distribution and extending the coarse phase representation to a precise phase representation. Precisely, we demonstrate that IrisCode is a clustering algorithm with four prototypes; the locus of a Gabor function is a two …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 3, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:5ugPr518TE4C", "title": "d. Zhang and G. Lu,“A study of identical twins palm print for personal verification”", "authors": ["A Kong"], "description": null, "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 0, 3, 0, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:_FxGoFyzp5QC", "title": "Palmprint authentication technologies, systems and applications", "authors": ["David Zhang", "Guangming Lu", "Adams Wai-Kin Kong", "Michael Wong"], "description": "This paper presents a novel personal authentication system using palmprints.The technology uses the unique information extracted from palmprints (such as principal lines, wrinkles, and textures) during the authentication process to eliminate possible frauds that cannot be avoided by traditional methods (using password or cards). The uniqueness of features and robustness of algorithm make the system far superior to existing biometric systems. This paper first presents the system architecture construction and the algorithm design. Being a robust and reliable system, it was tested by more than 8,000 palmprint images with very low false acceptance rate (0.02%), and a relative high genuine acceptance rate (98.83%). The whole process time for once authentication is less than 1 second. Finally some possible applications are discussed which could be benefited by using palmprint technology.", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 3, 0, 1, 2, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:uJ-U7cs_P_0C", "title": "Pure transformer with integrated experts for scene text recognition", "authors": ["Yew Lee Tan", "Adams Wai-Kin Kong", "Jung-Jae Kim"], "description": "Scene text recognition (STR) involves the task of reading text in cropped images of natural scenes. Conventional models in STR employ convolutional neural network (CNN) followed by recurrent neural network in an encoder-decoder framework. In recent times, the transformer architecture is being widely adopted in STR as it shows strong capability in capturing long-term dependency which appears to be prominent in scene text images. Many researchers utilized transformer as part of a hybrid CNN-transformer encoder, often followed by a transformer decoder. However, such methods only make use of the long-term dependency mid-way through the encoding process. Although the vision transformer (ViT) is able to capture such dependency at an early stage, its utilization remains largely unexploited in STR. This work proposes the use of a transformer-only model as a simple baseline which outperforms hybrid CNN …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 7, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:dQ2og3OwTAUC", "title": "Segmenting vitiligo on clinical face images using CNN trained on synthetic and internet images", "authors": ["LI Yanling", "Adams Wai-Kin Kong", "Steven Thng"], "description": "Accurately diagnosing and describing the severity of vitiligo is crucial for prognostication, treatment selection and comparison. Currently, disease severity scores require dermatologists to estimate percentage area of involvement, which is subjected to inter and intra-assessor variability. Previous studies focus on pure skin but vitiligo on the face, which has a more serious impact on patients' quality of life, was completely neglected. Convolutional neural networks (CNNs) have good performance on many segmentation tasks. However, due to data privacy, it is hard to have a large clinical vitiligo face image dataset to train a CNN. To address this challenge, images from two different sources, the Internet and the proposed vitiligo face synthesis algorithm, are employed in training. 843 vitiligo images taken from different viewpoints were collected from the Internet. These images are hugely different from the target clinical images …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 5, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:VL0QpB8kHFEC", "title": "Gender and ethnicity classification based on palmprint and palmar hand images from uncontrolled environment", "authors": ["Wojciech Michal Matkowski", "Adams Wai Kin Kong"], "description": "Soft biometric attributes such as gender, ethnicity or age may provide useful information for biometrics and forensics applications. Researchers used, e.g., face, gait, iris, and hand, etc. to classify such attributes. Even though hand has been widely studied for biometric recognition, relatively less attention has been given to soft biometrics from hand. Previous studies of soft biometrics based on hand images focused on gender and well-controlled imaging environment. In this paper, the gender and ethnicity classification in uncontrolled environment are considered. Gender and ethnicity labels are collected and provided for subjects in a publicly available database, which contains hand images from the Internet. Five deep learning models are fine-tuned and evaluated in gender and ethnicity classification scenarios based on palmar 1) full hand, 2) segmented hand and 3) palmprint images. The experimental results …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 3, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:_B80troHkn4C", "title": "Attacking object detectors without changing the target object", "authors": ["Yi Huang", "Adams Wai-Kin Kong", "Kwok-Yan Lam"], "description": "Object detectors, such as Faster R-CNN and YOLO, have numerous applications, including in some critical systems, e.g., self-driving cars and unmanned aerial vehicles. Their vulnerabilities have to be studied thoroughly before deploying them in critical systems to avoid irrecoverable loss caused by intentional attacks. Researchers have proposed some methods to craft adversarial examples for studying security risk in object detectors. All these methods require modifying pixels inside target objects. Some modifications are substantial and target objects are significantly distorted. In this paper, an algorithm which derives an adversarial signal placing around the border of target objects to fool objector detectors is proposed. Computationally, the algorithm seeks a border around target objects to mislead Faster R-CNN to produce a very large bounding box and finally decease its confidence to target objects …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:b0M2c_1WBrUC", "title": "Relatively permanent pigmented or vascular skin marks for identification: A pilot reliability study", "authors": ["Arfika Nurhudatiana", "Adams Wai‐Kin Kong", "Noah Craft", "Hong Liang Tey"], "description": "In child sexual exploitation offenses, the collected evidence images often show the skin of nonfacial body parts of the criminals and victims. For identification in this scenario, “relatively permanent pigmented or vascular skin marks,” abbreviated as RPPVSM, were recently introduced as the basis for a novel biometric trait. This pilot study evaluated the interexaminer variability of RPPVSM identification. Four dermatology physicians were recruited to examine RPPVSM from 75 skin images collected from a total of 51 Caucasian and Asian subjects. The images were separated into 50 reference (“suspect”) images and 25 evaluation (“evidence”) images. The examiners were asked to perform identification by annotating RPPVSM in each of the 25 evaluation images and matching them with the reference images. The rate of misidentification was 0% while the mean rate at which examiners failed to find a match was 6 …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 4, 0, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:YsMSGLbcyi4C", "title": "A novel personal authentication system using palmprint technology", "authors": ["David Zhang", "Guangming Lu", "Adams Wai-Kin Kong", "Michael Wong"], "description": "In recent times, an increasing, worldwide effort has been devoted to the development of automatic personal identification systems that can be effective in a wide variety of security contexts. Palmprints have a number of unique advantages: they are rich in features such as principal lines, wrinkles, and textures and these provide stable and distinctive information sufficient for separating an individual from a large population. In this paper, we present a novel biometric authentication system to identify a person’s identity by his/her palmprint. Being a robust and reliable system, it was tested by more than 8,000 palmprint images with very low false acceptance rate (0.02%), and a relative high genuine acceptance rate (98.83%). The whole authentication process is less than 1 second. Finally, some possible applications are discussed which could be benefited by using palmprint technology.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 3, 0, 1, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:2KloaMYe4IUC", "title": "Data considerations for predictive modeling applied to the discovery of bioactive natural products", "authors": ["Hai Tao Xue", "Michael Stanley-Baker", "Adams Wai Kin Kong", "Hoi Leung Li", "Wilson Wen Bin Goh"], "description": "HighlightsNatural products are an important source of therapeutic compounds.Natural product research can benefit greatly from advances in AI.Knowledge integration is a limiting step for natural-product-based drug discovery.Natural products (NPs) constitute a large reserve of bioactive compounds useful for drug development. Recent advances in high-throughput technologies facilitate functional analysis of therapeutic effects and NP-based drug discovery. However, the large amount of generated data is complex and difficult to analyze effectively. This limitation is increasingly surmounted by artificial intelligence (AI) techniques but more needs to be done. Here, we present and discuss two crucial issues limiting NP-AI drug discovery: the first is on knowledge and resource development (data integration) to bridge the gap between NPs and functional or therapeutic effects. The second issue is on NP-AI modeling …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 5, 0]}, "topic": "Bioinformatic", "agg_topic": "Bioinformatic", "final_topic": "Biomedical Informatic"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:4DMP91E08xMC", "title": "Palm print identification using palm line orientation", "authors": null, "description": "A method of biometrics identification involves obtaining an image of a portion of a hand of an individual, said image including a plurality of line features of the hand, analyzing the image to obtain a characteristic value including orientation information of said line features in two or more orientations, and comparing the characteristic value with reference information in a database. The analyze use a neurophysiology-based Gabor.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:M3ejUd6NZC8C", "title": "Eyelash detection model for accurate iris segmentation.", "authors": ["Wai Kin Kong", "David Zhang"], "description": "In this paper, we present a novel eyelash detection model based on three criterions: 1) separable eyelash condition, 2) non-informative condition and 3) connective criterion. The first condition handles separable eyelash and the second condition manages multiple eyelashes. The last criterion avoids misclassification of strong iris texture as a single and separable eyelash. A number of images are selected to evaluate the accuracy and necessity of the eyelash detection model. The results are encouraging.", "publication_year": 2001, "citations_by_year": {"year": [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 3, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:_Re3VWB3Y0AC", "title": "Exploiting the Relationship Between Kendall's Rank Correlation and Cosine Similarity for Attribution Protection", "authors": ["Fan Wang", "Adams Wai Kin Kong"], "description": "Model attributions are important in deep neural networks as they aid practitioners in understanding the models, but recent studies reveal that attributions can be easily perturbed by adding imperceptible noise to the input. The non-differentiable Kendall's rank correlation is a key performance index for attribution protection. In this paper, we first show that the expected Kendall's rank correlation is positively correlated to cosine similarity and then indicate that the direction of attribution is the key to attribution robustness. Based on these findings, we explore the vector space of attribution to explain the shortcomings of attribution defense methods using  norm and propose integrated gradient regularizer (IGR), which maximizes the cosine similarity between natural and perturbed attributions. Our analysis further exposes that IGR encourages neurons with the same activation states for natural samples and the corresponding perturbed samples. Our experiments on different models and datasets confirm our analysis on attribution protection and demonstrate a decent improvement in adversarial robustness.", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [2, 3, 0]}, "topic": "Attribution Protection", "agg_topic": "Cryptography", "final_topic": "Cryptography"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:hkOj_22Ku90C", "title": "Pixel-wise ordinal classification for salient object grading", "authors": ["Yanzhu Liu", "Yanan Wang", "Adams Wai Kin Kong"], "description": "Driven by business intelligence applications for rating attraction of products in shops, a new problem — salient object grading is studied in this paper. In computer vision, plenty of salient object detection approaches have been proposed, while most existing studies detect objects in a binary manner: salient or not. This paper focuses on a new problem setting that requires detecting all salient objects and categorizing them into different salient levels. Based on that, a pixel-wise ordinal classification method is proposed. It consists of a multi-resolution saliency detector which detects and segments objects, an ordinal classifier which grades pixels into different salient levels, and a binary saliency enhancer which sharpens the difference between non-saliency and all other salient levels. Two new image datasets with salient level labels are constructed. Experimental results demonstrate that, on the one hand, the proposed …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [3, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:RYcK_YlVTxYC", "title": "Restoring blood vessel patterns from JPEG compressed skin images for forensic analysis", "authors": ["Xiaojie Li", "Adams Wai-Kin Kong"], "description": "The recent development of forensic methods makes criminal and victim identification based on blood vessel patterns hidden in color images possible. The performance of these methods highly depends on the quality of input images. The JPEG method, being the most popular image compression method, generates blocking artifacts, which seriously degrade image quality and make uncovering blood vessels difficult. This paper proposes an algorithm to restore blood vessel patterns hidden in JPEG compressed skin images. An analysis is first performed to identify critical discrete cosine transform (DCT) coefficients that control the quality of blood vessel patterns. According to the analysis, an algorithm is designed to restore these coefficients by exploiting DCT coefficients in different blocks and channels of JPEG compressed images. A blood vessel pattern matching method and a database with 978 images are …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:IWHjjKOFINEC", "title": "A palmprint authentication system", "authors": ["Guangming Lu", "David Zhang", "Wai Kin Kong", "Michael Wong"], "description": "Biometrics lies in the heart of today’s society. There has been an ever-growing need to automatically authenticate individuals for various applications, such as information confidentiality, homeland security, and computer security. Traditional knowledge-based or token-based personal identification or verification is unreliable, inconvenient, and inefficient. Knowledge-based approaches use “something that you know” to make a personal identification, such as password and personal identity number. Token-based approaches use “something that you have” to make a personal identification, such as passport or ID card. Since those approaches are not based on any inherent attributes of an individual to make the identification, they cannot differentiate between an authorized person and an impostor who fraudulently acquires the “token” or “knowledge” of the authorized person. This is why biometric systems have become …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 2, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:QIV2ME_5wuYC", "title": "Using Low-Resolution Palmprint Images and Texture Analysis for Personal Identification", "authors": ["Wai Kin Kong", "David Zhang"], "description": "Biometrics identification is an emerging technology for solving security problems in our networked society. A new branch of biometric technology, palmprint recognition, whereby the lines and points can be extracted from our palm for personal identification was proposed several years ago [1-6]. In this paper, we implement the feature extraction technique applied to iris recognition [7] on low–resolution palmprint images. A 2-D Gabor filter is used to obtain the texture information and two palmprint images are compared in term of their hamming distance. The experimental results show that our method is effective.", "publication_year": 2002, "citations_by_year": {"year": [2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Mojj43d5GZwC", "title": "Inter‐and intra‐observer agreement in dermatologists’ diagnoses of hyperpigmented facial lesions and development of an algorithm for automated diagnosis", "authors": ["Peicong Yu", "Xiaojie Li", "Yi Huang", "Hong Liang Tey", "Adams Wai Kin Kong", "Tomohiro Hakozaki", "Ankur Purwar"], "description": "Background Hyperpigmentation has varied aetio‐pathologies. Hence, accurate and reproducible diagnosis of the type of hyperpigmentation is essential for effective management. It is typically made clinically by dermatologists but the rate of inter‐ and intra‐observer agreement/variability is unknown. Hyperpigmented facial lesions are extremely common but access to dermatological services is difficult or costly in most countries. Thus, it is desired to evaluate dermatologists’ inter‐ and intra‐observer agreement in the diagnosis and to develop an algorithm for automated diagnosis. Materials and Methods Hyperpigmented lesions on 392 facial images were diagnosed by three experienced dermatologists either jointly or independently, and this process was subsequently repeated for 52 randomly selected images. When there was non‐concordance amongst the dermatologists for the diagnosis, a majority decision …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:WA5NYHcadZ8C", "title": "From the perspective of cnn to adversarial iris images", "authors": ["Yi Huang", "Adams Kong Wai-Kin", "Kwok-Yan Lam"], "description": "IrisCode, the most influential iris recognition algorithm, has been extensively applied in national identity programmes and border controls. Currently over one billion people spanning approximately 170 nationalities have been enrolled in IrisCode. It is vital to thoroughly study this crucial algorithm, especially for issues related to its security. How to generate iris images from its templates is one of such security issues. The existing generation methods can produce images from iris templates and the synthetic images can be used to match other real iris images. However, their quality is very low with obvious artifacts. Considering the feature extraction process of IrisCode as a non-differentiable shallow convolutional neural network and using a differentiable function to approximate its step function, the generation process can be formulated as an unconstrained minimization problem. It can be mathematically proven that the …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 1, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:B3FOqHPlNUQC", "title": "A multi-model restoration algorithm for recovering blood vessels in skin images", "authors": ["Xiaojie Li", "Adams Wai Kin Kong"], "description": "Blood vessels under skin surface have been used as a biometric trait for many years. Traditionally, they are used only in commercial and governmental applications because infrared images are required to capture high quality blood vessels. Recent research results demonstrate that blood vessels can be extracted directly from color images potentially for forensic applications. However, color images taken by consumer cameras are likely compressed by the JPEG compression method. As a result, the quality of the color images is seriously degraded, which makes the blood vessels difficult to be visualized. In this paper, a multi-model restoration algorithm (MMRA) is presented to remove blocking artifacts in JPEG compressed images and restore the lost information. Two mathematical properties in the JPEG compression process are identified and used to design MMRA. MMRA is based on a tailor-made clustering …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:fPk4N6BV_jEC", "title": "Method and apparatus for image generation", "authors": null, "description": "Method and apparatus for image generation from biometric data is disclosed herein. In a described embodiment, the biometric data is in the form of IrisCode and the method comprises constructing a graph of filter responses and bits which define the biometric data; comparing the bits with corresponding bits of reference graphs of a trained database to obtain an optimal graph; updating the filter responses based on the optimal graph; and decompressing the IrisCode based on the updated filter responses to generate an image. The image may be a reconstruction of an original image which is defined by the IrisCode.", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 2, 0, 0, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:9Nmd_mFXekcC", "title": "Biometrics I", "authors": ["Chee Cheun Huang", "Julien Epps", "Ewald Enzinger", "Xuran Zhao", "Nicholas Evans", "Jean-Lue Dugelay", "Xiaojie Li", "Adams Wai-Kin Kong"], "description": "Presents the table of contents/splash page of the proceedings record.", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 1, 1, 2, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:Se3iqnhoufwC", "title": "A knowledge-based algorithm to remove blocking artifacts in skin images for forensic analysis", "authors": ["Chaoying Tang", "Adams Wai-Kin Kong", "Noah Craft"], "description": "Identifying criminals and victims in evidence images, where their faces are covered or obstructed, is a challenging task. In the legal case, United States v. Michael Joseph Pepe (2008), Craft and Kong, who served as expert witnesses, used nevi to identify a pedophile in evidence images. Their expert opinions were challenged, partially because the blocking artifacts generated by the standard JPEG algorithm adversely affected the visibility of the nevi. In addition to this case, a huge amount of JPEG compressed child pornography is posted on-line every day. Although many methods have been proposed to remove blocking artifacts, they are ineffective for our target application. In this paper, a knowledge-based algorithm, which simultaneously removes JPEG blocking artifacts, and recovers skin features, is proposed. Given a training dataset which contains original and compressed skin images, the relationship …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 2, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:qxL8FJ1GzNcC", "title": "A new approach to personal identification in large databases by hierarchical palmprint coding with multi-features", "authors": ["Jane You", "Wai-Kin Kong", "David Zhang", "King Hong Cheung"], "description": "This paper presents a new approach to personal identification using palmprints. To tackle the key issues such as feature extraction, representation, indexing, similarity measurement and fast search for the best match, we propose a hierarchical multi-feature coding scheme to facilitate coarse-to-fine matching for efficient and effective palmprint verification and identification in a large database. In contrast to the existing systems that employ a fixed mechanism for feature extraction and similarity measurement, we extract multiple features and adopt different matching criteria at different levels to achieve high performance by coarse-to-fine guided search. Our experimental results demonstrate the feasibility and effectiveness of the proposed method.", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 3, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:_Ybze24A_UAC", "title": "Power system design optimization for a ferry using hybrid-shaft generators", "authors": ["Thant Zin Oo", "Yan Ren", "Adams Wai-Kin Kong", "Yi Wang", "Xiong Liu"], "description": "Ferry contributing a significant amount of greenhouse gas is one of the critical vessels to be electrified. Designing a power system for a ferry with hybrid-shaft generators is different from designing a power system for other vessels because of its fixed route. More clearly, ferries repeatedly travel between their port of origin and port of destination, and before the next voyage, the battery must be recharged to the initial state so that the optimal energy management scheme can be repeatedly applied. Furthermore, the flexibility of hybrid-shaft generators, which allow more fuel saving, increases design complexity. In this paper, a mixed-integer non-linear programming problem is first formulated, and a power management algorithm with an  initialization  step for fulfilling the battery recharging requirement and a  refinement  step for minimizing the fuel consumption is proposed. The simulation results obtained from data of an …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:ye4kPcJQO24C", "title": "A portrait photo-to-tattoo transform based on digital tattooing", "authors": ["Xingpeng Xu", "Wojciech Michal Matkowski", "Adams Wai Kin Kong"], "description": "Tattooing portraits of loved ones is a popular form of love expression and tribute. Tattooing portraits is complicated and challenging because of detailed facial expressions and unique characters of each person. Currently, it is hard for clients to give clear instructions on tattoo designs to tattooists, because there is no effective way to see a portrait tattoo before putting it on the body. In this paper, an algorithm which transforms a given portrait photo to a portrait tattoo is proposed. It takes a portrait photo, a reference portrait tattoo image, a skin image and a set of parameters as inputs. The portrait photo is the person’s face whom the client wants to put on his/her skin. The reference portrait tattoo image is used to control the color and style of the synthetic portrait tattoo. The skin image is taken from the skin region where the client wants to tattoo. By adjusting the parameters, portrait tattoos with different characteristics can be …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:vRqMK49ujn8C", "title": "Learning from small data: A pairwise approach for ordinal regression", "authors": ["Yanzhu Liu", "Xiaojie Li", "Adams Wai Kin Kong", "Chi Keong Goh"], "description": "Ordinal regression which aims to classify instances into ordinal categories has numerous applications. As a supervised learning problem, a large number of labeled data is needed to train an accurate model, in particular when the number of categories is large. Learning an effective ordinal classifier from a small dataset is a challenging task. This paper proposes a framework to transform the ordinal regression problem to a binary classification problem and then recover the ordinal information from the binary outputs. The labeled instances are paired up to train a binary classifier, and therefore, the number of training points is squared, which alleviates the lack of training points. The transformed binary classification problem is solved by a pairwise SVM method. Experimental results demonstrate that on 12 widely used benchmarks, the proposed method is effective comparing with the state-of-the-art ordinal regression …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 0, 0, 0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:sSrBHYA8nusC", "title": "A geometric-based tattoo retrieval system", "authors": ["Xingpeng Xu", "Adams Wai Kin Kong"], "description": "Various soft biometric traits have been used as hints in forensic investigation. Tattoo, as one of those soft biometric traits, has been used extensively because it is easy to be remembered and described by witnesses and appears very often among criminals and victims. Most of the tattoo retrieval systems currently used in police departments are still text-based systems. They depend on labels tagged on the tattoo images in databases. This manual labelling process is very time consuming and subject to loss of some detailed information, such as the accurate location and the shape of tattoos. These problems can make tattoo retrieval inefficiently and misleading. To address them, a geometric based tattoo retrieval system is developed. It allows witnesses to draw the boundary of a query tattoo and retrieve all the tattoos with similar shape around the particular location. The system comprises a tattoo detection algorithm …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 1, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=20&pagesize=80&citation_for_view=2GfXvbUAAAAJ:XiVPGOgt02cC", "title": "Use of relatively permanent pigmented or vascular skin mark patterns in images for personal identification", "authors": null, "description": "Embodiments include methods, devices, software, and systems for identifying a person based on relatively permanent pigmented or vascular skin mark (RPPVSM) patterns in images. Locations of RPPVSMs in different images of people are point matched, and a correspondence probability that the point matched RPPVSMs are from different people is calculated. Other embodiments are also described. Other embodiments are also described and claimed.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 1, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:EUQCXRtRnyEC", "title": "A fully automatic method for gridding bright field images of bead-based microarrays", "authors": ["Abhik Datta", "Adams Wai-Kin Kong", "Kin-Choong Yow"], "description": "In this paper, a fully automatic method for gridding bright field images of bead-based microarrays is proposed. There have been numerous techniques developed for gridding fluorescence images of traditional spotted microarrays but to our best knowledge, no algorithm has yet been developed for gridding bright field images of bead-based microarrays. The proposed gridding method is designed for automatic quality control during fabrication and assembly of bead-based microarrays. The method begins by estimating the grid parameters using an evolutionary algorithm. This is followed by a grid-fitting step that rigidly aligns an ideal grid with the image. Finally, a grid refinement step deforms the ideal grid to better fit the image. The grid fitting and refinement are performed locally and the final grid is a nonlinear (piecewise affine) grid. To deal with extreme corruptions in the image, the initial grid parameter estimation …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 2, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:j3f4tGmQtD8C", "title": "Use of relatively permanent pigmented or vascular skin mark patterns in images for personal identification", "authors": null, "description": "Embodiments include methods, devices, software, and systems for identifying a person based on relatively permanent pigmented or vascular skin mark (RPPVSM) patterns in images. Locations of RPPVSMs in different images of people are point matched, and a correspondence probability that the point matched RPPVSMs are from different people is calculated. Other embodiments are also described. Other embodiments are also described and claimed.", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 0, 2, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:epqYDVWIO7EC", "title": "TF-ICON: Diffusion-Based Training-Free Cross-Domain Image Composition", "authors": ["Shilin Lu", "Yanzhu Liu", "Adams Wai-Kin Kong"], "description": "Text-driven diffusion models have exhibited impressive generative capabilities, enabling various image editing tasks. In this paper, we propose TF-ICON, a novel Training-Free Image COmpositioN framework that harnesses the power of text-driven diffusion models for cross-domain image-guided composition. This task aims to seamlessly integrate user-provided objects into a specific visual context. Current diffusion-based methods often involve costly instance-based optimization or finetuning of pretrained models on customized datasets, which can potentially undermine their rich prior. In contrast, TF-ICON can leverage off-the-shelf diffusion models to perform cross-domain image-guided composition without requiring additional training, finetuning, or optimization. Moreover, we introduce the exceptional prompt, which contains no information, to facilitate text-driven diffusion models in accurately inverting real images into latent representations, forming the basis for compositing. Our experiments show that equipping Stable Diffusion with the exceptional prompt outperforms state-of-the-art inversion methods on various datasets (CelebA-HQ, COCO, and ImageNet), and that TF-ICON surpasses prior baselines in versatile visual domains. Code is available at https://github. com/Shilin-LU/TF-ICON", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [2, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:5awf1xo2G04C", "title": "A survey on image and video cosegmentation: Methods, challenges and analyses", "authors": ["Yan Ren", "Adams Wai Kin Kong", "Licheng Jiao"], "description": "Image and video cosegmentation is a newly emerging and rapidly progressing area, which aims at delineating common objects at pixel-level from a group of images or a set of videos. Plenty of related works have been published and implemented in varied applications, but there lacks a systematic survey on both image and video cosegmentation. This paper provides a comprehensive overview including the existing methods, applications, and challenges. Specifically, different cosegmentation problem settings are described, the formulation details of the methods are summarized and their potential applications are listed. Moreover, the benchmark datasets and standard evaluation metrics are also given; and the future directions and unsolved challenges are discussed.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:ZuybSZzF8UAC", "title": "Palmprint recognition using realistic animation aided data augmentation", "authors": ["Swarup Pranjal", "Adams Wai Kin Kong"], "description": "In this paper, a palmprint augmentation algorithm based on 3D animation is proposed for enhancing contactless palmprint recognition performance. Contactless palmprint varies in position, orientation and musculoskeletal deformations. As the existing contactless databases are small, they contain only a few such variations of a palm. Popular data augmentation approaches, including translation, rotation and scaling, have been used to increase the dataset size and its diversity, but these methods do not simulate non-linear deformation of the hand. Some researchers have used 3D and computer graphic techniques to generate more data for training deep networks. These techniques are application-specific. The proposed algorithm makes use of a 3D hand model to simulate muscular and skeletal deformations of the hand. The deformations from the 3D model are applied to 2D palmprint images to generate new …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 2, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:kRWSkSYxWN8C", "title": "A meta-recognition based skin marks matching algorithm with feature fusion for forensic identification", "authors": ["Peicong Yu", "Adams Wai-Kin Kong"], "description": "Soft biometrics, such as skin marks, play an important role in forensic identification, for they cannot only supplement hard biometrics to improve the overall identification performance, but may also serve as supportive evidence when hard biometrics is not available. Skin marks are small and difficult to be accurately detected due to different lighting conditions, poses as well as individual variation in their skin marks. In this paper, we propose a meta-recognition based skin marks matching algorithm to address these challenges for forensic identification. The algorithm combines both the geometric information in spatial distribution of skin marks and the appearance information of individual skin mark to establish the correspondence between two images. A multi-level skin marks matching scheme is adopted and fusion of scores is carried out at different levels using a meta-recognition method. The experimental results …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 1, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:maZDTaKrznsC", "title": "Introduction to the IrisCode Theory", "authors": ["Adams Wai Kin Kong", "David Zhang", "Mohamed Kamel"], "description": "IrisCode is the most successful iris recognition method. Developed for over 18 years, IrisCode still dominates the market even though numerous iris recognition algorithms have been proposed in the academics. Currently, more than 60 million people have been mathematically enrolled by this algorithm. Its computational advantages, including high matching speed, predictable false acceptance rates and robustness against local brightness and contrast variations, play a significant role in its commercial success. To further these computational advantages, researchers have modified this algorithm to enhance iris recognition performance and recognize other biometric traits (e.g. palmprint). Many scientific papers on iris recognition have been published, but its theory is almost completely ignored. In this chapter, we will report our most recent theoretical work on the IrisCode.", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 1, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:dfsIfKJdRG4C", "title": "Speeding up the knowledge-based deblocking method for efficient forensic analysis", "authors": ["Yanzhu Liu", "Xiaojie Li", "Adams Wai Kin Kong"], "description": "Identifying individuals in evidence images (e.g. child sexual abuse and masked gunmen), where their faces are covered or obstructed, is a challenging task. Skin mark patterns and blood vessel patterns have been proposed as biometrics to overcome this challenge, but their clarity depends on the quality of evidence images. However, evidence images are very likely compressed by the JPEG method, which is widely installed in digital cameras. To remove blocking artifacts in skin images and restore the original clarity for forensic analysis, a knowledge-based deblocking method, which replaces compressed blocks in evidence images with uncompressed blocks from a large skin image database, was proposed. Experimental results demonstrated that this method is effective and performs better than other deblocking methods that were designed for generic images. The search for optimal uncompressed blocks in a …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:J_g5lzvAfSwC", "title": "A fast point pattern matching algorithm for robust spatially addressable bead encoding", "authors": ["Abhik Datta", "Adams Wai-Kin Kong", "Soumita Ghosh", "Dieter Trau"], "description": "Bead encoding is a key problem central to all bead based microarrays. Recently a spatially addressable bead encoding technique has been developed ([1], [2]) that alleviates the need for costly hardware while still allowing high-throughput analysis. This paper proposes a pattern matching based scheme that extends this bead encoding technique's usability to uncontrolled environments. A novel affine invariant point pattern matching algorithm is developed to achieve this. The proposed algorithm uses local features to overcome the combinatorial explosion problem encountered in matching corrupted point patterns. The use of efficient data structures is emphasized to make the algorithm fast and scalable. The proposed scheme can decode bead identities in assays involving thousands of beads in a few seconds. Evaluation results using both real and simulated data are presented.", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:HDshCWvjkbEC", "title": "An alternative Gabor filtering scheme", "authors": ["Adams Wai-Kin Kong"], "description": "An elementary function that is now commonly referred to as Gabor filter was derived from uncertainty relation for information by Gabor to overcome the representation limit of Fourier analysis. For image-based applications (e.g. biometric recognition), researchers amend the weights of Gabor filters to produce zero DC (direct current) Gabor filters. This amendment can significantly change the shape of Gabor filters, when they use a special range of parameters. The aim of this paper is to develop a new Gabor filtering scheme to overcome this problem. Two different types of zero DC Gabor filters are compared with the proposed scheme on face recognition. FERET database is employed in the experiments. The Gabor phase from the proposed filtering scheme gives improvement in the range between 11% and 8.5%, and the performance of its magnitude is comparable with other schemes.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:35N4QoGY0k4C", "title": "A new approach to appearance-based face recognition", "authors": ["King Hong Cheung", "A Kong", "Jane You", "Qin Li", "David Zhang", "Prabir Bhattacharya"], "description": "Current holistic appearance based face recognition methods require a high dimensional feature space to attain fruitful performance. In this paper, we have proposed a relatively low feature dimensional, template-matching scheme to cope with the transformed appearance-based face recognition problem. We use aggregated Gabor filter responses to represent face images. We investigated the effect of \"duplicate\" images (images from different sessions) and the effect of facial expressions. Our results indicate that the proposed method is more robust in recognizing \"duplicate\" images with variations in facial expression than the principal component analysis method.", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:0KyAp5RtaNEC", "title": "Adapter Incremental Continual Learning of Efficient Audio Spectrogram Transformers", "authors": ["Nithish Muthuchamy Selvaraj", "Xiaobao Guo", "Adams Kong", "Bingquan Shen", "Alex Kot"], "description": "Continual learning involves training neural networks incrementally for new tasks while retaining the knowledge of previous tasks. However, efficiently fine-tuning the model for sequential tasks with minimal computational resources remains a challenge. In this paper, we propose Task Incremental Continual Learning (TI-CL) of audio classifiers with both parameter-efficient and compute-efficient Audio Spectrogram Transformers (AST). To reduce the trainable parameters without performance degradation for TI-CL, we compare several Parameter Efficient Transfer (PET) methods and propose AST with Convolutional Adapters for TI-CL, which has less than 5% of trainable parameters of the fully fine-tuned counterparts. To reduce the computational complexity, we introduce a novel Frequency-Time factorized Attention (FTA) method that replaces the traditional self-attention in transformers for audio spectrograms. FTA achieves competitive performance with only a factor of the computations required by Global Self-Attention (GSA). Finally, we formulate our method for TI-CL, called Adapter Incremental Continual Learning (AI-CL), as a combination of the \"parameter-efficient\" Convolutional Adapter and the \"compute-efficient\" FTA. Experiments on ESC-50, SpeechCommandsV2 (SCv2), and Audio-Visual Event (AVE) benchmarks show that our proposed method prevents catastrophic forgetting in TI-CL while maintaining a lower computational budget.", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}, "topic": "Continual Learning", "agg_topic": "Federated Learning", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:yB1At4FlUx8C", "title": "A Practical Upper Bound for the Worst-Case Attribution Deviations", "authors": ["Fan Wang", "Adams Wai-Kin Kong"], "description": "Model attribution is a critical component of deep neural networks (DNNs) for its interpretability to complex models. Recent studies bring up attention to the security of attribution methods as they are vulnerable to attribution attacks that generate similar images with dramatically different attributions. Existing works have been investigating empirically improving the robustness of DNNs against those attacks; however, none of them explicitly quantifies the actual deviations of attributions. In this work, for the first time, a constrained optimization problem is formulated to derive an upper bound that measures the largest dissimilarity of attributions after the samples are perturbed by any noises within a certain region while the classification results remain the same. Based on the formulation, different practical approaches are introduced to bound the attributions above using Euclidean distance and cosine similarity under both L2 and Linf-norm perturbations constraints. The bounds developed by our theoretical study are validated on various datasets and two different types of attacks (PGD attack and IFIA attribution attack). Over 10 million attacks in the experiments indicate that the proposed upper bounds effectively quantify the robustness of models based on the worst-case attribution dissimilarities.", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}, "topic": "Deep Learning", "agg_topic": "Adversarial Attacks on Neural Network", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:VLnqNzywnoUC", "title": "Real-Time Energy Management for Marine Applications Using Markov Approximation", "authors": ["Thant Zin Oo", "Adams Wai-Kin Kong"], "description": "All-electric and hybrid-electric ships have become the centerpiece for reducing greenhouse gas emissions and improving fuel efficiency in the maritime industry. Real-time power management of multiple power sources in both design and operation becomes critical due to the uncertainty and randomness of the vessel's power demand. Furthermore, the vessel operators may have additional requirements for operational flexibility, such as fully recharging the battery before the next trip and limiting engine switch on/off to reduce wear-and-tear, which lead to complex power management systems requiring domain-expert knowledge. In this paper, a hybrid solution for real-time power management is proposed. The model-based approach encapsulates the power system, and the data-driven approach (a machine learning technique called Markov approximation) handles the uncertainty. First, an offline deterministic …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}, "topic": "Power System", "agg_topic": "Cybersecurity", "final_topic": "Security"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:ZfRJV9d4-WMC", "title": "Using double attention for text tattoo localisation", "authors": ["Xingpeng Xu", "Shitala Prasad", "Kuanhong Cheng", "Adams Wai Kin Kong"], "description": "Text tattoos contain rich information about an individual for forensic investigation. To extract this information, text tattoo localisation is the first and essential step. Previous tattoo studies applied existing object detectors to detect general tattoos, but none of them considered text tattoo localisation and they neglect the prior knowledge that text tattoos are usually inside or nearby larger tattoos and appear only on human skin. To use this prior knowledge, a prior knowledge‐based attention mechanism (PKAM) and a network named Text Tattoo Localisation Network based on Double Attention (TTLN‐DA) are proposed. In addition to TTLN‐DA, two variants of TTLN‐DA are designed to study the effectiveness of different prior knowledge. For this study, NTU Tattoo V2, the largest tattoo dataset and NTU Text Tattoo V1, the largest text tattoo dataset are established. To examine the importance of the prior knowledge and the …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 0, 0]}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:uLbwQdceFCQC", "title": "Unimodal and Crossmodal Refinement Network for Multimodal Sequence Fusion", "authors": ["Xiaobao Guo", "Adams Kong", "Huan Zhou", "Xianfeng Wang", "Min Wang"], "description": "Effective unimodal representation and complementary crossmodal representation fusion are both important in multimodal representation learning. Prior works often modulate one modal feature to another straightforwardly and thus, underutilizing both unimodal and crossmodal representation refinements, which incurs a bottleneck of performance improvement. In this paper, Unimodal and Crossmodal Refinement Network (UCRN) is proposed to enhance both unimodal and crossmodal representations. Specifically, to improve unimodal representations, a unimodal refinement module is designed to refine modality-specific learning via iteratively updating the distribution with transformer-based attention layers. Self-quality improvement layers are followed to generate the desired weighted representations progressively. Subsequently, those unimodal representations are projected into a common latent space, regularized by a multimodal Jensen-Shannon divergence loss for better crossmodal refinement. Lastly, a crossmodal refinement module is employed to integrate all information. By hierarchical explorations on unimodal, bimodal, and trimodal interactions, UCRN is highly robust against missing modality and noisy data. Experimental results on MOSI and MOSEI datasets illustrated that the proposed UCRN outperforms recent state-of-the-art techniques and its robustness is highly preferred in real multimodal sequence fusion scenarios. Codes will be shared publicly.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:CHSYGLWDkRkC", "title": "Identifying critical factors influencing quality of blood vessel information in JPEG compressed skin images", "authors": ["Xiaojie Li", "Adams Wai Kin Kong"], "description": "Recent research results demonstrate the potential of using blood vessel patterns for criminal and victim identification. With newly developed methods, blood vessel patterns under human skin are possible to be visualized from evidence images (e.g., Child sexual abuse images). However, these images are always taken by consumer cameras and compressed by the JPEG method, which can degrade the blood vessel information seriously. In this paper, an analysis is conducted to find out the critical factors influencing the quality of the blood vessel information. Simulations using different compression ratios are performed on skin images with different resolutions. The results indicate that the quality of blood vessel information is controlled by several low frequency discrete cosine transform (DCT) coefficients in the Y, U and V channels. The findings will be useful for designing algorithms to restore the blood vessel …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:ZeXyd9-uunAC", "title": "Palmprint Identification by Fused Wavelet Characteristics", "authors": ["Guangming Lu", "David Zhang", "Wai-Kin Kong", "Qingmin Liao"], "description": "The wavelet theory has become a hot research topic in the last few years for its important relative characteristics, such as sub-band coding, multi-resolution analysis and filter banks. In this Chapter, we propose a novel method of feature extraction for palmprint identification based on the waveletransform, which is very efficient to handle the textural characteristics of palmprint images at low resolution. In order to achieve a high accuracy, four sets of statistical features (mean, energy, variance, and kurtosis) are extracted based on the wavelet transform. Five classifier combination strategies are then represented. The experimental comparison of various feature sets and different fusion schemes shows that the individual feature set of energy has the best classification ability and the fusion schemes of Median rule as well as the Majority rule have the best performance.", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:7PzlFSSx8tAC", "title": "On Effective Palmprint Retrieval for Personal Identification.", "authors": ["King Hong Cheung", "Adams Wai-Kin Kong", "Jane You", "David Zhang"], "description": "This paper presents a novel retrieval method for effective search of palmprints based on Principal Component Analysis (PCA) and Self-Organizing Feature Map (SOM). To reduce search space and speed up the query processing, an integration of PCA and SOM is proposed, where the coefficients obtained by PCA for global feature representation is considered as input features of SOM. The trained SOM can be used as a retrieval engine to identify similar palmprint images with respect to the query palmprint image for personal identification..", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:p2g8aNsByqUC", "title": "An integration of principal component analysis and self-organizing map for effective palmprint retrieval", "authors": ["King Hong Cheung", "WK Kong", "Jia You", "Dapeng Zhang"], "description": "An integration of principal component analysis and self-organizing map for effective palmprint \nretrieval — PolyU Scholars Hub Skip to main navigation Skip to search Skip to main content \nPolyU Scholars Hub Home PolyU Scholars Hub Logo Help & FAQ Home Researchers Units \nResearch output Prizes Activities Press/Media Student theses Search by expertise, name or \naffiliation An integration of principal component analysis and self-organizing map for effective \npalmprint retrieval KH Cheung, WK Kong, Jia You, Dapeng Zhang Department of Computing The \nHong Kong Polytechnic University Research output: Unpublished conference presentation \n(presented paper, abstract, poster) › Conference presentation (not published in \njournal/proceeding/book) › Academic research › peer-review Overview Original language English \nPages 101-104 Number of pages 4 Publication status Published - 2003 Event International …", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:mVmsd5A6BfQC", "title": "Criteria-Based Eyelash Detection Model for Accurate Iris Segmentation", "authors": ["Wai-Kin Kong", "David Zhang"], "description": "In this paper, we present a novel eyelash detection model based on three criteria: 1) separable eyelash condition, 2) multiple eyelashes condition and 3) connective criterion. The first condition handles separable eyelash and the second condition manages multiple eyelashes. The last criterion avoids misclassification of strong iris texture as the separable eyelash. Many images are selected to evaluate the accuracy and usefulness of the eyelash detection model and the results are encouraging.", "publication_year": 2001, "citations_by_year": {"year": [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:uc_IGeMz5qoC", "title": "Pace-adaptive and Noise-resistant Contrastive Learning for Multimodal Feature Fusion", "authors": ["Xiaobao Guo", "Alex Kot", "Adams Wai-Kin Kong"], "description": "Multimodal feature fusion aims to draw complementary information from different modalities to achieve better performance. Contrastive learning is effective at discriminating coexisting semantic features (positive) from irrelative ones (negative) in multimodal signals. However, positive and negative pairs learn at separate rates, which undermines the overall performance of multimodal contrastive learning (MCL). Moreover, the learned representation model is not robust, as MCL utilizes supervision signals from potentially noisy modalities. To address these issues, a novel multimodal contrastive learning objective, Pace-adaptive and Noise-resistant Noise-Contrastive Estimation (PN-NCE), is proposed for multimodal fusion by directly using unimodal features. PN-NCE encourages the positive and negative pairs reaching to their optimal similarity scores adaptively and shows less susceptibility to noisy inputs during …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Multimodal Fusion", "agg_topic": "Multimodal Fusion", "final_topic": "Multimodal Fusion"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:nrtMV_XWKgEC", "title": "Flexible-modal Deception Detection with Audio-Visual Adapter", "authors": ["Zhaoxu Li", "Zitong Yu", "Nithish Muthuchamy Selvaraj", "Xiaobao Guo", "Bingquan Shen", "Adams Wai-Kin Kong", "Alex Kot"], "description": "Detecting deception by human behaviors is vital in many fields such as custom security and multimedia anti-fraud. Recently, audio-visual deception detection attracts more attention due to its better performance than using only a single modality. However, in real-world multi-modal settings, the integrity of data can be an issue (e.g., sometimes only partial modalities are available). The missing modality might lead to a decrease in performance, but the model still learns the features of the missed modality. In this paper, to further improve the performance and overcome the missing modality problem, we propose a novel Transformer-based framework with an Audio-Visual Adapter (AVA) to fuse temporal features across two modalities efficiently. Extensive experiments conducted on two benchmark datasets demonstrate that the proposed method can achieve superior performance compared with other multi-modal fusion methods under flexible-modal (multiple and missing modalities) settings.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Multi-modal Fusion", "agg_topic": "Multimodal Fusion", "final_topic": "Multimodal Fusion"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:ipzZ9siozwsC", "title": "Adapter Incremental Continual Learning of Efficient Audio Spectrogram Transformers", "authors": ["Nithish Muthuchamy Selvaraj", "Xiaobao Guo", "Adams Kong", "Bingquan Shen", "Alex Kot"], "description": "Continual learning involves training neural networks incrementally for new tasks while retaining the knowledge of previous tasks. However, efficiently fine-tuning the model for sequential tasks with minimal computational resources remains a challenge. In this paper, we propose Task Incremental Continual Learning (TI-CL) of audio classifiers with both parameter-efficient and compute-efficient Audio Spectrogram Transformers (AST). To reduce the trainable parameters without performance degradation for TI-CL, we compare several Parameter Efficient Transfer (PET) methods and propose AST with Convolutional Adapters for TI-CL, which has less than 5% of trainable parameters of the fully fine-tuned counterparts. To reduce the computational complexity, we introduce a novel Frequency-Time factorized Attention (FTA) method that replaces the traditional self-attention in transformers for audio spectrograms. FTA …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:EkHepimYqZsC", "title": "Audio-Visual Deception Detection: DOLOS Dataset and Parameter-Efficient Crossmodal Learning", "authors": ["Xiaobao Guo", "Nithish Muthuchamy Selvaraj", "Zitong Yu", "Adams Wai-Kin Kong", "Bingquan Shen", "Alex Kot"], "description": "Deception detection in conversations is a challenging yet important task, having pivotal applications in many fields such as credibility assessment in business, multimedia anti-frauds, and custom security. Despite this, deception detection research is hindered by the lack of high-quality deception datasets, as well as the difficulties of learning multimodal features effectively. To address this issue, we introduce DOLOS, the largest gameshow deception detection dataset with rich deceptive conversations. DOLOS includes 1,675 video clips featuring 213 subjects, and it has been labeled with audio-visual feature annotations. We provide train-test, duration, and gender protocols to investigate the impact of different factors. We benchmark our dataset on previously proposed deception detection approaches. To further improve the performance by fine-tuning fewer parameters, we propose Parameter-Efficient Crossmodal Learning (PECL), where a Uniform Temporal Adapter (UT-Adapter) explores temporal attention in transformer-based architectures, and a crossmodal fusion module, Plug-in Audio-Visual Fusion (PAVF), combines crossmodal information from audio-visual features. Based on the rich fine-grained audio-visual annotations on DOLOS, we also exploit multi-task learning to enhance performance by concurrently predicting deception and audio-visual features. Experimental results demonstrate the desired quality of the DOLOS dataset and the effectiveness of the PECL. The DOLOS dataset and the source codes are available.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Multimodal Learning", "agg_topic": "Artificial Intelligence and Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:t7zJ5fGR-2UC", "title": "Certification of Attribution Robustness for Euclidean Distance and Cosine Similarity Measure", "authors": ["Fan Wang", "Adams Wai-Kin Kong"], "description": "Model attribution is a critical component of deep neural networks (DNNs) for its interpretability to complex models. Recent works bring up attention to the security of attributions as they are vulnerable to attribution attacks that generate similar images with dramatically different attributions. Studies have been working on empirically improving the robustness of DNNs against those attacks. However, due to their lack of certification, the actual robustness of the model for a testing point is not known. In this work, we define \\emph{certified attribution robustness} for the first time that upper bounds the dissimilarity of attributions after the samples are perturbed by any noises within a certain region while the classification results remain the same. Based on the definition, we propose different approaches to certify the attributions using Euclidean distance and cosine similarity under both  and -norm perturbations constraints. The bounds developed by our theoretical study are validated on three datasets (MNIST, Fashion-MNIST and CIFAR-10), and two different types of attacks (PGD attack and IFIA attribution attack). The experimental results show that the bounds certify the model effectively.", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Machine Learning", "agg_topic": "Machine Learning", "final_topic": "Artificial Intelligenc"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:fEOibwPWpKIC", "title": "Real-Time Shipboard Power Management Based on Monte-Carlo Tree Search", "authors": ["Yan Ren", "Adams Wai-Kin Kong", "Yi Wang"], "description": "The increasing concern in reducing greenhouse gas emissions and improving the fuel efficiency of marine transportation leads to a higher demand for intelligent power management systems (PMS). Unlike offline PMS with prior knowledge on the load profiles, real-time PMS is more challenging because of unknown load profiles. Two typical real-time PMS methods are equivalent consumption minimization strategy (ECMS) and model prediction control (MPC). However, ECMS can only make instantaneous decisions without the ability to handle large load demand changes, and MPC normally relies on pre-defined input references to guide the optimization. To alleviate these problems, in this paper, a Monte-Carlo Tree Search (MCTS) based method is proposed with a reward function guided by worst-case to minimize the fuel consumption. Meanwhile, a Siamese learning-based model is integrated with MCTS to …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Power Managemen", "agg_topic": "Hardware Design and Electronic Design Automation", "final_topic": "Hardware Design and Neural Network Optimization"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:z_wVstp3MssC", "title": "Portmanteauing Features for Scene Text Recognition", "authors": ["Yew Lee Tan", "Ernest Yu Kai Chew", "Adams Wai-Kin Kong", "Jung-Jae Kim", "Joo Hwee Lim"], "description": "Scene text images have different shapes and are subjected to various distortions, e.g. perspective distortions. To handle these challenges, the state-of-the-art methods rely on a rectification network, which is connected to the text recognition network. They form a linear pipeline which uses text rectification on all input images, even for images that can be recognized without it. Undoubtedly, the rectification network improves the overall text recognition performance. However, in some cases, the rectification network generates unnecessary distortions on images, resulting in incorrect predictions in images that would have otherwise been correct without it. In order to alleviate the unnecessary distortions, the portmanteauing of features is proposed. The portmanteau feature, inspired by the portmanteau word, is a feature containing information from both the original text image and the rectified image. To generate the …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}, "topic": "Computer Vision", "agg_topic": "Artificial Intelligenc", "final_topic": "Federated Learning"}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:PR6Y55bgFSsC", "title": "New Threats Against Object Detector with Non-local Block", "authors": ["Yi Huang", "Fan Wang", "Adams Wai-Kin Kong", "Kwok-Yan Lam"], "description": "The introduction of non-local blocks to the traditional CNN architecture enhances its performance for various computer vision tasks by improving its capabilities of capturing long-range dependencies. However, the usage of non-local blocks may also introduce new threats to computer vision systems. Therefore, it is important to study the threats caused by non-local blocks before directly applying them on commercial systems. In this paper, two new threats named disappearing attack and appearing attack against object detectors with a non-local block are investigated. The former aims at misleading an object detector with a non-local block such that it is unable to detect a target object category while the latter aims at misleading the object detector such that it detects a predefined object category, which is not present in images. Different from the existing attacks against object detectors, these threats are able to …", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:N5tVd3kTz84C", "title": "Gender and Ethnicity Classification based on Palmprint and Palmar Hand Images from Uncontrolled Environment", "authors": ["Wojciech Michal Matkowski", "Adams Wai Kin Kong"], "description": "Soft biometric attributes such as gender, ethnicity or age may provide useful information for biometrics and forensics applications. Researchers used, eg, face, gait, iris, and hand, etc. to classify such attributes. Even though hand has been widely studied for biometric recognition, relatively less attention has been given to soft biometrics from hand. Previous studies of soft biometrics based on hand images focused on gender and well-controlled imaging environment. In this paper, the gender and ethnicity classification in uncontrolled environment are considered. Gender and ethnicity labels are collected and provided for subjects in a publicly available database, which contains hand images from the Internet. Five deep learning models are fine-tuned and evaluated in gender and ethnicity classification scenarios based on palmar 1) full hand, 2) segmented hand and 3) palmprint images. The experimental results …", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:eq2jaN3J8jMC", "title": "Palmprint Recognition in Uncontrolled and Uncooperative Environment", "authors": ["Wojciech Michal Matkowski", "Tingting Chai", "Adams Wai Kin Kong"], "description": "Online palmprint recognition and latent palmprint identification are two branches of palmprint studies. The former uses middle-resolution images collected by a digital camera in a well-controlled or contact-based environment with user cooperation for commercial applications and the latter uses high-resolution latent palmprints collected in crime scenes for forensic investigation. However, these two branches do not cover some palmprint images which have the potential for forensic investigation. Due to the prevalence of smartphone and consumer camera, more evidence is in the form of digital images taken in uncontrolled and uncooperative environment, eg, child pornographic images and terrorist images, where the criminals commonly hide or cover their face. However, their palms can be observable. To study palmprint identification on images collected in uncontrolled and uncooperative environment, a new …", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:SdhP9T11ey4C", "title": "A Study on Wrist Identification for Forensic Investigation", "authors": ["Wojciech Michal Matkowski", "Frodo Kin Sun Chan", "Adams Wai Kin Kong"], "description": "Criminal and victim identification based on crime scene images is an important part of forensic investigation. Criminals usually avoid identification by covering their faces and tattoos in the evidence images, which are taken in uncontrolled environments. Existing identification methods, which make use of biometric traits, such as vein, skin mark, height, skin color, weight, race, etc., are considered for solving this problem. The soft biometric traits, including skin color, gender, height, weight and race, provide useful information but not distinctive enough. Veins and skin marks are limited to high resolution images and some body sites may neither have enough skin marks nor clear veins. Terrorists and rioters tend to expose their wrists in a gesture of triumph, greeting or salute, while paedophiles usually show them when touching victims. However, wrists were neglected by the biometric community for forensic applications …", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:AXPGKjj_ei8C", "title": "The Nipple-Areola Complex for Criminal Identification", "authors": ["Wojciech Michal Matkowski", "Krzysztof Matkowski", "Adams Wai-Kin Kong", "Cory Lloyd Hall"], "description": "In digital and multimedia forensics, identification of child sexual offenders based on digital evidence images is highly challenging due to the fact that the offender's face or other obvious characteristics such as tattoos are occluded, covered, or not visible at all. Nevertheless, other naked body parts, e.g., chest are still visible. Some researchers proposed skin marks, skin texture, vein or androgenic hair patterns for criminal and victim identification. There are no available studies of nipple-areola complex (NAC) for offender identification. In this paper, we present a study of offender identification based on the NAC, and we present NTU-Nipple-v1 dataset, which contains 2732 images of 428 different male nipple-areolae. Popular deep learning and hand-crafted recognition methods are evaluated on the provided dataset. The results indicate that the NAC can be a useful characteristic for offender identification.", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:tKAzc9rXhukC", "title": "The Nipple-Areola Complex for Criminal Identification", "authors": ["Wojciech Michal Matkowski", "Krzysztof Matkowski", "Adams Wai-Kin Kong", "Cory Lloyd Hall"], "description": "In digital and multimedia forensics, identification of child sexual offenders based on digital evidence images is highly challenging due to the fact that the offender's face or other obvious characteristics such as tattoos are occluded, covered, or not visible at all. Nevertheless, other naked body parts, eg, chest are still visible. Some researchers proposed skin marks, skin texture, vein or androgenic hair patterns for criminal and victim identification. There are no available studies of nipple-areola complex (NAC) for offender identification. In this paper, we present a study of offender identification based on the NAC, and we present NTU-Nipple-v1 dataset, which contains 2732 images of 428 different male nipple-areolae. Popular deep learning and hand-crafted recognition methods are evaluated on the provided dataset. The results indicate that the NAC can be a useful characteristic for offender identification.", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:9vf0nzSNQJEC", "title": "Giant Panda Face Recognition Using Small Dataset", "authors": ["Wojciech Michal Matkowski", "Adams Wai Kin Kong", "Han Su", "Peng Chen", "Rong Hou", "Zhihe Zhang"], "description": "Giant panda (panda) is a highly endangered animal. Significant efforts and resources have been put on panda conservation. To measure effectiveness of conservation schemes, estimating its population size in wild is an important task. The current population estimation approaches, including capture-recapture, human visual identification and collection of DNA from hair or feces, are invasive, subjective, costly or even dangerous to the workers who perform these tasks in wild. Cameras have been widely installed in the regions where pandas live. It opens a new possibility for non-invasive image based panda recognition. Panda face recognition is naturally a small dataset problem, because of the number of pandas in the world and the number of qualified images captured by the cameras in each encounter. In this paper, a panda face recognition algorithm, which includes alignment, large feature set extraction and …", "publication_year": 2019, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:4OULZ7Gr8RgC", "title": "Embedding Information on Metal Surfaces by Micro-Milling", "authors": ["Tesswin Thomas", "Sathyan Subbiah", "Adams Wai Kin Kong"], "description": "A new method of storing or embedding information on the surface of metals is presented here. The feed marks left behind by the passing tool in micro-milling are used as a way to embed the information. By simply varying the feed rates during milling in predetermined way information can be stored similar to how an optical storage disc embeds digital information in a binary fashion. Such storage is demonstrated by creating the surface topography using micro-milling and performing information retrieval by extracting and analyzing the surface profiles. Expected applications of this are in steganography and water marking of products for authenticity checks.", "publication_year": 2013, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:uWQEDVKXjbEC", "title": "Method for analyzing a palm print for the identification of an individual using Gabor analysis", "authors": null, "description": "Issue Date: 16-Dec-2008 Source: US Patent 7,466,846 B2. Washington, DC: US Patent and Trademark Office, 2008. Abstract: A method of palmprint identification includes obtaining an image of a portion of an inner surface of a hand of an individual. A sub-image of skin surface within a defined area of the inner surface of the hand of obtained from the image. The sub-image is analyzed to obtain texture data for the skin surface with the defined area. The texture data is compared to reference information in a database. Keywords: Palmprint identification", "publication_year": 2008, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:SP6oXDckpogC", "title": "Method and apparatus for identifying a palmprint image", "authors": null, "description": "Issue Date: 9-Apr-2008 Source: 中国专利 ZL 03822593. X Abstract: A method of palmprint identification includes analyzing an area from an image of a palm to obtain texture data for the skin surface with the area. The texture data is compared to reference information in a database to determine the identity of an individual. An apparatus for capturing an image of a palm includes an enclosure with a window in it, and an image sensor and light source disposed within the enclosure and arranged to capture an image through the window. Protuberances are provided on the surface. The protuberances are arranged to be in known juxtaposition to a hand suitably placed on the window for capture of an image that includes the palm area of the hand.一种掌纹识别方法, 包括: 分析来自手掌图像的区域, 以利用该区域获得皮肤表面的纹理数据. 将纹理数据与数据库中的参考信息进行比较, 以确定对个体的识别. 一种用于捕获手掌图像的 …", "publication_year": 2008, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:l7t_Zn2s7bgC", "title": "On cancelable biometrics for personal authentication", "authors": ["KH Cheung", "A Kong", "Jia You", "Q Li", "Dapeng Zhang", "P Bhattacharya"], "description": "On cancelable biometrics for personal authentication — Open Platform for University Scholars \nOPUS - PolyU Skip to main navigation Skip to search Skip to main content Open Platform for \nUniversity Scholars OPUS - PolyU Home Open Platform for University Scholars OPUS - PolyU \nLogo Help & FAQ Home Researchers Units Research output Prizes Activities Press / Media \nStudent theses Search by expertise, name or affiliation On cancelable biometrics for personal \nauthentication KH Cheung, A. Kong, Jia You, Q. Li, Dapeng Zhang, P. Bhattacharya Department \nof Computing The Hong Kong Polytechnic University Research output: Unpublished \nconference presentation (presented paper, abstract, poster) › Conference presentation (not \npublished in journal/proceeding/book) › Academic research › peer-review Overview Original \nlanguage English Pages 111-117 Number of pages 7 Publication status Published - 2005 …", "publication_year": 2005, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:zLWjf1WUPmwC", "title": "Other Biometries-A New Approach to Personal Identification in Large Databases by Hierarchical Palmprint Coding with Multi-features", "authors": ["Jane You", "Wai-Kin Kong", "David Zhang", "King Hong Cheung"], "description": null, "publication_year": 2004, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:OU6Ihb5iCvQC", "title": "A new approach to personal identification via hierarchical palmprint coding", "authors": ["Jia You", "Dapeng Zhang", "King Hong Cheung", "WK Kong"], "description": "This paper presents a new approach to personal identification using palmprints. To tackle the key issues such as palmprint feature extraction, representation, indexing, matching criteria and fast search for large data archives, we introduce, a hierarchical palmprint coding scheme to facilitate coarse-to-fine matching for efficient and effective palmprint classification. The proposed scheme consists of four levels: 1) a global geometry based feature for palmprint location (Level-1 feature), 2) a global texture based feature for palmprint grouping (Level-2 feature), 3) a local fuzzy\" interest line\" detection for palmprint selection (Level-3 feature), 4) a local texture energy vector for fine palmprint matching (Level-4 feature). In addition, we adopt a mask based statistical measurement to extract texture feature in palmprints, which is characterized by its high convergence of inner-palm similarities and good dispersion of inter-palm discrimination. Furthermore, we apply fuzzy set technology to detect dominant feature, points (\" interest\" points) and lines (\" interest\" lines) to guide matching. A wide range of palmprint images have been tested to demonstrate the feasibility and effectiveness of the proposed method.", "publication_year": 2003, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:mB3voiENLucC", "title": "An effective coordinate system to solve tilting problem for iris recognition", "authors": ["A Kong", "Dapeng Zhang"], "description": "An effective coordinate system to solve tilting problem for iris recognition — PolyU Scholars Hub \nSkip to main navigation Skip to search Skip to main content PolyU Scholars Hub Home PolyU \nScholars Hub Logo Help & FAQ Home Researchers Units Research output Prizes Activities \nPress/Media Student theses Search by expertise, name or affiliation An effective coordinate \nsystem to solve tilting problem for iris recognition A. Kong, Dapeng Zhang Department of \nComputing The Hong Kong Polytechnic University Research output: Unpublished conference \npresentation (presented paper, abstract, poster) › Conference presentation (not published in \njournal/proceeding/book) › Academic research › peer-review Overview Original language \nEnglish Publication status Published - 2000 Event International Conference on Image and \nGraphics [ICIG] - Duration: 1 Jan 2000 → … Conference Conference International Conference …", "publication_year": 2000, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:vDijr-p_gm4C", "title": "Supplementary Material for Audio-Visual Deception Detection: DOLOS Dataset and Parameter-Efficient Crossmodal Learning", "authors": ["Xiaobao Guo12", "Nithish Muthuchamy Selvaraj", "Zitong Yu", "Adams Wai-Kin Kong", "Bingquan Shen", "Alex Kot"], "description": "The gameshow episodes from multiple seasons were first discovered on YouTube. To extract the relevant content from each round of an episode, the speakers’ utterances (in the form of video clips) were identified by their timestamps. The clips were selected based on specific criteria, such as containing little noise and being of sufficient length to convey meaningful information. Multiple clips could be extracted from each round, all with the same veracity label. Python scripts were used to automate the download of the clips from YouTube, using the timestamps as reference. This process is described in more detail in Section 3.1 of the main paper.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:j8SEvjWlNXcC", "title": "Supplementary Material of Pure Transformer with Integrated Experts for Scene Text Recognition", "authors": ["Yew Lee Tan", "Adams Wai-Kin Kong", "Jung-Jae Kim"], "description": "Method Year Avg. accuracy Parameters Time 7672 7406 7248(mil.)(ms) Wang et al.[4] AAAI ‘20 86.9-- 18.4 22 Lu et al.[2] PR ‘21 89.3-- 54.6 53 Fang et al.[1] CVPR ‘21-92.8- 36.7 27 Yan et al.[5] CVPR ‘21--91.5 29.1 29 PTIE–4 layers 91.6 92.8 92.9 31.2 36 PTIE–5 layers 91.9 93.2 93.2 38.6 45 PTIE–6 layers 92.4 94.1 93.5 45.9 52", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:7T2F9Uy0os0C", "title": "Using double attention for text tattoo localisation", "authors": null, "description": null, "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=2GfXvbUAAAAJ&cstart=100&pagesize=100&citation_for_view=2GfXvbUAAAAJ:D_sINldO8mEC", "title": "Palmprint Texture Analysis based on Low-Resolution Images", "authors": ["Wai Kin Kong", "David Zhang"], "description": "Biometrics identification is an emerging solution for solving security problens in our networked society. A new branch of biometric approach-palmprint technology, whereby the lines and points can be extracted from our palm for personal authentication, was proposed several years ago. In this paper, we develop a new feature extraction method based on low-resolution palmprint images. A 2-D Gabor filter is used to obtain the texture information and two palmprint images are compared in term of their hamming distance. The experimental results illustrate the effectiveness of our method.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}, "topic": null, "agg_topic": null, "final_topic": null}]