{"2020": {"summary": "Professor [Name] has made significant contributions in the field of simulation modeling and optimization in various domains such as supply chain resilience, emergency services allocation, online map matching, multitask scheduling, and cloud gaming resource allocation. Their research has advanced the use of machine learning techniques, parallel computing, and high-level synthesis to improve the efficiency and effectiveness of simulations in these areas. Their work has also explored the application of simulation in evaluating passenger behavior, manufacturing processes, traffic simulations, and crowd guidance systems, showcasing the versatility and impact of simulation-based research in real-world scenarios.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=20&pagesize=80&citation_for_view=QdmIiyIAAAAJ:n3vGvpFsckwC": "This research article presents a simulation model that incorporates network structural properties to analyze and improve the resilience of supply chains in the face of disruptions.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=20&pagesize=80&citation_for_view=QdmIiyIAAAAJ:W2uZP3ddy8sC": "This research article proposes a novel approach that uses machine learning techniques and multi-nature features to accurately predict daily regional ambulance demand, aiming to support the allocation of resources and timely access to emergency services.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=20&pagesize=80&citation_for_view=QdmIiyIAAAAJ:R-LXmdHK_14C": "This research article proposes an opportunistic approach to online map matching using low-sampling GPS data, allowing for immediate inference of travelling routes with low output latency.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:In6cVmBjs0IC": "This research article proposes comprehensive models and scheduling algorithms for multitask scheduling in service-oriented manufacturing, considering the fuzzy uncertainty of multiple criteria.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:x21FZCSn4ZoC": "OpenABLext is an automatic code generation framework that enables the co-execution of agent-based simulations on heterogeneous hardware platforms, such as CPUs, GPUs, and FPGAs, by optimizing hardware assignment using a novel online dispatching method.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:RMgMIBzvq-4C": "This research article proposes a method to optimize rendering server allocation for cloud gaming, taking into account latency and multiplayer interactions.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:bVQMTfhMCi4C": "This research article proposes a machine learning-based performance model and efficient algorithms for resource allocation in cloud gaming to minimize resource usage and ensure quality of service.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:Y0-TYkg6YM4C": "This research article proposes a passenger model to simulate boarding and alighting in confined transportation scenarios, allowing researchers to evaluate the impact of different vehicle layouts on the required time.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:7Frjd3zlGBUC": "The research article proposes a method to accelerate microscopic traffic simulations by identifying independence among agent state updates, resulting in improved efficiency and performance.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:FsLZdJ3BAzkC": "This research article presents a runtime abstraction-level conversion approach for speeding up the simulation of discrete-event wafer-fabrication models by substituting machine groups with mean-delay models during steady state.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:4e5Qn2KL_jwC": "This research article proposes a multi-population genetic programming framework with adaptively weighted primitives to improve the efficiency and effectiveness of genetic programming in real-world applications.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:9NZAP19TdFAC": "This research article presents a risk-based method for optimizing the placement of Automated External Defibrillators (AEDs) in Singapore, using artificial cardiac arrest data to improve upon the common method of using historical data.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:yTLRzDEmwhEC": "This research article presents a framework for accelerating the simulation of discrete-event wafer-fabrication models in smart semiconductor manufacturing, allowing for faster decision-making based on the current manufacturing situation.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:L24QuVWYgZ0C": "This research article explores the collective effects of helping behavior in emergency evacuations by using numerical simulations and a game theoretic model.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:rOcdG6UcVlcC": "This research article explores the use of simulation and machine learning methods to generate dispatching knowledge in a dynamic manufacturing environment, with a focus on reducing overfitting and improving generalization of the model.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:H7nrzBkawXsC": "This research article explores the use of parallel computing techniques to improve the performance of microscopic traffic simulation models used in intelligent transportation systems.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:cBPnxVikjH8C": "This research article explores the use of high-level synthesis to accelerate traffic simulations on FPGAs, achieving significant speedup compared to traditional methods.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:Azgs6IHzeyYC": "This research article proposes advancements in automatic code generation for agent-based simulations on heterogeneous hardware, aiming to enable modellers to target multiple devices using a single model specification and generate efficient code.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:jlhcAiayVhoC": "The article proposes a collaborative simulation execution approach using both CPU and GPU for improved performance in large-scale simulations.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:KTwcwpFFj4wC": "This research article explores the use of crowd simulation to evaluate the effectiveness of different passenger guidance systems in public transport hubs, including digital signage and mobile phone guidance systems. The results demonstrate that crowd simulation is a useful tool for evaluating and designing guidance systems in public transport spaces.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:I8rxH6phXEkC": "This research article proposes the use of a multi-objective evolutionary algorithm to automatically design guardrails in subway stations, optimizing passenger transfer time and flow rate. The algorithm is tested in different scenarios and provides promising results for guardrail design.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=400&pagesize=100&citation_for_view=QdmIiyIAAAAJ:rCNdntzdTkkC": "This research article proposes a method called cluster fast-forwarding to reduce the computational cost of microscopic traffic simulations by training artificial neural networks to capture interactions between vehicles, resulting in improved performance compared to traditional methods."}}, "2021": {"summary": "Professor X has conducted extensive research in the field of simulation and optimization, with a focus on improving various aspects of traffic simulation, emergency evacuations, distributed computing, and cloud gaming. Their work includes proposing innovative algorithms and models to enhance efficiency, accuracy, and decision-making in these domains.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:aEW5N-EHWIMC": "This research article discusses the application of deep learning models in microscopic traffic simulation and the need for updating parameters dynamically for real-time traffic simulation.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:I858iXPj1OkC": "This research article proposes an integrated approach for multi-agent pickup and delivery with task deadlines, aiming to maximize the number of tasks completed by their deadlines.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:wyM6WWKXmoIC": "This research article proposes a hierarchical aggregation/disaggregation method to increase the speed of discrete-event simulations in smart semiconductor manufacturing, allowing for faster problem analysis and decision-making.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:rLGzs9wiiwIC": "This research article analyzes different state update schemes in agent-based simulations, focusing on their ability to maintain simulation correctness and performance characteristics.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:2vr6o8x5NLkC": "This research article proposes a method to enable established spiking neural network simulators to run on heterogeneous hardware, such as CPUs, GPUs, and FPGAs, without significant modifications to the existing code base.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:EaFouW7jFu4C": "This research article investigates the horizontal movement performance of patient beds in healthcare facilities during emergency evacuations, aiming to improve evacuation times.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:ifOnle78iJkC": "The article discusses a new scheduling algorithm that aims to balance multiple objectives in cloud environments, such as QoS parameters and workflow optimization.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:KI9T_ytC6pkC": "This research article proposes an agent-based model to simulate the evacuation process in hospital emergency departments, and evaluates two different rescue strategies.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:g8uWPOAv7ggC": "The article proposes an efficient and error-tolerant approach for collaborative vehicle localization that increases efficiency and accuracy even with large measurement errors of nearby vehicle information.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:JH5k92_tO-AC": "This research article explores the use of edge servers and workload splitting to reduce latency and improve playability in cloud gaming, particularly for players in remote regions.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:6ZzL7HXColQC": "The article proposes a tool called OptCL to optimize performance for High Performance Domain-Specific Languages (HPDSLs) on heterogeneous platforms by enabling a heterogeneous co-execution mode.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:BAanoTsO0WEC": "This research article proposes a Bayesian-based approach called BayesNVL for estimating the absolute positions of nearby vehicles through vehicle-to-vehicle communication, incorporating GPS measurements and measured relative positions.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:Y9VhQm-5nPIC": "This research article examines how the presence of committed volunteers affects collective helping behavior in emergency evacuations, using a game theoretic model and pedestrian movement model. The study finds that the existence of committed volunteers promotes cooperation, but additional volunteers are only effective above a certain number.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:R22Rs3tN8aoC": "The article proposes a hot area targeting dead reckoning approach to increase the prediction capability in Distributed Virtual Environments, showing comparable results to state-of-the-art approaches.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:9shLKfS_uJEC": "This research article proposes a parallel hierarchical sort-based interest matching algorithm to improve the efficiency of interest management in simulations by taking advantage of modern multicore processors.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=400&pagesize=100&citation_for_view=QdmIiyIAAAAJ:xGWFX6Gbr9MC": "This research article proposes a time-efficient method for dynamically scaling distributed graph computations by changing the number of graph partitions while maintaining high partitioning quality. The method involves preprocessing and fast edge partitioning techniques, which significantly reduce repartitioning time without sacrificing partitioning quality.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=400&pagesize=100&citation_for_view=QdmIiyIAAAAJ:TesyEGJKHF4C": "This research article discusses the game theoretic modeling of helping behavior in emergency evacuations, focusing on the strategic interactions among evacuees and the potential benefits of altruistic actions in reducing evacuation time."}}, "2022": {"summary": "Professor X has made significant contributions to the field of data-driven crowd modeling, with research spanning various topics such as container-based workflow scheduling, cloud-based IoT simulation workflows, AED placement models, maintaining consistency of digital twins, physics-guided data-driven modeling in traffic simulation, and automated prediction of evacuation decisions. Their work also includes research on elevator allocation in emergency departments, crowd navigation path planning, edge-cloud gaming architecture, long-term pedestrian intention prediction, privacy-preserving demand forecasting, parallel and distributed simulation methods, load scheduling in rendering, IIoT sensor simulation, and map matching algorithms. Additionally, Professor X has explored the impact of committed volunteers on collective helping behavior in emergency evacuations.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=100&pagesize=100&citation_for_view=QdmIiyIAAAAJ:vnF2_uLGgtgC": "This article provides a comprehensive survey of data-driven crowd modeling techniques, including datasets, methods, validation techniques, and future research topics.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:3lUAU8Oskd0C": "This research article proposes a scheduling model for container-based workflows and the deployment of containers in a cloud-edge environment, with the objective of minimizing makespan and load.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:60iIaj97TE0C": "This research article proposes a cloud-based workflow scheduling model that considers task ordering, service selection, and resource allocation for IoT simulation workflows in complex manufacturing processes.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:XDrR66g3YHsC": "The research article proposes a novel AED placement model that aims to maximize the expected survival rate of out-of-hospital cardiac arrest cases by considering the impact of delayed defibrillation.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=200&pagesize=100&citation_for_view=QdmIiyIAAAAJ:sbeIDTyQOFgC": "This research article presents an approach for maintaining the consistency of digital twins in smart manufacturing by checking if observed timed events from the physical plant align with the estimations made by the digital twin.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:SpPTWFSNUtQC": "The article discusses the use of physics-guided data-driven modeling in microscopic traffic simulation to overcome biases and produce accurate and safe driving behaviors.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:V_vSwabWVtYC": "This research article proposes a new approach to combining physics-based and learning-based models for car-following behaviors by using deep reinforcement learning for model calibration.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:Ej9njvOgR2oC": "This research article proposes a simulation-based optimization approach using genetic algorithms to optimize the performance of adaptive abstraction control in smart manufacturing systems.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:vVJNg6_NJEsC": "This research article proposes an automated approach to predict and understand the evacuation decisions made by individuals during crowd evacuation using prioritized fuzzy decision rules.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:ukw-9cB-YDkC": "This research article discusses the simulation-based analysis of elevator allocation for the evacuation of trolley-ridden patients in a hospital emergency department, with a focus on reducing vertical evacuation time.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:cNe27ouKFcQC": "This research article proposes an evolutionary framework for automatic crowd navigation path planning in public scenes, which includes a fitness evaluation mechanism and a multiobjective differential evolution approach. The framework is shown to provide effective path planning strategies in simulation experiments.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:e84hm74t-eoC": "The research article proposes an edge-cloud gaming architecture that improves scalability and availability while reducing costs by distributing the workload and allocating players to remote rendering servers.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:XAp-VaTZjjwC": "This research article proposes a data-driven approach to predict long term pedestrian intention in large public places, using historical trajectories and velocity fields. The approach is evaluated in an airport terminal and shows effective prediction performance.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:oqD4_j7ulsYC": "This research article proposes a privacy-preserving federated learning approach to accurately forecast demand in the supply chain while protecting data privacy.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:yIeBiWEAh44C": "This research article provides a tutorial on parallel and distributed simulation methods for scalable discrete simulation, focusing on synchronization algorithms and their applications in transportation and spiking neural networks.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:M_lZXyI38BkC": "The article proposes a load scheduler, called SPIDER, that uses a fuzzy PID controller to efficiently distribute rendering workload among multiple GPUs in real-time split frame rendering.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:QaSi33NTfwYC": "This research article presents a method for simulating Industrial Internet of Things (IIoT) sensors in a wafer fabrication factory to investigate the implementation and behavior of IIoT applications without the need for costly investments in IoT systems and networks.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:xyvS_IvSCKsC": "This research article proposes a distribution-based method for estimating weights in map matching algorithms, aiming to decrease estimation bias caused by data source selection.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:PuOEWVtPfzwC": "This research article investigates how the presence of committed volunteers affects collective helping behavior in emergency evacuations, using an evolutionary game theoretic model coupled with a pedestrian movement model. The study finds that having a minimum number of committed volunteers can promote cooperation, but adding more volunteers is only effective above this threshold."}}, "2023": {"summary": "The professor's research focuses on various aspects of modeling and simulation in the field of computer science and manufacturing systems. Their work includes developing novel frameworks and algorithms to detect abnormal behaviors in crowd events, generate reliability models for complex manufacturing systems, improve coordination in traffic signal control optimization, and enhance the accuracy and efficiency of modeling and simulation in manufacturing plants.", "intermediate_results": {"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:RfUwGJFMQ-0C": "This research article presents a novel framework called MSMC-Net for detecting crowd-level abnormal behaviors (CABs) using multi-scale motion consistency learning, achieving improved performance on large-scale crowd event datasets.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:AFmTUeZ1pmEC": "This article proposes a data-driven approach using stochastic Petri nets to generate reliability models for complex manufacturing systems, based on event and state logs.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:EBV337fEn3EC": "This research article documents a seminar that focused on addressing methodological challenges in conducting effective and sustainable simulation studies in computer science.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:DquSII9TDu4C": "This research article examines the effects of pedestrian flow setups on contact duration distribution and characterizes the motions observed in contact interactions.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:yJjnfzR0HrkC": "This research article proposes an automatic model generation and data assimilation framework for cyber-physical production systems, aiming to improve the accuracy and efficiency of modeling and simulation in manufacturing plants.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:w2UhwfzvF0QC": "This research article proposes a performance-aware partitioning algorithm for cloud-based vehicle traffic simulations, which improves computation load balancing and communication cost in a heterogeneous computing environment.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:qCpRzq7zkD8C": "This research article proposes a cost-based algorithm to assign tasks and plan paths for agents in multi-agent pickup and delivery scenarios, aiming to minimize task tardiness.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:SrKkpNFED5gC": "The research article discusses the need for more efficient and intelligent approaches in modeling and simulation studies, and explores the potential of Artificial Intelligence and Machine Learning in improving sustainability and predictions in this field.", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=QdmIiyIAAAAJ&cstart=300&pagesize=100&citation_for_view=QdmIiyIAAAAJ:bXQfdp6S9ecC": "This research article proposes a new method called Spatial Iterative Coordination for Parallel Optimization (SICPO) to improve coordination and reduce synchronization in the simulation-based optimization of traffic signal control, which can be challenging due to the large search space."}}}