{"full_name": "Oh Hong Lye", "email": "hloh@ntu.edu.sg", "google_scholar": "https://scholar.google.com/citations?hl=en&user=d74x37YAAAAJ", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00131", "designation": "Senior Lecturer", "image_path": "./profile_img/oh_hong_lye.jpg", "biography": "Prior to joining NTU, Oh Hong Lye worked in the semiconductor industry for 20 years in Application and R&D job functions, covering a wide range of embedded system and wireless connectivity related products in consumer, computer and industrial segments.  As part of his job function, he interacts frequently with product R&D and project management teams from Multinational, Small & Medium Enterprises and Start-up companies, both locally and oversea in US, Europe and Asia.  He is also one of the pioneers of the Texas Instruments Asia Technical Training Organisation and the first Mentor workshop instructor in Asia.  As a result of his significant contribution to the company share-holder value and technical community.  He is elected to the technical ladder of Senior Member of the Technical Staff in Texas Instruments.He holds three patents from his work done in Video Compression Algorithm when in STMicroelectronics Asia Pacific.  In NTU, his research interests includes embedded system and wireless connectivity.  The research projects he is involved in are the Singapore Millennium Foundation Grant: “Think on Your Feet - Learning through Purposeful Collaborative Play and Movement”, which uses wireless connectivity technology to enable purposeful play targeted initially at special needs students, and SCALE@NTU: “Lost and Found: Localisation”, a project that uses various outdoor and indoor localisation technologies to enable effective detection and intervention of Dementia Patients who are lost or wandering.He is currently the Assistant Chair (Student Care) and has previously served as the Chair for the SCSE Outreach Committee from 2018-2020.  He is awarded the Nanyang Education Awards (School) in 2019.", "orcid": null, "other_websites": [], "bachelor_degree": null, "masters": null, "phd": null, "name": "Oh Hong Lye", "id": "rp00131", "publications": {"Publication Year": ["2005", "2021", "2009", "2017", "2009", "2006", "2020", "2022", "1997", "2021", "2002", "2023", "2022", "2015", "1996"], "Title": ["Motion vector detection with local motion estimator", "Off-line evaluation of indoor positioning systems in different scenarios: The experiences from IPIN 2020 competition", "Moving pictures encoding with constant overall bit-rate", "Smartphone orientation estimation algorithm combining Kalman filter with gradient descent", "Adaptive motion estimator", "Moving pictures encoding with constant overall bit rate", "Feature engineering for grid-based multi-floor indoor localisation using machine learning", "Singtracex: Navigation system to address wandering behavior for elders and their caregivers", "The TMS320C54x DSP HPI and PC parallel port interface", "GAN+: Data Augmentation Method using Generative Adversarial Networks and Dirichlet for Indoor", "Memory Allocation Techniques in System with Dynamic Swapping of Application Codes", "extendGAN+: Transferable Data Augmentation Framework Using WGAN-GP for Data-Driven Indoor Localisation Model", "Design Principles and Considerations for a Localisation App for Caregivers of People with Dementia", "Computer Science Course & Online Labs: Implementation, Results and Challenges", "A PARALLEL IMAGE SEGMENTATION ALGORITHM"], "Link": ["https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:ULOm3_A8WrAC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:vRqMK49ujn8C", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:NMxIlDl6LWMC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:e5wmG9Sq2KIC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:hMod-77fHWUC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:RYcK_YlVTxYC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:K3LRdlH-MEoC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:l7t_Zn2s7bgC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:WbkHhVStYXYC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:tOudhMTPpwUC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:SeFeTyx0c_EC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:tS2w5q8j5-wC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:08ZZubdj9fEC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:738O_yMBCRsC", "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=d74x37YAAAAJ&citation_for_view=d74x37YAAAAJ:W7OEmFMy1HYC"], "Topic": ["Others", "Others", "Others", "Others", "Others", "Others", "Others", "Healthcare Technology", "Others", "Others", "Others", "Federated Learning", "Computer Interaction", "Others", "Others"], "# of Citations": [53, 41, 35, 35, 32, 11, 7, 3, 3, 2, 2, 0, 0, 0, 0], "Description": ["A method and apparatus of encoding digital video, for example according to the ISO/IEC MPEG standards (ISO/IEC 11172-2 MPEG-1 and ISO/IEC 13818-2 MPEG-2), which employs a local motion estimator for determining respective local motion vectors for groups of adjacent macroblocks in a picture. A local motion vector is determined for each row of macroblocks in a picture from the motion vectors of the macroblocks in that row. Then, for macroblocks in the corresponding row of a subsequently coded picture, the local motion vector can be used to select the search window used for determining the motion vectors. The local motion estimator improves search range and accuracy of macroblock motion vector detection without increasing the search window accessing bandwidth and caching requirement, and computation lode of searching.", "Every year, for ten years now, the IPIN competition has aimed at evaluating real-world indoor localisation systems by testing them in a realistic environment, with realistic movement, using the EvAAL framework. The competition provided a unique overview of the state-of-the-art of systems, technologies, and methods for indoor positioning and navigation purposes. Through fair comparison of the performance achieved by each system, the competition was able to identify the most promising approaches and to pinpoint the most critical working conditions. In 2020, the competition included 5 diverse off-site off-site Tracks, each resembling real use cases and challenges for indoor positioning. The results in terms of participation and accuracy of the proposed systems have been encouraging. The best performing competitors obtained a third quartile of error of 1 m for the Smartphone Track and 0.5 m for the Foot-mounted …", "A method and apparatus control bit rates used in a moving pictures encoder, such as an MPEG standard encoder. A sequence of moving pictures is divided into segments each of which comprises one or more groups of pictures. A constant overall bit rate is specified for the sequence of pictures, but variable bit rate encoding used within each segment. A difference between the number of bits allocated for encoding the segment and the actual bits used for encoding is determined, and the difference distributed over one or more subsequent segments.", "Availability and all-in-one functionality of smartphones have become a multipurpose personal tool to improve our daily life. Recent advancements in hardware and accessibility of smartphones have spawn huge potential for assistive healthcare, in particular telerehabilitation. However, using smartphone sensors face certain challenges, in particular, accurate orientation estimation, which is usually less of a problem in specialized motion tracking sensor devices. Drift is one of the challenges. We first propose a simple feedback loop complementary filter (CFF) to reduce the error caused by the integration of the gyroscope's data in the orientation estimation. Next, we propose a new and better orientation estimation algorithm which combines quaternion-based kalman filter with corrector estimates using gradient descent (KFGD). We then evaluate CFF's and KFGD's performance on two early-stage rehabilitation exercises …", "A method and apparatus of encoding digital video according to the ISO/IEC MPEG standards (ISO/IEC 11172-2 MPEG-1 and ISO/IEC 13818-2 MPEG-2) using an adaptive motion estimator. A plurality of global motion vectors are derived from the motion vectors of a previous picture in a sequence, and the global motion vectors are analyzed to determine motion characteristics. The video encoding is arranged to enable switching among different types of local motion estimators based on the motion characteristics of the moving pictures sequence. This gives rise to a motion estimation algorithm that can adaptively change its search range, search area and block matching scheme to suit different types of moving sequences.", "A method and apparatus control bit rates used in a moving pictures encoder, such as an MPEG standard encoder. A sequence of moving pictures is divided into segments each of which comprises one or more groups of pictures. A constant overall bit rate is specified for the sequence of pictures, but variable bit rate encoding is used within each segment. A difference between the number of bits allocated for encoding the segment and the actual bits used for encoding is determined, and the difference is distributed over one or more subsequent segments.", "Nowadays, the need for indoor localization is increasing as it has many possible implementations in many sectors, e.g. navigation, health care, etc. In order to obtain an accurate indoor location, fingerprinting is the most commonly used method. The problem with fingerprinting approach is the high variation of RSSI values, resulting in erroneous location estimation. Machine learning approach is a new alternative to fingerprinting approach that aims to solve this problem. In this study, we adopt grid-based approach to train the Random Forest models with an end-to-end pipleline to autotune the models hyperparameter. In addition, we explore the impact of features by studying the default RSSI values for undetected AP as well as the feature importance. It highlights the significance of selecting the data pre-processing and the AP's RSSI combinations. RSSI data are collected from WiFi access points (APs) as WiFi access …", "The issue of an ever-increasing ageing population has been the increasing burden on caregivers to care for the elderly population. Caring for elders, especially those diagnosed with dementia, can be challenging. People living with dementia (PWD) require extra care and attention from the caregivers due to the associated behaviours that come with dementia. Wandering is a frequent behaviour exhibited by PWD, which can bring about negative outcomes on the PWD as well as increasing the stress of the caregivers. Though many technological solutions exist, they are not widely deployed. This paper introduces a technological framework, bridging the localisation technologies to the needs of elders and caregivers. The aim is to minimise or eliminate the negative outcomes of dementia wandering and to reduce the burden and stress on the caregivers, thus improving overall well-being. In this paper, we study the application, SingTRACeX, features by considering user needs from the field study with 2 focus group discussions (FGD), comprising of 14 professional caregivers and coordinators. The proposed system features Real-time Location Tracking and Indoor Localisation. The location is determined by GPS location from the Sensor module when outdoors, and estimation using data from the WiFi module, and Bluetooth module when indoors. The indoor navigation provided by the Indoor Localisation module uses an A-star search algorithm. This paper could serve as a foundation that can be built upon over time as the needs of elders and caregivers may change over time, as well as the evolution of technology that may bring about new methods to …", null, "Indoor localisation is indispensable to many service applications ranging from hospitals, malls, to parking lots. Several machine learning techniques have been explored with limited success. This is partly due to insufficient training data. This paper presents a data augmentation workflow, GAN+, which uses Dirichlet distribution coupled with a Generative Adversarial Network. It aims to improve the performance of the model by synthetically producing additional training samples without the need for any extra human effort. The proposed technique was tested using the multi-building dataset, UJIndoorLoc [1]. Experimental results show that the dataset generated by GAN+ can achieve an average location error that is more than ten times lower than that of the original dataset. Therefore, the proposed data augmentation scheme validates the feasibility of using GAN’s in the domain of indoor localisation.", "This application report illustrates how to manage the code/data in a system that performs dynamic swapping of routines on demand. This is process is achieved by following a simple setup procedure. This method is one of many ways to implement a dynamic swapping of applications.", "For indoor localisation, a challenge in data-driven localisation is to ensure sufficient data to train the prediction model to produce a good accuracy. However, for WiFi-based data collection, human effort is still required to capture a large amount of data as the representation Received Signal Strength (RSS) could easily be affected by obstacles and other factors. In this paper, we propose an extendGAN+ pipeline that leverages up-sampling with the Dirichlet distribution to improve location prediction accuracy with small sample sizes, applies transferred WGAN-GP for synthetic data generation, and ensures data quality with a filtering module. The results highlight the effectiveness of the proposed data augmentation method not only by localisation performance but also showcase the variety of RSS patterns it could produce. Benchmarking against the baseline methods such as fingerprint, random forest, and its base dataset with localisation models, extendGAN+ shows improvements of up to 23.47%, 25.35%, and 18.88% respectively. Furthermore, compared to existing GAN+ methods, it reduces training time by a factor of four due to transfer learning and improves performance by 10.13%.", "The number of people suffering from Dementia has been increasing, increasing the burden of caregivers living in the community. Despite the potential of mHealth technologies, many of these systems have low acceptance and adoption rate due to varying needs and dynamics of users, such as primary and secondary caregivers. Hence, we aims to consolidate user interaction and assess the proposed design with potential users. This paper reports on the methodology used for determining user’s requirements for different types of caregivers and the development of a tracking and localization mHealth application for the caregivers of a person with dementia with wandering and getting lost behaviour. Remote Usability testing was conducted on the SingTRACeX application using scenario-based methods and feedback was obtained for the refinement of the application. Lessons learned and higher design principles and …", "An ICT platform hosting online experiment with hardware remote access was implemented for computer science course on computer architecture at the School of Computer Engineering, Nanyang Technological University, from 2013 to 2015. Using an experimental approach, the author attempted to understand the challenges and efforts needed to develop an online lab system. The EDEX online lab was used to supplement conventional labs. The labs were made available to students for specified days and could be internet accessed anytime and anywhere. User data was used to address questions about the effectiveness of the online labs in improving the learning outcomes and user experience. The findings validated the effectiveness of online labs and its use as supplement to conventional labs.", "A new representation scheme for sparsely distributed range data based on convex hulls in regularly divided and non-overlapping sub-images has been derived. A fast algorithm is used for the convex hull extraction in each sub-image. Image segmentation and high level feature extraction can be easily done using this new data representation. Furthermore, texture and range data are combined to produce more reliable segmentation of the scene. The texture analysis in each sub-image is restricted to the area encompassed by the convex hull obtained from the range image analysis. All the information collected in this convex hull based representation are then used for image segmentation by merging together convex hulls that belong to the same region."]}, "collaboration_network": {"target": [], "target_id": [], "type": [], "location": [], "year": [], "title": [], "link": []}, "published_by_year": {"Year": ["1996", "1997", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023"], "# of Publications": [1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 2, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 2, 2, 1]}, "citations_by_year": {"Year": ["1997", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023", "unknown"], "# of Citations": [0, 0, 0, 0, 0, 0, 0, 3, 3, 2, 4, 1, 3, 2, 7, 14, 12, 12, 14, 7, 7, 6, 11, 19, 26, 37, 33, 1]}, "all_time_h_index": 7, "all_time_i10_index": 6, "all_time_i20_index": 5, "h_index_by_year": {"Year": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 2, 2, 2, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 6, 7]}, "h_index_by_publication_year": {"Publication Year": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "h-index": [0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 2, 1, 0]}, "avg_citations_by_publication_year": {"Publication Year": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023], "Avg Citations per Publication": [0.0, 3.0, 0.0, 0.0, 0.0, 0.0, 2.0, 0.0, 0.0, 52.0, 11.0, 0.0, 0.0, 33.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 35.0, 0.0, 0.0, 7.0, 21.5, 1.5, 0.0]}, "h_index_by_years_from_publication_year": {"Publication Year": [1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1996, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1997, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1998, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 1999, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2001, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2002, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2003, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2004, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2005, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2006, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2010, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2011, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2014, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2018, 2018, 2018, 2018, 2018, 2018, 2019, 2019, 2019, 2019, 2019, 2020, 2020, 2020, 2020, 2021, 2021, 2021, 2022, 2022, 2023], "Year": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2018, 2019, 2020, 2021, 2022, 2023, 2019, 2020, 2021, 2022, 2023, 2020, 2021, 2022, 2023, 2021, 2022, 2023, 2022, 2023, 2023], "h-index": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 1, 1, 0]}}