[{"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:PELIpwtuRlgC", "title": "Privacy-preserving blockchain-based federated learning for IoT devices", "authors": ["Yang Zhao", "Jun Zhao", "Linshan Jiang", "Rui Tan", "Dusit Niyato", "Zengxiang Li", "Lingjuan Lyu", "Yingbo Liu"], "description": "Home appliance manufacturers strive to obtain feedback from users to improve their products and services to build a smart home system. To help manufacturers develop a smart home system, we design a federated learning (FL) system leveraging a reputation mechanism to assist home appliance manufacturers to train a machine learning model based on customers’ data. Then, manufacturers can predict customers’ requirements and consumption behaviors in the future. The working flow of the system includes two stages: in the first stage, customers train the initial model provided by the manufacturer using both the mobile phone and the mobile-edge computing (MEC) server. Customers collect data from various home appliances using phones, and then they download and train the initial model with their local data. After deriving local models, customers sign on their models and send them to the blockchain. In case …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [8, 65, 124, 129, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:NaGl4SEjCO4C", "title": "Software-Defined Networking for Smart Grid Resilience: Opportunities and Challenges", "authors": ["Xinshu Dong", "Hui Lin", "Rui Tan", "Ravishankar K Iyer", "Zbigniew Kalbarczyk"], "description": "Software-defined networking (SDN) is an emerging networking paradigm that provides unprecedented flexibility in dynamically reconfiguring an IP network. It enables various applications such as network management, quality of service (QoS) optimization, and system resilience enhancement. Pilot studies have investigated the possibilities of applying SDN on smart grid communications, while the specific benefits and risks that SDN may bring to the resilience of smart grids against accidental failures and malicious attacks remain largely unexplored. Without a systematic understanding of these issues and convincing validations of proposed solutions, the power industry will be unlikely to embrace SDN, since resilience is always a key consideration for critical infrastructures like power grids. In this position paper, we aim to provide an initial understanding of these issues, by investigating (1) how SDN can enhance the …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [8, 27, 27, 37, 35, 26, 19, 16, 12, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:M3ejUd6NZC8C", "title": "Data fusion improves the coverage of wireless sensor networks", "authors": ["Guoliang Xing", "Rui Tan", "Benyuan Liu", "Jianping Wang", "Xiaohua Jia", "Chih-Wei Yi"], "description": "Wireless sensor networks (WSNs) have been increasingly available for critical applications such as security surveillance and environmental monitoring. An important performance measure of such applications is sensing coverage that characterizes how well a sensing field is monitored by a network. Although advanced collaborative signal processing algorithms have been adopted by many existing WSNs, most previous analytical studies on sensing coverage are conducted based on overly simplistic sensing models (e.g., the disc model) that do not capture the stochastic nature of sensing. In this paper, we attempt to bridge this gap by exploring the fundamental limits of coverage based on stochastic data fusion models that fuse noisy measurements of multiple sensors. We derive the scaling laws between coverage, network density, and signal-to-noise ratio (SNR). We show that data fusion can significantly improve …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 21, 26, 27, 20, 25, 13, 11, 8, 3, 11, 8, 3, 3, 1, 2]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:dfsIfKJdRG4C", "title": "Modeling and mitigating impact of false data injection attacks on automatic generation control", "authors": ["Rui Tan", "Hoang Hai Nguyen", "Eddy YS Foo", "David KY Yau", "Zbigniew Kalbarczyk", "Ravishankar K Iyer", "Hoay Beng Gooi"], "description": "This paper studies the impact of false data injection (FDI) attacks on automatic generation control (AGC), a fundamental control system used in all power grids to maintain the grid frequency at a nominal value. Attacks on the sensor measurements for AGC can cause frequency excursion that triggers remedial actions, such as disconnecting customer loads or generators, leading to blackouts, and potentially costly equipment damage. We derive an attack impact model and analyze an optimal attack, consisting of a series of FDIs that minimizes the remaining time until the onset of disruptive remedial actions, leaving the shortest time for the grid to counteract. We show that, based on eavesdropped sensor data and a few feasible-to-obtain system constants, the attacker can learn the attack impact model and achieve the optimal attack in practice. This paper provides essential understanding on the limits of physical impact …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [6, 21, 25, 35, 34, 31, 25, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:qxL8FJ1GzNcC", "title": "Mobile element assisted cooperative localization for wireless sensor networks with obstacles", "authors": ["Hongyang Chen", "Qingjiang Shi", "Rui Tan", "H Vincent Poor", "Kaoru Sezaki"], "description": "In this paper, a cooperative localization algorithm is proposed that considers the existence of obstacles in mobility-assisted wireless sensor networks (WSNs). An optimal movement scheduling method with mobile elements (MEs) is proposed to address limitations of static WSNs in node localization. In this scheme, a mobile anchor node cooperates with static sensor nodes and moves actively to refine location performance. It takes advantage of cooperation between MEs and static sensors while, at the same time, taking into account the relay node availability to make the best use of beacon signals. For achieving high localization accuracy and coverage, a novel convex position estimation algorithm is proposed, which can effectively solve the problem when infeasible points occur because of the effects of radio irregularity and obstacles. This method is the only rangefree based convex method to solve the localization …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 13, 14, 18, 18, 15, 14, 19, 12, 13, 14, 13, 5, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:abG-DnoFyZgC", "title": "Enhanced hidden moving target defense in smart grids", "authors": ["Jue Tian", "Rui Tan", "Xiaohong Guan", "Ting Liu"], "description": "Recent research has proposed a moving target defense (MTD) approach that actively changes transmission line susceptance to preclude stealthy false data injection (FDI) attacks against the state estimation of a smart grid. However, existing studies were often conducted under a weak adversarial setting, in that they ignore the possibility that alert attackers can also try to detect the activation of MTD before they launch the FDI attacks. We call this new threat as parameter confirming-first (PCF) FDI. To improve the stealthiness of MTD, we propose a hidden MTD approach that cannot be detected by the attackers and prove its equivalence to an MTD that maintains the power flows of the whole grid. Moreover, we analyze the completeness of MTD and show that any hidden MTD is incomplete in that FDI attacks may bypass the hidden MTD opportunistically. This result suggests that the stealthiness and completeness are …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [12, 16, 20, 25, 29, 21, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:dhFuZR0502QC", "title": "Exploiting data fusion to improve the coverage of wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Benyuan Liu", "Jianping Wang", "Xiaohua Jia"], "description": "Wireless sensor networks (WSNs) have been increasingly available for critical applications such as security surveillance and environmental monitoring. An important performance measure of such applications is sensing coverage that characterizes how well a sensing field is monitored by a network. Although advanced collaborative signal processing algorithms have been adopted by many existing WSNs, most previous analytical studies on sensing coverage are conducted based on overly simplistic sensing models (e.g., the disc model) that do not capture the stochastic nature of sensing. In this paper, we attempt to bridge this gap by exploring the fundamental limits of coverage based on stochastic data fusion models that fuse noisy measurements of multiple sensors. We derive the scaling laws between coverage, network density, and signal-to-noise ratio (SNR). We show that data fusion can significantly improve …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 8, 11, 18, 19, 11, 9, 17, 7, 4, 7, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:j3f4tGmQtD8C", "title": "Impact of integrity attacks on real-time pricing in smart grids", "authors": ["Rui Tan", "Varun Badrinath Krishna", "David KY Yau", "Zbigniew Kalbarczyk"], "description": "Modern information and communication technologies used by smart grids are subject to cybersecurity threats. This paper studies the impact of integrity attacks on real-time pricing (RTP), a key feature of smart grids that uses such technologies to improve system efficiency. Recent studies have shown that RTP creates a closed loop formed by the mutually dependent real-time price signals and price-taking demand. Such a closed loop can be exploited by an adversary whose objective is to destabilize the pricing system. Specifically, small malicious modifications to the price signals can be iteratively amplified by the closed loop, causing inefficiency and even severe failures such as blackouts. This paper adopts a control-theoretic approach to deriving the fundamental conditions of RTP stability under two broad classes of integrity attacks, namely, the scaling and delay attacks. We show that the RTP system is at risk of …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 5, 7, 20, 8, 10, 20, 14, 9, 12, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:9vf0nzSNQJEC", "title": "Mobile edge computing, blockchain and reputation-based crowdsourcing iot federated learning: A secure, decentralized and privacy-preserving system", "authors": ["Yang Zhao", "Jun Zhao", "Linshan Jiang", "Rui Tan", "Dusit Niyato"], "description": "Internet-of-Things (IoT) companies strive to get feedback from users to improve their products and services. However, traditional surveys cannot reflect the actual conditions of customers’ due to the limited questions. Besides, survey results are affected by various subjective factors. In contrast, the recorded usages of IoT devices reflect customers’ behaviours more comprehensively and accurately. We design an intelligent system to help IoT device manufacturers to take advantage of customers’ data and build a machine learning model to predict customers’ requirements and possible consumption behaviours with federated learning (FL) technology. The FL consists of two stages: in the first stage, customers train the initial model using the phone and the edge computing server collaboratively. The mobile edge computing server’s high computation power can assist customers’ training locally. Customers first collect data from various IoT devices using phones, and then download and train the initial model with their data. During the training, customers first extract features using their mobiles, and then add the Laplacian noise to the extracted features based on differential privacy, a formal and popular notion to quantify privacy. After achieving the local model, customers sign on their models respectively and send them to the blockchain. We use the blockchain to replace the centralized aggregator which belongs to the third party in FL. In the second stage, miners calculate the averaged model using the collected models sent from customers. By the end of the crowdsourcing job, one of the miners, who is selected as the temporary leader, uploads the model …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 31, 32, 32, 8, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:aqlVkmm33-oC", "title": "Quality-driven volcanic earthquake detection using wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Jinzhu Chen", "Wen-Zhan Song", "Renjie Huang"], "description": "Volcano monitoring is of great interest to public safety and scientific explorations. However, traditional volcanic instrumentation such as broadband seismometers are expensive, power-hungry, bulky, and difficult to install. Wireless sensor networks (WSNs) offer the potential to monitor volcanoes at unprecedented spatial and temporal scales. However, current volcanic WSN systems often yield poor monitoring quality due to the limited sensing capability of low-cost sensors and unpredictable dynamics of volcanic activities. Moreover, they are designed only for short-term monitoring due to the high energy consumption of centralized data collection. In this paper, we propose a novel quality-driven approach to achieving real-time, in-situ, and long-lived volcanic earthquake detection. By employing novel in-network collaborative signal processing algorithms, our approach can meet stringent requirements on sensing …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 14, 14, 16, 21, 11, 6, 2, 3, 4, 4, 2, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:4DMP91E08xMC", "title": "Exploiting reactive mobility for collaborative target detection in wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Jianping Wang", "Hing Cheung So"], "description": "Recent years have witnessed the deployments of wireless sensor networks in a class of mission-critical applications such as object detection and tracking. These applications often impose stringent Quality-of-Service requirements including high detection probability, low false alarm rate, and bounded detection delay. Although a dense all-static network may initially meet these Quality-of-Service requirements, it does not adapt to unpredictable dynamics in network conditions (e.g., coverage holes caused by death of nodes) or physical environments (e.g., changed spatial distribution of events). This paper exploits reactive mobility to improve the target detection performance of wireless sensor networks. In our approach, mobile sensors collaborate with static sensors and move reactively to achieve the required detection performance. Specifically, mobile sensors initially remain stationary and are directed to move …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 8, 8, 13, 8, 4, 7, 14, 9, 16, 6, 2, 1, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:dTyEYWd-f8wC", "title": "LMAC: Efficient carrier-sense multiple access for LoRa", "authors": ["Amalinda Gamage", "Jansen Liando", "Chaojie Gu", "Rui Tan", "Mo Li", "Olivier Seller"], "description": "Current LoRa networks including those following the LoRaWAN specification use the primitive ALOHA mechanism for media access control due to LoRa’s lack of carrier sense capability. From our extensive measurements, the channel activity detection feature that was recently introduced to LoRa for energy-efficiently detecting preamble chirps can also detect payload chirps reliably. This sheds light on an efficient carrier-sense multiple access protocol that we refer to as LMAC for LoRa networks. This article presents the designs of three advancing versions of LMAC that respectively implement carrier-sense multiple access, and balance the communication loads among the channels defined by frequencies and spreading factors based on the end nodes’ local information and then additionally the gateway’s global information. Experiments on a 50-node lab testbed and a 16-node university deployment show that …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [38, 58]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:35N4QoGY0k4C", "title": "Optimal false data injection attack against automatic generation control in power grids", "authors": ["Rui Tan", "Hoang Hai Nguyen", "Eddy YS Foo", "Xinshu Dong", "David KY Yau", "Zbigniew Kalbarczyk", "Ravishankar K Iyer", "Hoay Beng Gooi"], "description": "This paper studies false data injection attacks against automatic generation control (AGC), a fundamental control system used in all power grids to maintain the grid frequency at a nominal value. Attacks on the sensor measurements for AGC can cause frequency excursion that triggers remedial actions such as disconnecting customer loads or generators, leading to blackouts and potentially costly equipment damage. We derive an attack impact model and analyze an optimal attack, consisting of a series of false data injections, that minimizes the remaining time until the onset of remedial actions, leaving the shortest time for the grid to counteract. We show that, based on eavesdropped sensor data and a few feasible-to-obtain system constants, the attacker can learn the attack impact model and achieve the optimal attack in practice. This paper provides essential understanding on the limits of physical impact of false …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 14, 8, 18, 15, 10, 8, 14, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:ZeXyd9-uunAC", "title": "Volcanic earthquake timing using wireless sensor networks", "authors": ["Guojin Liu", "Rui Tan", "Ruogu Zhou", "Guoliang Xing", "Wen-Zhan Song", "Jonathan M Lees"], "description": "Recent years have witnessed pilot deployments of inexpensive wireless sensor networks (WSNs) for active volcano monitoring. This paper studies the problem of picking arrival times of primary waves (i.e., P-phases) received by seismic sensors, one of the most critical tasks in volcano monitoring. Two fundamental challenges must be addressed. First, it is virtually impossible to download the real-time high-frequency seismic data to a central station for P-phase picking due to limited wireless network bandwidth. Second, accurate P-phase picking is inherently computation-intensive, and is thus prohibitive for many low-power sensor platforms. To address these challenges, we propose a new P-phase picking approach for hierarchical volcano monitoring WSNs where a large number of inexpensive sensors are used to collect fine-grained, real-time seismic signals while a small number of powerful coordinator nodes …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [7, 8, 24, 13, 11, 7, 5, 5, 3, 2, 3, 1]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:tS2w5q8j5-wC", "title": "Moving Target Defense Approach to Detecting Stuxnet-Like Attacks", "authors": ["Jue Tian", "Rui Tan", "Xiaohong Guan", "Zhanbo Xu", "Ting Liu"], "description": "Recent cybersecurity incidents such as Stuxnet and Irongate alert us to the threats faced by critical cyber-physical systems. These attacks compromise the control signals to push the system to unsafe regions and meanwhile, inject fake sensor measurements to cover the ongoing attack. Detecting these Stuxnet-like (SL) attacks still remains an open research issue. This paper analyzes the taxonomy, construction, and implication of SL attacks in CPS control loops. We propose to apply the moving target defense (MTD) approach that actively changes the system configuration to detect SL attacks, since these attacks are generally constructed based on the knowledge about the system's configuration. We analyze the basic conditions for MTD to be successful. Finally, as a case study, we apply MTD for the secondary voltage control of power grids and present simulation results based on the IEEE 39-bus test system under …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 11, 19, 30, 19, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:hFOr9nPyWt4C", "title": "A high-fidelity temperature distribution forecasting system for data centers", "authors": ["Jinzhu Chen", "Rui Tan", "Yu Wang", "Guoliang Xing", "Xiaorui Wang", "Xiaodong Wang", "Bill Punch", "Dirk Colbry"], "description": "Data centers have become a critical computing infrastructure in the era of cloud computing. Temperature monitoring and forecasting are essential for preventing overheating-induced server shutdowns and improving a data center's energy efficiency. This paper presents a novel cyber-physical approach for temperature forecasting in data centers, which integrates Computational Fluid Dynamics (CFD) modeling, in situ wireless sensing, and real-time data-driven prediction. To ensure the forecasting fidelity, we leverage the realistic physical thermodynamic models of CFD to generate transient temperature distribution and calibrate it using sensor feedback. Both simulated temperature distribution and sensor measurements are then used to train a real-time prediction algorithm. As a result, our approach significantly reduces the computational complexity of online temperature modeling and prediction, which enables a …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 4, 6, 3, 3, 7, 3, 8, 9, 9, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:TQgYirikUcIC", "title": "System-level calibration for data fusion in wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Zhaohui Yuan", "Xue Liu", "Jianguo Yao"], "description": "Wireless sensor networks are typically composed of low-cost sensors that are deeply integrated in physical environments. As a result, the sensing performance of a wireless sensor network is inevitably undermined by biases in imperfect sensor hardware and the noises in data measurements. Although a variety of calibration methods have been proposed to address these issues, they often adopt the device-level approach that becomes intractable for moderate-to large-scale networks. In this article, we propose a two-tier system-level calibration approach for a class of sensor networks that employ data fusion to improve the sensing performance. In the first tier of our calibration approach, each sensor learns its local sensing model from noisy measurements using an online algorithm and only transmits a few model parameters. In the second tier, sensors' local sensing models are then calibrated to a common system …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 8, 8, 5, 4, 5, 9, 8, 4, 3, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:_Qo2XoVZTnwC", "title": "Fusion-based volcanic earthquake detection and timing in wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Jinzhu Chen", "Wen-Zhan Song", "Renjie Huang"], "description": "Volcano monitoring is of great interest to public safety and scientific explorations. However, traditional volcanic instrumentation such as broadband seismometers are expensive, power hungry, bulky, and difficult to install. Wireless sensor networks (WSNs) offer the potential to monitor volcanoes on unprecedented spatial and temporal scales. However, current volcanic WSN systems often yield poor monitoring quality due to the limited sensing capability of low-cost sensors and unpredictable dynamics of volcanic activities. In this article, we propose a novel quality-driven approach to achieving real-time, distributed, and long-lived volcanic earthquake detection and timing. By employing novel in-network collaborative signal processing algorithms, our approach can meet stringent requirements on sensing quality (i.e., low false alarm/missing rate, short detection delay, and precise earthquake onset time) at low power …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 4, 12, 5, 6, 6, 2, 5, 4, 2, 5, 1]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:e5wmG9Sq2KIC", "title": "Supero: A sensor system for unsupervised residential power usage monitoring", "authors": ["Dennis E Phillips", "Rui Tan", "Mohammad-Mahdi Moazzami", "Guoliang Xing", "Jinzhu Chen", "David KY Yau"], "description": "As a key technology of home area networks in smart grids, fine-grained power usage monitoring may help conserve electricity. Several existing systems achieve this goal by exploiting appliances' power usage signatures identified in labor-intensive in situ training processes. Recent work shows that autonomous power usage monitoring can be achieved by supplementing a smart meter with distributed sensors that detect the working states of appliances. However, sensors must be carefully installed for each appliance, resulting in high installation cost. This paper presents Supero - the first ad hoc sensor system that can monitor appliance power usage without supervised training. By exploiting multisensor fusion and unsupervised machine learning algorithms, Supero can classify the appliance events of interest and autonomously associate measured power usage with the respective appliances. Our extensive …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 5, 7, 5, 3, 2, 9, 5, 3, 3, 10, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&citation_for_view=co5MGPkAAAAJ:9ZlFYXVOiuMC", "title": "Fast sensor placement algorithms for fusion-based target detection", "authors": ["Zhaohui Yuan", "Rui Tan", "Guoliang Xing", "Chenyang Lu", "Yixin Chen", "Jianping Wang"], "description": "Mission-critical target detection imposes stringent performance requirements for wireless sensor networks, such as high detection probabilities and low false alarm rates. Data fusion has been shown as an effective technique for improving system detection performance by enabling efficient collaboration among sensors with limited sensing capability. Due to the high cost of network deployment, it is desirable to place sensors at optimal locations to achieve maximum detection performance. However, for sensor networks employing data fusion, optimal sensor placement is a non-linear optimizationproblem with prohibitive computational complexity. In this paper, we present fast sensor placement algorithms based on a probabilistic data fusion model.Simulation results show that our algorithms can meet the desired detection performance with a small number of sensors while achieving up to 7-fold speedup over the …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 13, 4, 7, 2, 4, 2, 7, 2, 0, 2, 1, 2, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:QIV2ME_5wuYC", "title": "Traffic video segmentation using adaptive-k gaussian mixture model", "authors": ["Rui Tan", "Hong Huo", "Jin Qian", "Tao Fang"], "description": "Video segmentation is an important phase in video based traffic surveillance applications. The basic task of traffic video segmentation is to classify pixels in the current frame to road background or moving vehicles, and casting shadows should be taken into account if exists. In this paper, a modified online EM procedure is proposed to construct Adaptive-K Gaussian Mixture Model (AKGMM) in which the dimension of the parameter space at each pixel can adaptively reflects the complexity of pattern at the pixel. A heuristic background components selection rule is developed to make pixel classification decision based on the proposed model. Our approach is demonstrated to be more adaptive, accurate and robust than some existing similar pixel modeling approaches through experimental results.", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 5, 3, 5, 4, 4, 2, 6, 6, 3, 2, 3, 0, 0, 2, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:iH-uZ7U-co4C", "title": "Go with the flow: Toward workflow-oriented security assessment", "authors": ["Binbin Chen", "Zbigniew Kalbarczyk", "David M Nicol", "William H Sanders", "Rui Tan", "William G Temple", "Nils Ole Tippenhauer", "An Hoa Vu", "David KY Yau"], "description": "In this paper we advocate the use of workflow---describing how a system provides its intended functionality---as a pillar of cybersecurity analysis and propose a holistic workflow-oriented assessment framework. While workflow models are currently used in the area of performance and reliability assessment, these approaches are designed neither to assess a system in the presence of an active attacker, nor to assess security aspects such as confidentiality. On the other hand, existing security assessment methods typically focus on modeling the active attacker (e.g., attack graphs), but many rely on restrictive models that are not readily applicable to complex (e.g., cyber-physical or cyber-human) systems. By \"going with the flow,\" our assessment framework can naturally adopt a holistic view of such systems, unifying information about system components, their properties, and possible attacks to argue about a security …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 11, 11, 4, 5, 0, 2, 1, 3, 3, 2]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:p2g8aNsByqUC", "title": "LoRa-Based Localization: Opportunities and Challenges", "authors": ["Chaojie Gu", "Linshan Jiang", "Rui Tan"], "description": "Low-power wide-area network (LPWAN) technologies featuring long-range communication capability and low power consumption will be important for forming the Internet of Things (IoT) consisting of many geographically distributed objects. Among various appearing LPWAN technologies, LoRa has received the most research attention due to its open specifications and gateway infrastructures unlike the closed designs and/or managed gateway infrastructures of other LPWAN technologies. While existing studies on LoRa has focused on network connectivity and performance, accurate positioning of LoRa end devices is still largely an open issue. In this paper, we discuss and analyze the physical layer features of LoRa that are relevant to localization. Our discussions and analysis illustrate the opportunities and challenges in implementing LoRa-based localization.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 5, 21, 11, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:7PzlFSSx8tAC", "title": "Adaptive calibration for fusion-based wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Xue Liu", "Jianguo Yao", "Zhaohui Yuan"], "description": "Wireless sensor networks (WSNs) are typically composed of low-cost sensors that are deeply integrated with physical environments. As a result, the sensing performance of a WSN is inevitably undermined by various physical uncertainties, which include stochastic sensor noises, unpredictable environment changes and dynamics of the monitored phenomenon. Traditional solutions (e.g., sensor calibration and collaborative signal processing) work in an open-loop fashion and hence fail to adapt to these uncertainties after system deployment. In this paper, we propose an adaptive system-level calibration approach for a class of sensor networks that employ data fusion to improve system sensing performance. Our approach features a feedback control loop that exploits sensor heterogeneity to deal with the aforementioned uncertainties in calibrating system performance. In contrast to existing heuristic based solutions …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 5, 4, 7, 5, 7, 2, 0, 2, 0, 4, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:IWHjjKOFINEC", "title": "Sensor placement algorithms for fusion-based surveillance networks", "authors": ["Xiangmao Chang", "Rui Tan", "Guoliang Xing", "Zhaohui Yuan", "Chenyang Lu", "Yixin Chen", "Yixian Yang"], "description": "Mission-critical target detection imposes stringent performance requirements for wireless sensor networks, such as high detection probabilities and low false alarm rates. Data fusion has been shown as an effective technique for improving system detection performance by enabling efficient collaboration among sensors with limited sensing capability. Due to the high cost of network deployment, it is desirable to place sensors at optimal locations to achieve maximum detection performance. However, for sensor networks employing data fusion, optimal sensor placement is a nonlinear and nonconvex optimization problem with prohibitively high computational complexity. In this paper, we present fast sensor placement algorithms based on a probabilistic data fusion model. Simulation results show that our algorithms can meet the desired detection performance with a small number of sensors while achieving up to seven …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 4, 6, 3, 6, 3, 1, 7, 3, 2, 5, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:Wp0gIr-vW9MC", "title": "Collaborative target detection in wireless sensor networks with reactive mobility", "authors": ["Rui Tan", "Guoliang Xing", "Jianping Wang", "Hing Cheung So"], "description": "Recent years have witnessed the deployments of wireless sensor networks in a class of mission-critical applications such as object detection and tracking. These applications often impose stringent QoS requirements including high detection probability, low false alarm rate and bounded detection delay. Although a dense all-static network may initially meet these QoS requirements, it does not adapt to unpredictable dynamics in network conditions (e.g., coverage holes caused by death of nodes) or physical environments (e.g., changed spatial distribution of events). This paper exploits reactive mobility to improve the target detection performance of wireless sensor networks. In our approach, mobile sensors collaborate with static sensors and move reactively to achieve the required detection performance. Specifically, mobile sensors initially remain stationary and are directed to move toward a possible target only …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 4, 9, 3, 3, 2, 6, 0, 5, 2, 3, 0, 1, 2, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:1sJd4Hv_s6UC", "title": "Detecting Wireless Spy Cameras Via Stimulating and Probing", "authors": ["Tian Liu", "Ziyu Liu", "Jun Huang", "Rui Tan", "Zhen Tan"], "description": "The rapid proliferation of wireless video cameras has raised serious privacy concerns. In this paper, we propose a stimulating-and-probing approach to detecting wireless spy cameras. The core idea is to actively alter the light condition of a private space to manipulate the spy camera's video scene, and then investigates the responsive variations of a packet flow to determine if it is produced by a wireless camera. Following this approach, we develop Blink and Flicker -- two practical systems for detecting wireless spy cameras. Blink is a lightweight app that can be deployed on off-the-shelf mobile devices. It asks the user to turn on/off the light of her private space, and then uses the light sensor and the wireless radio of the mobile device to identify the response of wireless cameras. Flicker is a robust and automated system that augments Blink to detect wireless cameras in both live and offline streaming modes. Flicker …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 6, 7, 14, 11, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:Tiz5es2fbqcC", "title": "Towards Touch-to-Access Device Authentication Using Induced Body Electric Potentials", "authors": ["Zhenyu Yan", "Qun Song", "Rui Tan", "Yang Li", "Adams Wai Kin Kong"], "description": "This paper presents TouchAuth, a new touch-to-access device authentication approach using induced body electric potentials (iBEPs) caused by the indoor ambient electric field that is mainly emitted from the building's electrical cabling. The design of TouchAuth is based on the electrostatics of iBEP generation and a resulting property, i.e., the iBEPs at two close locations on the same human body are similar, whereas those from different human bodies are distinct. Extensive experiments verify the above property and show that TouchAuth achieves high-profile receiver operating characteristics in implementing the touch-to-access policy. Our experiments also show that a range of possible interfering sources including appliances' electromagnetic emanations and noise injections into the power network do not affect the performance of TouchAuth. A key advantage of TouchAuth is that the iBEP sensing requires a …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 11, 9, 14, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:u9iWguZQMMsC", "title": "On lightweight privacy-preserving collaborative learning for internet-of-things objects", "authors": ["Linshan Jiang", "Rui Tan", "Xin Lou", "Guosheng Lin"], "description": "The Internet of Things (IoT) will be a main data generation infrastructure for achieving better system intelligence. This paper considers the design and implementation of a practical privacy-preserving collaborative learning scheme, in which a curious learning coordinator trains a better machine learning model based on the data samples contributed by a number of IoT objects, while the confidentiality of the raw forms of the training data is protected against the coordinator. Existing distributed machine learning and data encryption approaches incur significant computation and communication overhead, rendering them ill-suited for resource-constrained IoT objects. We study an approach that applies independent Gaussian random projection at each IoT object to obfuscate data and trains a deep neural network at the coordinator based on the projected data from the IoT objects. This approach introduces light …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 13, 10, 11, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:nb7KW1ujOQ8C", "title": "Simultaneous Localization and Mapping with Power Network Electromagnetic Field", "authors": ["Chris Xiaoxuan Lu", "Yang Li", "Peijun Zhao", "Changhao Chen", "Linhai Xie", "Hongkai Wen", "Rui Tan", "Niki Trigoni"], "description": "Various sensing modalities have been exploited for indoor location sensing, each of which has well understood limitations, however. This paper presents a first systematic study on using the electromagnetic field (EMF) induced by a building's electric power network for simultaneous localization and mapping (SLAM). A basis of this work is a measurement study showing that the power network EMF sensed by either a customized sensor or smartphone's microphone as a side-channel sensor is spatially distinct and temporally stable. Based on this, we design a SLAM approach that can reliably detect loop closures based on EMF sensing results. With the EMF feature map constructed by SLAM, we also design an efficient online localization scheme for resource-constrained mobiles. Evaluation in three indoor spaces shows that the power network EMF is a promising modality for location sensing on mobile devices …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 7, 15, 6, 6, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:qUcmZB5y_30C", "title": "Fidelity-aware utilization control for cyber-physical surveillance systems", "authors": ["Jinzhu Chen", "Rui Tan", "Guoliang Xing", "Xiaorui Wang", "Xing Fu"], "description": "Recent years have seen the growing deployments of Cyber-Physical Systems (CPSs) in many mission-critical applications such as security, civil infrastructure, and transportation. These applications often impose stringent requirements on system sensing fidelity and timeliness. However, existing approaches treat these two concerns in isolation and hence are not suitable for CPSs where system fidelity and timeliness are dependent on each other because of the tight integration of computational and physical resources. In this paper, we propose a holistic approach called Fidelity-Aware Utilization Controller (FAUC) for Wireless Cyber-physical Surveillance (WCS) systems that combine low-end sensors with cameras for large-scale ad hoc surveillance in unplanned environments. By integrating data fusion with feedback control, FAUC can enforce a CPU utilization upper bound to ensure the system's real-time …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 7, 6, 5, 7, 5, 1, 1, 0, 2, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:L8Ckcad2t8MC", "title": "Mobile scheduling for spatiotemporal detection in wireless sensor networks", "authors": ["Guoliang Xing", "Jianping Wang", "Zhaohui Yuan", "Rui Tan", "Limin Sun", "Qingfeng Huang", "Xiaohua Jia", "Hing Cheung So"], "description": "Wireless sensor networks (WSNs) deployed for mission-critical applications face the fundamental challenge of meeting stringent spatiotemporal performance requirements using nodes with limited sensing capacity. Although advance network planning and dense node deployment may initially achieve the required performance, they often fail to adapt to the unpredictability and variability of physical reality. This paper explores efficient use of mobile sensors to address limitations of static WSNs for target detection. We propose a data-fusion-based detection model that enables static and mobile sensors to effectively collaborate in target detection. An optimal sensor movement scheduling algorithm is developed to minimize the total moving distance of sensors while achieving a set of spatiotemporal performance requirements including high detection probability, low system false alarm rate, and bounded detection delay …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 6, 8, 3, 2, 3, 4, 1, 2, 3, 2, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:evX43VCCuoAC", "title": "LIMU-BERT: Unleashing the Potential of Unlabeled Data for IMU Sensing Applications", "authors": ["Huatao Xu", "Pengfei Zhou", "Rui Tan", "Mo Li", "Guobin Shen"], "description": "Deep learning greatly empowers Inertial Measurement Unit (IMU) sensors for various mobile sensing applications, including human activity recognition, human-computer interaction, localization and tracking, and many more. Most existing works require substantial amounts of well-curated labeled data to train IMU-based sensing models, which incurs high annotation and training costs. Compared with labeled data, unlabeled IMU data are abundant and easily accessible. In this work, we present LIMU-BERT, a novel representation learning model that can make use of unlabeled IMU data and extract generalized rather than task-specific features. LIMU-BERT adopts the principle of self-supervised training of the natural language model BERT to effectively capture temporal relations and feature distributions in IMU sensor measurements. However, the original BERT is not adaptive to mobile IMU data. By meticulously …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 14, 21, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:tkaPQYYpVKoC", "title": "Stealthy actuator signal attacks in stochastic control systems: Performance and limitations", "authors": ["Chongrong Fang", "Yifei Qi", "Jiming Chen", "Rui Tan", "Wei Xing Zheng"], "description": "In this technical note, the tradeoff between the attack detectability and the performance degradation in stochastic cyber-physical systems is investigated. We consider a linear time-invariant system in which the attack detector performs a hypothesis test on the innovation of the Kalman filter to detect malicious tampering with the actuator signals. We adopt a notion of attack stealthiness to quantify the degree of stealth by limiting the maximum achievable exponents of both false alarm probability and detection probability below certain thresholds. And the conditions for any actuator attack to have a specific level of stealthiness are derived. Additionally, we characterize the upper bound of the performance degradation induced by attacks with a given extent of stealthiness that produces independent and identically distributed Gaussian innovations, and design the attack, which achieves the stated upper bound for right …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 4, 18, 13, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:isC4tDSrTZIC", "title": "PTEC: A system for predictive thermal and energy control in data centers", "authors": ["Jinzhu Chen", "Rui Tan", "Guoliang Xing", "Xiaorui Wang"], "description": "Current data centers often adopt conservative and static settings for cooling and air circulation systems, leading to excessive energy consumption. This paper presents the design and evaluation of PTEC -- a system for predictive thermal and energy control in data centers. PTEC leverages the server built-in sensors and monitoring utilities, as well as a wireless sensor network, to monitor both the cyber and physical status of a data center. By predicting the temperature evolution of a data center in real time, PTEC finds the temperature set points, the cold air supply rates, and the speeds of server internal fans to minimize the expected total energy consumption of cooling and circulation systems. Moreover, PTEC enforces the upper bounds on server inlet temperatures and their temporal variations to prevent server overheating and reduce server hardware failure rate. We evaluated PTEC on a hardware test bed …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 1, 1, 8, 10, 5, 3, 3, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:-f6ydRqryjwC", "title": "Accuracy-aware aquatic diffusion process profiling using robotic sensor networks", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Jianxun Wang", "Xiaobo Tan"], "description": "Water resources and aquatic ecosystems are facing increasing threats from climate change, improper waste disposal, and oil spill incidents. It is of great interest to deploy mobile sensors to detect and monitor certain diffusion processes (e.g., chemical pollutants) that are harmful to aquatic environments. In this paper, we propose an accuracy-aware diffusion process profiling approach using smart aquatic mobile sensors such as robotic fish. In our approach, the robotic sensors collaboratively profile the characteristics of a diffusion process including source location, discharged substance amount, and its evolution over time. In particular, the robotic sensors reposition themselves to progressively improve the profiling accuracy. We formulate a novel movement scheduling problem that aims to maximize the profiling accuracy subject to limited sensor mobility and energy budget. We develop an efficient greedy algorithm …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 5, 10, 9, 5, 2, 1, 0, 3, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:O3NaXMp0MMsC", "title": "Integrity attacks on real-time pricing in electric power grids", "authors": ["Rui Tan", "Varun Badrinath Krishna", "David KY Yau", "Zbigniew Kalbarczyk"], "description": "Modern information and communication technologies used by electric power grids are subject to cyber-security threats. This article studies the impact of integrity attacks on real-time pricing (RTP), an emerging feature of advanced power grids that can improve system efficiency. Recent studies have shown that RTP creates a closed loop formed by the mutually dependent real-time price signals and price-taking demand. Such a closed loop can be exploited by an adversary whose objective is to destabilize the pricing system. Specifically, small malicious modifications to the price signals can be iteratively amplified by the closed loop, causing highly volatile prices, fluctuating power demand, and increased system operating cost. This article adopts a control-theoretic approach to deriving the fundamental conditions of RTP stability under basic demand, supply, and RTP models that characterize the essential behaviors of …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 8, 3, 8, 5, 3, 3, 3, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:4JMBOYKVnBMC", "title": "Profiling aquatic diffusion process using robotic sensor networks", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Jianxun Wang", "Xiaobo Tan"], "description": "Water resources and aquatic ecosystems are facing increasing threats from climate change, improper waste disposal, and oil spill incidents. It is of great interest to deploy mobile sensors to detect and monitor certain diffusion processes (e.g., chemical pollutants) that are harmful to aquatic environments. In this paper, we propose an accuracy-aware diffusion process profiling approach using smart aquatic mobile sensors such as robotic fish. In our approach, the robotic sensors collaboratively profile the characteristics of a diffusion process including source location, discharged substance amount, and its evolution over time. In particular, the robotic sensors reposition themselves to progressively improve the profiling accuracy. We formulate a novel movement scheduling problem that aims to maximize the profiling accuracy subject to the limited sensor mobility and energy budget. We develop an efficient greedy …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 7, 2, 4, 3, 2, 3, 5, 3, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:ZHo1McVdvXMC", "title": "Exploiting power grid for accurate and secure clock synchronization in industrial IoT", "authors": ["Sreejaya Viswanathan", "Rui Tan", "David KY Yau"], "description": "Desynchronized clocks among nodes in industrial Internet of Things (IoT) can degrade system performance and even lead to safety incidents. Clock synchronization protocols based on network message exchanges, though widely used in current industrial systems, are susceptible to delay attacks against the packet transmission. This vulnerability cannot be solved by conventional security measures such as encryption, and remains an open problem. This paper proposes to use the sine voltage waveform of a utility power grid to synchronize \"things\" connected to the same grid. Our experiments demonstrate that minute fluctuations of the voltage's cycle length encode fine-grained global time information in a city-scale utility grid. Based on this key result, we develop a clock synchronization approach that achieves sub-ms accuracy and is provably secure against packet delay attacks. Implementation results show that …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 9, 4, 4, 5, 5, 5, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:mVmsd5A6BfQC", "title": "Impact of data fusion on real-time detection in sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Benyuan Liu", "Jianping Wang"], "description": "Real-time detection is an important requirement of many mission-critical wireless sensor network applications such as battlefield monitoring and security surveillance. Due to the high network deployment cost, it is crucial to understand and predict the real-time detection capability of a sensor network. However, most existing real-time analyses are based on overly simplistic sensing models (e.g., the disc model) that do not capture the stochastic nature of detection. In practice, data fusion has been adopted in a number of sensor systems to deal with sensing uncertainty and enable the collaboration among sensors. However, real-time performance analysis of sensor networks designed based on data fusion has received little attention. In this paper, we bridge this gap by investigating the fundamental real-time detection performance of large-scale sensor networks under stochastic sensing models. Our results show that …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 7, 4, 8, 5, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:BrmTIyaxlBUC", "title": "Assessing and Mitigating Impact of Time Delay Attack: Case Studies for Power Grid Controls", "authors": ["Xin Lou", "Cuong Tran", "Rui Tan", "David KY Yau", "Zbigniew T Kalbarczyk", "Ambarish Kumar Banerjee", "Prakhar Ganesh"], "description": "Due to recent cyber attacks on various cyber-physical systems (CPSes), traditional isolation based security schemes in the critical systems are insufficient to deal with the smart adversaries in CPSes with advanced information and communication technologies (ICTs). In this paper, we develop real-time assessment and mitigation of an attack's impact as a system's built-in mechanisms. We study a general class of attacks, which we call time delay attack, that delays the transmissions of control data packets in the CPS control loops. Based on a joint stability-safety criterion, we propose the attack impact assessment consisting of (i) a machine learning (ML) based safety classification, and (ii) a tandem stability-safety classification that exploits a basic relationship between stability and safety, namely that an unstable system must be unsafe whereas a stable system may not be safe. In this assessment approach, the ML …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 5, 17, 9, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:Y5dfb0dijaUC", "title": "Toward efficient compute-intensive job allocation for green data centers: A deep reinforcement learning approach", "authors": ["Deliang Yi", "Xin Zhou", "Yonggang Wen", "Rui Tan"], "description": "Reducing the energy consumption of the servers in a data center via proper job allocation is desirable. Existing advanced job allocation algorithms, based on constrained optimization formulations capturing servers' complex power consumption and thermal dynamics, often scale poorly with the data center size and optimization horizon. This paper applies deep reinforcement learning (DRL) to build an allocation algorithm for long-lasting and compute-intensive jobs that are increasingly seen among today's computation demands. Specifically, a deep Q-network is trained to allocate jobs, aiming to maximize a cumulative reward over long horizons. The training is performed offline using a computational model based on long short-term memory networks that capture the servers' power and thermal dynamics. This offline training approach avoids slow online convergence, low energy efficiency, and potential server …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 7, 10, 7, 9, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:VL0QpB8kHFEC", "title": "When LoRa meets EMR: Electromagnetic covert channels can be super resilient", "authors": ["Cheng Shen", "Tian Liu", "Jun Huang", "Rui Tan"], "description": "Due to the low power of electromagnetic radiation (EMR), EM convert channel has been widely considered as a short-range attack that can be easily mitigated by shielding. This paper overturns this common belief by demonstrating how covert EM signals leaked from typical laptops, desktops and servers are decoded from hundreds of meters away, or penetrate aggressive shield previously considered as sufficient to ensure emission security. We achieve this by designing EMLoRa – a super resilient EM covert channel that exploits memory as a LoRa-like radio. EMLoRa represents the first attempt of designing an EM covert channel using state-of-the-art spread spectrum technology. It tackles a set of unique challenges, such as handling complex spectral characteristics of EMR, tolerating signal distortions caused by CPU contention, and preventing adversarial detectors from demodulating covert signals. Experiment …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [3, 17, 11, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:4OULZ7Gr8RgC", "title": "Hidden Moving Target Defense in Smart Grids", "authors": ["Jue Tian", "Rui Tan", "Xiaohong Guan", "Ting Liu"], "description": "Recent research has proposed a moving target defense (MTD) approach that actively changes transmission line susceptance to preclude stealthy false data injection (FDI) attacks against the state estimation of a smart grid. However, existing studies were often conducted under a less adversarial setting, in that they ignore the possibility that an alert attacker can also try to detect the activation of MTD and then cancel any FDI attack until they learn the new system configuration after MTD. Indeed, in this paper, we show that this can be achieved easily by the attacker. To improve the stealthiness of MTD against the attacker, we propose a hidden MTD approach that maintains the power flows of the whole grid after MTD. We develop an algorithm to construct the hidden MTD and analyze its feasibility condition when only a subset of transmission lines can adjust susceptance. Simulations are conducted to demonstrate the …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 6, 5, 5, 5, 6, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:kRWSkSYxWN8C", "title": "Efficient Compute-Intensive Job Allocation in Data Centers via Deep Reinforcement Learning", "authors": ["Deliang Yi", "Xin Zhou", "Yonggang Wen", "Rui Tan"], "description": "Reducing the energy consumption of the servers in a data center via proper job allocation is desirable. Existing advanced job allocation algorithms, based on constrained optimization formulations capturing servers' complex power consumption and thermal dynamics, often scale poorly with the data center size and optimization horizon. This article applies deep reinforcement learning to build an allocation algorithm for long-lasting and compute-intensive jobs that are increasingly seen among today's computation demands. Specifically, a deep Q-network is trained to allocate jobs, aiming to maximize a cumulative reward over long horizons. The training is performed offline using a computational model based on long short-term memory networks that capture the servers' power and thermal dynamics. This offline training approach avoids slow online convergence, low energy efficiency, and potential server overheating …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 5, 12, 9, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:OU6Ihb5iCvQC", "title": "Differentially Private Collaborative Learning for the IoT Edge.", "authors": ["Linshan Jiang", "Xin Lou", "Rui Tan", "Jun Zhao"], "description": "Collaborative learning based on training data contributed by many edge devices is a promising paradigm for implementing crowd intelligence. The collaboratively trained model generally provides superior classification performance due to the increased volume and expanded coverage of the training data. However, the data contribution may incur the concern of privacy breach. This paper presents the design of a privacy-preserving collaborative learning approach, in which the edge devices and the cloud train different stages of a deep neural network, and the data transmitted from an edge device to the honest-but-curious cloud is perturbed by Laplacian random noises to achieve ε-differential privacy. We apply the proposed approach to a case study of collaboratively training a convolutional neural network for handwritten digit recognition. The results show that our approach maintains 99% and 96% classification accuracy in implementing privacy loss levels of ε= 5 and ε= 2, respectively.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 10, 10, 5, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:XiSMed-E-HIC", "title": "Assessing and mitigating impact of time delay attack: a case study for power grid frequency control", "authors": ["Xin Lou", "Cuong Tran", "Rui Tan", "David KY Yau", "Zbigniew T Kalbarczyk"], "description": "Recent attacks against cyber-physical systems (CPSes) show that traditional reliance on isolation for security is insufficient. This paper develops efficient assessment and mitigation of an attack's impact as a system's built-in mechanisms. We focus on a general class of attacks, which we call time delay attack, that delays the transmissions of control data packets in a linear CPS control system. Our attack impact assessment, which is based on a joint stability-safety criterion, consists of (i) a machine learning (ML) based safety classification, and (ii) a tandem stability-safety classification that exploits a basic relationship between stability and safety, namely that an unstable system must be unsafe whereas a stable system may not be safe. The ML addresses a state explosion problem in the safety classification, whereas the tandem structure reduces false negatives in detecting unsafety arising from imperfect ML. We apply …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 4, 13, 7, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:b0M2c_1WBrUC", "title": "One-Hop Out-of-Band Control Planes for Low-Power Multi-Hop Wireless Networks", "authors": ["Chaojie Gu", "Rui Tan", "Xin Lou", "Dusit Niyato"], "description": "Separation of control and data planes (SCDP) is a desirable paradigm for low-power multi-hop wireless networks requiring high network performance and manageability. Existing SCDP networks generally adopt an in-band control plane scheme in that the control-plane messages are delivered by their data-plane networks. The physical coupling of the two planes may lead to undesirable consequences. To advance the network architecture design, we propose to leverage on the long-range communication capability of the increasingly available low-power wide-area network (LPWAN) radios to form one-hop out-of-band control planes. We choose LoRaWAN, an open, inexpensive, and ISM band based LPWAN radio to prototype our out-of-band control plane called LoRaCP. Several characteristics of LoRaWAN such as downlink-uplink asymmetry and primitive ALOHA media access control (MAC) present challenges …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 5, 9, 4, 4, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:k_IJM867U9cC", "title": "Aquatic debris monitoring using smartphone-based robotic sensors", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Jianxun Wang", "Xiaobo Tan", "Xiaoming Liu", "Xiangmao Chang"], "description": "Monitoring aquatic debris is of great interest to the ecosystems, marine life, human health, and water transport. This paper presents the design and implementation of SOAR — a vision-based surveillance robot system that integrates an off-the-shelf Android smartphone and a gliding robotic fish for debris monitoring. SOAR features real-time debris detection and coverage-based rotation scheduling algorithms. The image processing algorithms for debris detection are specifically designed to address the unique challenges in aquatic environments. The rotation scheduling algorithm provides effective coverage of sporadic debris arrivals despite camera's limited angular view. Moreover, SOAR is able to dynamically offload computation-intensive processing tasks to the cloud for battery power conservation. We have implemented a SOAR prototype and conducted extensive experimental evaluation. The results show that …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 3, 2, 1, 1, 5, 3, 4, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:sSrBHYA8nusC", "title": "Control of Air Free-Cooled Data Centers in Tropics via Deep Reinforcement Learning", "authors": ["Duc Van Le", "Yingbo Liu", "Rongrong Wang", "Rui Tan", "Yew-Wah Wong", "Yonggang Wen"], "description": "Air free-cooled data centers (DCs) have not existed in the tropical zone due to the unique challenges of year-round high ambient temperature and relative humidity (RH). The increasing availability of servers that can tolerate higher temperatures and RH due to the regulatory bodies' prompts to raise DC temperature setpoints sheds light upon the feasibility of air free-cooled DCs in tropics. This paper studies the problem of controlling the temperature and RH of the air supplied to the servers in a free-cooled tropical DC below certain thresholds to maintain servers' computing performance and reliability. To achieve the goal, a portion of the hot air generated by the servers is recirculated and mixed with the fresh outside air to adjust the RH of the supply air. To address the complex psychrometric dynamics, we apply deep reinforcement learning to learn the control policy that aims at minimizing the energy used for moving …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 4, 10, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:zA6iFVUQeVQC", "title": "Cost of differential privacy in demand reporting for smart grid economic dispatch", "authors": ["Xin Lou", "Rui Tan", "David KY Yau", "Peng Cheng"], "description": "Increasing dynamics of electrical loads presents uncertainty and hence new challenges for power grid controls and optimization. In economic dispatch control (EDC) for minimizing generation cost, demand reporting by customers is a promising approach for managing the uncertainty, but it raises important privacy concerns. Adding random noise to aggregate queries of demand reports can provide differential privacy (DP) for the individual customers. But the noisy query results can adversely impact the EDC's optimality. In this paper, we analyze the privacy cost in demand reporting in terms of how DP-induced noise will increase the total generation cost. Our analysis shows that the noise amounts for different customers are intricately coupled with one another in determining the total cost. In view of the coupling, we apply the principle of Shapley value to attribute fair shares of the total cost to the power grid buses. For …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 3, 6, 5, 2, 3, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:hC7cP41nSMkC", "title": "Performance analysis of real-time detection in fusion-based sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Jianping Wang", "Benyuan Liu"], "description": "Real-time detection is an important requirement of many mission-critical wireless sensor network applications such as battlefield monitoring and security surveillance. Due to the high network deployment cost, it is crucial to understand and predict the real-time detection capability of a sensor network. However, most existing real-time analyses are based on overly simplistic sensing models (e.g., the disc model) that do not capture the stochastic nature of detection. In practice, data fusion has been adopted in a number of sensor systems to deal with sensing uncertainty and enable efficient collaboration among resource-limited sensors. However, real-time performance analysis of sensor networks designed based on data fusion has received little attention. In this paper, we bridge this gap by investigating the fundamental real-time detection performance of large-scale sensor networks under stochastic sensing models …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 6, 1, 2, 3, 4, 0, 1, 1, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:dshw04ExmUIC", "title": "Deep room recognition using inaudible echos", "authors": ["Qun Song", "Chaojie Gu", "Rui Tan"], "description": "Recent years have seen the increasing need of location awareness by mobile applications. This paper presents a room-level indoor localization approach based on the measured room's echos in response to a two-millisecond single-tone inaudible chirp emitted by a smartphone's loudspeaker. Different from other acoustics-based room recognition systems that record full-spectrum audio for up to ten seconds, our approach records audio in a narrow inaudible band for 0.1 seconds only to preserve the user's privacy. However, the short-time and narrowband audio signal carries limited information about the room's characteristics, presenting challenges to accurate room recognition. This paper applies deep learning to effectively capture the subtle fingerprints in the rooms' acoustic responses. Our extensive experiments show that a two-layer convolutional neural network fed with the spectrogram of the inaudible echos …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 1, 5, 6, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:R3hNpaxXUhUC", "title": "Spatiotemporal aquatic field reconstruction using robotic sensor swarm", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Xiaobo Tan", "Jianxun Wang", "Ruogu Zhou"], "description": "Monitoring important aquatic processes like harmful algal blooms is of increasing interest to public health, ecosystem sustainability, marine biology, and aquaculture industry. This paper presents a novel approach to spatiotemporal aquatic field reconstruction using inexpensive, low-power, mobile sensing platforms called robotic fish. Robotic fish networks are a typical example of Cyber-Physical Systems where the design of cyber components (sensing, communication, and information processing) must account for inherent physical dynamics of the robots and the aquatic environment. Our approach features a rendezvous-based mobility control scheme where robotic fish collaborate in the form of a swarm to sense the aquatic environment in a series of carefully chosen rendezvous regions. We design a novel feedback control algorithm that maintains the desirable level of wireless connectivity for a sensor swarm in …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 6, 5, 4, 0, 0, 0, 2, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:5Ul4iDaHHb8C", "title": "Challenges of Privacy-Preserving Machine Learning in IoT", "authors": ["Mengyao Zheng", "Dixing Xu", "Linshan Jiang", "Chaojie Gu", "Rui Tan", "Peng Cheng"], "description": "The Internet of Things (IoT) will be a main data generation infrastructure for achieving better system intelligence. However, the extensive data collection and processing in IoT also engender various privacy concerns. This paper provides a taxonomy of the existing privacy-preserving machine learning approaches developed in the context of cloud computing and discusses the challenges of applying them in the context of IoT. Moreover, we present a privacy-preserving inference approach that runs a lightweight neural network at IoT objects to obfuscate the data before transmission and a deep neural network in the cloud to classify the obfuscated data. Evaluation based on the MNIST dataset shows satisfactory performance.", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 7, 5, 3, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:LPZeul_q3PIC", "title": "Managing Industrial Communication Delays with Software-Defined Networking", "authors": ["Rutvij H Jhaveri", "Rui Tan", "Arvind Easwaran", "Sagar V Ramani"], "description": "Recent technological advances have fostered the development of complex industrial cyber-physical systems with communication delay requirements. The consequences of delay requirement violation in such systems may become increasingly severe. In this paper, we propose a contract-based fault-resilient methodology which aims at managing the communication delays of network flows in industries. With this objective, we present a lightweight mechanism to estimate end-to-end communication delays in the network where the clocks of the switches are not synchronized. The mechanism aims at providing high level of accuracy with little communication overhead. We then propose a contract-based framework using software-defined networking (SDN) where the components are associated with delay contracts and a resilience manager. The proposed resilience management framework contains: (1) contracts which …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 8, 9, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:hkOj_22Ku90C", "title": "Learning-based simultaneous detection and characterization of time delay attack in cyber-physical systems", "authors": ["Prakhar Ganesh", "Xin Lou", "Yao Chen", "Rui Tan", "David KY Yau", "Deming Chen", "Marianne Winslett"], "description": "Control and communication technologies are key building blocks of cyber-physical systems (CPSes) that can improve the efficiency of the physical processes. However, they also make a CPS vulnerable to cyberattacks that can cause disruptions or even severe damage. This article focuses on one particular type of CPS cyberattack, namely the time delay attack (TDA), which exploits vulnerabilities in the communication channels to cause potentially serious harm to the system. Much work proposed for TDA detection is tested offline only and under strong assumptions. In order to construct a practical solution to deal with real-world scenarios, we propose a deep learning-based method to detect and characterize TDA. Specifically, we design a hierarchical long short-term memory model to process raw data streams from relevant CPS sensors online and continually monitor embedded signals in the data to detect and …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 5, 13, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:pqnbT2bcN3wC", "title": "A Simulation Study on Smart Grid Resilience under Software-Defined Networking Controller Failures", "authors": ["Uttam Ghosh", "Xinshu Dong", "Rui Tan", "Zbigniew Kalbarczyk", "David KY Yau", "Ravishankar K Iyer"], "description": "Riding on the success of SDN for enterprise and data center networks, recently researchers have shown much interest in applying SDN for critical infrastructures. A key concern, however, is the vulnerability of the SDN controller as a single point of failure. In this paper, we develop a cyber-physical simulation platform that interconnects Mininet (an SDN emulator), hardware SDN switches, and PowerWorld (a high-fidelity, industry-strength power grid simulator). We report initial experiments on how a number of representative controller faults may impact the delay of smart grid communications. We further evaluate how this delay may affect the performance of the underlying physical system, namely automatic gain control (AGC) as a fundamental closed-loop control that regulates the grid frequency to a critical nominal value. Our results show that when the fault-induced delay reaches seconds (e.g., more than four …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 4, 5, 1, 3, 4, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:J-pR_7NvFogC", "title": "Lightweight and unobtrusive data obfuscation at IoT edge for remote inference", "authors": ["Dixing Xu", "Mengyao Zheng", "Linshan Jiang", "Chaojie Gu", "Rui Tan", "Peng Cheng"], "description": "Executing deep neural networks for inference on the server-class or cloud backend based on the data generated at the edge of the Internet of Things is desirable due primarily to the limited compute power of the edge devices and the need to protect the confidentiality of the inference neural networks. However, such a remote inference scheme incurs concerns regarding the privacy of the inference data transmitted by the edge devices to the curious backend. This article presents a lightweight and unobtrusive approach to obfuscate the inference data at the edge devices. It is lightweight in that the edge device only needs to execute a small-scale neural network; it is unobtrusive in that the edge device does not need to indicate whether obfuscation is applied. Extensive evaluation by three case studies of free-spoken digit recognition, handwritten digit recognition, and American sign language recognition shows that our …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 5, 6, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:eflP2zaiRacC", "title": "Learning-Based Time Delay Attack Characterization for Cyber-Physical Systems", "authors": ["Xin Lou", "Cuong Tran", "David KY Yau", "Rui Tan", "Hongwei Ng", "Tom Zhengjia Fu", "Marianne Winslett"], "description": "The cyber-physical systems (CPSes) rely on computing and control techniques to achieve system safety and reliability. However, recent attacks show that these techniques are vulnerable once the cyber-attackers have bypassed air gaps. The attacks may cause service disruptions or even physical damages. This paper designs the built-in attack characterization scheme for one general type of cyber-attacks in CPS, which we call time delay attack, that delays the transmission of the system control commands. We use the recurrent neural networks in deep learning to estimate the delay values from the input trace. Specifically, to deal with the long time-sequence data, we design the deep learning model using stacked bidirectional long short-term memory (LSTM) units. The proposed approach is tested by using the data generated from a power plant control system. The results show that the LSTM-based deep learning …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 8, 4, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:BqipwSGYUEgC", "title": "ORBIT: a smartphone-based platform for data-intensive embedded sensing applications", "authors": ["Mohammad-Mahdi Moazzami", "Dennis E Phillips", "Rui Tan", "Guoliang Xing"], "description": "Owing to the rich processing, multi-modal sensing, and versatile networking capabilities, smartphones are increasingly used to build data-intensive embedded sensing applications. However, various challenges must be systematically addressed before smartphones can be used as a generic embedded sensing platform, including high power consumption, lack of real-time functionality and user-friendly embedded programming support. This paper presents ORBIT, a smartphone-based platform for data-intensive embedded sensing applications. ORBIT features a tiered architecture, in which a smartphone can interface to an energy-efficient peripheral board and/or a cloud service. ORBIT as a platform addresses the shortcomings of current smartphones while utilizing their strengths. ORBIT provides a profile-based task partitioning allowing it to intelligently dispatch the processing tasks among the tiers to minimize the …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 7, 2, 5, 1, 3, 0, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:fQNAKQ3IYiAC", "title": "Real-time QoS-aware Routing Scheme in SDN-based Robotic Cyber-Physical Systems", "authors": ["Rutvij H Jhaveri", "Rui Tan", "Sagar V Ramani"], "description": "Industrial cyber-physical systems (CPS) have gained enormous attention of manufacturers in recent years due to their automation and cost reduction capabilities in the fourth industrial revolution (Industry 4.0). Such an industrial network of connected cyber and physical components may consist of highly expensive components such as robots. In order to provide efficient communication in such a network, it is imperative to improve the Quality-of-Service (QoS). Software Defined Networking (SDN) has become a key technology in realizing QoS concepts in a dynamic fashion by allowing a centralized controller to program each flow with a unified interface. However, state-of-the-art solutions do not effectively use the centralized visibility of SDN to fulfill QoS requirements of such industrial networks. In this paper, we propose an SDN-based routing mechanism which attempts to improve QoS in robotic cyber-physical …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 4, 10, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:rO6llkc54NcC", "title": "A joint data compression and encryption approach for wireless energy auditing networks", "authors": ["Rui Tan", "Sheng-Yuan Chiu", "Hoang Hai Nguyen", "David KY Yau", "Deokwoo Jung"], "description": "Fine-grained real-time metering is a fundamental service of wireless energy auditing networks, where metering data is transmitted from embedded wireless power meters to gateways for centralized processing, storage, and forwarding. Due to limited meter capability and wireless bandwidth, the increasing sampling rates and network scales needed to support new energy auditing applications pose significant challenges to metering data fidelity and secrecy. This article exploits the compression and encryption properties of compressive sensing (CS) to design a joint data compression and encryption (JICE) approach that addresses these two challenges simultaneously. Compared with a conventional signal processing pipeline that compresses and encrypts data sequentially, JICE reduces computation and space complexities due to its simple design. It thus leaves more processor time and available buffer space for …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 4, 4, 4, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:f2IySw72cVMC", "title": "Optimal Attack against Cyber-Physical Control Systems with Reactive Attack Mitigation", "authors": ["Subhash Lakshminarayana", "Teo Zhan Teng", "David KY Yau", "Rui Tan"], "description": "This paper studies the performance and resilience of a cyber-physical control system (CPCS) with attack detection and reactive attack mitigation. It addresses the problem of deriving an optimal sequence of false data injection attacks that maximizes the state estimation error of the system. The results provide basic understanding about the limit of the attack impact. The design of the optimal attack is based on a Markov decision process (MDP) formulation, which is solved efficiently using the value iteration method. Using the proposed framework, we quantify the effect of false positives and mis-detections on the system performance, which can help the joint design of the attack detection and mitigation. To demonstrate the use of the proposed framework in a real-world CPCS, we consider the voltage control system of power grids, and run extensive simulations using PowerWorld, a high-fidelity power system simulator, to …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 6, 4, 3, 2, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:u_35RYKgDlwC", "title": "SecureRails: towards an open simulation platform for analyzing cyber-physical attacks in railways", "authors": ["Zhan-Teng Teo", "Bao Anh N Tran", "Subhash Lakshminarayana", "William G Temple", "Binbin Chen", "Rui Tan", "David KY Yau"], "description": "Analyzing the impact of cyber-physical attacks is important for railway operators to help them in assessing and prioritizing their efforts of securing the infrastructures. Since railways consist of several complex cyber-physical systems operating in tandem, it is difficult to assess the impact of an attack without a simulator. Commercially available simulators are intended to support operational design and lack the flexibility to incorporate different attack scenarios. Furthermore, many commercial tools are prohibitively expensive. To address the need for an open and extensible simulator, we propose to build SecureRails, an open source simulator for railway cyber-security analysis. SecureRails consists of two basic building blocks, a train motion simulator built on OpenRails platform, and a model based railway traction power flow simulator built on Matlab. In order to simulate the operation of a railway system, the two …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 4, 3, 1, 3, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:D03iK_w7-QYC", "title": "Natural timestamping using powerline electromagnetic radiation", "authors": ["Yang Li", "Rui Tan", "David KY Yau"], "description": "The continuous fluctuation of electric network frequency (ENF) presents a fingerprint indicative of time, which we call natural timestamp. This paper studies the time accuracy of these natural timestamps obtained from powerline electromagnetic radiation (EMR), which is mainly excited by powerline voltage oscillations at the rate of the ENF. However, since the EMR signal is often weak and noisy, extracting the ENF is challenging, especially on resource-limited sensor platforms. We design an efficient EMR conditioning algorithm and evaluate the time accuracy of EMR natural timestamps on two representative classes of IoT platforms - a high-end single-board computer with a customized EMR antenna and a low-end mote with a normal conductor wire acting as EMR antenna. Extensive measurements at five sites in a city, which are away from each other for up to 24 km, show that the high-end and low-end nodes …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 5, 2, 3, 0, 4, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:vV6vV6tmYwMC", "title": "On applying fault detectors against false data injection attacks in cyber-physical control systems", "authors": ["Quyen Dinh Vu", "Rui Tan", "David KY Yau"], "description": "Much recent work has applied existing fault detectors against attacks in cyber-physical control systems. The results demonstrate effectiveness in detecting simplistic attacks that cause fault-like disruptions. However, they do not address motivated and knowledgeable attackers who craft attacks using knowledge of the system including its method of detecting attacks. In this paper, we analyze the conditions for an attacker to bypass a dissipativity-theoretic fault detector adopted in the prior work. We show that the attacker can use a quadratic programming solver to efficiently compute false data injection attacks to bypass the detector. We show further that, by applying an OR gate to fuse binary detection results from a number of the detectors, with carefully chosen parameters, we can achieve an integrated detector bank that cannot be bypassed by an attacker, if the attacker can tamper with either the sensor or control data …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 5, 5, 1, 2, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:r0BpntZqJG4C", "title": "Adaptive calibration for fusion-based cyber-physical systems", "authors": ["Rui Tan", "Guoliang Xing", "Xue Liu", "Jianguo Yao", "Zhaohui Yuan"], "description": "Many Cyber-Physical Systems (CPS) are composed of low-cost devices that are deeply integrated with physical environments. As a result, the performance of a CPS system is inevitably undermined by various physical uncertainties, which include stochastic noises, hardware biases, unpredictable environment changes, and dynamics of the physical process of interest. Traditional solutions to these issues (e.g., device calibration and collaborative signal processing) work in an open-loop fashion and hence often fail to adapt to the uncertainties after system deployment. In this article, we propose an adaptive system-level calibration approach for a class of CPS systems whose primary objective is to detect events or targets of interest. Through collaborative data fusion, our calibration approach features a feedback control loop that exploits system heterogeneity to mitigate the impact of aforementioned uncertainties on the …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 3, 1, 3, 1, 2, 1, 1, 0, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:mB3voiENLucC", "title": "System-level calibration for fusion-based wireless sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Zhaohui Yuan", "Xue Liu", "Jianguo Yao"], "description": "Wireless sensor networks are typically composed of low-cost sensors that are deeply integrated in physical environments. As a result, the sensing performance of a wireless sensor network is inevitably undermined by biases in imperfect sensor hardware and the noises in data measurements. Although a variety of calibration methods have been proposed to address these issues, they often adopt the device-level approach that becomes intractable for moderate- to large-scale networks. In this paper, we propose a two-tier system-level calibration approach for a class of sensor networks that employ data fusion to improve the sensing performance. In the first tier of our calibration approach, each sensor learns its local sensing model from noisy measurements using an online algorithm and only transmits a few model parameters. In the second tier, sensors' local sensing models are then calibrated to a common system …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 4, 6, 0, 0, 2, 2, 1, 0, 1, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:ye4kPcJQO24C", "title": "Kalibre: Knowledge-based Neural Surrogate Model Calibration for Data Center Digital Twins", "authors": ["Ruihang Wang", "Xin Zhou", "Linsen Dong", "Yonggang Wen", "Rui Tan", "Li Chen", "Guan Wang", "Feng Zeng"], "description": "Computational fluid dynamics (CFD) model has been widely used for prototyping data centers. Evolving it to high-fidelity digital twin is desirable for the management and operations of large-scale data centers. Manually calibrating CFD model parameters to achieve twin-class fidelity by specially trained domain expert is tedious and labor-intensive. To reduce manual efforts, existing automatic calibration approaches developed for various computational models apply heuristics to search model configurations within an empirically defined parameter bound. However, in the context of CFD, each search step requires long-lasting CFD model's iterated solving, rendering these approaches impractical with increased model complexity. This paper presents Kalibre, a knowledge-based neural surrogate approach that performs CFD model calibration by iterating four key steps of i) training a neural surrogate model based on …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 9, 7, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:B3FOqHPlNUQC", "title": "One-Hop Out-of-Band Control Planes for Multi-Hop Wireless Sensor Networks", "authors": ["Chaojie Gu", "Rui Tan", "Xin Lou"], "description": "Separation of Control and Data Planes (SCDP) is a desirable paradigm for low-power multi-hop wireless sensor networks requiring high network performance and manageability. Existing SCDP networks generally adopt an in-band control plane scheme in that the control-plane messages are delivered by their data-plane networks. The physical coupling of the two planes may lead to undesirable consequences. Recently, multi-radio platforms (e.g., TI CC1350 and OpenMote B) are increasingly available, which make the physical separation of the control and data planes possible. To advance the network architecture design, we propose to leverage on the long-range communication capability of the Low-Power Wide-Area Network (LPWAN) radios to form one-hop out-of-band control planes. LoRaWAN, an open, inexpensive, and ISM band based LPWAN radio, is chosen to prototype our out-of-band control plane …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 3, 4, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:hMod-77fHWUC", "title": "Spatiotemporal aquatic field reconstruction using cyber-physical robotic sensor systems", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Xiaobo Tan", "Jianxun Wang", "Ruogu Zhou"], "description": "Monitoring important aquatic processes like harmful algal blooms is of increasing interest to public health, ecosystem sustainability, marine biology, and aquaculture industry. This article presents a novel approach to spatiotemporal aquatic field reconstruction using inexpensive, low-power mobile sensing platforms called robotic fish. Robotic fish networks are a typical example of cyber-physical systems where the design of cyber components (sensing, communication, and information processing) must account for inherent physical dynamics of the robots and the aquatic environment. Our approach features a rendezvous-based mobility control scheme where robotic fish collaborate in the form of a swarm to sense the aquatic environment in a series of carefully chosen rendezvous regions. We design a novel feedback control algorithm that maintains the desirable level of wireless connectivity for a sensor swarm in the …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 1, 3, 1, 1, 3, 0, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:kzcrU_BdoSEC", "title": "Deep Reinforcement Learning for Tropical Air Free-cooled Data Center Control", "authors": ["Duc Van Le", "Rongrong Wang", "Yingbo Liu", "Rui Tan", "Yew-Wah Wong", "Yonggang Wen"], "description": "Air free-cooled data centers (DCs) have not existed in the tropical zone due to the unique challenges of year-round high ambient temperature and relative humidity (RH). The increasing availability of servers that can tolerate higher temperatures and RH due to the regulatory bodies’ prompts to raise DC temperature setpoints sheds light upon the feasibility of air free-cooled DCs in the tropics. However, due to the complex psychrometric dynamics, operating the air free-cooled DC in the tropics generally requires adaptive control of supply air condition to maintain the computing performance and reliability of the servers. This article studies the problem of controlling the supply air temperature and RH in a free-cooled tropical DC below certain thresholds. To achieve the goal, we formulate the control problem as Markov decision processes and apply deep reinforcement learning (DRL) to learn the control policy that …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [2, 6, 7, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:M05iB0D1s5AC", "title": "Orbit: A platform for smartphone-based data-intensive sensing applications", "authors": ["Mohammad-Mahdi Moazzami", "Dennis E Phillips", "Rui Tan", "Guoliang Xing"], "description": "Owing to the rich processing, multi-modal sensing, and versatile networking capabilities, smartphones are increasingly used to build data-intensive embedded sensing applications. However, various challenges must be systematically addressed before smartphones can be used as a generic embedded sensing platform, including high power consumption, lack of real-time functionality, and user-friendly embedded programming support. This paper presents ORBIT, a smartphone-based platform for data-intensive embedded sensing applications. ORBIT features a tiered architecture, in which a smartphone can interface to an energy-efficient peripheral board and/or a cloud service. ORBIT as a platform addresses the shortcomings of current smartphones while utilizing their strengths. ORBIT provides a profile-based task partitioning that allows it to intelligently dispatch the processing tasks among the tiers to minimize …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 1, 5, 1, 2, 0, 2, 2]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:fEOibwPWpKIC", "title": "Vulnerability Analysis, Robustness Verification, and Mitigation Strategy for Machine Learning-Based Power System Stability Assessment Model Under Adversarial Examples", "authors": ["Chao Ren", "Xiaoning Du", "Yan Xu", "Qun Song", "Yang Liu", "Rui Tan"], "description": "Based on machine learning (ML) technique, the data-driven power system stability assessment has received significant research interests in recent years. Yet, the ML-based models may be vulnerable to the adversarial examples, which are very close to the original input but can lead to a different (wrong) assessment result. Taking short-term voltage stability (STVS) assessment problem as the case study, this paper firstly analyzes the vulnerability of the ML-based models under both the white-box and the black-box attack scenarios, where adversarial examples are generated to falsify the STVS assessment model into the wrong outputs without noticeable changes of the input values. Then, an empirical index is proposed to quantitatively measure the robustness of ML-based models under adversarial examples. After that, an adversarial training-based mitigation strategy is proposed to enhance the ML-based model …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 8, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:NJ774b8OgUMC", "title": "Attack-aware Synchronization-free Data Timestamping in LoRaWAN", "authors": ["Chaojie Gu", "Linshan Jiang", "Rui Tan", "Mo Li", "Jun Huang"], "description": "Low-power wide-area network technologies such as long-range wide-area network (LoRaWAN) are promising for collecting low-rate monitoring data from geographically distributed sensors, in which timestamping the sensor data is a critical system function. This article considers a synchronization-free approach to timestamping LoRaWAN uplink data based on signal arrival time at the gateway, which well matches LoRaWAN’s one-hop star topology and releases bandwidth from transmitting timestamps and synchronizing end devices’ clocks at all times. However, we show that this approach is susceptible to a frame delay attack consisting of malicious frame collision and delayed replay. Real experiments show that the attack can affect the end devices in large areas up to about 50,000, m2. In a broader sense, the attack threatens any system functions requiring timely deliveries of LoRaWAN frames. To address this …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [2, 4, 7, 1]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:08ZZubdj9fEC", "title": "Attack-Aware Data Timestamping in Low-Power Synchronization-Free LoRaWAN", "authors": ["Chaojie Gu", "Linshan Jiang", "Rui Tan", "Mo Li", "Jun Huang"], "description": "Low-power wide-area network technologies such as LoRaWAN are promising for collecting low-rate monitoring data from geographically distributed sensors, in which timestamping the sensor data is a critical system function. This paper considers a synchronization-free approach to timestamping LoRaWAN uplink data based on signal arrival time at the gateway, which well matches LoRaWAN’s one-hop star topology and releases bandwidth from transmitting timestamps and synchronizing end devices’ clocks at all times. However, we show that this approach is susceptible to a frame delay attack consisting of malicious frame collision and delayed replay. Real experiments show that the attack can affect the end devices in large areas up to about 50, 000 m 2 . In a broader sense, the attack threatens any system functions requiring timely deliveries of LoRaWAN frames. To address this threat, we propose a LoRaTS …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [6, 3, 2, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:N5tVd3kTz84C", "title": "On Lightweight Privacy-preserving Collaborative Learning for Internet of Things by Independent Random Projections", "authors": ["Linshan Jiang", "Rui Tan", "Xin Lou", "Guosheng Lin"], "description": "The Internet of Things (IoT) will be a main data generation infrastructure for achieving better system intelligence. This article considers the design and implementation of a practical privacy-preserving collaborative learning scheme, in which a curious learning coordinator trains a better machine learning model based on the data samples contributed by a number of IoT objects, while the confidentiality of the raw forms of the training data is protected against the coordinator. Existing distributed machine learning and data encryption approaches incur significant computation and communication overhead, rendering them ill-suited for resource-constrained IoT objects. We study an approach that applies independent random projection at each IoT object to obfuscate data and trains a deep neural network at the coordinator based on the projected data from the IoT objects. This approach introduces light computation …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 7, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:8AbLer7MMksC", "title": "Moving target defense for embedded deep visual sensing against adversarial examples", "authors": ["Qun Song", "Zhenyu Yan", "Rui Tan"], "description": "Deep learning-based visual sensing has achieved attractive accuracy but is shown vulnerable to adversarial example attacks. Specifically, once the attackers obtain the deep model, they can construct adversarial examples to mislead the model to yield wrong classification results. Deployable adversarial examples such as small stickers pasted on the road signs and lanes have been shown effective in misleading advanced driver-assistance systems. Many existing countermeasures against adversarial examples build their security on the attackers' ignorance of the defense mechanisms. Thus, they fall short of following Kerckhoffs's principle and can be subverted once the attackers know the details of the defense. This paper applies the strategy of moving target defense (MTD) to generate multiple new deep models after system deployment, that will collaboratively detect and thwart adversarial examples. Our MTD …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 3, 4, 4, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:2P1L_qKh6hAC", "title": "Energy-efficient aquatic environment monitoring using smartphone-based robots", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Jianxun Wang", "Xiaobo Tan", "Xiaoming Liu"], "description": "Monitoring aquatic environment is of great interest to the ecosystem, marine life, and human health. This article presents the design and implementation of Samba—an aquatic surveillance robot that integrates an off-the-shelf Android smartphone and a robotic fish to monitor harmful aquatic processes such as oil spills and harmful algal blooms. Using the built-in camera of the smartphone, Samba can detect spatially dispersed aquatic processes in dynamic and complex environment. To reduce the excessive false alarms caused by the nonwater area (e.g., trees on the shore), Samba segments the captured images and performs target detection in the identified water area only. However, a major challenge in the design of Samba is the high energy consumption resulted from continuous image segmentation. We propose a novel approach that leverages the power-efficient inertial sensors on smartphones to assist …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 1, 4, 0, 1, 2, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:xtRiw3GOFMkC", "title": "Exploiting electrical grid for accurate and secure clock synchronization", "authors": ["Sreejaya Viswanathan", "Rui Tan", "David KY Yau"], "description": "Desynchronized clocks among network nodes in critical infrastructures can degrade system performance and even lead to safety incidents. Clock synchronization protocols based on network message exchanges, though widely used in current network systems, are susceptible to delay attacks against the packet transmission. This vulnerability cannot be solved by conventional security measures, such as encryption, and remains an open problem. This article proposes to use the sine voltage waveform of a utility power grid to synchronize network nodes connected to the same grid. Our experiments demonstrate that minute fluctuations of the voltage’s cycle length encode fine-grained global time information in Singapore’s utility grid. Based on this key result, we develop a clock synchronization approach that achieves good accuracy and is provably secure against packet-delay attacks. Implementation results show that …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 4, 0, 3, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:_xSYboBqXhAC", "title": "Application-layer clock synchronization for wearables using skin electric potentials induced by powerline radiation", "authors": ["Zhenyu Yan", "Yang Li", "Rui Tan", "Jun Huang"], "description": "Design of clock synchronization for networked nodes faces a fundamental trade-off between synchronization accuracy and universality for heterogeneous platforms, because a high synchronization accuracy generally requires platform-dependent hardware-level network packet timestamping. This paper presents TouchSync, a new indoor clock synchronization approach for wearables that achieves millisecond accuracy while preserving universality in that it uses standard system calls only, such as reading system clock, sampling sensors, and sending/receiving network messages. The design of TouchSync is driven by a key finding from our extensive measurements that the skin electric potentials (SEPs) induced by powerline radiation are salient, periodic, and synchronous on a same wearer and even across different wearers. TouchSync integrates the SEP signal into the universal principle of Network Time Protocol …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 3, 2, 2, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:RYcK_YlVTxYC", "title": "Jice: Joint data compression and encryption for wireless energy auditing networks", "authors": ["Sheng-Yuan Chiu", "Hoang Hai Nguyen", "Rui Tan", "David KY Yau", "Deokwoo Jung"], "description": "Fine-grained real-time metering is a fundamental service of wireless energy auditing networks, where metering data is transmitted from embedded power meters to gateways for centralized processing, storage, and forwarding. Due to limited meter capability and wireless bandwidth, the increasing sampling rates and network scales needed to support new energy auditing applications pose significant challenges to metering data fidelity and secrecy. This paper exploits the compression and encryption properties of compressive sensing (CS) to design a joint data compression and encryption (JICE) approach that addresses these two challenges simultaneously. Compared with a conventional signal processing pipeline that compresses and encrypts data sequentially, JICE reduces computation and storage complexities due to its simple design. It thus leaves more processor time and available buffer space for handling …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 4, 3, 2, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:dQ2og3OwTAUC", "title": "Intelligent IoT for the Digital World: Incorporating 5G Communications and Fog/Edge Computing Technologies", "authors": ["Yang Yang", "Xu Chen", "Rui Tan", "Yong Xiao"], "description": "INTELLIGENT IOT FOR THE DIGITAL WORLD DISCOVER HOW THE INTELLIGENT INTERNET OF THINGS WILL CHANGE THE INFORMATION AND COMMUNICATION TECHNOLOGY INDUSTRY IN THE NEXT DECADE In the digital world, most data and Internet of Things (IoT) services need to be efficiently processed and executed by intelligent algorithms using local or regional computing resources, thus greatly saving and reducing communication bandwidth, end-to-end service delay, long-distance data transmissions, and potential privacy breaches. This book proposes a pyramid model, where data, computing and algorithm jointly constitute the triangular base to support a variety of user-centric intelligent IoT services at the spire by using different kinds of smart terminals or devices. This book provides a state-of-the-art review of intelligent IoT technologies and applications, discusses the key challenges and opportunities facing the digital world, and answers the following five critical questions: What is the most feasible network architecture to effectively provide sufficient resources anywhere anytime for intelligent IoT application scenarios? How do we efficiently discover, allocate and manage computing, communication and caching resources in heterogeneous networks across multiple domains and operators? How do we agilely achieve adaptive service orchestration and reliable service provisioning to meet dynamic user requirements in real time? How do we effectively protect data privacy in IoT applications, where IoT devices and edge/fog computing nodes only have limited resources and capabilities? How do we continuously guarantee …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [2, 7, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:cFHS6HbyZ2cC", "title": "Taming Asymmetric Network Delays for Clock Synchronization Using Power Grid Voltage", "authors": ["Dima Rabadi", "Rui Tan", "David KY Yau", "Sreejaya Viswanathan"], "description": "Many clock synchronization protocols based on message passing, e.g., the Network Time Protocol (NTP), assume symmetric network delays to estimate the one-way packet transmission time as half of the round-trip time. As a result, asymmetric network delays caused by either %natural one-way network congestion or malicious packet delays can cause significant synchronization errors. This paper exploits sinusoidal voltage signals of an alternating current (ac) power grid to tame the asymmetric network delays for robust and resilient clock synchronization. Our extensive measurements show that the voltage signals at geographically distributed locations in a city are highly synchronized. Leveraging calibrated voltage phases, we develop a new clock synchronization protocol, which we call Grid Time Protocol (GTP), that allows direct measurement of one-way packet transmission times between its slave and master …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 5, 2, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:W5xh706n7nkC", "title": "Understanding Credibility of Adversarial Examples against Smart Grid: A Case Study for Voltage Stability Assessment", "authors": ["Qun Song", "Rui Tan", "Chao Ren", "Yan Xu"], "description": "Stability assessment is an important task for maintaining reliable operations of power grids. With increased system complexity, deep learning-based stability assessment approaches are promising to address the shortfalls of the traditional time-domain simulation-based approaches. However, in the field of computer vision, the deep learning models are shown vulnerable to adversarial examples. Although this vulnerability has been noticed by the energy informatics research, the domain-specific analysis on the requirements imposed for implementing effective adversarial examples is still lacking. These attack requirements, albeit reasonable in computer vision tasks, can be too stringent in the context of power grids. In this paper, we systematically investigate the requirements and discuss the credibility of six representative adversarial example attacks for a case study of voltage stability assessment for the New …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:tOudhMTPpwUC", "title": "Performance and Resilience of Cyber-Physical Control Systems with Reactive Attack Mitigation", "authors": ["Subhash Lakshminarayana", "Jabir Shabbir Karachiwala", "Teo Zhan Teng", "Rui Tan", "David KY Yau"], "description": "This paper studies the performance and resilience of a linear cyber-physical control system (CPCS) with attack detection and reactive attack mitigation in the context of power grids. It addresses the problem of deriving an optimal sequence of false data injection attacks that maximizes the state estimation error of the power system. The results provide basic understanding about the limit of the attack impact. The design of the optimal attack is based on a Markov decision process (MDP) formulation, which is solved efficiently using the value iteration method. We apply the proposed framework to the voltage control system of power grids and run extensive simulations using PowerWorld. The results show that our framework can accurately characterize the maximum state estimation errors caused by an attacker who carefully designs the attack sequence to strike a balance between the attack magnitude and stealthiness, due to …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 3, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:EUQCXRtRnyEC", "title": "Modeling and detecting false data injection attacks against railway traction power systems", "authors": ["Subhash Lakshminarayana", "Teo Zhan Teng", "Rui Tan", "David KY Yau"], "description": "Modern urban railways extensively use computerized sensing and control technologies to achieve safe, reliable, and well-timed operations. However, the use of these technologies may provide a convenient leverage to cyber-attackers who have bypassed the air gaps and aim at causing safety incidents and service disruptions. In this article, we study False Data Injection (FDI) attacks against railway Traction Power Systems (TPSes). Specifically, we analyze two types of FDI attacks on the train-borne voltage, current, and position sensor measurements—which we call efficiency attack and safety attack—that (i) maximize the system’s total power consumption and (ii) mislead trains’ local voltages to exceed given safety-critical thresholds, respectively. To counteract, we develop a Global Attack Detection (GAD) system that serializes a bad data detector and a novel secondary attack detector designed based on unique …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 2, 3, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:ns9cj8rnVeAC", "title": "Monitoring aquatic debris using smartphone-based robots", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Jianxun Wang", "Xiaobo Tan", "Xiaoming Liu", "Xiangmao Chang"], "description": "Monitoring aquatic debris is of great interest to the ecosystems, marine life, human health, and water transport. This paper presents the design and implementation of SOAR—a vision-based surveillance robot system that integrates an off-the-shelf Android smartphone and a gliding robotic fish for debris monitoring in relatively calm waters. SOAR features real-time debris detection and coverage-based rotation scheduling algorithms. The image processing algorithms for debris detection are specifically designed to address the unique challenges in aquatic environments. The rotation scheduling algorithm provides effective coverage for sporadic debris arrivals despite camera's limited angular view. Moreover, SOAR is able to dynamically offload compute-intensive processing tasks to the cloud for battery power conservation. We have implemented a SOAR prototype and conducted extensive experimental evaluation …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 4, 0, 0, 0, 2, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:GnPB-g6toBAC", "title": "Samba: a smartphone-based robot system for energy-efficient aquatic environment monitoring", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Jianxun Wang", "Xiaobo Tan", "Xiaoming Liu"], "description": "Monitoring aquatic environment is of great interest to the ecosystem, marine life, and human health. This paper presents the design and implementation of Samba -- an aquatic surveillance robot that integrates an off-the-shelf Android smartphone and a robotic fish to monitor harmful aquatic processes such as oil spill and harmful algal blooms. Using the built-in camera of on-board smartphone, Samba can detect spatially dispersed aquatic processes in dynamic and complex environments. To reduce the excessive false alarms caused by the non-water area (e.g., trees on the shore), Samba segments the captured images and performs target detection in the identified water area only. However, a major challenge in the design of Samba is the high energy consumption resulted from the continuous image segmentation. We propose a novel approach that leverages the power-efficient inertial sensors on smartphone to …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 1, 2, 0, 1, 1, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:J_g5lzvAfSwC", "title": "Battery capacity planning for grid-connected solar photovoltaic systems", "authors": ["Binbin Chen", "Kian Hoong Kwan", "Rui Tan"], "description": "With the steady increase of grid-connected solar photovoltaic (PV) power generation in many parts of the world, management of solar generation intermittency becomes a key challenge for power system operators. A widely considered approach to addressing this issue is to install battery energy storages together with solar PV sources. This paper discusses the capacity planning when battery energy storage is used as a companion for grid-connected solar PV systems. We consider the concrete context of the National Electricity Market of Singapore (NEMS). For electricity markets like NEMS that adopt real-time bidding and clearance, we propose solutions that can enable a battery-companioned solar PV system to behave in the same way as traditional dispatchable generators. We observe that the battery capacity requirement can be reduced by shortening the cycle length for real-time bidding and clearance or by …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 1, 0, 0, 1, 3, 1, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:TFP_iSt0sucC", "title": "Safety-assured collaborative load management in smart grids", "authors": ["Hoang Hai Nguyen", "Rui Tan", "David KY Yau"], "description": "When a power grid is overloaded, load shedding is a conventional way to combat the imbalance between supply and demand that may jeopardize the grid's safety. However, disconnected customers may be excessively inconvenienced or even endangered. With the emergence of demand-response based on cyber-enabled smart meters and appliances, customers may participate in solving the imbalance by curtailing their demands collaboratively, such that no single customers will have to bear a disproportionate burden of reduced usage. However, compliance or commitment to curtailment requests by untrusted users is uncertain, which causes an important safety concern. This paper proposes a two-phase load management scheme that (i) gives customers a chance to curtail their demands and correct a grid's undersupply when there are no immediate safety concerns, but (ii) falls back to conventional load …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 3, 0, 2, 1, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:RHpTSmoSYBkC", "title": "Analysis of quality of surveillance in fusion-based sensor networks", "authors": ["Rui Tan", "Guoliang Xing", "Xunteng Xu", "Jianping Wang"], "description": "Recent years have witnessed the deployments of wireless sensor networks for mission-critical applications such as battlefield monitoring and security surveillance. These applications often impose stringent Quality of Surveillance (QoSv) requirements including low false alarm rate and short detection delay. In practice, collaborative data fusion techniques that can deal with sensing uncertainty and enable sensor collaboration have been widely employed in sensor systems to achieve stringent QoSv requirements. However, most previous analytical studies on the surveillance performance of wireless sensor networks are based on simplistic models (such as the disc model) that cannot capture the stochastic and collaborative nature of sensing. In this paper, we systematically analyze the fundamental relationship between QoSv, network density, sensing parameters, and target properties. The results show that data …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 4, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:UHK10RUVsp4C", "title": "PhyAug: Physics-Directed Data Augmentation for Deep Sensing Model Transfer in Cyber-Physical Systems", "authors": ["Wenjie Luo", "Zhenyu Yan", "Qun Song", "Rui Tan"], "description": "Run-time domain shifts from training-phase domains are common in sensing systems designed with deep learning. The shifts can be caused by sensor characteristic variations and/or discrepancies between the design-phase model and the actual model of the sensed physical process. To address these issues, existing transfer learning techniques require substantial target-domain data and thus incur high post-deployment overhead. This paper proposes to exploit the first principle governing the domain shift to reduce the demand on target-domain data. Specifically, our proposed approach called PhyAug uses the first principle fitted with few labeled or unlabeled source/target-domain data pairs to transform the existing source-domain training data into augmented data for updating the deep neural networks. In two case studies of keyword spotting and DeepSpeech2-based automatic speech recognition, with 5 …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:JQOojiI6XY0C", "title": "Joint IT-Facility Optimization for Green Data Centers via Deep Reinforcement Learning", "authors": ["Xin Zhou", "Ruihang Wang", "Yonggang Wen", "Rui Tan"], "description": "The data center market grows rapidly with the increase of data and its corresponding applications (e.g., machine learning, cloud storage, Internet of Things, and so on). The growth is boosted recently due to the shift of activities online during the COVID-19 pandemic. Reducing the energy consumption of data centers faces various challenges that are further aggravated by the tropical conditions with high temperature and humidity in the tropics like Singapore. The prevailing siloed approach of operating the information technology (IT) and the facility systems separately has resulted in wasteful over-provisioning. The recently proposed approaches for energy usage minimization under various constraints including thermal safety scale poorly with the data center size and often result in non-optimal solutions. To advance the state of the art, we apply deep reinforcement learning (DRL) to address the scalability problem and …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:1qzjygNMrQYC", "title": "Cost and Pricing of Differential Privacy in Demand Reporting for Smart Grids", "authors": ["Xin Lou", "David KY Yau", "Rui Tan", "Peng Cheng"], "description": "In smart grid, the highly dynamics of electrical loads introduce uncertainty to the system, which also brings new challenges for the power grid control and optimization. Reporting demand information by customers in solving the economic dispatch control (EDC) problem in power grids is a promising approach, but it raises important privacy concerns. One solution is to add random noise to aggregate queries of demand reports can provide differential privacy (DP) for the individual customers. However, the noisy query information can adversely degrade the EDC's optimality. In this paper, we first analyze the cost in demand reporting in terms of how DP-induced noise will increase the total generation cost. We show that the noise amounts for different customers are intricately coupled with one another in determining the total cost. To deal with the coupling, we apply the principle of Shapley value to attribute fair shares of …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:uWQEDVKXjbEC", "title": "Wearables Clock Synchronization Using Skin Electric Potentials", "authors": ["Zhenyu Yan", "Rui Tan", "Yang Li", "Jun Huang"], "description": "Design of clock synchronization for networked nodes faces a fundamental trade-off between synchronization accuracy and universality of heterogeneous platforms, because a high synchronization accuracy generally requires platform-dependent hardware-level network packet timestamping. This paper presents TouchSync, a new indoor clock synchronization approach for wearables that achieves millisecond accuracy while preserving universality in that it uses standard system calls only, such as reading system clock, sampling sensors, and sending/receiving network messages. The design of TouchSync is driven by a key finding from our extensive measurements that the skin electric potentials (SEPs) induced by powerline radiation are salient, periodic, and synchronous on a same wearer and even across different wearers. TouchSync integrates the SEP signal into the universal principle of Network Time Protocol …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 2, 4, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:70eg2SAEIzsC", "title": "On false data injection attacks against railway traction power systems", "authors": ["Subhash Lakshminarayana", "Zhan-Teng Teo", "Rui Tan", "David KY Yau", "Pablo Arboleya"], "description": "Modern urban railways extensively use computerized-sensing and control technologies to achieve safe, reliable, and well-timed operations. However, the use of these technologies may provide a convenient leverage to cyber-attackers who have bypassed the air gaps and aim at causing safety incidents and service disruptions. In this paper, we study false data injection (FDI) attacks against railways' traction power systems (TPSes). Specifically, we analyze two types of FDI attacks on the train-borne voltage, current, and position sensor measurements -- which we call efficiency attack and safety attack -- that (i) maximize the system's total power consumption and (ii) mislead trains' local voltages to exceed given safety-critical thresholds, respectively. To counteract, we develop a global attack detection system that serializes a bad data detector anda novel secondary attack detector designed based on unique TPS …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 3, 0, 2, 1, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:uLbwQdceFCQC", "title": "DeepMTD: Moving Target Defense for Deep Visual Sensing against Adversarial Examples", "authors": ["Qun Song", "Zhenyu Yan", "Rui Tan"], "description": "Deep learning-based visual sensing has achieved attractive accuracy but is shown vulnerable to adversarial attacks. Specifically, once the attackers obtain the deep model, they can construct adversarial examples to mislead the model to yield wrong classification results. Deployable adversarial examples such as small stickers pasted on the road signs and lanes have been shown effective in misleading advanced driver-assistance systems. Most existing countermeasures against adversarial examples build their security on the attackers’ ignorance of the defense mechanisms. Thus, they fall short of following Kerckhoffs’s principle and can be subverted once the attackers know the details of the defense. This article applies the strategy of moving target defense (MTD) to generate multiple new deep models after system deployment that will collaboratively detect and thwart adversarial examples. Our MTD design is …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=20&pagesize=80&citation_for_view=co5MGPkAAAAJ:JoZmwDi-zQgC", "title": "A schedule randomization policy to mitigate timing attacks in WirelessHART networks", "authors": ["Ankita Samaddar", "Arvind Easwaran", "Rui Tan"], "description": "Industrial control systems consist of large-scale wireless sensor-actuator networks (WSAN) that control the physical plant. The communications between the sensors and the actuators need to be reliable and guaranteed within strict deadlines for safe operation of all the system components in industrial setups. WirelessHART is the most suitable and widely adopted WSAN standard that serves as the medium of communication in industries. To satisfy deadlines of real-time flows in WirelessHART networks, the centralized network manager decides the communication schedule during network initialization. The same schedule repeats every hyperperiod. The repetitive nature of the communication slots over every hyperperiod makes the system vulnerable to timing attacks which can eventually disrupt the safety of the system. To mitigate such attacks, we propose SlotSwapper, a moving target defense mechanism that randomizes …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:NhqRSupF_l8C", "title": "Natural timestamps in powerline electromagnetic radiation", "authors": ["Yang Li", "Rui Tan", "David KY Yau"], "description": "The continuous fluctuation of electric network frequency (ENF) presents a fingerprint indicative of time, which we call natural timestamp. This article studies the time accuracy of these natural timestamps obtained from powerline electromagnetic radiation (EMR), which is mainly excited by powerline voltage oscillations at the rate of the ENF. However, since the EMR signal is often weak and noisy, extracting the ENF is challenging, especially on resource-limited sensor platforms. We design an efficient EMR conditioning algorithm and evaluate the time accuracy of EMR natural timestamps on two representative classes of IoT platforms—a high-end single-board computer with a customized EMR antenna and a low-end mote with a normal conductor wire acting as EMR antenna. Extensive measurements at six sites in a city, which are away from each other for up to 24km, show that the high-end and low-end nodes …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 3, 3, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:pyW8ca7W8N0C", "title": "Unsupervised residential power usage monitoring using a wireless sensor network", "authors": ["Rui Tan", "Dennis E Phillips", "Mohammad-Mahdi Moazzami", "Guoliang Xing", "Jinzhu Chen"], "description": "Appliance-level power usage monitoring may help conserve electricity in homes. Several existing systems achieve this goal by exploiting appliances’ power usage signatures identified in labor-intensive in situ training processes. Recent work shows that autonomous power usage monitoring can be achieved by supplementing a smart meter with distributed sensors that detect the working states of appliances. However, sensors must be carefully installed for each appliance, resulting in a high installation cost. This article presents Supero—the first ad hoc sensor system that can monitor appliance power usage without supervised training. By exploiting multisensor fusion and unsupervised machine learning algorithms, Supero can classify the appliance events of interest and autonomously associate measured power usage with the respective appliances. Our extensive evaluation in five real homes shows that Supero …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 4, 0, 2, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:RGFaLdJalmkC", "title": "A sensor system for high-fidelity temperature distribution forecasting in data centers", "authors": ["Jinzhu Chen", "Rui Tan", "Yu Wang", "Guoliang Xing", "Xiaorui Wang", "Xiaodong Wang", "Bill Punch", "Dirk Colbry"], "description": "Data centers have become a critical computing infrastructure in the era of cloud computing. Temperature monitoring and forecasting are essential for preventing server shutdowns because of overheating and improving a data center’s energy efficiency. This article presents a novel cyber-physical approach for temperature forecasting in data centers, one that integrates Computational Fluid Dynamics (CFD) modeling, in situ wireless sensing, and real-time data-driven prediction. To ensure forecasting fidelity, we leverage the realistic physical thermodynamic models of CFD to generate transient temperature distribution and calibrate it using sensor feedback. Both simulated temperature distribution and sensor measurements are then used to train a real-time prediction algorithm. As a result, our approach reduces not only the computational complexity of online temperature modeling and prediction, but also the number …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 1, 2, 0, 2, 2, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:j8SEvjWlNXcC", "title": "A data-assisted first-principle approach to modeling server outlet temperature in air free-cooled data centers", "authors": ["Yingbo Liu", "Duc Van Le", "Rui Tan"], "description": "The server outlet temperature is an important thermal condition to the operation of an air free-cooled data center that uses fans to continuously pass the outside air through the server room to cool the computing devices. However, the standard server’s management and monitoring tool cannot read the server’s built-in outlet temperature sensors fast enough to catch up the fast dynamics of the server outlet thermal condition caused by the changing server workload. Moreover, many server models do not have built-in sensors that can measure the server outlet temperature. In this paper, we develop a data-assisted first-principle model that leverages available built-in sensors and server’s operating monitoring tools to achieve low-latency estimation of the server outlet temperature. Specifically, the developed model takes the inlet and processor core temperatures, server’s fan speed, and processor utilization which are …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [2, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:VOx2b1Wkg3QC", "title": "SlotSwapper: a schedule randomization protocol for real-time WirelessHART networks", "authors": ["Ankita Samaddar", "Arvind Easwaran", "Rui Tan"], "description": "Industrial process control systems are time-critical systems where reliable communications between sensors and actuators need to be guaranteed within strict deadlines to maintain safe operation of all the components of the system. WirelessHART is the most widely adopted standard which serves as the medium of communication in industrial setups due to its support for Time Division Multiple Access (TDMA) based communication, multiple channels, channel hopping, centralized architecture, redundant routes and avoidance of spatial re-use of channels. However, the communication schedule in WirelessHART network is decided by a centralized network manager at the time of network initialization and the same communication schedule repeats every hyper-period. Due to predictability in the time slots of the communication schedule, these systems are vulnerable to timing attacks which eventually can disrupt the …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 2, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:UxriW0iASnsC", "title": "Urban Electric Load Forecasting with Mobile Phone Location Data", "authors": ["Stefan Selvarajoo", "Markus Schläpfer", "Rui Tan"], "description": "In recent years, electrical load forecasting has received continuous research efforts aiming to improve the short-term prediction accuracy of local energy demands. However, current methods are not able to take explicitly into account the dynamic spatial population distribution over the course of a day, which is particularly relevant in dense urban areas. In this paper, we harness society-wide mobile phone data to map the time-varying population distribution in the Trentino region, Italy, and to use these insights for a novel electrical load forecasting method. Our results demonstrate that the integration of aggregated mobile phone data yields compelling forecast models.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 3, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:z_wVstp3MssC", "title": "Toward Physics-Guided Safe Deep Reinforcement Learning for Green Data Center Cooling Control", "authors": ["Ruihang Wang", "Xinyi Zhang", "Xin Zhou", "Yonggang Wen", "Rui Tan"], "description": "Deep reinforcement learning (DRL) has shown good performance in tackling Markov decision process (MDP) problems. As DRL opti-mizes a long-term reward, it is a promising approach to improving the energy efficiency of data center cooling. However, enforcement of thermal safety constraint during DRL's state exploration is a main challenge. The widely adopted reward shaping approach adds negative reward when the exploratory action results in unsafety. Thus, it needs to experience sufficient unsafe states before it learns how to prevent unsafety. In this paper, we propose a safety-aware DRL framework for single-hall data center cooling control. It applies offline imitation learning and online post-hoc rectification to holis-tically prevent thermal unsafety during online DRL. In particular, the post-hoc rectification searches for the minimum modification to the DRL-recommended action such that the rectified action …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:uJ-U7cs_P_0C", "title": "ILLOC: In-Hall Localization with Standard LoRaWAN Uplink Frames", "authors": ["Dongfang Guo", "Chaojie Gu", "Linshan Jiang", "Wenjie Luo", "Rui Tan"], "description": "LoRaWAN is a narrowband wireless technology for ubiquitous connectivity. For various applications, it is desirable to localize LoRaWAN devices based on their uplink frames that convey application data. This localization service operates in an unobtrusive manner, in that it requires no special software instrumentation to the LoRaWAN devices. This paper investigates the feasibility of unobtrusive localization for LoRaWAN devices in hall-size indoor spaces like warehouses, airport terminals, sports centers, museum halls, etc. We study the TDoA-based approach, which needs to address two challenges of poor timing performance of LoRaWAN narrowband signal and nanosecond-level clock synchronization among anchors. We propose the ILLOC system featuring two LoRaWAN-specific techniques: (1) the cross-correlation among the differential phase sequences received by two anchors to estimate TDoA and (2 …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 6, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:lSLTfruPkqcC", "title": "Impact of signal delay attack on voltage control for electrified railways", "authors": ["Hoang Hai Nguyen", "Rui Tan", "David KY Yau"], "description": "Cybernated traction power system can be an attractive leverage for attackers who aim to cause catastrophic safety incidents in electrified railways. This paper studies the cybersecurity risks of the traction power voltage control system that regulates the voltages of railway feeder substations. We derive the stability condition of the control system when it is under a signal delay attack, i.e., the timing information of voltage measurements is maliciously corrupted so that the system wrongly uses old measurements to make control decisions. Our analysis and simulations show a fundamental trade-off between the voltage convergence speed when trains' reactive power draw varies and the tolerable malicious time delay in terms of system stability.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 1, 1, 1, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:9Nmd_mFXekcC", "title": "Configuration-Adaptive Wireless Visual Sensing System with Deep Reinforcement Learning", "authors": ["Siyuan Zhou", "Duc Van Le", "Rui Tan", "Joy Qiping Yang", "Daren Ho"], "description": "Visual sensing has been increasingly employed in various industrial applications including manufacturing process monitoring and worker safety monitoring. This paper presents the design and implementation of a wireless camera system, namely, EFCam, which uses low-power wireless communications and edge-fog computing to achieve cordless and energy-efficient visual sensing. The camera performs image pre-processing and offloads the data to a resourceful fog node for advanced processing using deep models. EFCam admits dynamic configurations of several parameters that form a configuration space. It aims to adapt the configuration to maintain desired visual sensing performance of the deep model at the fog node with minimum energy consumption of the camera in image capture, pre-processing, and data communications, under dynamic variations of the monitored process, the application requirement …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [2, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:-_dYPAW6P2MC", "title": "Air Free-Cooled Tropical Data Center: Design, Evaluation, and Learned Lessons", "authors": ["Duc Van Le", "Yingbo Liu", "Rongrong Wang", "Rui Tan", "Lek Heng Ngoh"], "description": "Air free cooling is an energy-efficient cooling scheme that has been adopted in the dry and cold climate zones. To adopt this cooling scheme in Singapore's tropical condition, we designed and implemented an air free-cooled DC testbed integrating sensing and control systems for the server and room conditions. Then, we conducted extensive experiments on the testbed to understand its energy efficiency and server reliability. This paper presents the key observations, experiences, and learned lessons obtained from our testbed over a duration of nearly two years. The experiments show that (1) the air free-cooling design can achieve the power usage effectiveness of 1.05, (2) the tropics’ year-round high temperatures up to   C do not impede the air free-cooling, and (3) the implementation of the air free-cooled tropical DCs requires special cares to deal with airborne contaminants to avoid fast corrosion rate and …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 4, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:7T2F9Uy0os0C", "title": "Improving Quality Control with Industrial AIoT at HP Factories: Experiences and Learned Lessons", "authors": ["Joy Qiping Yang", "Siyuan Zhou", "Duc Van Le", "Daren Ho", "Rui Tan"], "description": "Enabled by the increasingly available embedded hardware accelerators, the capability of executing advanced machine learning models at the edge of the Internet of Things (IoT) triggers wide interest of applying the resulting Artificial Intelligence of Things (AIoT) systems in industrial applications. The in situ inference and decision made based on the sensor data containing patterns with certain sophistication allow the industrial system to address a variety of heterogeneous, local-area non-trivial problems in the last hop of the IoT networks, avoiding the wireless bandwidth bottleneck and unreliability issues and also the cumbersome cloud. However, the literature still lacks presentations of industrial AIoT system developments that provide insights into the challenges and offer important lessons for the relevant research and engineering communities, no matter the development is successful or not. In light of this, we …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:WqliGbK-hY8C", "title": "Real-Time Cooling Power Attribution for Co-Located Data Center Rooms with Distinct Temperatures", "authors": ["Rongrong Wang", "Duc Van Le", "Rui Tan", "Yew-Wah Wong", "Yonggang Wen"], "description": "At present, a co-location data center often applies an identical and low temperature setpoint for its all server rooms. Although increasing the temperature setpoint is a rule-of-thumb approach to reducing the cooling energy usage, the tenants may have different mentalities and technical constraints in accepting higher temperature setpoints. Thus, supporting distinct temperature setpoints is desirable for a co-location data center in pursuing higher energy efficiency. This support calls for a new cooling power attribution scheme to address the inter-room heat transfers that can be up to 9% of server load as shown in our real experiments. This paper describes our approaches to estimating the inter-room heat transfers, using the estimates to rectify the metered power usages of the rooms' air handling units, and fairly attributing the power usage of the shared cooling infrastructure (i.e., chiller and cooling tower) to server …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 4, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:Fu2w8maKXqMC", "title": "Tropical data centre proof-of-concept", "authors": ["Duc Van Le", "Yingbo Liu", "Rongrong Wang", "Rui Tan"], "description": "Singapore is a data center (DC) hub in Southeast Asia. However, Singapore's year-round high temperatures and humidity levels introduce significant challenges for the local DC operators in improving the energy efficiency of their infrastructures. As Singapore's DCs spend more energy in cooling, their average power usage effectiveness (PUE), which is 2.07, is higher than the global average of 1.7. In the United States, the DC sector accounted for 1.8% of the country's total electricity consumption in 2014. In Singapore, this percentage is up to 7%. Thus, technologies that can improve DC energy efficiency in the tropics will further enhance Singapore's attractiveness as a regional data center hub. They are also important to Singapore's energy sustainability and commitment to Paris Agreement. Air-side free cooling that utilizes outside cold air to cool the information technology (IT) equipment has been increasingly used to improve the energy efficiency of DCs. However, air-side free cooling in the tropics has been long thought infeasible from the intuition that the high temperature and relative humidity (RH) of the air supplied to the servers will undermine their performance and reliability. On the other hand, the American Society of Heating, Refrigeration and Air-Conditioning Engineers (ASHRAE) has been working for years on expanding its suggested allowable temperature and RH ranges for IT equipment. For instance, the servers compliant with ASHRAE's Class A3 can operate continuously and reliably when the temperature and RH of the supply air are up to 40 degree Celsius and 90%. This sheds light on the possibility of air-side free-cooled DCs in …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:35r97b3x0nAC", "title": "Infrastructure-Free Smartphone Indoor Localization Using Room Acoustic Responses", "authors": ["Dongfang Guo", "Wenjie Luo", "Chaojie Gu", "Yuting Wu", "Qun Song", "Zhenyu Yan", "Rui Tan"], "description": "Smartphone indoor location awareness is increasingly demanded by a variety of mobile applications. The existing solutions for accurate smartphone indoor localization rely on additional devices or pre-installed infrastructure (e.g., dense WiFi access points, Bluetooth beacons). In this demo, we present EchoLoc, an infrastructure-free smartphone indoor localization system using room acoustic response to a chirp emitted by the phone. EchoLoc consists of a mobile client for echo data collection and a cloud server hosting a deep neural network for location inference. EchoLoc achieves 95% accuracy in recognizing 101 locations in a large public indoor space and a median localization error of 0.5 m in a typical lab area. Demo video is available at https://youtu.be/5si0Cq6LzT4.", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:l7t_Zn2s7bgC", "title": "Resilient Clock Synchronization Using Power Grid Voltage", "authors": ["Dima Rabadi", "Rui Tan", "David KY Yau", "Sreejaya Viswanathan", "Hao Zheng", "Peng Cheng"], "description": "Many clock synchronization protocols based on message passing, e.g., the Network Time Protocol (NTP), assume symmetric network delays to estimate the one-way packet transmission time as half of the round-trip time. As a result, asymmetric network delays caused by either network congestion or malicious packet delays can cause significant synchronization errors. This article exploits sinusoidal voltage signals of an alternating current (AC) power grid to limit the impact of the asymmetric network delays on these clock synchronization protocols. Our extensive measurements show that the voltage signals at geographically distributed locations in a city are highly synchronized. Leveraging calibrated voltage phases, we develop a new clock synchronization protocol that we call Grid Time Protocol (GTP), which allows direct measurement of one-way packet transmission times between its slave and master nodes …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:nrtMV_XWKgEC", "title": "SoftLoRa-a LoRa-based platform for accurate and secure timing", "authors": ["Chaojie Gu", "Rui Tan", "Jun Huang"], "description": "LoRa is an emerging low-power wide-area network technology. Existing studies have focused on LoRa's communication performance. Differently, we study two physical properties of LoRa, i.e., its performance in timing the signal propagation and the transmitters' frequency traits. Signal timing is a basis for implementing clock synchronization, ranging, and advanced physical (PHY) layer techniques such as concurrent decoding. However, LoRa end devices do not provide PHY-layer timestamping that is needed for accurate timing. We propose a SoftLoRa design that integrates a low-power software-defined radio receiver with a LoRa transceiver to provide PHY-layer access. Experiments show that SoftLoRa achieves microseconds timing accuracy over one kilometer and in a multistory building with strong signal attenuation. Signal propagation timing is in general susceptible to a frame delay attack. We implement this …", "publication_year": 2019, "citations_by_year": {"year": [2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:epqYDVWIO7EC", "title": "PriMask: Cascadable and Collusion-Resilient Data Masking for Mobile Cloud Inference", "authors": ["Linshan Jiang", "Qun Song", "Rui Tan", "Mo Li"], "description": "Mobile cloud offloading is indispensable for inference tasks based on large-scale deep models. However, transmitting privacy-rich inference data to the cloud incurs concerns. This paper presents the design of a system called PriMask, in which the mobile device uses a secret small-scale neural network called MaskNet to mask the data before transmission. PriMask significantly weakens the cloud's capability to recover the data or extract certain private attributes. The MaskNet is cascadable in that the mobile can opt in to or out of its use seamlessly without any modifications to the cloud's inference service. Moreover, the mobiles use different MaskNets, such that the collusion between the cloud and some mobiles does not weaken the protection for other mobiles. We devise a split adversarial learning method to train a neural network that generates a new MaskNet quickly (within two seconds) at run time. We apply …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:uc_IGeMz5qoC", "title": "Indoor Smartphone SLAM with Learned Echoic Location Features", "authors": ["Wenjie Luo", "Qun Song", "Zhenyu Yan", "Rui Tan", "Guosheng Lin"], "description": "Indoor self-localization is a highly demanded system function for smartphones. The current solutions based on inertial, radio frequency, and geomagnetic sensing may have degraded performance when their limiting factors take effect. In this paper, we present a new indoor simultaneous localization and mapping (SLAM) system that utilizes the smartphone's built-in audio hardware and inertial measurement unit (IMU). Our system uses a smartphone's loud-speaker to emit near-inaudible chirps and then the microphone to record the acoustic echoes from the indoor environment. Our profiling measurements show that the echoes carry location information with sub-meter granularity. To enable SLAM, we apply contrastive learning to construct an echoic location feature (ELF) extractor, such that the loop closures on the smartphone's trajectory can be accurately detected from the associated ELF trace. The detection …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:ipzZ9siozwsC", "title": "LIMU-BERT: Unleashing the Potential of Unlabeled Data for IMU Sensing Applications", "authors": ["Huatao Xu", "Pengfei Zhou", "Rui Tan", "Mo Li", "Guobin Shen"], "description": "Deep learning greatly empowers Inertial Measurement Unit (IMU) sensors for a wide range of sensing applications. Most existing works require substantial amounts of wellcurated labeled data to train IMU-based sensing models, which incurs high annotation and training costs. Compared with labeled data, unlabeled IMU data are abundant and easily accessible. This article presents a novel representation learning model that can make use of unlabeled IMU data and extract generalized rather than task-specific features. With the representations learned via our model, task-specific models trained with limited labeled samples can achieve superior performances in typical IMU sensing applications, such as Human Activity Recognition (HAR).", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:0KyAp5RtaNEC", "title": "On Credibility of Adversarial Examples Against Learning-Based Grid Voltage Stability Assessment", "authors": ["Qun Song", "Rui Tan", "Chao Ren", "Yan Xu", "Yang Lou", "Jianping Wang", "Hoay Beng Gooi"], "description": "Voltage stability assessment is essential for maintaining reliable power grid operations. Stability assessment approaches using deep learning address the shortfalls of the traditional time-domain simulation-based approaches caused by increased system complexity. However, deep learning models are shown to be vulnerable to adversarial examples in the field of computer vision. While this vulnerability has been noticed by the power grid cybersecurity research, the domain-specific analysis on the requirements imposed upon effective attack implementation is still lacking. Although these attack requirements are usually reasonable in computer vision tasks, they can be stringent in the context of power grids. In this paper, we conduct a systematic investigation on the attack requirements and credibility of six representative adversarial example attacks based on a voltage stability assessment application for the New …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:LjlpjdlvIbIC", "title": "Experiences and Learned Lessons from an Air Free-Cooled Tropical Data Center Testbed", "authors": ["Duc Van Le", "Yingbo Liu", "Rongrong Wang", "Rui Tan", "Lek Heng Ngoh"], "description": "The air free-cooling has been long thought infeasible in tropics due to the unique challenges of year-round high ambient temperature and relative humidity. In recent years, the increasing availability of servers that can tolerate higher temperatures and relative humidity levels sheds light upon the feasibility of the air free-cooling to enhance the data center energy efficiency. However, building an air free-cooled data center in the tropics requires extensive experiments to understand the details of how the tropical environment conditions will affect data center power consumption, computing throughput, and server hardware reliability. Thus, together with multiple partners in data center industry and research, we conducted a project that designs, builds, and experiments with an air free-cooled data center testbed consisting of three server rooms hosting 12 server racks with 60 kW total power rating. This paper presents the …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:bnK-pcrLprsC", "title": "Covert Device Association among Colluding Apps via Edge Processor Workload", "authors": ["Hangtai Li", "Yingbo Liu", "Rui Tan"], "description": "While thriving application (app) distribution systems involving incentivized third-party app vendors are desirable for the emerging edge computing paradigm, they also bring security challenges as faced by the current mobile app distribution systems. This article studies a threat called  covert device association , in which the vendors of two apps collude to figure out which of their app installations run on the same edge device. The threat can widely spread when the two apps are popular. It is also a stepping stone for: 1) the de-anonymization attacks against the users anonymous to one of the two vendors and 2) privilege escalation in which the two colluding vendors have united privileges. We show that the threat can be implemented via a reliable and ubiquitous covert channel based on the edge device’s processor workload without requiring any privileged permissions. We present the implementation details for three …", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:KxtntwgDAa4C", "title": "Resilience Bounds of Sensing-Based Network Clock Synchronization", "authors": ["Rui Tan", "Linshan Jiang", "Arvind Easwaran"], "description": "Recent studies exploited external periodic synchronous signals to synchronize a pair of network nodes to address a threat of delaying the communications between the nodes. However, the sensing-based synchronization may yield faults due to nonmalicious signal and sensor noises. This paper considers a system of N nodes that will fuse their peer-to-peer synchronization results to correct the faults. Our analysis gives the lower bound of the number of faults that the system can tolerate when N is up to 12. If the number of faults is no greater than the lower bound, the faults can be identified and corrected. We also prove that the system cannot tolerate more than N - 2 faults. Our results can guide the design of resilient sensing-based clock synchronization systems.", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:3s1wT3WcHBgC", "title": "Collaborative load management with safety assurance in smart grids", "authors": ["Rui Tan", "Hoang Hai Nguyen", "David KY Yau"], "description": "Load shedding can combat the overload of a power grid that may jeopardize the grid’s safety. However, disconnected customers may be excessively inconvenienced or even endangered. With the emergence of demand-response based on cyber-enabled smart meters and appliances, customers may participate in solving the overload by curtailing their demands collaboratively such that no single customers will have to bear a disproportionate burden of reduced usage. However, compliance or commitment to curtailment requests by untrusted users is uncertain, which causes an important safety concern. This article proposes a two-phase load management scheme that (i) gives customers a chance to curtail their demands and correct a grid’s overload when there are no immediate safety concerns but (ii) falls back to load shedding to ensure safety once the grid enters a vulnerable state. Extensive simulations based …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:5awf1xo2G04C", "title": "Orbit: A smartphone-based system platform for embedded sensing applications", "authors": ["Mohammad-Mahdi Moazzami", "Dennis E Phillips", "Rui Tan", "Guoliang Xing"], "description": "Owing to the rich processing, multi-modal sensing, and versatile networking capabilities, smartphones are increasingly used to build data-intensive embedded sensing applications. However, various challenges must be systematically addressed before smartphones can be used as a generic embedded sensing platform, including high power consumption, lack of real-time functionality and embedded programming support. This paper presents ORBIT, a smartphone-based system platform for embedded sensing applications. ORBIT features a tiered architecture, in which smartphone is interfaced to an energy efficient peripheral board and a cloud server. Time-critical tasks, such as high-rate sensor sampling and lightweight signal processing, are executed on the peripheral board, while computationintensive tasks are offloaded to the smartphone or cloud. By intelligently dispatching the processing tasks among the …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:EYYDruWGBe4C", "title": "Phyllis: Physics-Informed Lifelong Reinforcement Learning for Data Center Cooling Control", "authors": ["Ruihang Wang", "Zhiwei Cao", "Xin Zhou", "Yonggang Wen", "Rui Tan"], "description": "Deep reinforcement learning (DRL) has shown good performance in data center cooling control for improving energy efficiency. The main challenge in deploying the DRL agent to real-world data centers is how to quickly adapt the agent to the ever-changing system with thermal safety compliance. Existing approaches rely on DRL’s native fine-tuning or a learned data-driven dynamics model to assist the adaptation. However, they require long-term unsafe exploration before the agent or the model can capture a new environment. This paper proposes Phyllis, a physics-informed reinforcement learning approach to assist the DRL agent’s lifelong learning under evolving data center environment. Phyllis first identifies a transition model to capture the data hall thermodynamics in the offline stage. When the environment changes in the online stage, Phyllis assists the adaptation by i) supervising safe data collection with …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:vDijr-p_gm4C", "title": "NNFacet: Splitting Neural Network for Concurrent Smart Sensors", "authors": ["Jiale Chen", "Duc Van Le", "Rui Tan", "Daren Ho"], "description": "Various deep neural networks (DNNs) including convolutional neural networks (CNNs) and recurrent neural networks (RNNs) have shown appealing performance in various classification tasks. However, due to their large sizes, a single DNN often cannot fit into the memory of resource-constrained smart IoT sensors. This paper presents a DNN splitting framework called  NNFacet  that aims to run a DNN-based classification task on a total of    concurrent battery-based sensors observing the same physical process. We begin with determining the importance of all CNN filters or RNN units in learning each class. Then, an optimization problem divides the class set into    subsets and assigns them to the sensors, where the important CNN filters or RNN units associated with a class subset form a small model that is deployed to a sensor. Lastly, a multilayer perceptron is trained and deployed to a cloud or edge server …", "publication_year": 2023, "citations_by_year": {"year": [2023, "unknown"], "num_citations": [1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:g3aElNc5_aQC", "title": "Correction to “Privacy-Preserving Blockchain-Based Federated Learning for IoT Devices”", "authors": ["Yang Zhao", "Jun Zhao", "Linshan Jiang", "Rui Tan", "Dusit Niyato", "Zengxiang Li", "Lingjuan Lyu", "Yingbo Liu"], "description": "In   , on page 1824,    should be as follows:", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:zLWjf1WUPmwC", "title": "Telesonar: Robocall Alarm System by Detecting Echo Channel and Breath Timing", "authors": ["Zhenyu Yan", "Rui Tan", "Qun Song", "Chris Xiaoxuan Lu"], "description": "Massive fraudulent and phishing robocalls present threats to societies. The integration of artificial intelligence technologies, including dialogue and voice generation systems, renders the robocalls more deceptive. Existing countermeasures such as caller ID, call provenance, voiceprint, and fake voice detection have respective limitations and are heavyweight for end users' smartphones. This paper studies detecting the acoustic echo channel on the remote end of a call based on the received voice. The positive detection result evidencing the physical setup of an audio system is indicative of a human caller. However, the acoustic echo cancellation mechanisms of most audio systems and the use of earphone/headset diminish echoes significantly. To address these issues, the proposed Telesonar transmits short chirps during the vulnerable time of echo cancellation, detects the tiny echo remnants from the received …", "publication_year": 2022, "citations_by_year": {"year": [2022, 2023, "unknown"], "num_citations": [0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:tzM49s52ZIMC", "title": "Split Convolutional Neural Networks for Distributed Inference on Concurrent IoT Sensors", "authors": ["Jiale Chen", "Duc Van Le", "Rui Tan", "Daren Ho"], "description": "Convolutional neural networks (CNNs) are increasingly adopted on resource-constrained sensors for in-situ data analytics in Internet of Things (IoT) applications. This paper presents a model split framework, namely, splitCNN, in order to run a large CNN on a collection of concurrent IoT sensors. Specifically, we adopt CNN filter pruning techniques to split the large CNN into multiple small-size models, each of which is only sensitive to a certain number of data classes. These class-specific models are deployed onto the resource-constrained concurrent sensors which collaboratively perform distributed CNN inference on their same/similar sensing data. The outputs of multiple models are then fused to yield the global inference result. We apply splitCNN to three case studies with different sensing modalities, which include the human voice, industrial vibration signal, and visual sensing data. Extensive evaluation shows …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:tKAzc9rXhukC", "title": "EFCam: Configuration-Adaptive Fog-Assisted Wireless Cameras with Reinforcement Learning", "authors": ["Siyuan Zhou", "Duc Van Le", "Joy Qiping Yang", "Rui Tan", "Daren Ho"], "description": "Visual sensing has been increasingly employed in industrial processes. This paper presents the design and implementation of an industrial wireless camera system, namely, EFCam, which uses low-power wireless communications and edge-fog computing to achieve cordless and energy-efficient visual sensing. The camera performs image pre-processing (i.e., compression or feature extraction) and transmits the data to a resourceful fog node for advanced processing using deep models. EFCam admits dynamic configurations of several parameters that form a configuration space. It aims to adapt the configuration to maintain desired visual sensing performance of the deep model at the fog node with minimum energy consumption of the camera in image capture, pre-processing, and data communications, under dynamic variations of application requirement and wireless channel conditions. However, the adaptation …", "publication_year": 2021, "citations_by_year": {"year": [2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:PR6Y55bgFSsC", "title": "Method and system for carrying out timing related tasks", "authors": null, "description": "Embodiments of the present invention provide a method and system for timing related tasks in IoT systems, for example, in relation to synchronisation of clocks and timestamping. It is desirable that the method and system is able to withstand external tampering in a manner which does not jeopardise the accuracy and integrity of time related tasks in the IoT systems.", "publication_year": 2020, "citations_by_year": {"year": [2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:1yQoGdGgb4wC", "title": "Modeling and Detecting False Data Injection Attacks against Railway Traction Power Systems", "authors": ["Subhash Lakshminarayana", "Teo Zhan Teng", "Rui Tan", "David KY Yau"], "description": "Modern urban railways extensively use computerized sensing and control technologies to achieve safe, reliable, and well-timed operations. However, the use of these technologies may provide a convenient leverage to cyber-attackers who have bypassed the air gaps and aim at causing safety incidents and service disruptions. In this paper, we study false data injection (FDI) attacks against railways' traction power systems (TPSes). Specifically, we analyze two types of FDI attacks on the train-borne voltage, current, and position sensor measurements - which we call efficiency attack and safety attack -- that (i) maximize the system's total power consumption and (ii) mislead trains' local voltages to exceed given safety-critical thresholds, respectively. To counteract, we develop a global attack detection (GAD) system that serializes a bad data detector and a novel secondary attack detector designed based on unique TPS characteristics. With intact position data of trains, our detection system can effectively detect the FDI attacks on trains' voltage and current measurements even if the attacker has full and accurate knowledge of the TPS, attack detection, and real-time system state. In particular, the GAD system features an adaptive mechanism that ensures low false positive and negative rates in detecting the attacks under noisy system measurements. Extensive simulations driven by realistic running profiles of trains verify that a TPS setup is vulnerable to the FDI attacks, but these attacks can be detected effectively by the proposed GAD while ensuring a low false positive rate.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:eq2jaN3J8jMC", "title": "Demo Abstract: Natural Timestamping Using Electrical Power Grid", "authors": ["Sreejaya Viswanathan", "Yang Li", "Rui Tan"], "description": "The continuous fluctuation of electric network frequency (ENF) presents a fingerprint indicative of time, which we call natural timestamp. This live demo demonstrates the accuracy of the natural timestamps obtained by four wired voltage sensors and four wireless electromagnetic radiation (EMR) sensors that are geographically distributed in Singapore. The voltage sensors and the EMR sensors capture the minute fluctuations of the length of each voltage cycle and the average ENF over every 50 voltage cycles, respectively. The evaluation in our prior studies [1, 3] has shown that the natural timestamps recorded by the voltage sensors and the EMR sensors give sub-millisecond and sub-second average time errors, respectively. This demo will also show their time errors.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:SdhP9T11ey4C", "title": "Safety-Assured Performance Features in Complex Systems: Smart Grid Collaborative Load Management", "authors": ["Hoang Hai Nguyen", "Rui Tan", "David KY Yau"], "description": "When a power grid is overloaded, load shedding is a conventional approach to combating the imbalance between supply and demand that jeopardizes the grid safety. However, disconnected customers may suffer discomfort and even endangerment. With the emergence of demand response involving cyber-enabled smart meters and appliances, customers can participate in coping with the imbalance by curtailing their demands, such that the impact of temporary undersupply will be more bearable and fair to customers. However, relying purely on the uncertain demand response, which is affected by variable quality of smart devices and commitment of customers, must largely weaken the assurance for grid safety. This paper proposes a two-phase load management scheme that encourages the customers to curtail their demands to mitigate the increasing tension of undersupply when there are no immediate safety concerns, and falls back to load shedding to ensure safety when the grid is drifting to a vulnerable state. Extensive simulations based on a 37-bus system and real load data traces demonstrate the effectiveness of this scheme. In particular, the results show that if customers commit to the load curtailment schedules, the chance of the tough load shedding can be effectively reduced.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:KUbvn5osdkgC", "title": "Accuracy-aware aquatic diffusion process profiling using mobile sensor networks", "authors": ["Yu Wang", "Rui Tan", "Guoliang Xing", "Xiaobo Tan"], "description": "Water resources and aquatic ecosystems are fac-ing increasing threats from climate change, improper waste disposal, and oil spill incidents. It is of great interest to deploy mobile sensor networks to detect and monitor the (eg, chemical pollutants or oil) diffusion processes that are harmful to aquatic environments. In this paper, we propose an accuracyaware diffusion process profiling approach using smart aquatic mobile sensors such as robotic fish. In our approach, the mobile sensors collaboratively profile the characteristics of a diffusion including source location, pollution amount, and its evolution over time. In particular, the mobile sensors reposition themselves to progressively improve the profiling accuracy. We formally formulate a novel movement scheduling problem that aims to maximize the profiling accuracy subject to limited sensor mobility and energy budget. We develop a light-weight greedy algorithm as well as a more complex near-optimal algorithm to solve the problem. Extensive simulations under realistic settings validate the effectiveness of our approach. Moreover, a preliminary implementation on TelosB motes shows the feasibility of deploying our movement scheduling algorithms on mote-class sensor platforms.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:b1wdh0AR-JQC", "title": "Indoor Smartphone SLAM With Acoustic Echoes", "authors": ["Wenjie Luo", "Qun Song", "Zhenyu Yan", "Rui Tan", "Guosheng Lin"], "description": "Indoor self-localization has become a highly desirable system function for smartphones. The existing systems based on imaging, radio frequency, and geomagnetic sensing may have sub-optimal performance when their limiting factors prevail. In this paper, we present a new indoor simultaneous localization and mapping (SLAM) system that is based on the smartphone's built-in audio hardware and inertial measurement unit (IMU). Our system uses a smartphone's loudspeaker to emit near-inaudible chirps and then the microphone to record the acoustic echoes from the indoor environment. The echoes contain the smartphone's location information with sub-meter granularity. To enable SLAM, we apply contrastive learning to train an echoic location feature (ELF) extractor, such that the loop closures on the smartphone's trajectory can be accurately detected from the associated ELF trace. The detection results effectively regulate …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:gsN89kCJA0AC", "title": "Practically Adopting Human Activity Recognition", "authors": ["Huatao Xu", "Pengfei Zhou", "Rui Tan", "Mo Li"], "description": "Existing inertial measurement unit (IMU) based human activity recognition (HAR) approaches still face a major challenge when adopted across users in practice. The severe heterogeneity in IMU data significantly undermines model generalizability in wild adoption. This paper presents UniHAR, a universal HAR framework for mobile devices. To address the challenge of data heterogeneity, we thoroughly study augmenting data with the physics of the IMU sensing process and present a novel adoption of data augmentations for exploiting both unlabeled and labeled data. We consider two application scenarios of UniHAR, which can further integrate federated learning and adversarial training for improved generalization. UniHAR is fully prototyped on the mobile platform and introduces low overhead to mobile devices. Extensive experiments demonstrate its superior performance in adapting HAR models across four …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:tYavs44e6CUC", "title": "Uncertainty-Encoded Multi-Modal Fusion for Robust Object Detection in Autonomous Driving", "authors": ["Yang Lou", "Qun Song", "Qian Xu", "Rui Tan", "Jianping Wang"], "description": "Multi-modal fusion has shown initial promising results for object detection of autonomous driving perception. However, many existing fusion schemes do not consider the quality of each fusion input and may suffer from adverse conditions on one or more sensors. While predictive uncertainty has been applied to characterize single-modal object detection performance at run time, incorporating uncertainties into the multi-modal fusion still lacks effective solutions due primarily to the uncertainty's cross-modal incomparability and distinct sensitivities to various adverse conditions. To fill this gap, this paper proposes Uncertainty-Encoded Mixture-of-Experts (UMoE) that explicitly incorporates single-modal uncertainties into LiDAR-camera fusion. UMoE uses individual expert network to process each sensor's detection result together with encoded uncertainty. Then, the expert networks' outputs are analyzed by a gating network to determine the fusion weights. The proposed UMoE module can be integrated into any proposal fusion pipeline. Evaluation shows that UMoE achieves a maximum of 10.67%, 3.17%, and 5.40% performance gain compared with the state-of-the-art proposal-level multi-modal object detectors under extreme weather, adversarial, and blinding attack scenarios.", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:TIZ-Mc8IlK0C", "title": "Susceptibility of Autonomous Driving Agents to Learning-Based Action-Space Attacks", "authors": ["Yuting Wu", "Xin Lou", "Pengfei Zhou", "Rui Tan", "Zbigniew T Kalbarczyk", "Ravishankar K Iyer"], "description": "Intelligent vehicles with increasing complexity face cybersecurity threats. This paper studies action-space attacks on autonomous driving agents that make decisions using either a traditional modular processing pipeline or the recently proposed end-to-end driving model obtained via deep reinforcement learning (DRL). Such attacks alter the actuation signal and pose direct risks to the vehicle’s state. We formulate the attack construction as a DRL problem based on the input from either an extra camera or inertial measurement unit deployed. The attacks are designed to lurk until a safety-critical moment arises and cause a side collision upon activation. We analyze the behavioral differences between two driving agents when subjected to action-space attacks and demonstrate the superior resilience of the modular processing pipeline. We further investigate the performance and limitations of two enhancement methods …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:hMsQuOkrut0C", "title": "TouchKey: Touch to Generate Symmetric Keys by Skin Electric Potentials Induced by Powerline Radiation", "authors": ["Yuchen Miao", "Chaojie Gu", "Zhenyu Yan", "Sze Yiu Chau", "Rui Tan", "Qi Lin", "Wen Hu", "Shibo He", "Jiming Chen"], "description": "Secure device pairing is important to wearables. Existing solutions either degrade usability due to the need of specific actions like shaking, or they lack universality due to the need of dedicated hardware like electrocardiogram sensors. This paper proposes TouchKey, a symmetric key generation scheme that exploits the skin electric potential (SEP) induced by powerline electromagnetic radiation. The SEP is ubiquitously accessible indoors with analog-to-digital converters widely available on Internet of Things devices. Our measurements show that the SEP has high randomness and the SEPs measured at two close locations on the same human body are similar. Extensive experiments show that TouchKey achieves a high key generation rate of 345 bit/s and an average success rate of 99.29%. Under a range of adversary models including active and passive attacks, TouchKey shows a low false acceptance rate of 0 …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:BUYA1_V_uYcC", "title": "Multi-criteria assessments of increasing supply air temperature in tropical data center", "authors": ["Jing Zhou", "Baris Burak Kanbur", "Duc Van Le", "Rui Tan", "Fei Duan"], "description": "With rapid development of information technology, the number and scale of data centers (DCs) increase rapidly. Therefore, cooling energy saving becomes crucial. This study proposes multi-criteria assessments of increasing supply air temperature (SAT) in the air-cooled DCs to analyze the interactions of internal and external factors in cooling systems comprehensively. Impacts of refrigerant charge (RC), evaporation pressure (EP) control limits, and hot aisle containment (HAC) with improvements in SAT are compared and analyzed according to the thermodynamic, economic, and thermoeconomic aspects. Overall, as SAT increases from 20 °C to 32 °C, the power usage effectiveness decreases by 16.8%–19.3%. Increase in RC leads to energy consumption and cost increasing at high SAT ranges, whereas high RC shows obvious advantages at the low SAT from the thermoeconomic aspects. Additionally, releasing …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:p__nRnzSRKYC", "title": "Effects of Learning-Based Action-Space Attacks on Autonomous Driving Agents", "authors": ["Yuting Wu", "Xin Lou", "Pengfei Zhou", "Rui Tan", "Zbigniew Kalbarczyk", "Ravishankar K Iyer"], "description": "Vehicle cybernation with increasing use of information and communication technologies faces cybersecurity threats. This extended abstract studies action-space attacks on autonomous driving agents that make decisions using either a traditional modular processing pipeline or the recently proposed end-to-end model obtained via deep reinforcement learning (DRL). The action-space attacks alter the actuation signal and pose direct risks to the vehicle's behavior. We formulate the attack construction as a DRL problem based on the input from either an extra camera or inertial measurement unit deployed. Attacks are designed to lurk until a safety-critical moment arises (e.g. lane changing or overtaking), with the goal of causing a side collision upon activation. Our results demonstrate that the modular processing pipeline is more resilient than the DRL-based agent, due to the former's main focus of trajectory following …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:BwyfMAYsbu0C", "title": "Towards Efficient Personalized Driver Behavior Modeling with Machine Unlearning", "authors": ["Qun Song", "Rui Tan", "Jianping Wang"], "description": "Driver Behavior Modeling (DBM) aims to predict and model human driving behaviors, which is typically incorporated into the Advanced Driver Assistance System to enhance transportation safety and improve driving experience. Inverse reinforcement learning (IRL) is a prevailing DBM technique with the goal of modeling the driving policy by recovering an unknown internal reward function from human driver demonstrations. However, the latest IRL-based design is inefficient due to the laborious manual feature engineering processes. Besides, the reward function usually experiences increased prediction errors when deployed for unseen vehicles. In this paper, we propose a novel deep learning-based reward function for IRL-based DBM with efficient model personalization via machine unlearning. We evaluate our approach on a highway simulation constructed using the realistic human driving dataset NGSIM. We …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:4MWp96NkSFoC", "title": "Physics-Informed Machine Learning Model Generalization in AIoT: Opportunites and Challenges", "authors": ["Rui Tan", "Wenjie Luo"], "description": "Recent advances in machine learning inspire the development of deep neural network-based smart sensing applications for the Artificial Intelligence of Things (AIoT). However, due to the nature of the AIoT sensing data, the machine learning models are in general subject to poor generalizability due to the scarcity of labeled training data and run-time domain shifts. The existing solutions rely on data-driven approaches and do not consider the physical laws that govern data generation or domain shifts. This paper discusses the potential of utilizing the known physical laws to improve the machine learning model generalizability for AIoT applications. Through three case studies, we demonstrate that physics-informed machine learning can (1) effectively assist the generalization of deep neural networks and (2) achieve better performance compared with conventional approaches. Our objective is to encourage more …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:ML0RJ9NH7IQC", "title": "Interpersonal distance tracking with mmWave radar and IMUs", "authors": ["Yimin Dai", "Xian Shuai", "Rui Tan", "Guoliang Xing"], "description": "Tracking interpersonal distances is essential for real-time social distancing management and ex-post contact tracing to prevent spreads of contagious diseases. Bluetooth neighbor discovery has been employed for such purposes in combating COVID-19, but does not provide satisfactory spatiotemporal resolutions. This paper presents ImmTrack, a system that uses a millimeter wave radar and exploits the inertial measurement data from user-carried smartphones or wearables to track interpersonal distances. By matching the movement traces reconstructed from the radar and inertial data, the pseudo identities of the inertial data can be transferred to the radar sensing results in the global coordinate system. The re-identified, radar-sensed movement trajectories are then used to track interpersonal distances. In a broader sense, ImmTrack is the first system that fuses data from millimeter wave radar and inertial …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:Z5m8FVwuT1cC", "title": "BubCam: A Vision System for Automated Quality Inspection at Manufacturing Lines", "authors": ["Jiale Chen", "Duc Van Le", "Rui Tan", "Daren Ho"], "description": "Visual sensing has been widely adopted for quality inspection in production processes. This paper presents the design and implementation of a smart collaborative camera system, called BubCam, for automated quality inspection of manufactured ink bags in Hewlett-Packard (HP) Inc.'s factories. Specifically, BubCam estimates the volume of air bubbles in an ink bag, which may affect the printing quality. The design of BubCam faces challenges due to the dynamic ambient light reflection, motion blur effect, and data labeling difficulty. As a starting point, we design a single-camera system which leverages various deep learning based image segmentation and depth fusion techniques. New data labeling and training approaches are proposed to utilize prior knowledge of the production system for training the segmentation model with a small dataset. Then, we design a multi-camera system which additionally deploys …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:kuK5TVdYjLIC", "title": "Design, Deployment, and Evaluation of an Industrial AIoT System for Quality Control at HP Factories", "authors": ["Duc Van Le", "Joy Qiping Yang", "Siyuan Zhou", "Daren Ho", "Rui Tan"], "description": "Enabled by the increasingly available embedded hardware accelerators, the capability of executing advanced machine learning models at the edge of the Internet of Things (IoT) triggers interest of applying Artificial Intelligence of Things (AIoT) systems for industrial applications. The in situ inference and decision made based on the sensor data allow the industrial system to address a variety of heterogeneous, local-area non-trivial problems in the last hop of the IoT networks. Such a scheme avoids the wireless bandwidth bottleneck and unreliability issues, as well as the cumbersome cloud. However, the literature still lacks presentations of industrial AIoT system developments that provide insights into the challenges and offer lessons for the relevant research and industry communities. In light of this, we present the design, deployment, and evaluation of an industrial AIoT system for improving the quality control of HP …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:ILKRHgRFtOwC", "title": "Toward Data Center Digital Twins via Knowledge-based Model Calibration and Reduction", "authors": ["Ruihang Wang", "Deneng Xia", "Zhiwei Cao", "Yonggang Wen", "Rui Tan", "Xin Zhou"], "description": "Computational fluid dynamics (CFD) models have been widely used for prototyping data centers. Evolving them into high-fidelity and real-time digital twins is desirable for online operations of data centers. However, CFD models often have unsatisfactory accuracy and high computation overhead. Manually calibrating the CFD model parameters is tedious and labor-intensive. Existing automatic calibration approaches apply heuristics to search the model configurations. However, each search step requires a long-lasting process of repeatedly solving the CFD model, rendering them impractical especially for complex CFD models. This paper presents Kalibre, a knowledge-based neural surrogate approach that calibrates a CFD model by iterating four steps of i) training a neural surrogate model, ii) finding the optimal parameters through neural surrogate retraining, iii) configuring the found parameters back to the CFD …", "publication_year": 2023, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:yB1At4FlUx8C", "title": "Physics-directed Data Augmentation for Deep Model Transfer to Specific Sensor", "authors": ["Wenjie Luo", "Zhenyu Yan", "Qun Song", "Rui Tan"], "description": "Runtime domain shifts from the training phase caused by sensor characteristic variation incur performance drops of the deep learning-based sensing systems. To address this problem, existing transfer learning techniques require substantial target-domain data and incur high post-deployment overhead. Differently, we propose to exploit the first principle governing the domain shift to reduce the demand for target-domain data. Specifically, our proposed approach called PhyAug uses the first principle fitted with few labeled or unlabeled data pairs collected by the source sensor and the target sensor to transform the existing source-domain training data into the augmented target-domain data for calibrating the deep neural networks. In two audio sensing case studies of keyword spotting and automatic speech recognition, PhyAug recovers the recognition accuracy losses due to microphones’ characteristic variations by …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:EkHepimYqZsC", "title": "Holographic-Type Communication for Digital Twin: A Learning-based Auction Approach", "authors": ["XiuYu Zhang", "Minrui Xu", "Rui Tan", "Dusit Niyato"], "description": "Digital Twin (DT) technologies, which aim to build digital replicas of physical entities, are the key to providing efficient, concurrent simulation and analysis of real-world objects. In displaying DTs, Holographic-Type Communication (HTC), which supports the transmission of holographic data such as Light Field (LF), can provide an immersive way for users to interact with Holographic DTs (HDT). However, it is challenging to effectively allocate interactive and resource-intensive HDT services among HDT users and providers. This paper integrates the paradigms of HTC and DT to form a HTC for DT system, designs a marketplace for HDT services where HDT users' and providers' prices are evaluated by their valuation functions, and proposes an auction-based mechanism to match HDT services using a learning-based Double Dutch Auction (DDA). Specifically, we apply DDA and train an agent acting as the auctioneer to adjust the auction clock dynamically using Deep Reinforcement Learning (DRL), aiming to achieve the best market efficiency. Simulation results demonstrate that the proposed learning-based auctioneer can achieve near-optimal social welfare at halved auction information exchange cost of the baseline method.", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:VLnqNzywnoUC", "title": "Demo Abstract: 3D Simultaneous Localization and Mapping with Power Network Electromagnetic Radiation", "authors": ["Rongrong Wang", "Zhenyu Yan", "Yuting Wu", "Rui Tan", "Chris Xiaoxuan Lu"], "description": "Indoor localization by leveraging the existing residential instru-ments has been widely explored. Given the properties of tempo-ral stability and spatial distinctness, the electromagnetic radiation (EMR) from the powerline network is a promising signal for location sensing. In this demo, we present a three-sensor setup to capture the powerline EMR signal from the three-dimensional (3D) space and formulate a new powerline EMR feature to implement the simultaneous localization and mapping (SLAM). Compared with the single sensor setup, our proposed approach can improve the localization accuracy to decimeter level.", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:t7zJ5fGR-2UC", "title": "Sardino: Ultra-Fast Dynamic Ensemble for Secure Visual Sensing at Mobile Edge", "authors": ["Qun Song", "Zhenyu Yan", "Wenjie Luo", "Rui Tan"], "description": "Adversarial example attack endangers the mobile edge systems such as vehicles and drones that adopt deep neural networks for visual sensing. This paper presents {\\em Sardino}, an active and dynamic defense approach that renews the inference ensemble at run time to develop security against the adaptive adversary who tries to exfiltrate the ensemble and construct the corresponding effective adversarial examples. By applying consistency check and data fusion on the ensemble's predictions, Sardino can detect and thwart adversarial inputs. Compared with the training-based ensemble renewal, we use HyperNet to achieve {\\em one million times} acceleration and per-frame ensemble renewal that presents the highest level of difficulty to the prerequisite exfiltration attacks. We design a run-time planner that maximizes the ensemble size in favor of security while maintaining the processing frame rate. Beyond adversarial examples, Sardino can also address the issue of out-of-distribution inputs effectively. This paper presents extensive evaluation of Sardino's performance in counteracting adversarial examples and applies it to build a real-time car-borne traffic sign recognition system. Live on-road tests show the built system's effectiveness in maintaining frame rate and detecting out-of-distribution inputs due to the false positives of a preceding YOLO-based traffic sign detector.", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:2KloaMYe4IUC", "title": "Real-Time Cooling Power Attribution for Co-Located Data Center Rooms with Distinct Temperatures and Humidities", "authors": ["Rongrong Wang", "Duc Van Le", "Rui Tan", "Yew-Wah Wong"], "description": "At present, a co-location data center often applies an identical and low temperature setpoint for its all server rooms. Although increasing the temperature setpoint is a rule-of-thumb approach to reducing the cooling energy usage, the tenants may have different mentalities and technical constraints in accepting higher temperature setpoints. Thus, supporting distinct temperature setpoints is desirable for a co-location data center in pursuing higher energy efficiency. This calls for a new cooling power attribution scheme to address the inter-room heat transfers that can be up to 9% of server load as shown in our real experiments. This article describes our approaches to estimating the inter-room heat transfers, using the estimates to rectify the metered power usages of the rooms’ air handling units, and fairly attributing the power usage of the shared cooling infrastructure (i.e., chiller and cooling tower) to server rooms by …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:URolC5Kub84C", "title": "Green Data Center Cooling Control via Physics-Guided Safe Reinforcement Learning", "authors": ["Ruihang Wang", "Zhiwei Cao", "Xin Zhou", "Yonggang Wen", "Rui Tan"], "description": "Deep reinforcement learning (DRL) has shown good performance in tackling Markov decision process (MDP) problems. As DRL optimizes a long-term reward, it is a promising approach to improving the energy efficiency of data center cooling. However, enforcement of thermal safety constraints during DRL’s state exploration is a main challenge. The widely adopted reward shaping approach adds negative reward when the exploratory action results in unsafety. Thus, it needs to experience sufficient unsafe states before it learns how to prevent unsafety. In this paper, we propose a safety-aware DRL framework for data center cooling control. It applies offline imitation learning and online post-hoc rectification to holistically prevent thermal unsafety during online DRL. In particular, the post-hoc rectification searches for the minimum modification to the DRL-recommended action such that the rectified action will not result …", "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:XD-gHx7UXLsC", "title": "Journal: Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 2022, № 1, p. 1-26", "authors": ["Dongfang Guo", "Chaojie Gu", "Linshan Jiang", "Wenjie Luo", "Rui Tan"], "description": null, "publication_year": 2022, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:_Re3VWB3Y0AC", "title": "An Electromagnetic Covert Channel based on Neural Network Architecture", "authors": ["Chaojie Gu", "Jiale Chen", "Rui Tan", "Linshan Jiang"], "description": "Outsourcing the design of deep neural networks may incur cybersecurity threats from the hostile designers. This paper studies a new covert channel attack that leaks the inference results over the air through a hostile design of the neural network architecture and the computing device's electromagnetic radiation when executing the neural network. Specifically, the hostile neural network consists of a series of binary models that correspond to all classes and are executed sequentially. The execution terminates once any binary model given the input is positive about its responsible class. We describe an approach to generate such binary models by pruning a benign neural network that is trained using the standard method to deal with all the classes. Compared with the benign neural network, the hostile one has similar memory usage and negligible classification accuracy drop, but distinct inference times for the …", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:uWiczbcajpAC", "title": "A ack-Aware Synchronization-Free Data Timestamping in LoRaWAN", "authors": ["CHAOJIE GU", "LINSHAN JIANG", "RUI TAN", "MO LI", "JUN HUANG"], "description": "A preliminary version of this work appears in The 40th IEEE International Conference on Distributed Computing Systems (ICDCS 2020). This research was supported in part by two MOE AcRF Tier 1 grants (2019-T1-001-044 and 2018-T1-002-081). Authors’ addresses: Chaojie Gu, gucj@ ntu. edu. sg; Linshan Jiang, LINSHAN001@ e. ntu. edu. sg; Rui Tan, tanrui@ ntu. edu. sg; Mo Li, limo@ ntu. edu. sg, Nanyang Technological University, School of Computer Science and Engineering, N4-B02A-01, 50 Nanyang Avenue, Singapore, 639798; Jun Huang, Massachusetts Institute of Technology, Sloan School of Management, 100 Main St, Cambridge, United States, MA 02142, junhuang@ mit. edu.", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:_Ybze24A_UAC", "title": "Touch-to-Access Device Authentication For Indoor Smart Objects", "authors": ["Zhenyu Yan", "Qun Song", "Rui Tan"], "description": "This paper presents TouchAuth, a new touch-to-access device authentication approach using induced body electric potentials (iBEPs) caused by the indoor ambient electric field that is mainly emitted from the building's electrical network. The design of TouchAuth is based on the electrostatics of iBEP generation and a resulting property, i.e., the iBEPs at two close locations on the same human body are similar, whereas those from different human bodies are distinct. Extensive experiments verify the above property and show that TouchAuth achieves high-profile receiver operating characteristics in implementing the touch-to-access policy. Our experiments also show that a range of possible interfering sources including appliances’ electromagnetic emanations and noise injections into the power network do not affect the performance of TouchAuth. A key advantage of TouchAuth is that the iBEP sensing requires a …", "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:ZfRJV9d4-WMC", "title": "Demo Abstract: Infrastructure-Free Smartphone Indoor Localization Using Room Acoustic Responses", "authors": ["Dongfang Guo", "Wenjie Luo", "Chaojie Gu", "Yuting Wu", "Qun Song", "Zhenyu Yan", "Rui Tan"], "description": null, "publication_year": 2021, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:ZuybSZzF8UAC", "title": "Deep Reinforcement Learning for Tropical Air Free-Cooled Data Center Control", "authors": ["Duc Van Le", "Rongrong Wang", "Yingbo Liu", "Rui Tan", "Yew-Wah Wong", "Yonggang Wen"], "description": null, "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:vbGhcppDl1QC", "title": "LMAC", "authors": ["Amalinda Gamage", "Jansen Christian Liando", "Chaojie Gu", "Rui Tan", "Mo Li"], "description": "LMAC | CiNii Research CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 詳細へ移動 検索\nフォームへ移動 論文・データをさがす 大学図書館の本をさがす 日本の博士論文をさがす English \n検索 タイトル 人物/団体名 所属機関 ISSN DOI 期間 ~ 本文リンク 本文リンクあり データソース \nJaLC IRDB Crossref DataCite NDL NDL-Digital RUDA JDCat NINJAL CiNii Articles CiNii \nBooks CiNii Dissertations DBpedia Nikkei BP KAKEN Integbio 公共データカタログ すべて 研究\nデータ 論文 本 博士論文 プロジェクト LMAC DOI Web Site 被引用文献1件 Amalinda Gamage \nNanyang Technological University, Singpore Jansen Christian Liando Nanyang \nTechnological University, Singpore Chaojie Gu Nanyang Technological University, \nSingpore Rui Tan Nanyang Technological University, Singpore Mo Li Nanyang \nTechnological University, Singpore 書誌事項 タイトル別名 efficient carrier-sense multiple \naccess for LoRa 収録刊行物 Proceedings of the …", "publication_year": 2020, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:SP6oXDckpogC", "title": "A testbed and data yields for studying data center energy efficiency and reliability", "authors": ["Duc Van Le", "Yingbo Liu", "Rongrong Wang", "Rui Tan", "Lek Heng Ngoh"], "description": "Many data centers still adopt low temperature setpoints, resulting in high energy consumption of their cooling systems. In our ongoing research project, we have built a data center testbed consisting of three test rooms hosting servers and network equipment. In particular, the testbed is equipped with cooling, heating, and ventilation systems that are under our full control. Thus, we can operate the testbed in a wide range of server room conditions. The test rooms and servers are instrumented with hardware and software sensors monitoring more than 200 measurement points. An extensive test plan is being executed to collect a large volume of data to understand the impact of environmental conditions on server's computing performance and reliability as well as the energy efficiency of the testbed. The results will provide important guidelines for building and operating energy-efficient data centers. We will work with …", "publication_year": 2018, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:M3NEmzRMIkIC", "title": "Spatiotemporal Coverage in Fusion-Based Sensor Networks", "authors": ["Rui Tan", "Guoliang Xing"], "description": "Wireless sensor networks (WSNs) have been increasingly available for critical applications such as security surveillance and environmental monitoring. As a fundamental performance measure of WSNs, coverage characterizes how well a sensing field is monitored by a network. Two facets of coverage, i.e., spatial coverage and temporal coverage, quantify the percentage of area that is well monitored by the network and the timeliness of the network in detecting targets appearing in the sensing field, respectively. Although advanced collaborative signal processing algorithms have been adopted by many existing WSNs, most previous analytical studies on spatiotemporal coverage of WSNs are conducted based on overly simplistic sensing models (e.g., the disc model) that do not capture the stochastic nature of sensing. In this chapter, we attempt to bridge this gap by exploring the fundamental limits of spatiotemporal coverage based on …", "publication_year": 2014, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:L7CI7m0gUJcC", "title": "Energy-Saving Strategies in the Air-Cooled Tropical Data Center with Thermoeconomic Assessments", "authors": ["Fei Duan", "Jing Zhou", "Baris Burak Kanbur", "Duc Van Le", "Rui Tan"], "description": "Rapid developments of the electronic information industry promote energy usages of cooling system in data centers to be paid extensive attention, especially in the tropical environment. The study experimentally conducts the key issues and assessments of energy-saving operations of tropical data center at system and component levels from the perspectives of thermodynamics, economics, and thermoeconomics. Comprehensive assessments of supply air temperature, outdoor air temperature, and operation modes in tropical data center are discussed and compared. Operation modes of compression vary with the setpoints of supply air temperature. The alternate operation easily appears in multiple compressors, inevitably increasing the exergy loss & destruction of data centers. As supply air temperature rises from 20 C to 32 C, average hourly energy cost of cooling system decreases 37.8%. Also, high supply air temperature and low refrigerant charges have significant exergy costing advantages over resisting the impacts of outdoor air temperature changes. Based on them, practical operation strategies for dynamic adjustment of supply air temperature have been proposed to cope with impacts of the tropical high-temperature environment. The results reveal that the average energy savings values are 0.7%~ 2.8%, which provides the feasibility of making full use of outdoor conditions and indoor parameters.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=co5MGPkAAAAJ&cstart=100&pagesize=100&citation_for_view=co5MGPkAAAAJ:AvfA0Oy_GE0C", "title": "Energy-Saving Operations of Data Center in Tropical Environment", "authors": ["Jing Zhou", "Baris Burak Kanbur", "Duc Van Le", "Rui Tan", "Fei Duan"], "description": "The rapid development of the electronic information industry promotes the energy usage of the cooling system in data centers (DCs) to be paid extensive attention, especially in the tropical environment. The study experimentally conducts the key issues and assessments of energy-saving operations of the tropical data center (TDC) at system and component levels from the perspectives of thermodynamics, economics, and thermoeconomics. Comprehensive assessments of supply air temperature (SAT), outdoor air temperature (OAT), and operation modes in TDC are discussed and compared. The operation modes of compression vary with the setpoints of SAT. The alternate operation easily appears in multiple compressors, inevitably increasing the exergy loss & destruction of DCs. As the SAT increases from 20 C to 32 C, the average hourly energy cost of the cooling system decreases from SGD 3.7 to 2.3. Also, high SAT and low refrigerant charges have significant exergy costing advantages over resisting the impacts of OAT changes. Based on them, practical operation strategies for dynamic adjustment of SAT have been proposed to cope with the impacts of the tropical high-temperature environment. The results reveal that the average energy savings values are 0.7%~ 2.8%, which provides the feasibility of making full use of outdoor conditions and indoor parameters.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}}]