[{"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:u5HHmVD_uO8C", "title": "Scheduling and routing algorithms for AGVs: a survey", "authors": ["Ling Qiu", "Wen-Jing Hsu", "Shell-Ying Huang", "Han Wang"], "description": "Automated guided vehicles (AGVs) are now becoming popular in automated materials handling systems, flexible manufacturing systems and even container handling applications. In the past few decades, much research has been devoted to the technology of AGV systems and rapid progress has been witnessed. As one of the enabling technologies, scheduling and routing of AGVs have attracted considerable attention. Many algorithms for the scheduling and routing of AGVs have been proposed. However, most of the existing results are applicable to systems with a small number of AGVs, offering a low degree of concurrency. With a drastically increased number of AGVs in recent applications (e.g. in the order of a hundred in a container handling system), efficient algorithms are needed to resolve the increased contention of resources (e.g. path, loading and unloading buffers) among AGVs. This survey paper first …", "publication_year": 2002, "citations_by_year": {"year": [2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [3, 7, 11, 13, 18, 14, 22, 23, 28, 31, 23, 34, 27, 23, 29, 21, 17, 26, 29, 21, 26, 27, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:u-x6o8ySG0sC", "title": "Travel time analysis of a new automated storage and retrieval system", "authors": ["Ya-Hong Hu", "Shell Ying Huang", "Chuanyu Chen", "Wen-Jing Hsu", "Ah Cheong Toh", "Chee Kit Loh", "Tiancheng Song"], "description": "In conventional automated storage and retrieval systems (AS/RS), stacker cranes are used to access (store or retrieve loads into/from) the storage cells. The stacker cranes can travel simultaneously in the vertical and horizontal directions. However, because the combined motions generally require heavy machineries, the stacker cranes are inadequate for extra heavy loads such as sea container cargo. For such applications, we present a new kind of storage/retrieval (S/R) mechanism, designed with input from AS/RS manufacturers. Unlike stacker cranes, the new S/R mechanism has one vertical platform and N horizontal platforms to serve N tiers of an AS/RS rack. The vertical platform provides the vertical link among different tiers of the AS/RS rack, whereas the horizontal platforms access the storage cells on a given tier. The vertical platform and the horizontal platforms may move independently and concurrently …", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 7, 10, 16, 13, 10, 6, 12, 4, 10, 12, 9, 13, 12, 11, 14, 6, 7, 2, 1]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:3fE2CSJIrl8C", "title": "Dynamic yard crane dispatching in container terminals with predicted vehicle arrival information", "authors": ["Xi Guo", "Shell Ying Huang", "Wen Jing Hsu", "Malcolm Yoke Hean Low"], "description": "The performance of a container terminal depends on many aspects of operations. This paper focuses on the optimal sequencing of a yard crane (or YC for short) for serving a fleet of vehicles for delivery and pickup jobs. The objective is to minimize the average vehicle waiting time. While heuristic algorithms could not guarantee an optimal solution, a conventional mathematical formulation such as mixed integer program would require too much computing time. We present two new algorithms to efficiently compute YC dispatching sequences that are provably optimal within the planning window. The first algorithm is based on the well-known A∗ search along with an admissible heuristics. We also incorporate this heuristics into a second backtracking algorithm which uses a prioritized search order to accelerate the computation. Experimental results show that both new algorithms perform very well for realistic YC jobs …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 11, 5, 10, 10, 8, 5, 10, 7, 8, 5, 9, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:d1gkVwhDpl0C", "title": "Load balancing for conservative simulation on shared memory multiprocessor systems", "authors": ["Boon Ping Gan", "Yoke Hean Low", "Sanjay Jain", "Stephen John Turner", "Wentong Cai", "Wen Jing Hsu", "Shell Ying Huang"], "description": "Load balancing is a crucial factor in achieving good performance for parallel discrete event simulations. We present a load balancing scheme that combines both static partitioning and dynamic load balancing. The static partitioning scheme maps simulation objects to logical processes before simulation starts while the dynamic load balancing scheme attempts to balance the load during runtime. The static scheme involves two steps. First, the simulation objects that contribute to small lookahead are merged together by using a merging algorithm. Then a partitioning algorithm is applied. The merging is needed to ensure a consistent performance for our dynamic scheme. Our dynamic scheme is tailor-made for an asynchronous simulation protocol that does not rely on null messages. The performance study on a supply chain simulation shows that the partitioning algorithm and dynamic load balancing are important in …", "publication_year": 2000, "citations_by_year": {"year": [2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 4, 5, 4, 7, 5, 1, 2, 2, 4, 9, 9, 8, 3, 2, 5, 3, 3, 1, 1, 0, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:maZDTaKrznsC", "title": "Dynamic space and time partitioning for yard crane workload management in container terminals", "authors": ["Xi Guo", "Shell Ying Huang"], "description": "We propose a new hierarchical scheme for yard crane (YC) workload management in container terminals. We also propose a time partitioning algorithm and a space partitioning algorithm for deploying YCs to handle changing job arrival patterns in a row of yard blocks. The main differences between our approach and most of the methods in literature are (1) the average vehicle job waiting time instead of the number of jobs is used to balance YC workload and to evaluate the quality of a partition, (2) the YC working zone assignment is not in units of yard blocks and our space partitioning algorithm generates more flexible divisions of the workload from all blocks, and (3) the YC deployment frequency is not fixed but is decided by our time partitioning algorithm with the objective of minimizing average vehicle waiting times. The scheme combines simulation and optimization to achieve our objective for a row of yard …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [2, 2, 7, 5, 5, 5, 8, 9, 4, 4, 1, 4, 2]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:9yKSN-GCB0IC", "title": "Survey of languages and runtime libraries for parallel discrete-event simulation", "authors": ["Yoke-Hean Low", "Chu-Cheow Lim", "Wentong Cai", "Shell-Ying Huang", "Wen-Jing Hsu", "Sanjay Jain", "Stephen J Turner"], "description": "To develop a parallel discrete-event simulation from scratch requires in-depth knowledge of the mapping process from the physical model to the simulation model, and also a substantial effort in coping with the numerous issues concerning the underlying synchronization protocols in use. Languages and libraries could reduce the devel opment effort significantly by providing the user with a pre-built parallel simulation kernel as well as application development tools. This pa per contains a survey of the existing languages and libraries for parallel discrete-event simula tion. It is divided into two major sections: one on the languages, the other on the libraries. The discussions are mainly focused on the following aspects: user model, programming framework and language features, library API, protocols, and system support and environment. The re ported performances of some packages are also summarized.", "publication_year": 1999, "citations_by_year": {"year": [1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 6, 3, 2, 6, 4, 6, 4, 2, 2, 3, 1, 3, 5, 2, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:vV6vV6tmYwMC", "title": "Stowage planning of large containership with tradeoff between crane workload balance and ship stability", "authors": ["Liu Fan", "Malcolm Yoke Hean Low", "Huang Shell Ying", "Hsu Wen Jing", "Zeng Min", "Win Cho Aye"], "description": "This paper describes an effective algorithm for generating basic stowage plans of large containership calling at a given number of ports. The algorithm applies an efficient block-based container allocation heuristic method of our previous work and taking into considerations more constraints in the real-world operations of commercial shipping line. The algorithm divides the cargo-space of a large containership into blocks, and assigns groups of containers to different partitions of the ship according to a set of heuristic rules. We present a practical test case and analyze the stowage plan generated by our system based on critical measurements such as the number of re-handles, crane intensity and ship stability.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 2, 1, 4, 4, 3, 3, 2, 9, 6, 7, 2, 3, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:4TOpqqG69KYC", "title": "Capacity analysis of container terminals using simulation techniques", "authors": ["Shell Ying Huang", "Wen-Jing Hsu", "Chuanyu Chen", "Rong Ye", "Stuti Nautiyal"], "description": "Simulation based analysis is particularly useful for designing new container terminals and evaluating the benefits of new resources or impacts of operation policies and modifications. We present a computer simulation model that integrates all the activities of a container terminal and captures the essential interactions among the subsystems which affect terminal capacity. The system incorporates methods to generate realistic vessel arrival patterns and can track the moves of millions of containers in a terminal. We further present case studies of the handling capacities of three container terminals in the Southeast Asia region, the issues involved, our approach and the findings.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 3, 4, 1, 7, 4, 1, 6, 2, 2, 3, 0, 4, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:hC7cP41nSMkC", "title": "An Automated Stowage Planning System for Large Containerships", "authors": ["Malcolm Yoke Hean Low", "Xiantao Xiao", "Fan Liu", "Shell Ying Huang", "Wen Jing Hsu", "Zhengping Li"], "description": "The purpose of this study is to develop a system to automatically generate stowage plan for large containerships. The system consists of three modules: stowage plan generator, stability module and optimization engine. This paper presents the architecture and the work of the first module-stowage plan generator, which is used to automatically generate a feasible stowage plan with reasonable crane intensity (CI) and the number of rehandles and ready for the stability checks and adjustments. Our experimental results with real-world containership voyage data show that our system is able to efficiently generate feasible stowage plans comparable to human planners in terms of the number of rehandles and CI, which are crucial to shipping operations.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 4, 8, 4, 0, 2, 3, 1, 1, 2, 8, 0, 4, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:Se3iqnhoufwC", "title": "Yard crane dispatching based on real time data driven simulation for container terminals", "authors": ["Xi Guo", "Shell Ying Huang", "Wen Jing Hsu", "Malcolm Yoke Hean Low"], "description": "This paper studies the problem of real time yard crane dispatching in container terminals. Many technologies, including transponders, RFID and GPS have been used in the container terminal setting for real-time tracking of terminal equipment. A judicious integration of real-time data into the yard crane management system will allow better utilization of terminal resources to improve overall terminal productivity. We propose a yard crane dispatching algorithm based on real time data driven simulation to solve the problem of yard crane job sequencing to minimize average vehicle waiting time. The algorithm will produce optimal operation sequence for each planning window. Several policies to select jobs to form the planning window are also proposed. Our simulation results show that dispatching yard crane based on real time data driven simulation is of great value in improving yard crane performance in 3 scenarios …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 2, 4, 4, 6, 5, 3, 0, 0, 0, 1, 1, 3, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:ULOm3_A8WrAC", "title": "Simulation and optimization of container yard operations: A survey", "authors": ["Chuanyu Chen", "Wen-Jing Hsu", "Shell-Ying Huang"], "description": "Management of container terminal operations is essentially the allocation and scheduling of the expensive resources such as berths, quay cranes, storage space, yard cranes, and container carriers. Each of these resources plays an indispensable role in the interlocking processes in a container terminal. In this survey we give a critical review and a comparative study on various decision problems that arise at container terminals and in most cases, the solutions to which go into making up the overall terminal management system. For each problem, an overview of literature is presented, along with a description of the quantitative models that try to solve the problem. We focus our attention on yard management, since the operation on storage yard is the most complicated part at the terminal where both inbound and outbound container flows are handled in this area simultaneously.", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 5, 2, 2, 4, 5, 2, 3, 2, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:-f6ydRqryjwC", "title": "Assessing capacity and improving utilization of anchorages", "authors": ["Shell Ying Huang", "Wen Jing Hsu", "Yuxiong He"], "description": "Anchorages are important resources for certain hub ports, and they are increasingly in demand during peak periods. We evaluate the capacity of multiple anchorages by reproducing realistic mix of arriving vessels, dwelling time and the current practices in choosing anchoring spots within an anchorage. The model is validated by using historical data. We also propose methods for improving space utilization of anchorages. Our experiments with four real anchorages show that the space utilization is improved by 6–10% with MHDF and WALLPACK_MHDF algorithms. This finding opens up possibilities of designating vessel anchoring spots for improved utilizations in the future.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 2, 5, 3, 3, 2, 1, 3, 2, 2, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:ns9cj8rnVeAC", "title": "Route planning of automated guided vehicles", "authors": ["Hsu Wen Jing", "Huang Shell Ying"], "description": "A few basic types of transportation functions of the automated guided vehicles are identified. Frameworks and issues related to the routing problems are then presented. The suitability of several generic topologies to each function is evaluated under the framework. It is believed that the precursory work can be a basis for future research and development in this area.", "publication_year": 1994, "citations_by_year": {"year": [1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 1, 4, 2, 2, 6, 2, 2, 0, 0, 1, 0, 1, 2, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:ufrVoPGSRksC", "title": "Mixed integer programming models for dispatching vehicles at a container terminal", "authors": ["Li-Wei Zhang", "Rong Ye", "Shell-Ying Huang", "Wen-Jing Hsu"], "description": "This paper presents scheduling models for dispatching vehicles to accomplish a sequence of container jobs at the container terminal, in which the starting times as well as the order of vehicles for carrying out these jobs need to be determined. To deal with this scheduling problem, three mixed 0–1 integer programming models, Model I, Model II and Model III are provided. We present interesting techniques to reformulate the two mixed integer programming models, Model I and Model II, as pure 0–1 integer programming problems with simple constraint sets and present a lower bound for the optimal value of Model I. Model III is a complicated mixed integer programming model because it involves a set of non-smooth constraints, but it can be proved that its solutions may be obtained by the so-called greedy algorithm. We present numerical results showing that Model III is the best among these three models and …", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 2, 3, 1, 1, 1, 2, 3, 3, 2, 2, 0, 2, 0, 1, 2, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:qjMakFHDy7sC", "title": "An empirical comparison of runtime systems for conservative parallel simulation", "authors": ["Chu-Cheow Lim", "Yoke-Hean Low", "Wentong Cai", "Wen Jing Hsu", "Shell Ying Huang", "Stephen J Turne"], "description": "A main consideration when implementing a parallel simulation application is the choice of the parallel simulation protocol (conservative vs. optimistic). Given a particular protocol, the application programmer then has to determine a suitable parallel runtime system to implement the application. If the choice is an optimistic protocol, there are several parallel simulation libraries intended for application programmers (e.g. GTW, Warped). For a conservative protocol, the most effective approach is for the programmer to use a general parallel runtime library, and implement optimizations specific to the simulation application and/or model. In this paper, we selected four general parallel runtime libraries potentially relevant to parallel simulations, and implemented a conservative protocol on each of them. We study the four libraries on three main aspects: (a) programmability; (b) performance, and (c) mechanisms for …", "publication_year": 1998, "citations_by_year": {"year": [1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [4, 1, 3, 0, 6, 1, 1, 0, 2, 3, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:UeHWp8X0CEIC", "title": "Performance prediction tools for parallel discrete-event simulation", "authors": ["Chu-Cheow Lim", "Yoke-Hean Low", "Boon-Ping Gan", "Sanjay Jain", "Wentong Cai", "Wen Jing Hsu", "Shell Ying Huang"], "description": "We have developed a set of performance prediction tools which help to estimate the achievable speedups from parallelizing a sequential simulation. The tools focus on two important factors in the actual speedup of a parallel simulation program: the simulation protocol used; and the inherent parallelism in the simulation model. The first two tools are a performance/parallelism analyzer for a conservative, asynchronous simulation protocol, and a similar analyzer for a conservative, synchronous (super-step) protocol. Each analyzer allows us to study how the speedup of a model changes with increasing number of processors, when a specific protocol is used. The third tool-a critical path analyzer-gives on ideal upper bound to the model's speedup. This paper gives an overview of the prediction tools, and reports the predictions from applying the tools to a discrete-event wafer fabrication simulation model. The predictions …", "publication_year": 1999, "citations_by_year": {"year": [1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 2, 2, 1, 5, 1, 0, 1, 0, 1, 1, 0, 2, 1, 0, 1, 0, 0, 1, 0, 1, 2, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:qxL8FJ1GzNcC", "title": "Improving safety and stability of large containerships in automated stowage planning", "authors": ["Malcolm Yoke Hean Low", "Min Zeng", "Wen Jing Hsu", "Shell Ying Huang", "Fan Liu", "Cho Aye Win"], "description": "Stowage planning is an important task in the container transportation business. The quality of stowage plans generated for ships on a multiport voyage greatly affects a shipping line's operating cost which also directly affects the competitiveness of supply-chain companies that rely on it. This paper describes ongoing research and development of an automated system for generating quality stowage plans for large containerships. The system consists of three modules: stowage plan generator, stability module and optimization engine. The focus of the study is on the stability module, which automatically generates feasible stowage plans that conform to safety and stability requirements for large-scale vessels. The module can greatly reduce the amount of ballast required by the ship and lower the cost of shipping. The proposed system is tested on a real-world large containership with more than 7000 TEUs on a multiport …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 1, 0, 3, 1, 1, 4, 1, 4, 0, 4, 1, 1]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:W7OEmFMy1HYC", "title": "Platform-based AS/RS for container storage", "authors": ["Chuanyu Chen", "Shell-Ying Huang", "Wen-Jing Hsu", "Ah Cheong Toh", "Chee Kit Loh"], "description": "The ever-increasing demand on container port throughput has mounted the necessity of a more efficient container storage structure, the requirements of which apparently can be met by AS/RS because of its abilities of fully automating material handling and the potentials for delivering high performance. In this study, we present an AS/RS for container storage, develop the travel time models for the proposed system, and confirm its feasibility in terms of throughput performance. A pre-processing scheme for operation scheduling that significantly improves AS/RS throughput is proposed and evaluated. Additional constraints arising from the container size and weight on AS/RS design and scheduling are taken into considerations, which in effect leads to a platform-based AS/RS.", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 1, 4, 3, 3, 2, 2, 0, 3, 1, 2, 0, 1, 0, 1, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:dfsIfKJdRG4C", "title": "A marine traffic simulation system for hub ports", "authors": ["Shell Ying Huang", "Wen Jing Hsu", "Hui Fang", "Tiancheng Song"], "description": "Ensuring congestion-free marine traffic is crucial for hub ports in the world. For these hub ports, there has been increasing demand in marine transport. Therefore a capacity-assessment tool that models and simulates the navigational network, the traffic flows and complex navigational behaviors of vessels is needed. The simulation model presented in this paper is unique in the scale and complexity of the waterway networks covered, the flexibility in defining the traffic flow patterns, and the degree of accuracy demanded of navigational behaviors. As such, none of the existing models and simulation tools is adequate for assessing the waterway capacity. The model was calibrated based on detailed analysis of historical records and consultations with domain experts. The model was used in the study of several future scenarios of a hob port. The simulation system built has laid a useful foundation for planning future …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 5, 1, 3, 1, 1, 6, 0, 1, 5, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&citation_for_view=zWYCmiAAAAAJ:RHpTSmoSYBkC", "title": "Automated stowage planning for large containerships with improved safety and stability", "authors": ["Min Zeng", "Malcolm Yoke Hean Low", "Wen Jing Hsu", "Shell Ying Huang", "Fan Liu", "Cho Aye Win"], "description": "Stowage planning for container ships is a core activity of shipping lines. As the size of containership increases, generating a stowage plan with good safety and stability for a large containership becomes increasingly difficult. In this paper, we present an automated stowage planning system for large containerships which consists of three modules: the stowage plan generator, the safety and stability adjustment module, and the optimization engine. This paper focuses on the safety and stability adjustment module which resolves the stability issues of a stowage plan by adjusting the distribution of container weights by stowing containers in alternative feasible locations and fine-tuning stability parameters through adjusting the ballast in tanks onboard. Using shipping data for a large 7000 TEUs containership on a multi-port voyage, we demonstrate that our system can generate stowage plans with improved safety and …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 2, 0, 2, 6, 1, 3, 2, 0, 1, 4, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:0EnyYjriUFMC", "title": "A simulation based hybrid algorithm for yard crane dispatching in container terminals", "authors": ["Xi Guo", "Shell Ying Huang", "Wen Jing Hsu", "Malcolm Yoke Hean Low"], "description": "The problem of yard crane dispatching in container terminals is addressed in this paper. We proposed two new hybrid algorithms which combine the advantages of A* heuristic search and Recursive Backtracking with prioritized search order to accelerate the solution process. The algorithms proposed use real time data-driven simulation to accurately predict the time taken by the yard crane in performing its operations and this helps in getting an optimal dispatching sequence that can be followed by the yard crane. Experiments carried out show that the proposed algorithms consistently perform very well over all tested cases. The best performing algorithm is able to find the optimal solution over 2.4 × 10 18  possible dispatching sequences in about 0.3 to 0.4 seconds under heavy workload. The characteristics of memory-saving and interruptibility enable the algorithm to be easily integrated into a complete yard crane …", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 4, 3, 6, 0, 3, 1, 1, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:2osOgNQ5qMEC", "title": "An implementation of static functional process networks", "authors": ["Stuart Cox", "Shell-Ying Huang", "Paul Kelly", "Junxian Liu", "Frank Taylor"], "description": "To get high performance on a distributed-memory multicomputer at present and for the foreseeable future, some explicit control is needed. This paper describes work aimed at harnessing the power of the functional notation in exercising such control. We have developed a declarative annotation scheme which allows explicit control over process placement and communications. The language, called Caliban, has been implemented on a configurable, loosely coupled commercial multicomputer and we describe the compiler and run-time system.", "publication_year": 1992, "citations_by_year": {"year": [1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 4, 1, 3, 2, 1, 4, 0, 0, 1, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:70eg2SAEIzsC", "title": "Visualization and simulation tool for automated stowage plan generation system", "authors": ["Win Cho Aye", "Malcolm Yoke Hean Low", "Huang Shell Ying", "Hsu Wen Jing", "Zeng Min"], "description": "This paper presents a tool for the visualization and simulation of automated stowage plan generation for large containership. The stowage plan is generated automatically based on a heuristic algorithm. The allocation algorithm generates different stowage plan in three main stages which includes basic allocation, special container allocation and various stages of stability adjustments. The purpose of this study is to describe how visualization of stowage plan and simulation of allocation sequences can help in the formulation of new and better stowage allocation algorithm.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 5, 0, 1, 1, 2, 0, 2, 0, 1, 0, 2, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:roLk4NBRz8UC", "title": "Dynamic Control of Intention Priorities of Human-Like Agents.", "authors": ["Huiliang Zhang", "Shell-Ying Huang"], "description": "Intention scheduling mechanism plays a critical role in the correct behaviour of BDI agents. For human-like agents, the independent intentions should be scheduled based on their priorities, which show the respective importance and urgency of the intentions. We propose to enrich the BDI agent architecture with 2 processing components, a PCF (Priority Changing Function) Selector and a Priority Controller. These enable a BDI agent to assign an initial priority value to an intention and change it with time according to the chosen PCF. The initial priority value reflects its urgency at the time of intention creation. The PCF selected defines how the priority should change with time. As an example, we design a function by simulating human behaviors when dealing with several things at the same time. The priority first increases with time according to the Gaussian function to simulate that people are more inclined to do something which has been on their mind for sometime. After a certain time, if the intention still does not get executed because of other higher priority intentions, its priority will decrease according to the Ebbinghaus forgetting curve. Experiment results show that with this mechanism, the agent can show some human-like characteristics when scheduling intention to execute. This can be used when simulating human-like agents.", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 3, 1, 4, 0, 1, 1, 3, 2, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:zYLM7Y9cAGgC", "title": "A methodology for automating the parallelization of manufacturing simulations", "authors": ["Stephen J Turner", "Wentong Cai", "Chu Cheow Lin", "Yoke Hean Low", "Wen Jing Hsu", "Shell Ying Huang"], "description": "One of the main reasons why parallel discrete event simulution hus not been adopted more widely in industry is that the terminology used by the parallel simulution community differsfrom thatof industriulsimulationpractitioners. This paper shows how the gap between these two communities can be bridged by presenting a methodology for automating the parallelization of manufacturing simulations. Our approach provides a way of automatically generating a mapping from a sequential simulation model to un eflcient parallel implementation.The results of this mapping can be expressed in a form which is independent of any particular parallel simulation system or language. Since it is easy to generate code for different simulation systems, it is possible to evuluate alternative parallel simulation protocols at an early stage of development. A prediction of the petformance can thus be obtained by studying the behaviour of …", "publication_year": 1998, "citations_by_year": {"year": [1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 3, 4, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:ZeXyd9-uunAC", "title": "Randomized algorithm with tabu search for multi-objective optimization of large containership stowage plans", "authors": ["Fan Liu", "Malcolm Yoke Hean Low", "Wen Jing Hsu", "Shell Ying Huang", "Min Zeng", "Cho Aye Win"], "description": "This paper describes a randomized algorithm with Tabu Search (TS) for multi-objective optimization of large containership stowage plans. The algorithm applies a randomized block-based container allocation approach to obtain a Pareto set of stowage plans from a set of initial solutions in the first stage, and uses TS to carry out multi-objective optimization on the Pareto set of stowage plans in the second stage. Finally, a group of non-dominated solutions is generated based on objectives such as the number of re-handles, the completion time of the longest crane, the number of stacks that exceed the weight limit, the number of idle slots, horizontal moment difference and cross moment difference. Experimental results based on real data show that the proposed algorithm is able to obtain better stowage plans compared with human planners.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 0, 2, 1, 0, 1, 1, 4, 2, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:Y0pCki6q_DkC", "title": "Decentralized routing algorithms for automated guided vehicles", "authors": ["Jeffrey TL Soh", "Wen-Jing Hsu", "Shell-Ying Huang", "Adrian CY Ong"], "description": "Automated Guided Vehicles (AGVs) are driverless vehicles that are becoming a popular means for material handling. Existing methods for routing AGVs are generally based on centralized control. The central controller is potentially a bottleneck of communication and the single point of weakness of the system. Moreover, the computational cost required to preplan all AGV routes may be too high as to affect the scalability of the solution. Our project aims to design and develop decentralized routing strategies for an AGV system deployed within a container port. Two routing algorithms were developed: Row-First and Semi-Random. The goal is to minimize deadlocks and congestion and maximize throughput. The performances of the algorithms were monitored and compared with each other using a graphics based computer simulator called SIM-PORT.", "publication_year": 1996, "citations_by_year": {"year": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 5, 2, 0, 0, 0, 0, 0, 1, 2, 2, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:UebtZRa9Y70C", "title": "An efficient block-based heuristic method for stowage planning of large containerships with crane split consideration", "authors": ["Xiantao Xiao", "Malcolm Yoke Hean Low", "Fan Liu", "Shell Ying Huang", "Wen Jing Hsu", "Zhengping Li"], "description": null, "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 2, 0, 0, 0, 3, 1, 0, 1, 1, 2, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:eQOLeE2rZwMC", "title": "Performing A* search for yard crane dispatching in container terminals", "authors": ["Xi Guo", "Shell Ying Huang"], "description": "We address the problem of dispatching a yard crane in its appointed zone of a container terminal. The objective of yard crane dispatching is to determine a sequence for handling all coming jobs within the zone that minimizes the average vehicle waiting time. We propose 2 modified A* search algorithms with admissible heuristics to provide fast and optimal dispatching solution. Simulation results show that the algorithm using the improved heuristic is able to find the optimal solution over 2.4 times 10 18  possible dispatching sequences in about 3 to 4 seconds under heavy work load.", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 3, 3, 2, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:2P1L_qKh6hAC", "title": "New cost function for multi-robot exploration", "authors": ["AK Poernomo", "Huang Shell Ying"], "description": "This paper discusses the problem of multi-robot exploration. The objective of this problem is to explore an unknown environment using a team of mobile robots in a minimum amount of time. We believe that in an unknown environment, it is very difficult to estimate the amount of new information expected from a frontier location. We propose a new objective for the assignment algorithm and introduce a new cost function to be used in the assignment algorithm that leads to better motion planning. For the sake of simplicity, we suggest to use greedy algorithm for the assignment algorithm. In this paper, we also proposed a method for exploration problem with robots' limited communication capability, by estimating the missing robots' position, so that the outcome will not degrade significantly", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 0, 1, 3, 2, 3, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:_FxGoFyzp5QC", "title": "A generic symbiotic simulation framework", "authors": ["Shell Ying Huang", "Wentong Cai", "Stephen John Turner", "Wen Jing Hsu", "Suiping Zhou", "Malcolm Yoke Hean Low", "Richard Fujimoto", "Rassul Ayani"], "description": "Context plays an important role for making accurate recommendations in recommendation systems. There are three types of context: network location context, user context and demand context. However, current researches on service recommendation techniques fail to take into consideration all the context. This paper introduces the context-aware recommendation approach which integrates network location context, user context and demand context. An extensible meta-model is proposed in our system, thus the description of class property can be scalable. The consistent representation of service and user demand will provide convenience for service matching and service filtering. In order to ensure real-time update of service information, this paper puts forward three methods: spontaneous service updating, delayed service updating based on accessing, as well as delayed service updating periodically. For service …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 5, 1, 2, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:WF5omc3nYNoC", "title": "Conservative parallel simulation of manufacturing system", "authors": ["Yoke-Hean Low", "Chu-Cheow Lim", "Boon-Ping Gan", "Sanjay Jain", "Wentong Cai", "Wen Jing Hsu", "Shell Ying Huang", "Stephen J Turner"], "description": null, "publication_year": 1998, "citations_by_year": {"year": [1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 5, 2, 0, 3, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:Tyk-4Ss8FVUC", "title": "A centralized routing algorithm for AGVS in container ports", "authors": ["Xee Yu", "Shell-Ying Huang"], "description": null, "publication_year": 1997, "citations_by_year": {"year": [1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 6, 1, 0, 1, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:lSLTfruPkqcC", "title": "Routing automated guided vehicles on mesh like topologies", "authors": ["SY Huang", "WJ Hsu"], "description": null, "publication_year": 1994, "citations_by_year": {"year": [1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 1, 1, 0, 1, 5, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:IjCSPb-OGe4C", "title": "Program transformations for static process networks", "authors": ["Stuart Cox", "Shell-Ying Huang", "Paul Kelly", "Junxian Liu", "Frank Taylor"], "description": "An important recent idea in software technology for distributed-memory multicomputers is the use of annotations to control data partitioning and placement, relying on a compiler to infer the necessary process placement and communications. We have been developing a declarative language for controlling data partitioning and placement in functional programs, called Caliban. It is interesting because the annotation language builds on the power of the functional language, allowing the user to reuse code developed for the computational part of the problem when expressing how it should be distributed across a parallel computer. The key to doing this is partial evaluation, that is symbolically executing the program until the annotation is in its primitive form, and the partitioning is clear.", "publication_year": 1993, "citations_by_year": {"year": [1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 4, 0, 2, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:Mojj43d5GZwC", "title": "A bounded two-level dynamic programming algorithm for quay crane scheduling in container terminals", "authors": ["Shell Ying Huang", "Ya Li"], "description": "One of the optimization problems in terminal operations is the quay crane scheduling problem. The quay crane scheduling algorithm plays a critical role because it directly affects the length of the vessel loading and unloading process, which means vessel turnaround time. We propose a bounded two-level dynamic programming (DP) algorithm which keeps the simplicity of the bay-based approach but overcomes its shortcomings. We also propose a method to estimate the lower bound to quay crane scheduling given the lists of unloading and loading containers and the number of quay cranes assigned to the vessel. This lower bound is used both to reduce computational time of the 2-level DP algorithm and to evaluate our crane scheduling method. Our experiments with real vessel unloading and loading lists for 80 vessels show that the vessel makespan is close to the lower bound. The computational times for the …", "publication_year": 2018, "citations_by_year": {"year": [2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 4, 5, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:q3oQSFYPqjQC", "title": "Yard crane scheduling to minimize total weighted vessel loading time in container terminals", "authors": ["Shell Ying Huang", "Ya Li"], "description": "One of the most important objectives for container terminals is to minimize the total weighted turnaround time for vessels. Minimizing total weighted vessel loading time directly helps minimize total weighted vessel turnaround time. In this paper we consider the yard crane (YC) scheduling problem in a multi-vessel loading process. We propose a YC scheduling system that minimizes the total weighted maximum tardiness of loading jobs. Our experiments show that this is significantly more effective in the minimization of the total weighted vessel loading time than the existing YC scheduling methods that minimize job waiting time or makespan. Our scheduling system also has the ability to dynamically optimize the YC operations with the consideration of the maximum tardiness already incurred to each vessel earlier in the loading process. To evaluate against our YC scheduling system, an optimal algorithm to …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 4, 2, 1, 2, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:geHnlv5EZngC", "title": "MTSS--A Marine Traffic Simulation System and Scenario Studies for a Major Hub Port", "authors": ["Shell Ying Huang", "Wen Jing Hsu", "Hui Fang", "Tiancheng Song"], "description": "Hub ports need to ensure that their navigational networks can fulfill increased demand in marine traffic. They also need to assess the possible impacts of an accident resulting in partial or complete closure of navigation channels. For lack of adequate analytical tools, modeling and simulation are the only means for such studies. To date, however, no adequate simulation tool exists for modeling and simulating the complex traffic at a large-scale hub port. The challenge is to efficiently model the large number of interacting vessels while accurately reflecting the navigational behaviors of various types of vessels whose movements must comply with prevailing protocols in a location- and situation-aware fashion. We present a systematic approach that enables the construction of a marine traffic simulation system called MTSS. MTSS was calibrated based on detailed analysis of historical records obtained from a major hub …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 2, 2, 0, 3, 3, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:dTyEYWd-f8wC", "title": "A general framework for parallel BDI agents", "authors": ["Huiliang Zhang", "Shell Ying Huang"], "description": "The traditional BDI agent has 3 basic computational components that generate beliefs, generate intentions and execute intentions. They run in a sequential and cyclic manner. This may introduce several problems. Among them, the inability to watch the environment continuously in dynamic environments may be disastrous. There is also no support for goal and intention reconsideration and consideration of relationships between goals at the architecture level. A parallel BDI agent architecture was proposed in [15] and evaluated in [16]. Based on the work in [15] and [16], we propose in this paper, a general framework for the parallel BDI agent model. Under this general framework, parallel BDI agents with different configurations depending on the availability of physical resources may be built. These agents have a number of advantages over the sequential one: 1. changes in the agent's environment can be detected …", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 2, 2, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:hqOjcs7Dif8C", "title": "Performance of new broadcast forwarding criteria in manet", "authors": ["Lijuan Zhu", "Bu-Sung Lee", "Boon-Chong Seet", "Kai-Juan Wong", "Genping Liu", "Shell-Ying Huang", "Keok-Kee Lee"], "description": "In a mobile ad hoc network (MANET), packet broadcast is common and frequently used to disseminate information. Broadcast consume large amount of bandwidth resource, which is scarce in MANET environment. The problem is to find the ideal forward node set so as to minimize the bandwidth consumed, which is a NP-Complete problem. In this paper we will investigate three dominant node approximation algorithms: dominant pruning, total dominant pruning and partial dominant pruning algorithm. An extension to the original algorithms, modified termination criteria, is proposed. Simulation results show that the new termination criteria ensure the same coverage using a reduced number of forward nodes.", "publication_year": 2004, "citations_by_year": {"year": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 3, 1, 2, 0, 0, 0, 0, 1, 0, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:IWHjjKOFINEC", "title": "Anchorage capacity analysis using simulation.", "authors": ["Shell Ying Huang", "Wen Jing Hsu", "Yuxiong He", "Tiancheng Song", "Charles De Souza", "Rong Ye", "Chuanyu Chen", "Stuti Nautiyal"], "description": "With the substantial growth in marine traffic, anchorage space is now in high demand in certain hub ports. To provide decision support for port authorities, we have analyzed the usage of anchorages in recent years. The demands on the anchorages arise from the dynamically changing vessel mix and similarly complex service patterns. The utilization and the capacity of an anchorage space also depend heavily on the dispatching and allocation rules as well as the shape and areas of the anchorage. The complexity of the system studied is therefore beyond the current analytical tools, and hence simulation provides an effective means for the study. In this paper, we present a simulation-based capacity analysis on anchorages. The simulation model built is able to match the current scenarios well, and the analysis by simulation proves very useful in assessing anchorage utilization and capacity for future scenarios.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 2, 1, 0, 2, 0, 2, 1, 1, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:LkGwnXOMwfcC", "title": "A parallel discrete-event simulation of wafer fabrication processes", "authors": ["Chu-Cheow Lim", "Yoke-Hean Low", "Boon-Ping Gan", "Stephen J Turner", "Sanjay Jain", "Wentong Cai", "Wen Jing Hsu", "SY Huang"], "description": "Simulation modeling is an important tool for planning factory operations, to identify and eliminate possible bottlenecks and to maintain high machine utilization. The objective of our project is to apply parallel simulation techniques for virtual factory modeling in the electronics manufacturing sector. We have implemented a parallel wafer fabrication simulation model based on the Sematech data sets [13]. It uses a conservative synchronous protocol [7] modified from [1], and a static MULTIFIT-COM partitioning scheme [17] to allocate multiple machine sets to logical processes (LP’s). The model, though simplified, does contain certain realistic features found in commercial simulation packages (eg TestSim and ManSim [14].) This paper will give an overview description of our implementation, and show its performance numbers on a 4-CPU Sun Enterprise 3000 system. The preliminary timings demonstrate that, even when the simulated events are relatively fine-grained, it is possible to achieve speedup using a conservative synchronous protocol, with an appropriate partitioning scheme and judicious use of lookahead’s.", "publication_year": 1998, "citations_by_year": {"year": [1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 3, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:EUQCXRtRnyEC", "title": "A hybrid metaheuristic method for dispatching automated guided vehicles in container terminals", "authors": ["Li Qin Song", "Shell Ying Huang"], "description": "To reduce the turnaround time of a vessel in a container terminal, the performance of automated guided vehicles (AGVs) which carry on the transportation of containers between quayside and yard is crucial. A good dispatching strategy for AGVs should be able to minimize the waiting or idle time of the quay cranes by assigning vehicles to loading or unloading jobs with a minimum total delay time. The AGVs dispatching problem discussed in this paper include the consideration of propagated tardiness. A delay in one job may affect all the subsequent jobs served by the same quay crane. To handle this assignment problem, we propose a hybrid metaheuristic method. This hybrid method is tested with simulations on a container management system and the results are compared with a greedy method. The hybrid method outperforms the greedy method with obvious improvement. Further comparison between the …", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 2, 1, 1, 1, 1, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:Wp0gIr-vW9MC", "title": "An improved least cost heuristic for dynamic yard crane deployment in container terminals", "authors": ["Shell Ying Huang", "Xi Guo"], "description": "Yard Crane (YC) deployment in a multi-berth terminal is a very complex problem. The total amount of work to the entire terminal yard changes dynamically over time. The levels of workload to different parts of the yard also vary greatly and change over time. So the YC deployment algorithm plays a critical role in increasing YC productivity and reducing vehicle waiting times in the yard. This paper proposes two improved Least Cost Heuristic (LCH) algorithms. The two algorithms consider practical operation constraints and improve performance by adding weight to long waiting jobs and judicious use of YC idle time within deployment periods. We evaluate the improved algorithms against the original LCH [8] in a storage yard of practical size, under dynamically changing workload both in time and space. Experimental results show that the proposed algorithms make substantial reductions in job waiting times over the …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 1, 2, 0, 0, 1, 0, 2, 0, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:YsMSGLbcyi4C", "title": "A general framework for parallel BDI agents in dynamic environments", "authors": ["Huiliang Zhang", "Shell Ying Huang"], "description": "In this paper, a general framework for the parallel BDI model suitable for dynamic environments is proposed. It is a parallel agent architecture that supports the following agent abilities at architecture level:(1) the ability to monitor the environment at all times and respond to emergencies timely;(2) the ability to reconsider and re-schedule goals, intentions and actions in reaction to unexpected or new information;(3) the ability to perform multiple actions at once;(4) the ability to perceive, deliberate and act simultaneously;(5) the ability to prioritize the deliberations and intention executions. We define the functions and the operations of the processing units in the agent and how these units interact, cooperate and synchronize with each other. With the advances in semiconductor technology which allow multiple processing units to be implemented on the same silicon chip, a parallel BDI agent will be an effective way to …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 1, 0, 1, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:rO6llkc54NcC", "title": "Embedding simulation in yard crane dispatching to minimize job tardiness in container terminals", "authors": ["Shell Ying Huang", "Xi Guo", "Wen Jing Hsu", "Wei Lin Lim"], "description": "Two optimal algorithms, MTA ∗  and MT-RBA ∗ , are presented to find the optimal yard crane (YC) job sequence for serving a fleet of vehicles for delivery and pickup jobs with scheduled deadlines and predicted vehicle arrival times. The objective is to minimize the total tardiness of incoming vehicle jobs. This is important for minimizing vessel turnaround time. In the search for an optimal job sequence, the evaluation of the total tardiness of (partial) job sequences requires sequence dependent job service times. Simulation is embedded in our optimization algorithms to help provide accurate YC service times. This results in a more accurate evaluation of job tardiness but incurs costs. Experimental results show that this is feasible despite the simulation costs. MTA ∗  and MT-RBA ∗  significantly outperform the Earliest Due Date First and the Smallest Completion time Job First heuristics in minimizing job tardiness. MT …", "publication_year": 2012, "citations_by_year": {"year": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 3, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:b0M2c_1WBrUC", "title": "A parallel bdi agent architecture", "authors": ["Zhang Huiliang", "Huang Shell Ying"], "description": "In this paper, we proposed a parallel architecture for BDI agents. The agent built with this architecture has the ability of deliberating on new beliefs and executing current intentions at once. The agent also has the ability to prioritize the deliberations and intention executions so it is able to respond quickly to circumstance changes and all the thinking and acting are done at appropriate times. It is in fact a more natural way to simulate human minds since we are always doing several things simultaneously. The parallel architecture consists of three parallel running components which are the belief manager, the intention generator and the intention executor. The coordination between the parallel components is done by interrupts of different priorities. The various levels of priorities include matters that need to be deliberated/acted on (1) immediately and in shortest time possible, (2) immediately without hurrying, (3) at …", "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 5, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:t6usbXjVLHcC", "title": "Optimization and evaluation of tandem quay crane performance", "authors": ["Shell Ying Huang", "Ya Li"], "description": "To meet the challenges of mega-vessels, i.e. those vessels that have capacity of 18,000 Twenty-foot Equivalent Units (TEUs) or more, tandem lift quay cranes have become more and more popular in container terminals. Theoretically these cranes may double the productivity of loading and unloading operations at the quayside. However, many factors in real operations affect the throughput of such cranes. The existing performance evaluations of these cranes involve yard operations which may end up with inaccurate results. They also do not consider hatch covers, intra-bay crane movements, and the time needed by the crane to change spreader between tandem lifts and single lifts. We propose a method to plan the operations of tandem quay cranes to handle the containers in a 40-foot bay. This includes grouping containers into tandem lifts and sequencing all lifts (tandem and single) in a 40-foot bay to optimize …", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 2, 3, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:MXK_kJrjxJIC", "title": "Are parallel bdi agents really better?", "authors": ["Huiliang Zhang", "Shell-Ying Huang"], "description": "The traditional BDI agent has 3 basic computational components that generate beliefs, generate intentions and execute intentions. They run in a sequential and cyclic manner. This may introduce several problems. Among them, the inability to watch the environment continuously in dynamic environments may be disastrous and makes an agent less rational–the agent may endanger itself. Two possible solutions are by parallelism and by controlling and managing the 3 components in suitable ways. We examine a parallel architecture with three parallel running components which are the belief manager, the intention generator and the intention executor. The agent built with this architecture will have the ability of performing several actions at once. To evaluate the parallel BDI agent, we compare the parallel agent against four versions of sequential agents where the 3 components of the BDI agent are controlled and managed in different ways and different time resources are allocated to them. Experiments are designed to simulate agents based on the sequential and parallel BDI architectures respectively and the ability of the agents to respond to the same sequences of external events of various priorities are assessed. The comparison results show that the parallel BDI agent has quicker response, react to emergencies immediately and its behaviour is more rational.", "publication_year": 2006, "citations_by_year": {"year": [2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 1, 0, 1, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:e5wmG9Sq2KIC", "title": "Scheduling dynamically evolving parallel programs using the genetic approach", "authors": ["Boon-Ping Gan", "Shell-Ying Huang"], "description": "Presents a study of scheduling dynamically evolving parallel programs in distributed multiprocessor systems. Four centralized schedulers based on a genetic algorithm are proposed. These schedulers consider both load balancing and communication minimization. They do not assume a-priori knowledge of the execution time or communication overhead. The newly-arrived parallel programs are scheduled to run immediately on arrival, and the processors are not reserved exclusively for the execution of a single parallel program. Simulation experiments were designed and conducted to evaluate the proposed schedulers. The results show that these schedulers can achieve up to 60% improvement in the average response time and up to 80% improvement in communication minimization as compared to the least-loaded scheduler.", "publication_year": 2000, "citations_by_year": {"year": [2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:4OULZ7Gr8RgC", "title": "Reducing simulation costs of embedded simulation in yard crane dispatching in container terminals", "authors": ["Shell Ying Huang", "Xi Guo"], "description": "Embedding simulation in optimization algorithms will incur computational costs. For NP-hard problems the computational costs of the embedded simulation in the optimization algorithm are likely to be substantial. YC dispatching is NP-hard. So it is very important to be able to minimize simulation costs in YC dispatching algorithms. In the optimization algorithm for yard crane dispatching published, simulation of YC operations of the entire (partial) sequence of YC jobs are carried out each time the tardiness of a (partial) sequence needs to be evaluated. In this paper we study two approaches to reduce simulation costs in these embedded simulations in the optimization algorithm. Experimental results show that one approach significantly reduces the computational time of the optimization algorithm. We also analyze the reasons for the other approach which fails to reduce the computational time.", "publication_year": 2013, "citations_by_year": {"year": [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 3, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:J_g5lzvAfSwC", "title": "Dynamic map for obstacle avoidance", "authors": ["Zhang Huiliang", "Huang Shell Ying"], "description": "Most of the existing obstacle avoidance algorithms work well in a relatively static environment, which consists of mostly stationary obstacles and maybe some slow-moving obstacles. In a dynamic environment, however, these obstacle avoidance algorithms may result in a robot colliding with a moving obstacle. In this paper, we propose an idea of constructing a dynamic map of obstacles that shows the predicted positions of the moving obstacles in future. It imitates the human actions of monitoring and estimating the movements of other objects in order to choose a suitable path for themselves to travel in a dynamic environment. We used this idea on an existing obstacle avoidance algorithm, the vector field histogram approach. The simulation results show that the resulting method is able to navigate a robot safely in a dynamic environment.", "publication_year": 2003, "citations_by_year": {"year": [2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 2, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:LjlpjdlvIbIC", "title": "The development of conservative superstep protocols for shared memory multiprocessor systems", "authors": ["Boon-Ping Gan", "Yoke-Hean Low", "Wentong Cai", "Stephen J Turner", "Sanjay Jain", "Wen Jing Hsu", "Shell Ying Huang"], "description": "This paper summarizes our work involving the successive refinements of a conservative superstep protocol. The refined protocols are known as the SST, SLS, and FET protocols. Each of the refinements improves the safetime bound, which in turn reduces the number of supersteps. In general, this helps to reduce the synchronization overhead and thus the execution time. However, a change in the number of supersteps can also introduce load imbalances within supersteps into the simulation. This observation becomes apparent with the FET protocol in particular. The performance of the refined protocols is compared through several semiconductor supply-chain simulation models. The results from the experiments strongly indicate the feasibility of using parallel discrete-event simulation techniques in the simulation of large scale systems such as a supply-chain.", "publication_year": 2001, "citations_by_year": {"year": [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:KlAtU1dfN6UC", "title": "The modified mapping heuristic algorithm", "authors": ["Boon Ping Gan", "Shell Ying Huang"], "description": "The Mapping Heuristic (MH) proposed by EI-Rewini and Lewis (1990) is a list scheduling technique that considers several real world parameters-the interconnection topology, link transfer rates and contention delay-neglected in other list scheduling algorithms. This work is to implement the mapping heuristic algorithm for a system with mesh interconnection topology. During implementation, some modifications were made to the original algorithm. The aim was to get a shorter schedule, to minimize contention delay and to minimize the number of processors used for execution without lengthening execution time. Some problems with the updating of the routing tables in the algorithm were identified and solutions were offered to solve them. Experiment results showed that the modified algorithm outperformed the original MH. The modified algorithm also works for systems with other topologies.", "publication_year": 1996, "citations_by_year": {"year": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 1, 1, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:B3FOqHPlNUQC", "title": "Twincrane-atcrss-game: Job dispatching with lookahead for twin yard cranes", "authors": ["Shell Ying Huang", "Ya Li", "Xiaoxuan Fan"], "description": "When the handling capacity of one yard crane is not enough for one yard block, two cranes are often deployed. Due to the problem complexity in dispatching two or more yard cranes, many researchers have proposed heuristic methods to find near-optimal solutions. We propose TwinCrane-ATCRSS-Game, an online job dispatching algorithm for twin yard cranes when side loading is used. Whenever a yard crane is about to complete its current job, it selects the next job using the ATCRSS rule. However the final choice of the next job is made with a lookahead based on the non-zero-sum game approach. We evaluate the algorithm against the Nearest Neighbour, the Earlier Due Date and the Smallest-Completion Time heuristics.", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 2, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:u9iWguZQMMsC", "title": "Yard crane deployment in container terminals", "authors": ["Shell Ying Huang", "Ya Li", "Meimei Lau", "Teck Chin Tay"], "description": "A three-level, hierarchical system for yard crane (YC) management in container terminals and the algorithms for the bottom two levels were proposed in previous studies. The bottom two levels are responsible for YC job sequencing and intra-row YC deployment. This paper presents YC deployment strategies for inter-row YC deployment. The objectives are to minimize vehicle waiting times and the number of overflow jobs. We show by realistic simulation experiments that (1) when the number of yard cranes is less than the number of yard blocks, deploying YCs in proportion to the number of jobs in each row (3L-Pro-Jobs) is the best; (2) when the number of yard cranes is equal to or more than the number of yard blocks, the apparent workload approach, 3L-AW, performs best.", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 2, 0, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:4DMP91E08xMC", "title": "Simulation-based dynamic partitioning of yard crane workload for container terminal operations.", "authors": ["Xi Guo", "Shell-Ying Huang", "Wen-Jing Hsu", "Malcolm Yoke Hean Low"], "description": "We address the problem of dynamically partitioning the entire row of h container yard blocks into k non-overlapping zones where k is the number of cranes allocated to a row of yard blocks. Allocating non-overlapping zones to each crane will simplify the operational management where a number of cranes share the work in a row because crane collision will be a potential danger and careful planning is needed to avoid it. However even careful prior planning may not solve all the crane clashes which will lead to delays in operation. We use real time data driven simulation to estimate the dynamic workload of each yard crane in the proposed yard crane workload partition algorithm. Our experimental results show that our partition scheme is able to minimize vehicle waiting time. This will help maintain the continuous feeding of vehicles to quay cranes and as a result, reduce vessel turnaround time, which is a key performance indicator for container terminals.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:Zph67rFs4hoC", "title": "An agent’s activities are controlled by his priorities", "authors": ["Huiliang Zhang", "Shell Ying Huang", "Yuming Chang"], "description": "Activity scheduling mechanism plays a critical role in the correct behaviour of BDI agents. For example, a robotic agent to serve at home should carry out the right activities at the right times. However the scheduling of deliberation about new beliefs and the scheduling of intention execution have not been carefully studied in most BDI systems. Usually if there is any differentiation of urgency among different tasks, a constant utility/priority value is used by a task selection fnction. We argue that priorities should be allowed to change with time and a linear function of time may not be the best for all tasks. In this paper, we propose to enrich the BDI framework with an extension which consists of 2 processing components, a PCF (Priority Changing Function) Selector and a Priority Controller. With this extension priorities of desires/intentions may have different initial values and may be changed with time according to …", "publication_year": 2008, "citations_by_year": {"year": [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 2, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:5nxA0vEk-isC", "title": "Parallel discrete-event simulation of a supply-chain in semiconductor industry", "authors": ["Yoke-Hean Low", "Boon-Ping Gan", "Sanjay Jain", "Wentong Cai", "Wen-Jing Hsu", "Shell-Ying Huang", "Stephen J Turner"], "description": "This paper describes our work on the study of how parallel discrete-event simulation techniques can be applied in a supply-chain simulation. A supply-chain simulation model consists of multiple virtual factory models. Each virtual factory model executes integrated simulation of the manufacturing and business processes and communications network to allow one to analyze the effects of different system configurations and control policies on actual system performance. Since a supply-chain model will have a large problem size and take a long time to run, it is natural to consider the use of parallel discrete-event simulation techniques (PDES) to reduce its execution time, so that the simulation results can be obtained in a reasonable amount of time. This project uses PDES on real-world manufacturing data-sets. A parallel simulation protocol is developed to exploit the shared memory hardware for conducting supply …", "publication_year": 2000, "citations_by_year": {"year": [2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:8k81kl-MbHgC", "title": "CSL. I. Modelling general N-ary, logical CSPs", "authors": ["JC Tay", "SY Huang", "C Quek"], "description": "Examines and details the motivations and design of a constraint specification language (CSL) for user-defined constraints. Many approaches to constraint programming are based on, as well as extended from, the logic programming paradigm. Some of the better-known constraint logic programming languages and systems are CLP, PROLOG III and CHIP. In these languages, unification in conventional logic programming is replaced by constraint satisfaction. Numerical constraints are usually focused on. The technique of constraint satisfaction is therefore hidden from the user. The motivation for developing CSL is not in adding to the myriad of available constraint programming languages, neither is CSL a complete stand-alone package for solving constraint satisfaction problems (CSPs), though it has a mode that allows it to do so. Its main purpose is simpler: CSL serves to enhance the constraint satisfaction aspect …", "publication_year": 1997, "citations_by_year": {"year": [1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:RYcK_YlVTxYC", "title": "Qualitative synchronous tracking of system behaviours", "authors": ["C Quek", "SY Huang", "JC Tay"], "description": null, "publication_year": 1994, "citations_by_year": {"year": [1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:M3ejUd6NZC8C", "title": "Activity scheduling for a robotic caretaker agent for the elderly", "authors": ["Shell Ying Huang", "Huiliang Zhang"], "description": "A real-time robotic agent that takes care of an elderly person at home will need to schedule various tasks in real time. The deadlines of its tasks are generally soft (missing a deadline by a few minutes in most cases has no serious consequences). Another characteristic is that many tasks are preferably done close to some time points instead of as soon as possible. To support such time management behaviour, we propose to enrich the BDI agent framework with an extension which consists of two processing components, a priority changing function (PCF) selector and a priority controller. The priorities of desires/intentions are represented by their PCFs. A PCF is a function of both time and the utility value of a desire/intention. So it represents both the urgency and the importance (beneficial value) of a desire/intention. We propose a method of constructing PCFs which model the change of priorities of tasks as time …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:HDshCWvjkbEC", "title": "How fast can a BDI agent respond?", "authors": ["Huiliang Zhang", "Chunyan Miao", "Shell Ying Huang", "Zhiqi Shen", "Xudong Luo"], "description": "It is very important to know how fast a BDI agent can react to and process incoming event sequences if we want to apply such autonomous agents into time-sensitive applications like the Close-In weapon system in air-carriers. In, we proposed an analysis method for traditional sequential agents. In this paper we extend the theoretical analysis method to parallel BDI agents. Our method can estimate the average response time using the average attributes of a sequence of events based on probability and queueing theory. The simulation experiments show that our theoretical analysis method is effective. We also show by an experiment that an agent that dynamically allocates its computational time resources perform better than one that does not. Thus, the theoretical method suggests a way to quickly estimate the performance of an agent if the average attributes of the incoming event sequence are known in advance …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:9ZlFYXVOiuMC", "title": "Predicting Responsiveness of BDI Agent", "authors": ["Huiliang Zhang", "Zhiqi Shen", "Shell Ying Huang", "Chunyan Miao"], "description": "A performance mark of a BDI agent is how fast it can react to and process incoming event sequences. To the best of our knowledge, few papers have been published about predicting an agent's average response time for an event sequence before the agent is applied in a real project. In this paper, we first introduce a simulation method. In simulation, a sequence of events with attributes, such as priorities and amounts of time needed to process the events, is input to the agent at designed insertion time. The events are processed by the agent according to the attributes. The statistics of processing time can be recorded. Then we make some theoretical analysis to estimate the average response time when an agent processes a sequence of events based on probability and queueing theory. Comparison experiments show that the results from analysis are quite matching with the results from simulation experiments. The …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:XiSMed-E-HIC", "title": "Yard crane dispatching to minimize vessel turnaround times in container terminals", "authors": ["Shell Ying Huang", "Ya Li", "Xi Guo"], "description": "Yard crane (YC) dispatching in the operational planning of container terminals usually aims to minimize makespan of YC operations or waiting time of vehicles. We propose that minimizing the maximum tardiness of vehicle jobs at yard blocks will minimize the operational delay of the longest quay crane (QC). This will minimize vessel turnaround time which is one of the most important objectives of container terminals. A provably optimal algorithm, MMT-RBA* to minimize maximum job tardiness, is presented to sequence the YC jobs. Jobs requiring reshuffling of other containers, often ignored in other studies, are handled by embedded simulation in our optimization algorithms. Another provably optimal algorithm, MMS-RBA* to minimize makespan, is also presented. Simulation experiments confirm that MMT-RBA* significantly outperforms the optimal algorithm RBA* to minimize vehicle waiting time from earlier …", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:mB3voiENLucC", "title": "Motivation Based Goal Adoption for Autonomous Intelligent Agents", "authors": ["Umair Rafique", "Shell Ying Huang", "Chun Yan Miao"], "description": "An intelligent agent situated in some environment needs to know the preferred states it is expected to achieve so that it can work towards achieving them. The preferred states the agent has selected to achieve at a given time are its \"goals\". One popular approach for deciding which preferred state to adopt as goal at a given time is to assign utility values to these states and then choose the one with the highest utility at a given time. However a preferred state can be useful to a varying degree depending upon the situation the agent is in and hence such static utility cannot represent its usefulness indifferent situations. In this paper we propose an approach of representing utility of preferred states based on the concept of motivations which adjusts their utility according to the situation the agent is in.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:dhFuZR0502QC", "title": "A two stage yard crane workload partitioning and job sequencing algorithm for container terminals", "authors": ["Xi Guo", "Shell Ying Huang"], "description": "We propose a new YC workload partitioning scheme which employs dynamic data driven simulations to conduct what-if experiments in container terminals. Both the optimal partition of the workload in a row of yard blocks and the optimal dispatching sequences for individual YCs are achieved. The practical consideration of the safety constraints is included. A dynamic programming (DP) approach is used to avoid re-computation. An efficient two stage workload partition algorithm (TSWP) is proposed which successfully reduces the number of full what-if simulations while maintaining solution optimality. An effective lower bound (LB) generator with adjustable LB accuracy is designed in supporting the TSWP algorithm. Experimental results show that the TSWP algorithm outperforms the pure DP approach in all tested scenarios and takes less than 1 part per thousand computational time of the DP approach.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:QIV2ME_5wuYC", "title": "Preference generation for autonomous agents", "authors": ["Umair Rafique", "Shell Ying Huang"], "description": "An intelligent agent situated in an environment needs to know the preferred states it is expected to achieve or maintain so that it can work towards achieving or maintaining them. We refer to all these preferred states as “preferences”. The preferences an agent has selected to bring about at a given time are called “goals”. This selection of preferences as goals is generally referred to as “goal generation”. Basic aim behind goal generation is to provide the agent with a way of getting new goals. Although goal generation results in an increase in the agent’s knowledge about its goals, the overall autonomy of the agent does not increase as its goals are derived from its preferences (which are programmed). We argue that to achieve greater autonomy, an agent must be able to generate new preferences. In this paper we discuss how an agent can generate new preferences based on analogy between new objects …", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:NaGl4SEjCO4C", "title": "BDIE architecture for rational agents", "authors": ["H Zhang", "SY Huang"], "description": null, "publication_year": 2005, "citations_by_year": {"year": [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:XiVPGOgt02cC", "title": "a Two-level dynamic programming algorithm for quay crane scheduling in container terminals", "authors": ["SY Huang", "Y Li", "WJ Hsu"], "description": "One of the optimization problems in terminal operations is the quay crane scheduling problem. The quay crane scheduling algorithm plays a critical role because it directly affects the duration of the vessel loading and unloading process, which means vessel turnaround time. We propose a two-level dynamic programming (DP) algorithm which keeps the simplicity of the bay-based approach but overcomes most of its shortcomings. We also propose a method to estimate the lower bound to quay crane scheduling given the lists of unloading and loading containers and the number of quay cranes assigned to the vessel. Our experiments with real vessel unloading and loading lists for 113 vessels show that the performance is close to the lower bound.", "publication_year": 2017, "citations_by_year": {"year": [2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:8AbLer7MMksC", "title": "A Cooperative Approach to Dispatching and Scheduling Twin-Yard Cranes in Container Terminals", "authors": ["Shell Ying Huang", "Ya Li"], "description": "To increase the productivity of the storage yard of a container terminal, two identical yard cranes are often deployed in a yard block. In theory, the productivity of a yard block may be doubled with twin-cranes. However, crane interference may severely lower the combined productivity of the twin-cranes. In this paper, we propose an online job dispatching method for twin yard cranes when side loading is used. The method adopts the non-zero-sum game approach to induce the cooperative behaviour in the dispatching and scheduling of jobs for the two cranes to minimize the total job completion time. A one-step lookahead algorithm and a two-step lookahead algorithm are proposed. We evaluate our algorithms against Ng’s lower bound of total completion time for twin-cranes and against the greedy heuristic Smallest Completion Time-First. Our experiments showed that our dispatching and scheduling …", "publication_year": 2016, "citations_by_year": {"year": [2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:4fKUyHm3Qg0C", "title": "Yard crane dispatching to minimize total weighted vessel turnaround times in container terminals", "authors": ["Shell Ying Huang", "Ya Li"], "description": "In traditional approaches, the objective of yard crane (YC) dispatching is usually to minimize makespan of YC operations or to minimize vehicle waiting time. However, one of the most important objectives of terminal operation management is to minimize total weighted vessel turnaround time. We prove that minimizing the maximum tardiness of vehicle jobs from one vessel will minimize the vessel’s turnaround time. Therefore minimizing the total weighted maximum tardiness of all YCs’ jobs will minimize the total weighted vessel turnaround time. We propose algorithm MTWMT to minimize total weighted maximum job tardiness. We compare the performance of our algorithm with the optimal algorithms RBA* and MMS-RBA* from earlier studies. RBA* minimizes total vehicle waiting time while MMS-RBA* minimizes makespan. Experimental results confirm that MTWMT is most effective in reducing total …", "publication_year": 2015, "citations_by_year": {"year": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:vRqMK49ujn8C", "title": "Reducing Simulation Costs in ATCRSS Algorithm for Job Scheduling Problems", "authors": ["Shell Ying Huang", "Ya Li"], "description": "Reducing computational costs in simulation-based optimization procedures is often achieved by allocating the computing budget intelligently. For the job scheduling problem on a single machine by the ATCRSS dispatching rule, many job sequences are repeatedly examined by the simulation module therefore wasting a lot of computational time. This is because many job sequences are not unique. We propose to use a TRIE dictionary to memorize the simulation results of the job sequences so that each unique sequence is simulated once only. We tested job sets of 4, 8, 12, 16, 20 and 24 jobs each containing 243x30 problems. Significant computational costs are saved in these tested problems.", "publication_year": 2014, "citations_by_year": {"year": [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:aqlVkmm33-oC", "title": "Deciding on planning windows by partitioning time for yard crane management in container terminals.", "authors": ["Xi Guo", "Shell Ying Huang"], "description": "This paper proposes a new dynamic Yard Crane (YC) workload partition scheme in container terminals. The main contribution is the time partitioning algorithm which finds a sequence of time windows to match closely the changing workload distribution and get the maximum benefit of the space partition algorithm. Experimental results show that the proposed time partition algorithm plays the most important role in making substantial improvements over basic partition scheme in all tested workload scenarios.", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:L8Ckcad2t8MC", "title": "A three-level hierarchical workload management scheme for yard cranes in container terminals", "authors": ["Shell Ying Huang", "Xi Guo", "Mei Mei Lau"], "description": "We propose a three-level, hierarchical scheme for yard crane (YC) workload management in container terminals. Level 1 distributes YCs among different rows in the storage yard at suitable times based on predicted future workload. This is done a few times during a shift of 8 hours. Level 2 dispatches YCs to work in various non-overlapping working zones in each row for the time window in between two rounds of YC re-distributions at Level 1. Level 3 determines the serving sequences of vehicle jobs for an YC in a working zone over a period of time (e.g., a sub-planning window). The algorithms for levels 2 and 3 have been published elsewhere. This paper proposes the proportional distribution and the uniform distribution strategies for YC deployment at level 1. We compare the performance of the three-level hierarchical scheme in terms of average job waiting times and the average number of overflow jobs …", "publication_year": 2011, "citations_by_year": {"year": [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:hFOr9nPyWt4C", "title": "A vessel navigational behavior model for assessing waterway capacity.", "authors": ["Hui Fang", "Shell Ying Huang", "Wen Jing Hsu", "Tiancheng Song"], "description": "We have designed and built a detailed simulation system for modelling vessel navigation and                                                                traffic flows in a network of waterways. The simulation system includes the following models: the                                                                navigational network model, the traffic flow model, the vessel movement model and the vessel                                                                navigational behaviour model. In this paper we will focus on the vessel navigational behaviour model.                                                                We are able to simulate realistic navigational behaviours which depend on the type of the vessels, on                                                                the physical location and on the traffic situation. The model is calibrated and validated by three sets                                                                of real historical radar data collected from three different time periods. Using this model, we are able                                                                to analyze the traffic flows under various identified scenarios and conduct traffic capacity studies of                                                                the Singapore waterways.", "publication_year": 2010, "citations_by_year": {"year": [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:_kc_bZDykSQC", "title": "A New Action Description Scheme for Informal Reasoning.", "authors": ["Umair Rafique", "Shell-Ying Huang"], "description": "Reasoning about Actions has an important place in the development of Intelligent Agents. While reasoning about Actions, Action Representation plays an important role. General practice is to use Preconditions and Posteffects for defining an Action. We believe that for an agent that assists humans in making decisions for daily life in a Smart Home environment, Preconditions are not adequate to represent the complexity due to the huge number of different situations resulting from various factors affecting a decision. We propose an extension to this basic idea by introducing the concept of Hindering and Supporting factors for Actions and argue that this can describe many Informal Reasoning situations more succinctly than traditional Action description schemes. We present the reasoning algorithm based on this new Action Description and show with examples how this new scheme helps in reaching more appropriate decisions in a Smart Home environment and hence improving the quality of living for its inhabitants.", "publication_year": 2009, "citations_by_year": {"year": [2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:mVmsd5A6BfQC", "title": "SMART: Structured memory for abstract reasoning and thinking", "authors": ["Umair Rafique", "Shell Ying Huang"], "description": "An important skill considered part of intelligent behavior is Abstract Thinking and Decision Making which includes thinking about a problem and reaching a decision after reasoning about its different aspects. This aspect of intelligent behavior has not recieved much attention and most of the cognitive architectures present today either focus more on the perceptual-motoric aspects of human brain or delve into the psycological, common behavioral and common sense issues. Here we present a cognitive architecture which addresses the issue of Abstract Thinking and Decision Making by using a novel representation for knowledge in the memory of an agent. The memory of an agent consists of four components, Concept Net, Working Memory, Perceptions and Possessions. Concept Net is a multi-layered net representing various concepts and their relationships with one another. We contend that this way of …", "publication_year": 2007, "citations_by_year": {"year": [2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, "unknown"], "num_citations": [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:tS2w5q8j5-wC", "title": "Improving Computational Performance of Simulation-based Heuristic Algorithms for Job Sequencing", "authors": ["Shell Ying Huang", "Ya Li"], "description": "In many simulation-based optimization algorithms, substantial amount of time is often required in the simulation experiments to evaluate the solutions to the problem. In some heuristic or metaheuristic algorithms a significant number of revisits to the same solutions are made when the search converges. We use the ATCRSS heuristic for job sequencing problems as an example to investigate two ways of implementing a dictionary to memorize the simulation results. The objective is to eliminate repeated simulations to improve the computational performance of the algorithm. Our experiments show that the saving in computational time is comparable between hash table and TRIE. For sequencing 10 to 60 jobs the saving is between 20% and 30%. In addition, hash table is more efficient in memory usage than TRIE in our tested cases. We also suggest that hash table is a more general way of implementing the dictionary …", "publication_year": 2015, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:eMMeJKvmdy0C", "title": "Towards Automation of Stowage Planning for Large Containerships", "authors": ["Win Cho Aye", "Hsu Wen Jing", "Huang Shell Ying", "Sun Hongyang", "Zhou Nina", "Quan Ying"], "description": "{\" _buckets\":{\" deposit\":\" 5700ed58-3f2d-4cf0-bc72-4ded90c6c529\"},\" _deposit\":{\" id\":\" 4708\",\" owners\":[],\" pid\":{\" revision_id\": 0,\" type\":\" recid\",\" value\":\" 4708\"},\" status\":\" published\"},\" _oai\":{\" id\":\" oai: meral. edu. mm: recid/4708\",\" sets\":[\" user-ucsy\"]},\" communities\":[\" ucsy\"],\" item_1583103067471\":{\" attribute_name\":\" Title\",\" attribute_value_mlt\":[{\" subitem_1551255647225\":\" Towards Automation of Stowage Planning for Large Containerships\",\" subitem_1551255648112\":\" en\"}]},\" item_1583103085720\":{\" attribute_name\":\" Description\",\" attribute_value_mlt\":[{\" interim\":\" Stowage planning is a process of allocatingcontainers onboard the ship taking into consideration ofsea-worthy conditions. Moreover, the different ports ofdischarge, sizes, types, and weight of containers mustalso be considered in order to minimize handling costand prevent hazards. Manual stowage planningrequires detailed checking as well as …", "publication_year": 2012, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:1yQoGdGgb4wC", "title": "Assessing capacity and improving utilization of", "authors": ["Shell Ying Huang", "Wen Jing Hsu", "Yuxiong He"], "description": "Anchorages are important resources for certain hub ports, and they are increasingly in demand during peak periods. We evaluate the capacity of multiple anchorages by reproducing realistic mix of arriving vessels, dwelling time and the current practices in choosing anchoring spots within an anchorage. The model is validated by using historical data. We also propose methods for improving space utilization of anchorages. Our experiments with four real anchorages show that the space utilization is improved by 6 to 10% with MHDF and WALLPACK_MHDF algorithms. This finding opens up possibilities of designating vessel anchoring spots for improved utilizations in the future.", "publication_year": 2011, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:HE397vMXCloC", "title": "Yard crane dispatching based on real time data driven simulation for container terminals (Main article)", "authors": ["Xi Guo", "Shell Ying Huang", "Wen Jing Hsu", "Malcolm Yoke Hean Low", "X Guo", "SY Huang", "WJ Hsu", "MYH Low"], "description": "This paper studies the problem of real time yard crane dispatching in container terminals. Many technologies, including transponders, RFID and GPS have been used in the container terminal setting for real-time tracking of terminal equipment. A judicious integration of real-time data into the yard crane management system will allow better utilization of terminal resources to improve overall terminal productivity. We propose a yard crane dispatching algorithm based on real time data driven simulation to solve the problem of yard crane job sequencing to minimize average vehicle waiting time. The algorithm will produce optimal operation sequence for each planning window. Several policies to select jobs to form the planning window are also proposed. Our simulation results show that dispatching yard crane based on real time data driven simulation is of great value in improving yard crane performance in 3 scenarios …", "publication_year": 2008, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:hkOj_22Ku90C", "title": "Efficient transport system for containers in ports", "authors": ["Shell Ying Huang", "Wen Jing Hsu"], "description": "This report documents the work done in the project ?Efficient Transport Systems for Container Port?. The research was carried out in two areas: (1) study of optimization models of a number of processes in the container handling operation in ports; (ii) Development of a simulation model to study new configurations, operating policies that will increase port efficiency significantly in order to be able to handle the demands of mega container vessels. We have presented interesting techniques to handle the optimization models. We have proposed many constructive ideas, extensible design methods and interesting modeling techniques that can make simulation more realistic, flexible and efficient. The simulation nwdel built has been found useful by industrial practitioners. Jurong Port and NOL both are using the adapted versions of the simulation model to investigate on the terminal capacities and ways to improve terminal efficiency.", "publication_year": 2004, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:PR6Y55bgFSsC", "title": "THE DEVELOPMENT OF CONSERVATIVE SUPERSTEP PROTOCOLS FOR SHARED MEMORY MULTIPROCESSOR SYSTEMS", "authors": ["BOON-PING GANt", "YOKE-HEAN LOWt", "WENTONG CAT", "STEPHEN J TURNER", "SANJAY JAIN", "WEN JING HSU", "SHELL YING HUANG"], "description": "This paper summarizes our work involving the successive refinements of a conservative superstep protocol. The refined protocols are known as the SST, SLS, and FET protocols. Each of the refinements improves the safetime bound, which in turn reduces the number of supersteps. In general, this helps to reduce the synchronization overhead and thus the execution time. However, a change in the number of supersteps can also introduce load imbalances within supersteps into the simulation. This observation becomes apparent with the FET protocol in particular. The performance of the refined protocols is compared through several semiconductor supply-chain simulation models. The results from the experiments strongly indicate the feasibility of using parallel discrete-event simulation techniques in the simulation of large scale systems such as a supply-chain.1. Introduction. Parallel discrete-event simulation (PDES) has been a well-researched area for many years. An important area in PDES has been the design and development of new synchronization protocols. In PDES, a simulation is decomposed into logical processes (LPs) that can be simulated in parallel. PDES synchronization protocols are used to ensure that parallel execution of these LPs does not violate the causality constraint, ie events are strictly processed in timestamp order. PDES synchronization protocols can be broadly classified into two categories, conservative and optimistic. Conservative protocols [7, 4] strictly enforce the causality constraint by allowing the simulation to progress up to a safetime. A safetime is a time guarantee that no events with a lower timestamp will be …", "publication_year": 2002, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:yD5IFk8b50cC", "title": "A Guide to Research in Assumption-Based Truth Maintenance Systems in Constraint Satisfaction", "authors": ["J Tay", "C Quek", "S Huang"], "description": "Publisher SummaryThe reason maintenance problem-solving architecture presents a new paradigm for organizing data and control. This architecture provides an improvement over traditional pattern-directed inference systems in the five areas of artificial intelligence (AI) program design. These areas are efficiency, coherency, flexibility, additivity, and extendibility. Research in reason maintenance has directed its attention toward improving reason maintenance algorithms, inference engine control strategies, and the overall reason maintenance system (RMS)-based system architecture, to ensure that these characteristics are not inadvertently lost. The causal effect of work and objectives in these three areas has become isolated from the real performance issues of the problem solver. This chapter proposes a classification framework to direct and link the three RMS research areas to the contribution of overall …", "publication_year": 2002, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:u_35RYKgDlwC", "title": "CSL. II. A compiler for the LCSP", "authors": ["JC Tay", "SY Huang", "C Quek"], "description": "Part I (see ibid., pp. 414-421) provided a rigorous definition of the CSL (constraint specification language) algebra as a language to model the general n-ary logical constraint satisfaction problem (LCSP). In this paper, the majority of our discussions focus on design and implementational issues that arose while building software for compiling the language into executable data structures. The primary objective of the CSL compiler is to efficiently compile a CSL program (for a user-defined LCSP) into a form that can be solved by binary constraint satisfaction problem (CSP) algorithms.", "publication_year": 1997, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:tkaPQYYpVKoC", "title": "SPECIAL SECTION ON SUPPLY CHAIN SYSTEMS", "authors": ["SH Chung", "FTS Chan", "WH Ip", "MYH Low", "M Zeng", "WJ Hsu", "SY Huang", "F Liu", "CA Win", "C Trummer", "C Ruggenthaler", "CM Kirchsteiger", "C Steger", "R Weiß", "M Pistauer", "D Dalton"], "description": "Presents the table of contents for this issue of the periodical.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:Y5dfb0dijaUC", "title": "REAL-TIME SCHEDULING FOR TWIN YARD CRANES IN CONTAINER TERMINALS", "authors": ["SY Huang", "Y Li", "NKX Tay"], "description": "To increase the productivity of the storage yard of a container terminal, two identical yard cranes are often deployed in a yard block. These two cranes cannot cross each other and have to maintain safety distance at all times. Thus they may block each other in their storage and retrieval operations. This will severely lower their combined productivity unless careful planning of the crane operations is done. In this paper, we propose a real-time yard crane scheduling method for twin yard cranes when end-loading block layout is used. The method is executed every time a crane is about to complete its current operation. It selects its next job from a rolling planning window and schedules its operation time. The method adopts the non-zero-sum game approach to induce the cooperative behaviour of the two cranes. Two algorithms, the two-step lookahead algorithm and the three-step lookahead algorithm are presented. The objective is to minimize the average makespan of the two yard cranes. Our experiments to evaluate the algorithm performance showed that the both algorithms are effective and efficient. The three-step lookahead is more complex but produces better results.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:WA5NYHcadZ8C", "title": "A Randomized Heuristic Algorithm for Cyclic Routing of UAVs", "authors": ["Cheng Siang Lim", "Shell Ying Huang"], "description": "Unmanned Aerial Vehicles (UAVs) have been increasingly used in military and civilian applications. Even though the UAV routing problems have similarities with Vehicle Routing Problems, there are still many problems where effective and efficient solutions are lacking. We propose a randomized heuristic algorithm for the cyclic routing of a single UAV. The UAV is required to visit a set of target areas where the time interval between consecutive visits to each area cannot exceed its relative deadline. The PSPACE-complete problem has a solution whose length may be exponential. Our algorithm tries to compute a feasible cyclic route while trying to keep short the cycle time. Our tests of 57 instances of the problem show that the algorithm has good effectiveness and efficiency.", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}}, {"link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=zWYCmiAAAAAJ&cstart=20&pagesize=80&citation_for_view=zWYCmiAAAAAJ:bEWYMUwI8FkC", "title": "Dynamic Utility of Preferences and Goal Adoption in Autonomous Intelligent Agents", "authors": ["Umair Rafique", "Shell Ying Huang"], "description": "An autonomous intelligent agent situated in an environment needs to know the preferred states of its environment it wants to achieve so that it can work towards achieving them. We refer to these preferred states as “preferences” of the agent. The preferences an agent selects to achieve at a given time are called its “goals” while this selection process is called “goal adoption”. In essence goal adoption for an autonomous intelligent agent is about determining 1) which preference to adopt as a goal at a given time and 2) when to adopt a goal. The popular approach to goal adoption is to assign static utility values to preferences and then adopt the one with the highest utility as goal at a given time. However there are two problems with this approach. Firstly a preference can be useful to a varying degree depending upon the situation the agent is in. For example the preference to play your favorite game will be more attractive if you have not done so for a while compared to when you have just played it. Static utility value of a preference cannot represent its usefulness in such different situations. Secondly such an approach does not specify “when” an agent should adopt a goal. In this paper we propose an approach to goal adoption where we model preferences of an agent as the means to satisfy its motivations where a motivation represents the internal state of the agent with respect to a certain feeling. The satisfaction level of motivations of an agent is affected by changes in its situation and by its own activities. The collective state of an agent’s motivations at a given time determines how satisfied the agent is at that time. We represent the utility of a …", "publication_year": null, "citations_by_year": {"year": [], "num_citations": []}}]