{"full_name": "Li Boyang", "designation": "Nanyang Associate Professor (NRF), School of Computer Science and Engineering", "name_card": "Assoc Prof Li Boyang", "email": "boyang.li@ntu.edu.sg", "keywords": ["Computer Science and Engineering"], "biography": "Dr. Li Boyang, Albert is a Nanyang Associate Professor at the School of Computer Science and Engineering, Nanyang Technological University. Before joining SCSE, he held a visiting position at the Alibaba-NTU Singapore Joint Research Institute. Prior to that, he was a Senior Research Scientist at Baidu Research USA from 2018 to 2019, and a Research Scientist and Group Leader at Disney Research Pittsburgh from 2015 to 2017. He received his Ph.D. degree in Computer Science from Georgia Institute of Technology in 2014, and his B.Eng. degree from Nanyang Technological University in 2008. He published more than 45 peer-reviewed papers in top-tier journals and conferences, and holds two US patents. His research work has been covered by influential technology media outlets such as Engadget, TechCrunch, New Scientist, and National Public Radio.", "interests": "My research interests lie in Computational Narrative Intelligence, Multimodal Learning, and Machine Learning. Narrative Intelligence is a central cognitive ability and a hallmark of human intelligence. I believe that in order to simulate human intelligence, artificial intelligence must first acquire human-level knowledge from an approximation of the human experience, which is inherently multimodal. Further, inspired by the observation that human intelligence emerges from the interaction of multiple cognitive processes, I am interested in understanding the interactions between different neural network components and developing techniques that coordinate the learning of different neural network components beyond simplistic stochastic gradient descent.", "grants": "Computational Narrative IntelligenceConstructing Event-level Narrative Intelligence from the Ground UpTechnical challenges, linguistic obstacles, and cultural barriers in bringing knowledge societies into the metaverse. With a metaverse showcase of how the peoples of Afro-Eurasia saw each other transitioning into modernity", "articles": ["Xu, B., Fu, Y., Jiang, Y. G., Li, B., & Sigal, L. (2016). Heterogeneous knowledge transfer in video emotion recognition, attribution and summarization. IEEE Transactions on Affective Computing, 9(2), 255-270.", "Cai, Y., Miao, C., Tan, A. H., Shen, Z., & Li, B. (2009). Creating an immersive game world with evolutionary fuzzy cognitive maps. IEEE Computer Graphics and Applications, 30(2), 58-70.", "Tu, G., Fu, Y., Li, B., Gao, J., Jiang, Y. G., & Xue, X. (2019). A multi-task neural approach for emotion attribution, classification, and summarization. IEEE Transactions on Multimedia, 22(1), 148-159.", "Noack, A., Ahern, I., Dou, D., & Li, B. (2021). An empirical study on the relation between network interpretability and adversarial robustness. SN Computer Science, 2(1), 32.", "Annalyn, N., Bos, M. W., Sigal, L., & Li, B. (2018). Predicting personality from book preferences with user-generated content labels. IEEE Transactions on Affective Computing, 11(3), 482-492.", "Liu, Y., Lan, Y., Li, B., Miao, C., & Tian, Z. (2021). Proof of Learning (PoLe): empowering neural network training with consensus building on blockchains. Computer Networks, 201, 108594.", "Feng, S., Li, B., Yu, H., Liu, Y., & Yang, Q. (2022). Semi-Supervised Federated Heterogeneous Transfer Learning. Knowledge-Based Systems, 252, 109384.", "Guo, X., Yu, H., Li, B., Wang, H., Xing, P., Feng, S., ... & Miao, C. (2022). Federated Learning for Personalized Humor Recognition. ACM Transactions on Intelligent Systems and Technology (TIST), 13(4), 68.", "Click  here for more publications.", "Adam Noack, Isaac Ahern, Dejing Dou, and Boyang Li. An Empirical Study on the Relation between Network Interpretability and Adversarial Robustness. Springer Nature Computer Science. 2020.", "Ng Annalyn, Maarten Bos, Leonid Sigal, Boyang Li. Predicting Personality from Book Preferences with User-Generated Content Labels. IEEE Transaction on Affective Computing. 2018.", "Boyang Li. Humor: A Dynamic and Dual-Process Theory with Computational Considerations. Advances in Cognitive Systems. 2016.", "Boyang Li, Stephen Lee-Urban, D. Scott Appling and Mark O. Riedl. Crowdsourcing Narrative Intelligence. Advances in Cognitive Systems. 2012."], "books": [], "book_chapters": [], "conferences": ["Yinan Zhang, Boyang Li, Yong Liu, Hao Wang, Chunyan Miao. Initialization Matters: Regularizing Manifold-informed Initialization for Neural Recommendation Systems. ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). 2021.", "Yuanyuan Chen, Boyang Li, Han Yu, Pengcheng Wu, and Chunyan Miao. HyDRA: Hypergradient Data Relevance Analysis for Interpreting Deep Neural Networks. The AAAI Conference on Artificial Intelligence (AAAI). 2021.", "Hannah Kim, Denys Katerenchuk, Daniel Billet, Jun Huan, Haesun Park, and Boyang Li. Understanding Actors and Evaluating Personae with Gaussian Embeddings. The AAAI Conference on Artificial Intelligence (AAAI). 2019.", "Pelin Dogan, Boyang Li, Leonid Sigal, Markus Gross. A Neural Multi-sequence Alignment TeCHnique (NeuMATCH). The Conference on Computer Vision and Pattern Recognition (CVPR). 2018.", "Sasha Azad, Jingyang Xu, Haining Yu and Boyang Li. Scheduling Live Interactive Narratives with Mixed-Integer Linear Programming. The 13th AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment (AIIDE). Snowbird, Utah. 2017.", "Tong Wang, Ping Chen, and Boyang Li. Predicting the Quality of Short Narratives from Social Media. The 26th International Joint Conference on Artificial Intelligence (IJCAI). Melbourne, Australia. 2017.", "Rogelio Cardona-Rivera and Boyang Li. PlotShot: Generating Discourse-constrained Stories around Photos. The 12th AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment. Burlingame, CA. 2016.", "Yi Luan, Yangfeng Ji, Hannaneh Hajishirzi, and Boyang Li. Multiplicative Representations for Unsupervised Semantic Role Induction. The 54th Annual Meeting of the Association for Computational Linguistics. Berlin, Germany. 2016.", "Boyang Li, Stephen Lee-Urban, George Johnston and Mark O. Riedl. Story Generation with Crowdsourced Plot Graphs. The 27th AAAI Conferece on Artificial Intelligence. Bellevue, Washington. 2013.", "Boyang Li, Alexander Zook, Nicholas Davis, and Mark O. Riedl. Goal-Driven Conceptual Blending: A Computational Approach for Creativity. The 3rd International Conference on Computational Creativity. Dublin, Ireland. 2012."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=QwL4z2UAAAAJ&hl=en", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55837513500"}, "google_scholar": "https://scholar.google.com/citations?user=QwL4z2UAAAAJ&hl=en", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55837513500", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01289", "other_websites": ["http://www.boyangli.org"]}