{"full_name": "Bo An", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Bo An", "email": "boan@ntu.edu.sg", "keywords": ["Computational Intelligence", "Information Sciences and Systems", "Robotics and Intelligent Systems", "Smart Cities", "Artificial and Augmented Intelligence", "Economics", "Smart Cities"], "biography": "Bo An is a Professor in Computer Science and Engineering, and Co-Director of Artificial Intelligence Research Institute (AI.R) at Nanyang Technological University, Singapore. He received the Ph.D degree in Computer Science from the University of Massachusetts, Amherst. His current research interests include artificial intelligence, multiagent systems, computational game theory, reinforcement learning, and optimization. His research results have been successfully applied to many domains including infrastructure security and e-commerce. He has published over 100 referred papers at AAMAS, IJCAI, AAAI, ICAPS, KDD, UAI, EC, WWW, ICLR, NeurIPS, ICML, JAAMAS, AIJ and ACM/IEEE Transactions. Dr. An was the recipient of the 2010 IFAAMAS Victor Lesser Distinguished Dissertation Award, an Operational Excellence Award from the Commander, First Coast Guard District of the United States, the 2012 INFORMS Daniel H. Wagner Prize for Excellence in Operations Research Practice, and 2018 Nanyang Research Award (Young Investigator). His publications won the Best Innovative Application Paper Award at AAMAS’12, the Innovative Application Award at IAAI’16, and the best paper award at DAI’20. He was invited to give Early Career Spotlight talk at IJCAI’17. He led the team HogRider which won the 2017 Microsoft Collaborative AI Challenge. He was named to IEEE Intelligent Systems' \"AI's 10 to Watch\" list for 2018. He is PC Co-Chair of AAMAS’20 and will be General Co-Chair of AAMAS’23. He is a member of the editorial board of JAIR and is the Associate Editor of AIJ, JAAMAS, IEEE Intelligent Systems, ACM TAAS, and ACM TIST. He was elected to the board of directors of IFAAMAS, senior member of AAAI, and Distinguished member of ACM. You can find more information at https://personal.ntu.edu.sg/boan", "interests": "Artificial intelligence, multiagent systems, computational game theory, reinforcement learning,  and optimization", "grants": "2019 President's Council Chair in Computer Science and EngineeringAdaptive Bus Network Scheduled by Deep Reinforcement LearningAI for Social Good Faculty Award towards collaborative project with ATREEAnti-Spam Impression Allocation And Ranking Policy Robustness EvaluationArtificial Intelligence Research Institute (AI.R), NTUBoosting Workforce Wellbeing via Finance and AL-powered Sequential InterventionCyber Research Programme Office (CRPO)Improving Transferability and Interpretability for Domain GeneralizationMATAI: AN AI-POWERED GENERALIST MATERIAL DISCOVERY PLATFORMMeasuring and Pricing Climate Risk in Financial Markets\tOnline Resource Allocation with Limited Offline Data for Generalized Assignment ProblemsTradeMaster: Reinforcement Learning-based Quantitative Trading ToolkitTradeMaster: Reinforcement Learning-based Quantitative Trading Toolkit (SMU)TRUSTWORTHY AI CENTRE NTU (TAICeN)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NTU)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NUS)TRUSTWORTHY AI CENTRE NTU (TAICeN) (SMU)Understand AI’s Future Directions", "articles": ["Xiong, Y., Gan, J., An, B., Miao, C., & Bazzan, A. L. (2018). Optimal electric vehicle fast charging station placement based on game theoretical framework. IEEE Transactions on Intelligent Transportation Systems, 19(8), 2493-2504.", "An, B., Lesser, V., & Sim, K. M. (2011). Strategic agents for multi-resource negotiation. Autonomous Agents and Multi-Agent Systems, 23(1), 114-153.", "Hu, Y., Gao, Y., & An, B. (2014). Multiagent reinforcement learning with unshared value functions. IEEE Transactions on Cybernetics, 45(4), 647-662.", "An, B., Sim, K. M., Tang, L. G., Li, S. Q., & Cheng, D. J. (2006). Continuous-time negotiation mechanism for software agents. IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics), 36(6), 1261-1272.", "Wang, W., Jiang, J., An, B., Jiang, Y., & Chen, B. (2016). Toward efficient team formation for crowdsourcing in noncooperative social networks. IEEE Transactions on Cybernetics, 47(12), 4208-4222.", "An, B., Ordóñez, F., Tambe, M., Shieh, E., Yang, R., Baldwin, C., ... & Meyer, G. (2013). A deployed quantal response-based patrol planning system for the US Coast Guard. Interfaces, 43(5), 400-420.", "Hu, Y., Gao, Y., & An, B. (2014). Accelerating multiagent reinforcement learning by equilibrium transfer. IEEE Transactions on Cybernetics, 45(7), 1289-1302.", "Fang, F., Nguyen, T. H., Pickles, R., Lam, W. Y., Clements, G. R., An, B., ... & Lemieux, A. (2017). PAWS—A deployed game-theoretic application to combat poaching. AI Magazine, 38(1), 23-36.", "Yu, H., Shen, Z., Miao, C., An, B., & Leung, C. (2014). Filtering trust opinions through reinforcement learning. Decision Support Systems, 66, 102-113.", "An, B., Shieh, E., Tambe, M., Yang, R., Baldwin, C., DiRenzo, J., ... & Meyer, G. (2012). PROTECT--A Deployed Game Theoretic System for Strategic Security Allocation for the United States Coast Guard. AI Magazine, 33(4), 96-110.", "Click  here for more publications.", "Feng, L., Huang, J., Shu, S., & An, B. (2020). Regularized matrix factorization for multilabel learning with missing labels. IEEE Transactions on Cybernetics, 52(5), 3710-3721.", "Aung, A. P. P., Jayavelu, S., Li, X., & An, B. (2022). Planning sequential interventions to tackle depression in large uncertain social networks using deep reinforcement learning. Neurocomputing, 481, 182-192.", "An, B., Sun, S., & Wang, R. (2022). Deep Reinforcement Learning for Quantitative Trading: Challenges and Opportunities. IEEE Intelligent Systems, 37(2), 23-26.", "Wei, H., Xie, R., Feng, L., Han, B., & An, B. (2022). Deep Learning From Multiple Noisy Annotators as A Union. IEEE Transactions on Neural Networks and Learning Systems.", "Deng, Y., & An, B. (2021). Utility distribution matters: enabling fast belief propagation for multi-agent optimization with dense local utility function. Autonomous Agents and Multi-Agent Systems, 35(2), 1-40.", "JC.Jiang, B. An, YC. Jiang, P. Shi, Z. Bu, J. Cao. (2019). Batch Allocation for Tasks with Overlapping Skill Requirements in Crowdsourcing. IEEE Transactions on Parallel and Distributed Systems, 30(8), 1722-1737.", "JC. Jiang, B. An, YC. Jiang, DH. Lin. (2019). Context-aware Reliable Crowdsourcing in Social Networks. IEEE Transactions on Systems, Man, and Cybernetics: Systems, 50(2), 617-632.", "JC. Jiang, B. An, YC. Jiang, DH. Lin, Z. Bu, J. Cao, Z. Hao. (2018). Understanding Crowdsourcing Systems from a Multiagent Perspective and Approach. ACM Transactions on Autonomous and Adaptive Systems, 13(2), Article 8."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"scopus": "https://www.scopus.com/authid/detail.uri?authorId=8901577100"}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=PEEpuNwAAAAJ", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8901577100", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00698", "other_websites": ["https://personal.ntu.edu.sg/boan/"]}