{"full_name": "Wei Ying", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Wei Ying", "email": "ying.wei@ntu.edu.sg", "keywords": ["Computational Intelligence", "Biomedical Informatics and Data Science"], "biography": "Ying Wei is an Assistant Professor at the School of Computer Science and Engineering, Nanyang Technological University since Sep 2023. Prior to that, she was an Assistant Professor at the Department of Computer Science, City University of Hong Kong and a Senior Researcher at the Machine Learning Center of Tencent AI Lab from November 2017 to January 2021. She works on machine learning, and is especially interested in solving challenges in knowledge transfer by pushing the boundaries of both theories and applications. She received her Ph.D. degree from Hong Kong University of Science and Technology in 2017 with the support of Hong Kong PhD Fellowship. Before this, she completed her Bachelor degree from Huazhong University of Science and Technology in 2012, with first class honor. Her work was nominated for the best paper candidates at KDD’14. She has co-organized the first First Workshop on Pre-training: Perspectives, Pitfalls, and Paths Forward at ICML 2022, and been invited as a senior PC member for AAAI, to give invited talks at NeurIPS MetaLearn 2021 and FTL-IJCAI 2021 workshops, and as a PC member for many other top-tier conferences, such as ICML, NeurIPS, ICLR, and etc.", "interests": "Machine learning, Transfer learning, Continual learning, Meta-learning, Drug discovery", "grants": "Towards Reliable Meta-learning in the Wild: a Task Distribution-aware Framework with Energy-based Models", "articles": ["Yifan Zhang, Ying Wei, Qingyao Wu, Peilin Zhao, Shuaicheng Niu, Mingkui Tan, Junzhou Huang. “Collaborative Unsupervised Domain Adaptation for Medical Image Diagnosis”, IEEE Transactions on Image Processing, 29, 2020."], "books": [], "book_chapters": [], "conferences": ["Yichen Wu, Long-Kai Huang, Ying Wei*. “Adversarial Task Up-sampling for Meta-learning”, Thirty-sixth Annual Conference on Neural Information Processing Systems (NeurIPS), 2022.", "Yinjie Jiang, Zhengyu Chen, Luotian Yuan, Kun Kuang, Xinhai Ye, Zhihua Wang, Fei Wu*, Ying Wei*. “The Role of Deconfounding in Meta-learning”, Thirty-ninth International Conference on Machine Learning (ICML), 2022.", "Long-Kai Huang, Junzhou Huang, Qiang Yang, Ying Wei*. “Frustratingly Easy Transferability Estimation”, Thirty-ninth International Conference on Machine Learning (ICML), 2022.", "Huaxiu Yao, Ying Wei*, Long-Kai Huang, Ding Xue, Junzhou Huang, Zhenhui Li. “Functionally Regionalized Knowledge Transfer for Low-resource Drug Discovery”, Thirty-fifth Annual Conference on Neural Information Processing Systems (NeurIPS), 2021.", "Huaxiu Yao, Long-Kai Huang, Linjun Zhang, Ying Wei*, Li Tian, James Zou, Junzhou Huang, Zhenhui Li. “Improving Generalization in Meta-learning via Task Augmentation”, Thirty-eighth International Conference on Machine Learning (ICML), 2021.", "Ying Wei, Peilin Zhao, Junzhou Huang. “Meta-learning Hyperparameter Performance Prediction with Neural Processes”, Thirty-eighth International Conference on Machine Learning (ICML), 2021.", "Huaxiu Yao, Ying Wei*, Junzhou Huang, Zhenhui (Jessie) Li. “Hierarchically Structured Meta-learning”, Thirty-sixth International Conference on Machine Learning (ICML), 2019.", "Ying Wei, Yu Zhang, Junzhou Huang, Qiang Yang. “Transfer Learning via Learning to Transfer”, Thirty-fifth International Conference on Machine Learning (ICML), 2018."], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=5UpFdKsAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02297", "other_websites": ["https://wei-ying.net/"]}