{"full_name": "Tang Xueyan", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Tang Xueyan", "email": "asxytang@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Parallel and Distributed Computing"], "biography": "Dr. Tang is currently an associate professor in the School of Computer Engineering at Nanyang Technological University, Singapore. He received his B.Eng. degree in computer science and engineering from Shanghai Jiao Tong University in 1998, and his Ph.D. degree in computer science from the Hong Kong University of Science and Technology in 2003. His research interests include distributed systems, mobile and pervasive computing, and wireless sensor networks.", "interests": "Distributed systems, mobile and pervasive computing, wireless sensor networks.", "grants": "Algorithmics of Distributed Data Storage and AccessFairness and Efficiency for Distributed Job ExecutionTightening Bounds for Submodular Optimization: Algorithms and Analyses", "articles": ["X. Tang and J. Xu. (2008). Optimizing Lifetime for Continuous Data Aggregation with Precision Guarantees in Wireless Sensor Networks. IEEE-ACM Transactions on Networking, 16(4), 904-917.", "X. Tang and J. Xu. (2008). Adaptive Data Collection Strategies for Lifetime-Constrained Wireless Sensor Networks. IEEE Transactions on Parallel and Distributed Systems, 19(6), 721-734.", "X. Tang and S. T. Chanson. (2006). Analysis of Replica Placement under Expiration-Based Consistency Management. IEEE Transactions on Parallel and Distributed Systems, 17(11), 1253-1263.", "X. Tang and S. T. Chanson. (2002). Coordinated En-Route Web Caching. IEEE Transactions on Computers, 51(6), 595-607."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00075", "other_websites": ["https://personal.ntu.edu.sg/asxytang/"]}