{"full_name": "Josephine Chong", "designation": "Lecturer, School of Computer Science and Engineering", "name_card": "Dr Josephine Chong", "email": "josephine.chong@ntu.edu.sg", "keywords": [], "biography": "Prior to joining NTU, Dr Josephine Chong has previously worked at the Northumbria University (England) and Auckland University of Technology (New Zealand). While working at these universities, she teaches a range of Business Information Systems modules such as Business Information Systems, Enterprise Information Systems, Business Database Management and SAP. Her main research interest focuses on digital transformation and specially how organizations can redesign their strategies and frameworks for data analytics capability.", "interests": "Digital Transformation Sustainable Collaborative NetworksData Management Systems", "grants": null, "articles": ["Olesen, K., Wood, L.C. and Chong, J.L. (2021) Citizen Adoption in E-Government Systems: A Meta Analysis. Journal of Global Information Management (JGIM), 29(6), pp.1-28.", "Duan, S.X., Wibowo, S., and Chong, J. (2021) ‘A Multicriteria Analysis Approach for Evaluating the Performance of Agriculture Decision Support Systems for Sustainable Agribusiness’, Mathematics, vol.9.", "Duong, L.N.K., and Chong, J.L.L. (2020) ‘Supply Chain Collaboration in the Presence of Disruptions: A Literature Review’, International Journal of Production Research, DOI: 10.1080/00207543.2020.1712491", "Chong, J.L.L., and Karin, O. (2017) ‘A Technology-Organization-Environment Perspective on Eco-effectiveness: A Meta-analysis’, Australian Journal of Information Systems, vol.21.", "Chong, J.L.L., and Duong, L.N.K. (2017) ‘Understanding IT Governance Effectiveness in Asia: An Event Study’, Pacific Asia Journal of the Association for Information Systems, vol.9, no.1, pp.29-54.", "Chong, J.L.L., and Tan, F.B. (2012) ‘IT Governance in Collaborative Networks: A Socio-Technical Perspective’, Pacific Asia Journal of the Association for Information Systems, vol.4, no.2, pp.31-48.", "Chong, J.L.L. (2010) ‘Evaluating the impact of Arnould and Wallendorf's (1994) market-oriented ethnography ’, Journal of Business Research, vol. 63, no.12, pp. 1295-1300."], "books": [], "book_chapters": [], "conferences": ["Chong, J.L.L., and Duan, S. (2019) ‘A RBV and Capabilities Research Framework for Organizational Ecosystems’, 19th International Conference on Electronic Business, Newcastle, England 8-12 December 2019.", "Chong, J.L.L. (2019) ‘Evolution of a Sustainable Innovation Ecosystem’, International Conference on Big Data in Business, London, England, October 29-31 2019."], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02294", "other_websites": []}