{"full_name": "Wee Keong NG", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Wee Keong NG", "email": "awkng@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Internet & Communications", "Info-Communication Technology", "Interactive Digital Media", "Security Studies & Policy Issues", "Cyber Security and Forensics"], "biography": "Dr. W. K. NG works in machine learning, privacy-preserving techniques, query-permissible encrypted databases, enterprise blockchain systems, data security, and blockchain security. His work is motivated by the need to harness the power of data for the betterment of stakeholders, where the data has confidentiality and privacy issues; where the data may be owned and held by different stakeholders, and where the data is so large that it must be hosted in cloud servers that are never completely secured (susceptible to insider and cyber attacks). He contributes to companies and industries as technology consultant on projects involving data analytics, artificial intelligence, data privacy and security, and blockchain. In recent years, his involvement in conferences and workshop can be found here. His work is supported by various research grants, which can be found here. He is Associate Editor and Member of Editorial Boards of five journals. Over the years, he has worked with many talented students on their PhD and Master theses. Dr. Ng writes for online magazines and newspapers and contributes to social causes.", "interests": "Machine learning / Artificial intelligencePrivacy-preserving data analytical techniquesEncrypted databasesEnterprise blockchain systemsData security", "grants": "Strategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)", "articles": ["H.F.Zhu, W.K.Ng, “Transitive Pseudonyms Mediated Electronic Health Records Sharing for Very Important Patients,” International Conference on Web Services (ICWS’19), San Diego, USA, Jun 2019.", "H. F. Zhu, W. K. Ng, “Sustainable Data Management Strategies and Systems in Untrusted Cloud Environments,” 6th International Conference on Information Technology: IoT and Smart City (ICIT 2018), Hong Kong, Dec 2018.", "E. Bandara, W. K. Ng, K. De Zoysa, N. Fernando, S. Tharaka, P. Maurakirinathan, N. Jayasuriya, “Mystiko: Blockchain Meets Big Data,” BigData Conference, San Francisco, USA, Dec 2018.", "H. G. Do, W. K. Ng, “Blockchain-Based System for Secure Data Storage with Private Keyword Search,” IEEE World Congress on Services, Honolulu, HI, USA, Jun 2017.", "H. G. Do, W. K. Ng, “Multidimensional Range Query on Outsourced Database with Strong Privacy Guarantee,” 14th International Conference on Privacy, Security and Trust, pp. 555-560, Auckland, New Zealand, Dec 2016."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01094", "other_websites": ["https://personal.ntu.edu.sg/awkng"]}