{"full_name": "Liu Weichen", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Liu Weichen", "email": "liu@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Computing Hardware and Architecture", "Hardware and Embedded Systems"], "biography": "Dr. Weichen Liu is an Associate Professor at the School of Computer Science and Engineering, Nanyang Technological University, Singapore. He was a Nanyang Assistant Professor (NAP) during 2018-2023. He received his PhD degree from the Hong Kong University of Science and Technology, and the MEng and BEng degrees from Harbin Institute of Technology, China. Dr. Liu serves as an Associate Editor of IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), and a Subject Area Editor of Elsevier Journal of Systems Architecture (JSA). He served as a General Chair of the 25th IEEE International Symposium on Real-Time Computing (ISORC 2020), a Program Chair of ISORC 2019, a Track Chair of ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED 2021, 2022), The 16th IEEE International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC 2023), and a chair, technical program committee member, organizing committee member and guest editor of over 20 premier international conferences, journals, workshops and student forums, including DAC, ICCAD, ASP-DAC, CODES+ISSS, RTSS, RTAS, ISLPED, GLSVLSI, MSC@ESWEEK, SRF@ASP-DAC, EAI@ICDCS, etc. Dr. Liu authored and co-authored more than 170 research papers in peer-reviewed journals, conferences and books, and received the best paper candidate awards from DATE 2023, GLSVLSI 2022, ASP-DAC 2020, 2019 and 2016, CASES 2015, CODES+ISSS 2009, and the best poster paper awards from SRF@ASP-DAC 2020 and 2017, RTCSA 2017, AMD-TFE 2010. His research was supported by leading industrial partners including Intel, AMD, Xilinx, MediaTek, Huawei and HP.", "interests": "Embedded and Real-Time SystemsMany-Core SystemsElectronic/Photonic Network-on-ChipMachine Learning AccelerationEdge Intelligence", "grants": "Emerging Many-Core Processors", "articles": ["Xiangzhong Luo, Di Liu, Hao Kong, Shuo Huai, Hui Chen, Weichen Liu, “SurgeNAS: A Comprehensive Surgery on Hardware-Aware Differentiable Neural Architecture Search”, IEEE Transactions on Computers (TC), 2022.", "Hui Chen, Peng Chen, Xiangzhong Luo, Shuo Huai, Weichen Liu, “LAMP: Load-balanced Multipath Parallel Transmission in Point-to-point NoCs”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2022.", "Shien Zhu, Luan H. K. Duong, Weichen Liu, “TAB: Unified and Optimized Ternary, Binary and Mixed-Precision Neural Network Inference on the Edge”, ACM Transactions on Embedded Computing Systems (TECS), 2022.", "Peng Chen, Hui Chen, Jun Zhou, Mengquan Li, Weichen Liu, Chunhua Xiao, Yiyuan Xie, Nan Guan, “Contention Minimization in Emerging SMART NoC via Direct and Indirect Routes”, IEEE Transactions on Computers (TC), 2021.", "Pengxing Guo, Weigang Hou, Lei Guo, Luan H. K. Duong, Weichen Liu, “Fault-Tolerant Routing Mechanism in 3D Optical Network-on-Chip based on Node Reuse”, IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), 2020."], "books": [], "book_chapters": ["Mengquan Li, Weichen Liu, “Thermal Reliability and Communication Performance Co-Optimization for WDM-based Optical Networks-on-Chip”, Silicon Photonics for High Performance Computing and Beyond, CRC Press, 2021."], "conferences": ["Shiqing Li, Di Liu, Weichen Liu, “Optimized Data Reuse via Reordering for Sparse Matrix-Vector Multiplication on FPGAs”, ACM/IEEE International Conference on Computer Aided Design (ICCAD), 2021.", "Shuo Huai, Lei Zhang, Di Liu, Weichen Liu, Ravi Subramaniam, “ZeroBN: Learning Compact Neural Networks For Latency-Critical Edge Systems”, ACM/IEEE Design Automation Conference (DAC), 2021.", "Mengquan Li, Jun Zhou, Pengxing Guo, Weichen Liu, “Lightweight Thermal Monitoring in Optical Networks-on-Chip via Router Reuse”, ACM/IEEE Design, Automation and Test in Europe (DATE), 2020.", "Weichen Liu, Wenyang Liu, Yichen Ye, Qian Lou, Yiyuan Xie, Lei Jiang, “Holylight: A Nanophotonic Accelerator for Deep Learning in Data Centers”, ACM/IEEE Design, Automation and Test in Europe (DATE), 2019.", "Mengquan Li, Weichen Liu, Lei Yang, Peng Chen, Duo Liu, Nan Guan, “Routing in Optical Network-on-Chip: Minimizing Contention with Guaranteed Thermal Reliability”, ACM/IEEE Asia and South Pacific Design Automation Conference (ASPDAC), 2019. (Best Paper Candidate Award)"], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=UozjxW8AAAAJ&hl=en", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=21743260700"}, "google_scholar": "https://scholar.google.com/citations?user=UozjxW8AAAAJ&hl=en", "orcid": "https://orcid.org/0000-0001-9348-4662", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=21743260700", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00280", "other_websites": ["https://personal.ntu.edu.sg/liu/"]}