{"full_name": "Lam Siew Kei", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Lam Siew Kei", "email": "assklam@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Hardware and Embedded Systems", "Computing Hardware and Architecture"], "biography": "Siew Kei received his BASc, MEng and PhD from School of Computer Engineering, NTU. He was a Visiting Research Fellow in the Imperial College of London, University of Warwick, and RWTH Aachen, Germany. He is currently an Associate Professor in School of Computer Science and Engineering (SCSE), NTU. His research investigates custom computing techniques to meet the challenging demands for performance, energy-efficiency, cost, reliability, and security in edge intelligence.", "interests": "Custom Computing; High Level Synthesis; Heterogeneous and Reconfigurable Computing Systems; Embedded Vision and Autonomous Systems", "grants": "Configurable Side-Channel-Aware Program ObfuscationFL-SLAM: Federated Lifelong SLAMNever-Ending Deep Learning Agent for Non-stationary Data StreamsProtecting Critical AI Assets for Edge IntelligenceROAD USER TRAJECTORY PREDICTION USING  ENHANCED SCENE CONTEXTSecurity, Reliability and Privacy of Modern Hardware Accelerators and Co-processors for Edge Implementation of Deep Learning ModelsSuperfast-VO: FPGA-based Multicamera Visual Odometry", "articles": ["R Rohith ; Vijeta Rathore ; Vivek Chaturvedi ; Amit Kumar Singh ; Srikanthan Thambipillai ; Siew-Kei Lam. (2018). IEEE 8th AnnualComputing and Communication Workshop and Conference (CCWC) 2018: LifeSim: A lifetime reliability simulator for manycore systems. IEEE 8th AnnualComputing and Communication Workshop and Conference (CCWC)USA: IEEE.", "Meiqing Wu, Siew-Kei Lam, Thambipillai Srikanthan. (2017). A Framework for Fast and Robust Visual Odometry. IEEE Transactions on Intelligent Transportation Systems, 18(12), 3433-3448.", "Deshya Wijesundera, Alok Prakash, Siew Kei Lam and Thambipillai Srikanthan. (2016, May). Exploiting Configuration Dependencies for Rapid Area-efficient Customization of Soft-core Processors. Paper presented at 19th International Workshop on Software and Compilers for Embedded Systems, Sankt Goar (Germany).", "Yan Lin Aung, Siew-Kei Lam, and Thambipillai Srikanthan. (2015). 2015 20th International Conference on Digital Signal Processing (DSP): Rapid Estimation of DSPs Utilization for Efficient High-Level Synthesis. International Conference on Digital Signal Processing (DSP) (pp. 1261-1265)Singapore: IEEE."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=V-ys2R0AAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00901", "other_websites": ["https://personal.ntu.edu.sg/assklam/"]}