{"full_name": "Li Mo", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Li Mo", "email": "limo@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Internet & Communications", "Computer Networks and Communications", "Internet of Things"], "biography": "Dr. Mo Li is a Professor in School of Computer Science and Engineering. He received his BS degree in Department of Computer Science and Technology from Tsinghua University, and the PhD degree in Department of Computer Science and Engineering from Hong Kong University of Science and Technology. Dr. Mo Li has been internationally recognized for his research in wireless sensing and networking, IoT for smart cities and urban informatics. Dr. Li received Nanyang Research Award (Young Investigator) in 2016, a prestigious recognition to his research excellence by NTU. Dr. Li is a Distinguished Member of the ACM since 2019, and a Fellow of the IEEE since 2020.", "interests": "Networked and distributed systems, wireless and mobile, Internet of Things (IoT), smart city and urban computing", "grants": "Build CSI based wireless sensing platforms with commodity WiFiData-driven Traffic Analytics and Simulation for Incident Impact Analysis and ManagementFood Supply Chain Management built with Blockchain and Internet-of-Things (IoT)Holistic Allocation of Edge and Wireless Resources for Time-Sensitive IoT ApplicationsIntelligent Data Aggregation Framework for Workflow Optimisation in Smart Facility Management SolutionsTowards AIoT – Building Intelligence into Sensing, Networking, and Data Analytics of IoT", "articles": ["Mo, L., & Yunhao, L. (2009). Underground coal mine monitoring with wireless sensor networks. ACM Transactions on Sensor Networks (TOSN), 5(2), 1-31. doi: 10.1145/1498915.1498916", "Li, M., Li, Z., & Vasilakos, A. V. (2013). A survey on topology control in wireless sensor networks : taxonomy, comparative study, and open issues. Proceedings of the IEEE, 101(12), 2538-2557. doi: 10.1109/JPROC.2013.2257631", "Zhou, P., Zheng, Y., & Li, M. (2014). How long to wait? Predicting bus arrival time with mobile phone based participatory sensing. IEEE Transactions on Mobile Computing, 13(6), 1228 - 1241. doi: 10.1109/TMC.2013.136", "Liu, Y., He, Y., Li, M., Wang, J., Liu, K., & Li, X. (2012). Does wireless sensor network scale? A measurement study on GreenOrbs. IEEE Transactions on Parallel and Distributed Systems, 24(10), 1983-1993. doi: 10.1109/TPDS.2012.216", "Zheng, Y., & Li, M. (2012). Fast tag searching protocol for large-scale RFID systems. IEEE/ACM Transactions on Networking, 21(3), 924-934. doi: 10.1109/TNET.2012.2212454", "Li, M., & Liu, Y. (2009). Rendered path : range-free localization in anisotropic sensor networks with holes. IEEE/ACM Transactions on Networking, 18(1), 320-332. doi: 10.1109/TNET.2009.2024940", "Guo, D., Chen, T., Li, D., Li, M., Liu, Y., & Chen, G. (2012). Expandable and cost-effective network structures for data centers using dual-port servers. IEEE Transactions on Computers, 62(7), 1303-1317. doi: 10.1109/TC.2012.90", "Dong, D., Li, M., Liu, Y., Li, X. Y., & Liao, X. (2011). Topological detection on wormholes in wireless ad hoc and sensor networks. IEEE/ACM Transactions on Networking, 19(6), 1787-1796. doi: 10.1109/TNET.2011.2163730", "Liu, X., Li, M., Li, S., Peng, S., Liao, X., & Lu, X. (2013). IMGPU : GPU-accelerated influence maximization in large-scale social networks. IEEE Transactions on Parallel and Distributed Systems, 25(1), 136-145. doi: 10.1109/TPDS.2013.41", "Li, M., Liu, Y., & Chen, L. (2008). Nonthreshold-based event detection for 3D environment monitoring in sensor networks. IEEE Transactions on Knowledge and Data Engineering, 20(12), 1699-1711. doi: 10.1109/TKDE.2008.114", "Click  here for more publications.", "Ji, S., & Li, M. (2021). CLNet : complex input lightweight neural network designed for massive MIMO CSI feedback. IEEE Wireless Communications Letters, 10(10), 2318-2322. doi: 10.1109/LWC.2021.3100493", "Du, W., Tong, P., & Li, M. (2020). UniLoc : a unified mobile localization framework exploiting scheme diversity. IEEE Transactions on Mobile Computing, 20(7), 2505-2517. doi: 10.1109/TMC.2020.2979857", "Wu, K., Yang, Q., Yuan, B., Zou, Y., Ruby, R., & Li, M. (2020). Echowrite : an acoustic-based finger input system without training. IEEE Transactions on Mobile Computing, 20(5), 1789-1803. doi: 10.1109/TMC.2020.2973094", "Tong, P., Du, W., Li, M., Huang, J., Wang, W., & Qin, Z. (2019). Last-mile school shuttle planning with crowdsensed student trajectories. IEEE Transactions on Intelligent Transportation Systems, 22(1), 293-306. doi: 10.1109/TITS.2019.2956786", "Liu, Z., Zhou, P., Li, Z., & Li, M. (2018). Think like a graph : real-time traffic estimation at city-scale. IEEE Transactions on Mobile Computing, 18(10), 2446-2459. doi: 10.1109/TMC.2018.2873642", "Jansen Christian Liando, Amalinda Gamage, Agustinus Wellson Tengourtius, Li Mo. (2019). Known and Unknown Facts of LoRa: Experiences from a Large-scale Measurement Study. ACM Transactions on Sensor Networks, 15(2), Article 16.", "Mo Li, Pengfei Zhou, Yuanqing Zheng, Zhenjiang Li, Guobin Shen. (2015). IODetector: A Generic Service for Indoor Outdoor Detection. ACM Transactions on Sensor Networks, 11(2), Article 28.", "Pengfei Zhou, Yuanqing Zheng, Mo Li. (2014). How Long to Wait? Predicting Bus Arrival Time with Mobile Phone based Participatory Sensing. IEEE Transactions on Mobile Computing, Vol. 13 Issue 6, 1228-1241."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?hl=en&user=kjiwE6IAAAAJ", "web_of_science": "https://www.webofscience.com/wos/author/record/212682", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=57213424037"}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=kjiwE6IAAAAJ", "orcid": "https://orcid.org/0000-0002-6047-9709", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=57213424037", "web_of_science": "https://www.webofscience.com/wos/author/record/212682", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00937", "other_websites": ["https://personal.ntu.edu.sg/limo"]}