{"full_name": "Wang Wenya", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Wang Wenya", "email": "wangwy@ntu.edu.sg", "keywords": [], "biography": "Dr Wang Wenya is an Assistant Professor at the School of Computer Science and Engineering, NTU. Prior to joining NTU, she was a Postdoc (under the International Postdoctoral Fellowship) at the Allen School's NLP group from University of Washington, working with Noah Smith and Hanna Hajishirzi. Before that, she has been awarded the \"Lee Kuan Yew Postdoctoral Fellowship\" in 2019. She received her PhD degree from the School of Computer Science and Engineering, NTU, supervised by Sinno Jialin Pan, and the BSc degree from the School of Mathematical Sciences, NTU. She also worked as a Machine Learning Research Associate in SAP Research and Innovation. Her research interests lie in reasoning for Natural Language Processing (or multimodal learning), including symbolic (logic) reasoning, commonsense reasoning, knowledge integration, and robustness or generalizability of generative AI.", "interests": "Natural Language Processing, Symbolic (Logic) Reasoning, Language Reasoning, Multimodal Learning", "grants": "Towards Enhanced Language Comprehension over Complex Linguistic Phenomena", "articles": [], "books": [], "book_chapters": [], "conferences": ["Wenya Wang, Vivek Srikumar, Hanna Hajishirzi, Noah A. Smith. To appear in Proceedings of the 61th Annual Meeting of the Association for Computational Linguistics (ACL-23). Toronto, Canada. July 9-14, 2023. (Long paper)", "Interpretable Multimodal Misinformation Detection with Logic Reasoning.", "Hui Liu, Wenya Wang, Haoliang Li. To appear in Proceedings of the 61th Annual Meeting of the Association for Computational Linguistics (ACL-23). Toronto, Canada. July 9-14, 2023. (Findings)", "Towards Multi-Modal Sarcasm Detection via Hierarchical Congruity Modeling with Knowledge Enhancement.", "Hui Liu, Wenya Wang, Haoliang Li. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP-22). (Long paper)", "Deep Inductive Logic Reasoning for Multi-Hop Reading Comprehension.", "Wenya Wang and Sinno Jialin Pan. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL-22). Dublin, Ireland. May 22-27, 2022. (Long paper)", "Integrating Deep Learning with Logic Fusion for Information Extraction. Wenya Wang and Sinno Jialin Pan. In Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI-20). New York, USA. Feb. 7-12, 2020."], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=eOKISncAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01685", "other_websites": ["https://personal.ntu.edu.sg/wangwy/"]}