{"full_name": "Sourav Saha Bhowmick", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Sourav Saha Bhowmick", "email": "assourav@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Art, Design and Media", "Sociology", "Biomedical Sciences & Life Sciences"], "biography": "Sourav S Bhowmick is a computer scientist and an educator. He leads the Data Management Research Group at NTU (DANTE). He is also the Research Group Lead of Data Management & Analytics Group in SCSE. He was a Visiting Associate Professor from 2007 to 2013 at the Biological Engineering Division, Massachusetts Institute of Technology (MIT), USA. He was a Senior Visiting Professor at Fudan University in 2013. He was inducted into Distinguished Members of the ACM in 2020 for \"outstanding scientific contributions to computing\". Sourav’s core research expertise is in data management, human-data interaction, and data analytics. He is more excited to solving problems not within the mainstream of these fields that require new perspectives instead of yet another solution to a traditional problem. Consequently, his research interests are multi-area (e.g., data management and HCI, data management and IR) and multi-disciplinary (e.g., system biology and data analytics, social psychology and data analytics, cognitive psychology and data management, abstract art and social analytics, adult learning and data management) in flavor, focusing primarily on developing novel paradigms, algorithms, technology, and software to improve efficiency of software as well as humans. Sourav has published more than 100 papers in top-tier data management, data mining, multimedia, bioinformatics, and systems biology venues such as ACM SIGMOD, VLDB, ACM WWW, ACM MM, ACM SIGIR, VLDB Journal, Bioinformatics, and Biophysical Journal. The common thread running through his research is a focus on going beyond papers to build usable novel prototypes. He has received Best Paper Awards at ACM CIKM 2004 and ACM BCB 2011 for papers related to evolution mining and biological network summarization, respectively. His work on influence maximization was nominated for the best paper award in SIGMOD 2015. He has co-authored books on “Summarizing Biological Networks” and “Human Interaction with Graphs”, which are published by Springer-Verlag (May 2017) and Morgan & Claypool (August 2018) publishers, respectively. His research is supported by over S$4M in research grant from the Singapore-MIT Alliance and the Ministry of Education (4 Tier 2s, 6 Tier 1s). Sourav's research has been deployed in the real-world. His XML data management framework for biological data was part of the product of a local startup HeliXense Pte Ltd in 2002. More recently, his data-driven conflicts of interest (COI) detection system called CLOSET is being used by several premium conferences. Sourav regularly serves as a reviewer for premium data management and data analytics conferences (e.g., SIGMOD, VLDB) and journals (e.g., TODS, VLDB Journal). He has served/serving as a program chair/co-chair of several venues including ACM CIKM 2020, IEEE BigComp 2018, DASFAA 2014. He has also served/serving as Group Leader (area chair) for VLDB 2022, SIGMOD 2021, ICDE 2021, and SIGMOD 2019. He is a member of the steering committee of DASFAA. Sourav has been panelist, tutorial and keynote speaker in several international conferences (including SIGMOD, VLDB). He has also been reviewer of external Ph.D dissertations, national and international grant proposals, and external tenure applications. He is a member of the editorial boards of several international journals (e.g., IEEE TKDE, JASIST, SIGMOD Record). He is a co-recipient of the \"VLDB Service Award\" in 2018 from the VLDB Endowment for his contribution in designing an efficient PVLDB proceedings management framework. He is also conferred \"Distinguished PVLDB2020 Review Board Member Award\" in 2020 for \"outstanding services to VLDB 2020 and data management community\". Sourav have strong interest and passion for teaching undergraduate and graduate students. He was nominated for the Excellence in Teaching Award in 2020, 2005, 2004, and 2003. He was recipient of Lecturer of the Year Award (2002-2003) for Year 1 undergraduate course. Sourav have been invited twice (2011 and 2013) by the Database Society of Japan to mentor graduate students.", "interests": "Data management, human-data interaction, data analytics, network biology, computational social science, data-driven adult learning.", "grants": "Towards Data-driven Disambiguation of Homonymous Names in DBLP: A 30-Year-Old Notoriously Hard Challenge", "articles": ["Madria, S. K., Mohania, M., Bhowmick, S. S., & Bhargava, B. (2002). Mobile data and transaction management. Information Sciences, 141(3-4), 279-309.", "Li, H., Bhowmick, S. S., Sun, A., & Cui, J. (2015). Conformity-aware influence maximization in online social networks. The VLDB Journal, 24(1), 117-141.", "Bhowmick, S. S., & Seah, B. S. (2015). Clustering and summarizing protein-protein interaction networks: A survey. IEEE Transactions on Knowledge and Data Engineering, 28(3), 638-658.", "Sun, A., Bhowmick, S. S., Nam Nguyen, K. T., & Bai, G. (2011). Tag‐based social image retrieval: An empirical evaluation. Journal of the American Society for Information Science and Technology, 62(12), 2364-2381.", "Madria, S., Passi, K., & Bhowmick, S. (2008). An XML Schema integration and query mechanism system. Data & Knowledge Engineering, 65(2), 266-303.", "Zhang, Y., Jatowt, A., Bhowmick, S. S., & Tanaka, K. (2016). The past is not a foreign country: Detecting semantically similar terms across time. IEEE Transactions on Knowledge and Data Engineering, 28(10), 2793-2807.", "Zhao, Q., Chen, L., Bhowmick, S. S., & Madria, S. (2006). XML structural delta mining: Issues and challenges. Data & Knowledge Engineering, 59(3), 627-651.", "Shestakov, D., Bhowmick, S. S., & Lim, E. P. (2005). DEQUE: querying the deep web. Data & Knowledge Engineering, 52(3), 273-311.", "Fan, Z., Peng, Y., Choi, B., Xu, J., & Bhowmick, S. S. (2013). Towards efficient authenticated subgraph query service in outsourced graph databases. IEEE Transactions on Services Computing, 7(4), 696-713.", "Hung, H. H., Bhowmick, S. S., Truong, B. Q., Choi, B., & Zhou, S. (2014). QUBLE: towards blending interactive visual subgraph search queries on large networks. The VLDB Journal, 23(3), 401-426.", "Click  here for more publications.", "Yi, P., Li, J., Choi, B., Bhowmick, S. S., & Xu, J. (2022). FLAG: Towards Graph Query Autocompletion for Large Graphs. Data Science and Engineering, 7(2), 175-191.", "Peipei, Y. I., Choi, B., Zhang, Z., Bhowmick, S. S., & Xu, J. (2020). GFocus: User focus-based graph query autocompletion. IEEE Transactions on Knowledge and Data Engineering, 34(4), 1788–1802.", "Yang, R., Shi, J., Xiao, X., Yang, Y., Bhowmick, S. S., & Liu, J. (2022). No PANE, No Gain: Scaling Attributed Network Embedding in a Single Server. ACM SIGMOD Record, 51(1), 42-49.", "Li, G., Choi, B. K. K., Xu, J., Bhowmick, S. S., Chun, K. P., & Wong, G. L. (2020). Efficient shapelet discovery for time series classification. IEEE Transactions on Knowledge and Data Engineering, 34(3), 1149–1163.", "Li, H., Xu, M., Bhowmick, S. S., Rayhan, J. S., Sun, C., & Cui, J. (2022). PIANO: Influence Maximization Meets Deep Reinforcement Learning. IEEE Transactions on Computational Social Systems, 1-13.", "Huey Eng Chua, Sourav S Bhowmick, Lisa Tucker-Kellogg. (2017). Synergistic Target Combination Prediction From Curated Signaling Networks: Machine Learning Meets Systems Biology and Pharmacology. Methods, 129(1), 60-80.", "Hui Li, Sourav S Bhowmick, Aixin Sun, J Cui. (2015). Conformity-aware Influence Maximization in Online Social Networks. The VLDB Journal, 24(1)."], "books": [], "book_chapters": [], "conferences": ["Kai Huang, Huey Eng Chua, Sourav S Bhowmick, Byron Choi, Shuigeng Zhou. (2019). Proceedings of 45th ACM SIGMOD International Conference on Management of Data (ACM SIGMOD 2019): CATAPULT: Data-driven Selection of Canned Patterns for Efficient Visual Graph Query Formulation. ACM SIGMODAmsterdam, The Netherlands: ACM.", "Yinglong Song, Huey Eng Chua, Sourav S Bhowmick, Byron Choi, Shuigeng Zhou. (2018). BOOMER: Blending Visual Formulation and Processing of p-Homomorphic Queries on Large Networks. ACM SIGMOD 2018."], "bibliometrics": {"scopus": "https://www.scopus.com/authid/detail.uri?authorId=7006796096"}, "google_scholar": null, "orcid": "https://orcid.org/0000-0003-1957-8016", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7006796096", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00915", "other_websites": ["http://www3.ntu.edu.sg/home/assourav/"]}