{"full_name": "Miao Chun Yan", "designation": "Chair, School of Computer Science and Engineering", "name_card": "Prof Miao Chun Yan", "email": "ascymiao@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Info-Communication Technology", "Interactive Digital Media", "Internet & Communications", "Artificial and Augmented Intelligence"], "biography": "Dr Chunyan Miao is a President’s Chair Professor and Chair of the School of Computer Science and Engineering at Nanyang Technological University, Singapore. Under her leadership, SCSE has contributed greatly to NTU’s top world rankings in CS, CE and AI. SCSE has been ranked as the top university for AI Research Citation Impact by The Nikkei Review. Forbes has listed SCSE’s Data Science and Artificial Intelligence (DSAI) programme in ‘The 10 Best AI and Data Science Undergraduate Courses for 2021’.Dr Miao is an expert on Human-Centered AI and is well-known for her impactful AI research in health, ageing, education, and digital industry. She has received over 20 Best Paper and AI awards including the NRF Investigatorship Award 2019; and the Innovative Applications of AI Award, AAAI 2018 and 2020. has been elevated as IEEE Fellow in 2022; was recognized as 'Professional of the Year' at the IT Leaders Awards 2021 and was named in the “Singapore 100 Women in Tech” list by IMDA/SCS/CNA in 2020, for her significant contributions to Singapore’s tech sector. Dr Miao was bestowed the 2023 National Day Awards - Public Administration Medal (Silver) in recognition of her contributions to education in Singapore and dedicated service to the University. Dr Miao initiated the large-scale interdisciplinary collaboration on AI Ethics and Governance and the world’s first Flexi-Master program to address ethical issues related to AI adoption in Singapore. In recent years, she has received over S$250M in large-scale research grants and initiated over S$200M worth of educational programmes for the EDB-Industrial Postgraduate Programme (IPP) PhD training over 5 years.Dr Miao is the Founding Director and Lead PI of the Joint NTU-UBC Research Centre of Excellence in Active Living for the Elderly (LILY), the first AI-empowered interdisciplinary ageing research centre in Singapore. In collaboration with NHG and TTSH, LILY’s AI for ageing technologies have reached over 10,000 senior citizens in Singapore. LILY technologies have also been showcased during Singapore President’s state visits and ministerial mission trips to UK, China and Japan.Dr Miao is the Founding Director and Lead PI of the S$50M Alibaba-NTU Singapore Joint Research Institute, Alibaba’s first and largest joint research institute outside China. She is also the Founding Director and Lead PI of the $60M NTU-WeBank Joint Research Centre on FinTech. Dr Miao has served as Council Member, Singapore Computer Society (SCS) since 2006. She is Chair of the AI Body of Knowledge Review Panel which has played an instrumental role in positioning Singapore as a world leader in AI Ethics and Governance. She has served as Editor of several international journals and as Chair/Co-chair/Technical Program Committee member of many leading AI international conferences. She was the general chair of KDD 2021, the world’s premier DSAI conference.Dr Miao received her PhD Degree in Computer Engineering from NTU and pursued her postdoctoral studies at Simon Fraser University (SFU), Canada. She was a founding faculty member and Associate Professor at the Centre for Digital Media, jointly established by UBC and SFU. She was also a Tan Chin Tuan Fellow for academic and research collaboration in AI for education at Harvard University and MIT. She is a Fellow of SCS, the Academy of Engineering Singapore (SAEng) and the Institution of Engineers Singapore (IES).", "interests": "Human Centered Artificial Intelligence (HAI), Human AI Interaction, AI Ethics, HAI for health, ageing, sustainability and education.", "grants": "AI for Person Re-Identification “Skeleton-Based Person Re-Identification, Self-Supervised/Unsupervised Person Re-Identification, Domain Generalized Person Re-Identification”Alibaba-NTU Singapore Joint Research InstituteCyber Research Programme Office (CRPO)Joint NTU-Alibaba Research InstituteJoint NTU-WeBank Research Centre on FintechJoint SDU-NTU Centre for Artificial Intelligence Research(C-FAIR) - Smart Community Research and Talent ProgrammeMonetary Academic Resources for ResearchSenior-friendly Persuasive AI Companions for an Aging PopulationTradeMaster: Reinforcement Learning-based Quantitative Trading ToolkitTradeMaster: Reinforcement Learning-based Quantitative Trading Toolkit (SMU)TrustFUL: Trustworthy Federated Ubiquitous LearningTrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)WeBank-NTU Joint Research Institute on Fintech", "articles": ["Lim, W. Y. B., Luong, N. C., Hoang, D. T., Jiao, Y., Liang, Y. C., Yang, Q., ... & Miao, C. (2020). Federated learning in mobile edge networks : a comprehensive survey. IEEE Communications Surveys & Tutorials, 22(3), 2031-2063. doi: 10.1109/COMST.2020.2986024", "Liu, Y., Wu, M., Miao, C., Zhao, P., & Li, X. L. (2016). Neighborhood regularized logistic matrix factorization for drug-target interaction prediction. PLoS Computational Biology, 12(2), e1004760. doi: 10.1371/journal.pcbi.1004760", "Yu, H., Shen, Z., Leung, C., Miao, C., & Lesser, V. R. (2013). A survey of multi-agent trust management systems. IEEE Access, 1, 35-50. doi: 10.1109/ACCESS.2013.2259892", "Miao, Y., Liu, Z. Q., Siew, C. K., & Miao, C. Y. (2001). Dynamical cognitive network-an extension of fuzzy cognitive map. IEEE Transactions on Fuzzy Systems, 9(5), 760-770. doi: 10.1109/91.963762", "Zou, L., Zheng, J., Miao, C., Mckeown, M. J., & Wang, Z. J. (2017). 3D CNN based automatic diagnosis of attention deficit hyperactivity disorder using functional and structural MRI. IEEE Access, 5, 23626-23636. doi: 10.1109/ACCESS.2017.2762703", "Xiong, Y., Gan, J., An, B., Miao, C., & Bazzan, A. L. (2017). Optimal electric vehicle fast charging station placement based on game theoretical framework. IEEE Transactions on Intelligent Transportation Systems, 19(8), 2493-2504. doi: 10.1109/TITS.2017.2754382", "Zhong, H., Miao, C., Shen, Z., & Feng, Y. (2014). Comparing the learning effectiveness of BP, ELM, I-ELM, and SVM for corporate credit ratings. Neurocomputing, 128, 285-295. doi: 10.1016/j.neucom.2013.02.054", "Song, H., Miao, C., Roel, W., Shen, Z., & Catthoor, F. (2009). Implementation of fuzzy cognitive maps based on fuzzy neural network and application in prediction of time series. IEEE Transactions on Fuzzy Systems, 18(2), 233-250. doi: 10.1109/TFUZZ.2009.2038371", "Song, H. J., Miao, C. Y., Wuyts, R., Shen, Z. Q., D’Hondt, M., & Catthoor, F. (2010). An extension to fuzzy cognitive maps for classification and prediction. IEEE Transactions on Fuzzy Systems, 19(1), 116-135. doi: 10.1109/TFUZZ.2010.2087383", "Huang, D., He, B., & Miao, C. (2014). A survey of resource management in multi-tier web applications. IEEE Communications Surveys & Tutorials, 16(3), 1574-1590. doi: 10.1109/SURV.2014.010814.00060", "Click  here for more publications.", "Lim, W. Y. B., Ng, J. S., Xiong, Z., Jin, J., Zhang, Y., Niyato, D., ... & Miao, C. (2021). Decentralized edge intelligence : a dynamic resource allocation framework for hierarchical federated learning. IEEE Transactions on Parallel and Distributed Systems, 33(3), 536-550. doi: 10.1109/TPDS.2021.3096076", "Lyu, S., Cheng, J., Wu, X., Cui, L., Chen, H., & Miao, C. (2020). Auxiliary learning for relation extraction. IEEE Transactions on Emerging Topics in Computational Intelligence. doi: 10.1109/TETCI.2020.3040444", "Lim, W. Y. B., Xiong, Z., Kang, J., Niyato, D., Leung, C., Miao, C., & Shen, X. (2020). When information freshness meets service latency in federated learning : a task-aware incentive scheme for smart industries. IEEE Transactions on Industrial Informatics, 18(1), 457-466. doi: 10.1109/TII.2020.3046028", "Lim, W. Y. B., Garg, S., Xiong, Z., Zhang, Y., Niyato, D., Leung, C., & Miao, C. (2021). UAV-assisted communication efficient federated learning in the era of the Artificial Intelligence of Things. IEEE Network, 35(5), 188-195. doi: 10.1109/MNET.002.2000334", "Liu, B., Liu, Y., Zhang, H., Xu, Y., Tang, C., Tang, L., ... & Miao, C. (2021). Adaptive power iteration clustering. Knowledge-Based Systems, 225, 107118. doi: 10.1016/j.knosys.2021.107118", "Zhiwei Zeng, Zhiqi Shen, Jing Jih Chin, Cyril Leung, Yu Wang, Ying Chi, Chunyan Miao. (2020). Explainable and Contextual Preferences based Decision Making with Assumption-based Argumentation for Diagnostics and Prognostics of Alzheimer’s Disease. International Conference on Autonomous Agents and Multiagent Systems.", "Yongqing Zheng, Han Yu, Lizhen Cui, Chunyan Miao, Cyril Leung, Yang Liu & Qiang Yang. (2020). Addressing the challenges of government service provision with AI. AI Magazine, 41(1), 33-43."], "books": [], "book_chapters": [], "conferences": ["Yong Liu, Yingtai Xiao, Qiong Wu, Chunyan Miao, Juyong Zhang, Binqiang Zhao, Haihong Tang. (2020). Diversified Interactive Recommendation with Implicit Feedback. The Thirty-Fourth AAAI Conference on Artificial Intelligence (AAAI-20).", "Chang Liu, Yi Dong, Han Yu, Zhiqi Shen, Zhanning Gao, Pan Wang, Changgong Zhang, Peiran Ren, Xuansong Xie, Lizhen Cui & Chunyan Miao. (2019). Proceedings of the 28th ACM International Conference on Information and Knowledge Management (CIKM'19): Generating Persuasive Visual Storylines for Promotional Videos. (pp. 901–910)ACM."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=fmXGRJgAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/391057", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8850060600"}, "google_scholar": "https://scholar.google.com/citations?user=fmXGRJgAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-0300-3448", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8850060600", "web_of_science": "https://www.webofscience.com/wos/author/record/391057", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00084", "other_websites": []}