{"full_name": "Long Cheng", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Long Cheng", "email": "c.long@ntu.edu.sg", "keywords": ["Information Sciences and Systems"], "biography": "Cheng LONG is currently an Assistant Professor at the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU). He received the PhD degree from Hong Kong University of Science and Technology (HKUST) in 2015 and Bachelor's degree from South China University of Technology (SCUT) in 2010. He has research interests broadly in data management and data mining. Specifically, he works in (a) spatial data management with machine learning-based techniques, (b) spatial data mining in the urban domain (e.g., traffic and mobility), (c) graph data mining (namely dense subgraph mining and graphlet mining), and recently in (d) high-dimensional vector data management (e.g., approximate nearest neighbor search). His research has been recognized with the \"Best Research Award\" provided by ACM-Hong Kong, the \"Fulbright-RGC Research Award\" provided by Research Grant Council (Hong Kong), the \"PG Paper Contest Award\" provided by IEEE-HK, and the \"Overseas Research Award\" provided by HKUST.", "interests": "•\tSpatial data management•\tSpatial data mining•\tGraph data mining•\tVector data management", "grants": "Google PhD FellowshipLearn to Augment and Represent Spatial Urban DataLeveraging Machine Learning for Bipartite MatchingPre-Processing and Querying Big Trajectory Data with Reinforcement Learning", "articles": ["2.\tZhang, Liang*, Cheng Long~^. \"Road Network Representation Learning: A Dual Graph based Approach.\" ACM Transactions on Knowledge Discovery from Data (IF: 4.157) (2023).#", "3.\tWang, Kaixin*, Cheng Long~^, Darrell Joshua Ong, Jie Zhang, and Xue-Ming Yuan. \"Single-site Perishable Inventory Management under Uncertainties: A Deep Reinforcement Learning Approach.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) (2023).##", "4.\tZou, Jie**, Aixin Sun, Cheng Long~^, Mohammad Aliannejadi, and Evangelos Kanoulas. \"Asking Clarifying Questions: To benefit or to disturb users in Web search?.\" Information Processing & Management (IF: 7.466) 60, no. 2 (2023): 103176.#", "5.\tWang, Yongjie, Ke Wang, Cheng Long, and Chunyan Miao. \"Summarizing User-Item Matrix By Group Utility Maximization.\" ACM Transactions on Knowledge Discovery from Data (IF: 4.157) 17, no. 6 (2023): 1-22.#", "6.\tDu, Xinqi, Hechang Chen, Bo Yang, Cheng Long, and Songwei Zhao. \"HRL4EC: Hierarchical reinforcement learning for multi-mode epidemic control.\" Information Sciences (IF: 8.233) 640 (2023): 119065.##", "7.\tZhang, Liang*, Cheng Long~^, and Gao Cong. \"Region Embedding with Intra and Inter-View Contrastive Learning.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) (2022).##", "8.\tLiu, Qidong, Cheng Long, Jie Zhang, Mingliang Xu, and Dacheng Tao. \"Aspect-Aware Graph Attention Network for Heterogeneous Information Networks.\" IEEE Transactions on Neural Networks and Learning Systems (IF: 10.4), 2022.##", "9.\tWei, Victor Junqiu, Raymond Chi-Wing Wong, Cheng Long, David Mount, and Hanan Samet. \"Proximity Queries on Terrain Surface.\" ACM Transactions on Database Systems (IF: 1.629) 47, no. 4 (2022): 1-59.#", "10.\tCheng, Ji, Da Yan, Wenwen Qu, Xiaotian Hao, Cheng Long, Wilfred Ng, and Xiaoling Wang. \"Mining Order-preserving Submatrices under Data Uncertainty: A Possible-world Approach and Efficient Approximation Methods.\" ACM Transactions on Database Systems (IF: 1.629) 47, no. 2 (2022): 1-57.#", "11.\tMo, Zijing, Christian D. Peters, Cheng Long, Nicholas P. Hankins, and Qianhong She. \"How split-feed osmotically assisted reverse osmosis (SF-OARO) can outperform conventional reverse osmosis (CRO) processes under constant and varying electricity tariffs.\" Desalination (IF: 11.211) 530 (2022): 115670.##", "12.\tXiong, Pan, Cheng Long, Huiyu Zhou, Xueming Zhang, and Xuhui Shen. \"GNSS TEC-based earthquake ionospheric perturbation detection using a novel deep learning framework.\" IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing (IF: 5.5) 15 (2022): 4248-4263.#", "13.\tWang, Zheng*, Cheng Long~^, and Gao Cong. \"Similar Sports Play Retrieval with Deep Reinforcement Learning.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) (2021).##", "14.\tChen, Zitong, Ada Wai-Chee Fu, Cheng Long^, Yang Wu. \"k-Pleased Querying.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) (2021).##", "15.\tArsomngern, Pattaramanee, Cheng Long, Supasorn Suwajanakorn, and Sarana Nutanong. \"Towards Pointsets Representation Learning via Self-Supervised Learning and Set Augmentation.\" IEEE Transactions on Pattern Analysis and Machine Intelligence (IF: 23.6) 45, no. 1 (2021): 1201-1216.##", "16.\tRuan, Sijie, Xi Fu, Cheng Long, Zi Xiong, Jie Bao, Ruiyuan Li, Yiheng Chen, Shengnan Wu, and Yu Zheng. \"Filling Delivery Time Automatically Based on Couriers' Trajectories.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9), 2021.##", "17.\tChan, Harry Kai-Ho, Shengxin Liu, Cheng Long^, and Raymond Chi-Wing Wong. \"Cost-Aware and Distance-Constrained Collective Spatial Keyword Query.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9), 2021.##", "18.\tYu, Kaiqiang*, Cheng Long~^, P. Deepak, and Tanmoy Chakraborty. \"On Efficient Large Maximal Biplex Discovery.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) 35, no. 1 (2021): 824-829.##", "19.\tLiu, Qidong, Cheng Long, Jie Zhang, Mingliang Xu, and Pei Lv. \"TriATNE: Tripartite Adversarial Training for Network Embeddings.\" IEEE Transactions on Cybernetics (IF: 11.8) 52, no. 9 (2021): 9634-9645.##", "20.\tRuan, Xiaoqian, Guosheng Lin, Cheng Long, and Shengli Lu. “Few-Shot Fine-Grained Classification with Spatial Attentive Comparison”, Knowledge-based Systems (IF: 8.139), 2021.##", "21.\tWan, Ying**, Cheng Long~, Ruilong Deng, Guanghui Wen, and Xinghuo Yu. \"Adaptive Event-Triggered Strategy for Economic Dispatch in Uncertain Communication Networks.\" IEEE Transactions on Control of Network Systems (IF: 4.2) 8, no. 4 (2021): 1881-1891.#", "22.\tXiong, Pan, Lei Tong, Kun Zhang, Xuhui Shen, Roberto Battiston, Dimitar Ouzounov, Roberto Iuppa, Danny Crookes, Cheng Long, and Huiyu Zhou. \"Towards advancing the earthquake forecasting by machine learning of satellite data.\" Science of The Total Environment (IF: 10.754) 771 (2021): 145256.##", "23.\tXiong, Pan, Dulin Zhai, Cheng Long, Huiyu Zhou, Xuemin Zhang, and Xuhui Shen. \"Long Short-Term Memory Neural Network for Ionospheric Total Electron Content Forecasting Over China.\" Space Weather (IF: 4.288) 19, no. 4 (2021): e2020SW002706.", "24.\tXiong, Pan, Cheng Long, Huiyu Zhou, Roberto Battiston, Angelo De Santis, Dimitar Ouzounov, Xuemin Zhang, and Xuhui Shen. \"Pre-earthquake ionospheric perturbation identification using CSES data via transfer learning.\" Frontiers in Environmental Science (IF: 4.6) (2021): 514.#", "25.\tHuang, Keke, Yiming Wu, Cheng Long, Hongquan Ji, Bei Sun, Xiaofang Chen, and Chunhua Yang. \"Adaptive process monitoring via online dictionary learning and its industrial application.\" ISA transactions (IF: 5.911) 114 (2021): 399-412.##", "26.\tWan, Ying**, Cheng Long~, Ruilong Deng, Guanghui Wen, Xinghuo Yu, and Tingwen Huang. \"Distributed event-based control for thermostatically controlled loads under hybrid cyber attacks.\" IEEE Transactions on Cybernetics (IF: 11.8) 51, no. 11 (2020): 5314-5327.##", "27.\tLong, Cheng^, Anhua Chen, Pakawadee Pengcharoen, and Raymond Chi-Wing Wong. \"On optimal preference diffusion over social networks.\" Information Systems (IF: 3.18) 88 (2020): 101441.#", "28.\tLin, Weipeng, Ke Wang, Zhilin Zhang, Ada Wai-Chee Fu, Raymond Chi-Wing Wong, Cheng Long, and Chunyan Miao. \"Towards Secure and Efficient Equality Conjunction Search over Outsourced Databases.\" IEEE Transactions on Cloud Computing (IF: 6.5) 10, no. 2 (2020): 1445-1461.#", "29.\tLiu, Qidong, Xin Zhou, Cheng Long, Jie Zhang, and Mingliang Xu. \"Learning Network Representations With Different Order Structural Information.\" IEEE Transactions on Computational Social Systems (IF: 5.0) 7, no. 4 (2020): 907-914.#", "30.\tXiong, Pan, Cheng Long, Huiyu Zhou, Roberto Battiston, Xuemin Zhang, and Xuhui Shen. \"Identification of electromagnetic pre-earthquake perturbations from the DEMETER data by machine learning.\" Remote Sensing (IF: 5.0) 12, no. 21 (2020): 3643.##", "31.\tWei, Victor Junqiu, Raymond Chi-Wing Wong, Cheng Long, and Pan Hui. \"On nearby-fit spatial keyword queries.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) 32, no. 11 (2019): 2198-2212.##", "32.\tYang, Chunhua, Longfei Zhou, Keke Huang, Hongquan Ji, Cheng Long, Xiaofang Chen, and Yongfang Xie. \"Multimode process monitoring based on robust dictionary learning with application to aluminium electrolysis process.\" Neurocomputing (IF: 5.779) 332 (2019): 305-319.#", "33.\tLong, Cheng^, Raymond Chi-Wing Wong, and Victor Junqiu Wei. \"Profit maximization with sufficient customer satisfactions.\" ACM Transactions on Knowledge Discovery from Data (IF: 4.157) 12, no. 2 (2018): 1-34.#", "34.\tChan, Harry Kai-Ho, Cheng Long, and Raymond Chi-Wing Wong. \"On generalizing collective spatial keyword queries.\" IEEE Transactions on Knowledge and Data Engineering (IF: 8.9) 30, no. 9 (2018): 1712-1726.##", "35.\tChen, Zitong, Yubao Liu, Raymond Chi-Wing Wong, Jiamin Xiong, Ganglin Mai, and Cheng Long. \"Optimal location queries in road networks.\" ACM Transactions on Database Systems (IF: 1.629) 40, no. 3 (2015): 1-41.#", "36.\tLong, Cheng^, and Raymond Chi-Wing Wong. \"Viral marketing for dedicated customers.\" Information Systems (IF: 3.18) 46 (2014): 1-23.#"], "books": [], "book_chapters": ["2.\tLuo, Weichen and Cheng Long. \"Fact Checking on Knowledge Graph\", in Data Science for Fake News: Surveys and Perspectives, Springer, 2020.", "3.\tLong, Cheng and Raymond Chi-Wing Wong. \"Spatial Matching Problems\", in Encyclopedia of Database Systems, Second Edition, Springer, 2018.", "4.\tLong, Cheng and Raymond Chi-Wing Wong. \"Optimal Worst-Case Matching\", in Encyclopedia of GIS, Springer, 2017."], "conferences": ["2.\tGao, Jianyang* and Cheng Long~. \"High-Dimensional Approximate Nearest Neighbor Search: with Reliable and Efficient Distance Comparison Operations.\" Proceedings of the 2023 ACM SIGMOD International Conference on Management of Data, 2023.#", "3.\tYu, Kaiqiang* and Cheng Long~. \"Maximum k-Biplex Search on Bipartite Graphs: A Symmetric-BK Branching Approach.\" Proceedings of the 2023 ACM SIGMOD International Conference on Management of Data, 2023.#", "4.\tGu, Tu, Kaiyu Feng, Gao Cong, Cheng Long, Zheng Wang, and Sheng Wang. \"The RLR-Tree: A Reinforcement Learning Based R-Tree for Spatial Data.\" Proceedings of the 2023 ACM SIGMOD International Conference on Management of Data, 2023.#", "5.\tYuan, Lyuheng, Da Yan, Wenwen Qu, Saugat Adhikari, Jalal Khalil, Cheng Long, and Xiaoling Wang. \"T-FSM: A Task-Based System for Massively Parallel Frequent Subgraph Pattern Mining from a Big Graph.\" Proceedings of the 2023 ACM SIGMOD International Conference on Management of Data, 2023.#", "6.\tJiangneng Li, Zheng Wang*, Gao Cong, Cheng Long, Han Mao Kiah, Bin Cui. \"Towards Designing and Learning Piecewise Space-Filling Curves.\" Proceedings of the VLDB Endowment, 2023.#", "7.\tWang, Kaixin*, Cheng Long~, Da Yan, Jie Zhang, and H. V. Jagadish. \"Reinforcement Learning Enhanced Weighted Sampling for Accurate Subgraph Counting on Fully Dynamic Graph Streams.\" In 2023 IEEE 39th International Conference on Data Engineering (ICDE), IEEE, 2023.#", "8.\tZhang, Qianru, Zheng Wang*, Cheng Long~, Chao Huang, Siu-Ming Yiu, Yiding Liu, Gao Cong, and Jieming Shi. \"Online Anomalous Subtrajectory Detection on Road Networks with Deep Reinforcement Learning.\" In 2023 IEEE 39th International Conference on Data Engineering (ICDE), IEEE, 2023.#", "9.\tSaha, Arkaprava*, Xiangyu Ke, Arijit Khan, and Cheng Long~. \"Most Probable Densest Subgraphs.\" In 2023 IEEE 39th International Conference on Data Engineering (ICDE), IEEE, 2023.#", "10.\tXu, Qianxiong*, Wenting Zhao, Guosheng Lin, and Cheng Long~. \"Self-Calibrated Cross Attention Network for Few-Shot Segmentation.\" In 2023 International Conference on Computer Vision (ICCV), 2023.#", "11.\tZhao, Wenting, Gongping Xu, Zhen Cui, Siqiang Luo, Cheng Long, and Tong Zhang. \"Deep Graph Structural Infomax.\" Proceedings of the AAAI Conference on Artificial Intelligence, 2023.#", "12.\tZhou, Wei, Hao Wang, Yiling Zhang, Cheng Long, Yan Yang, Dongjie Wang. \"Multi-scale Progressive Gated Transformer for Physiological Signal Classification.\" Proceedings of The 14th Asian Conference on Machine Learning, 2023.", "13.\tYu, Kaiqiang*, Cheng Long~, Shengxin Liu, and Da Yan. \"Efficient Algorithms for Maximal k-Biplex Enumeration.\" Proceedings of the 2022 ACM SIGMOD International Conference on Management of Data, 2022.#", "14.\tRuan, Sijie, Cheng Long, Xiaodu Yang, Tianfu He, Ruiyuan Li, Jie Bao, Yiheng Chen, Shengnan Wu, Jiangtao Cui, Yu Zheng. \"Discovering Actual Delivery Locations from Mis-Annotated Couriers’ Trajectories.\" In 2022 IEEE 38th International Conference on Data Engineering (ICDE), IEEE, 2022.#", "15.\tGuo, Guimu, Da Yan, Lyuheng Yuan, Jalal Khalil, Cheng Long, Zhe Jiang, Yang Zhou. \"Maximal Directed Quasi-Clique Mining.\" In 2022 IEEE 38th International Conference on Data Engineering (ICDE), IEEE, 2022.#", "16.\tRuan, Sijie, Cheng Long, Zhipeng Ma, Jie Bao, Tianfu He, Ruiyuan Li, Yiheng Chen, Shengnan Wu and Yu Zheng. \"Service Time Prediction for Delivery Tasks via Spatial Meta-Learning.\" In Proceedings of the 28th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, 2022.#", "17.\tXu, Qianxiong*, Sijie Ruan, Cheng Long~, Liang Yu, and Chen Zhang. \"Traffic Speed Imputation with Spatio-Temporal Attentions and Cycle-Perceptual Training.\" In Proceedings of the 31st ACM International Conference on Information & Knowledge Management, pp. 2280-2289. 2022.#", "18.\tZhang, Qianru, Zheng Wang*, Cheng Long~, Siu-Ming Yiu. \"On Predicting and Generating a Good Break Shot in Billiards Sports.\" In Proceedings of the 2022 SIAM International Conference on Data Mining (SDM), SIAM, 2022.#", "19.\tShen, Xin, Yuhang Jiao, Cheng Long, Yuguang Wang, Xiaowei Wang, Sen Yang, Ji Liu, Jie Zhang. \"Prototype Feature Extraction for Multi-task Learning.\" In ACM The Web Conference, 2022.#", "20.\tZhou, Shaowen*, Bowen Yu, Aixin Sun, Cheng Long~, Jingyang Li, and Jian Sun. \"A Survey on Neural Open Information Extraction: Current Status and Future Directions.\" In Proceedings of the 31st International Joint Conference on Artificial Intelligence (IJCAI), 2022.#", "21.\tWang, Zheng*, Mingrui Liu*, Cheng Long~, Qianru Zhang, Jiangneng Li, and Chunyan Miao. \"On Inferring User Socioeconomic Status with Mobility Records.\" In 2022 IEEE International Conference on Big Data (2022).", "22.\tWang, Zheng*, Cheng Long~, and Gao Cong. \"Trajectory Simplification with Reinforcement Learning.\" In 2021 IEEE 37th International Conference on Data Engineering (ICDE), pp. 684-695. IEEE, 2021.#", "23.\tShen, Xin, Zhao Li, Pengcheng Zou, Cheng Long, Jie Zhang, Jiajun Bu, and Jingren Zhou. \"ATNN: Adversarial Two-Tower Neural Network for New Item’s Popularity Prediction in E-commerce.\" In 2021 IEEE 37th International Conference on Data Engineering (ICDE), pp. 2499-2510. IEEE, 2021.#", "24.\tChen, Yile, Xiucheng Li, Gao Cong, Cheng Long, Zhifeng Bao, Shang Liu, Wanli Gu, and Fuzheng Zhang. \"Points-of-interest relationship inference with spatial-enriched graph neural networks.\" Proceedings of the VLDB Endowment 15, no. 3 (2021): 504-512. #", "25.\tWang, Zheng*, Cheng Long~, Gao Cong, and Qianru Zhang. \"Error-Bounded Online Trajectory Simplification with Multi-Agent Reinforcement Learning.\" In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining, pp. 1758-1768. 2021.#", "26.\tWang, Kaixin*, Cheng Long~, Yongxin Tong, Jie Zhang, and Yi Xu. \"Adaptive Holding for Online Bottleneck Matching with Delays.\" In Proceedings of the 2021 SIAM International Conference on Data Mining (SDM), pp. 235-243. Society for Industrial and Applied Mathematics, 2021.#", "27.\tChen, Yile, Xiucheng Li, Gao Cong, Zhifeng Bao, Cheng Long, Yiding Liu, Arun Kumar Chandran, and Richard Ellison. \"Robust Road Network Representation Learning: When Traffic Patterns Meet Traveling Semantics.\" In Proceedings of the 30th ACM International Conference on Information & Knowledge Management, pp. 211-220. 2021.#", "28.\tMa, Yueen, Da Yan, Cheng Long, D. Rangaprakash, and Gopikrishna Deshpande. \"Predicting Autism Spectrum Disorder from Brain Imaging Data by Graph Convolutional Network.\" In 2021 International Joint Conference on Neural Networks (IJCNN), pp. 1-8. IEEE, 2021.", "29.\tWei, Victor Junqiu, Raymond Chi-Wing Wong, and Cheng Long. \"Architecture-Intact Oracle for Fastest Path and Time Queries on Dynamic Spatial Networks.\" In Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data, pp. 1841-1856. 2020.#", "30.\tWang, Zheng*, Cheng Long~, Gao Cong, and Yiding Liu. \"Efficient and effective similar subtrajectory search with deep reinforcement learning.\" Proceedings of the VLDB Endowment 13, no. 12 (2020): 2312-2325.#", "31.\tRuan, Sijie, Zi Xiong, Cheng Long, Yiheng Chen, Jie Bao, Tianfu He, Ruiyuan Li, Shengnan Wu, Zhongyuan Jiang, and Yu Zheng. \"Doing in One Go: Delivery Time Inference Based on Couriers' Trajectories.\" In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, pp. 2813-2821. 2020.#", "32.\tRuan, Sijie, Cheng Long, Jie Bao, Chunyang Li, Zisheng Yu, Ruiyuan Li, Yuxuan Liang, Tianfu He, and Yu Zheng. \"Learning to generate maps from trajectories.\" In Proceedings of the AAAI Conference on Artificial Intelligence, vol. 34, no. 01, pp. 890-897. 2020.#", "33.\tChen, Yile, Cheng Long, Gao Cong, and Chenliang Li. \"Context-aware deep model for joint mobility and time prediction.\" In Proceedings of the 13th International Conference on Web Search and Data Mining, pp. 106-114. 2020.#", "34.\tXiao, Nan, Nan Hu, Liang Yu, and Cheng Long. \"Generating Full Spatiotemporal Vehicular Paths: A Data Fusion Approach.\" In Proceedings of the 29th ACM International Conference on Information & Knowledge Management, pp. 2837-2844. 2020.#", "35.\tShen, Xin, Yizhou Ye, Martin Ester, Cheng Long, Jie Zhang, Zhao Li, Kaiying Yuan, and Yanghua Li. \"Multi-Channel Sellers Traffic Allocation in Large-scale E-commerce Promotion.\" In Proceedings of the 29th ACM International Conference on Information & Knowledge Management, pp. 2845-2852. 2020.#", "36.\tWang, Zheng*, Ju, Ce, Cheng Long~, Xiaoyu Zhang, and Dong Eui Chang. \"Interaction-aware kalman neural networks for trajectory prediction.\" In 2020 IEEE Intelligent Vehicles Symposium (IV), pp. 1793-1800. IEEE, 2020.", "37.\tGangireddy, Siva Charan Reddy, Deepak P, Cheng Long, and Tanmoy Chakraborty. \"Unsupervised Fake News Detection: A Graph-based Approach.\" In Proceedings of the 31st ACM Conference on Hypertext and Social Media, pp. 75-83. 2020.", "38.\tWu, Yang, Ada Wai-Chee Fu, Cheng Long, and Zitong Chen. \"LSimRank: Node Similarity in a Labeled Graph.\" In Asia-Pacific Web (APWeb) and Web-Age Information Management (WAIM) Joint International Conference on Web and Big Data, pp. 127-144. Springer, Cham, 2020.", "39.\tWang, Xingyao, Da Yan, Ke Chen, Yancong Deng, Cheng Long, Kunlin Zhang, and Sibo Yan. \"Lane Extraction and Quality Evaluation: A Hough Transform Based Approach.\" In 2020 IEEE Conference on Multimedia Information Processing and Retrieval (MIPR), pp. 7-12. IEEE, 2020.", "40.\tWang, Zheng*, Cheng Long~, Gao Cong, and Ce Ju. \"Effective and efficient sports play retrieval with deep representation learning.\" In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, pp. 499-509. 2019.#", "41.\tChan, Harry Kai-Ho, Cheng Long, Da Yan, and Raymond Chi-Wing Wong. \"Fraction-score: a new support measure for co-location pattern mining.\" In 2019 IEEE 35th international conference on data engineering (ICDE), pp. 1514-1525. IEEE, 2019.#", "42.\tWang, Yansheng, Yongxin Tong, Cheng Long, Pan Xu, Ke Xu, and Weifeng Lv. \"Adaptive dynamic bipartite graph matching: A reinforcement learning approach.\" In 2019 IEEE 35th International Conference on Data Engineering (ICDE), pp. 1478-1489. IEEE, 2019.#", "43.\tYan, Da, James Cheng, Hongzhi Chen, Cheng Long, and Purushotham Bangalore. \"Lightweight Fault Tolerance in Pregel-Like Systems.\" In Proceedings of the 48th International Conference on Parallel Processing, pp. 1-10. 2019.#", "44.\tLin, Weipeng, Ke Wang, Zhilin Zhang, Ada Waichee Fu, Raymond Chi-Wing Wong, and Cheng Long. \"Class Indistinguishability for Outsourcing Equality Conjunction Search.\" In International Conference on Cloud Computing, pp. 253-270. Springer, Cham, 2019.", "45.\tXie, Min, Raymond Chi-Wing Wong, Jian Li, Cheng Long, and Ashwin Lall. \"Efficient k-regret query algorithm with restriction-free bound for any dimensionality.\" In Proceedings of the 2018 ACM SIGMOD international conference on management of data, pp. 959-974. 2018.#", "46.\tWu, Yang, Cheng Long, Ada Wai-Chee Fu, and Zitong Chen. \"Counting Edges with Target Labels in Online Social Networks via Random Walk.\" In International Conference on Extending Database Technology, pp. 217-228. 2018.#", "47.\tDuffy, Carl, P. Deepak, Cheng Long, M. Satish Kumar, Amit Thorat, and Amaresh Dubey. \"Fast Identification of Interesting Spatial Regions with Applications in Human Development Research.\" In International Conference on Database and Expert Systems Applications, pp. 408-416. Springer, Cham, 2018.", "48.\tWei, Victor Junqiu, Raymond Chi-Wing Wong, Cheng Long, and David M. Mount. \"Distance oracle on terrain surface.\" In Proceedings of the 2017 ACM SIGMOD International Conference on Management of Data, pp. 1211-1226. 2017.#", "49.\tChan, Harry Kai-Ho, Cheng Long, and Raymond Chi-Wing Wong. \"Inherent-cost aware collective spatial keyword queries.\" In International Symposium on Spatial and Temporal Databases, pp. 357-375. Springer, Cham, 2017.", "50.\tWu, Yang, Cheng Long, Ada Wai-Chee Fu, and Zitong Chen. \"Counting Edges and Triangles in Online Social Networks via Random Walk.\" In Asia-Pacific Web (APWeb) and Web-Age Information Management (WAIM) Joint Conference on Web and Big Data, pp. 346-361. Springer, Cham, 2017.", "51.\tLong, Cheng, Raymond Chi-Wing Wong, and H. V. Jagadish. \"Trajectory simplification: On minimizing the direction-based error.\" Proceedings of the VLDB Endowment 8, no. 1 (2014): 49-60.#", "52.\tLong, Cheng, Raymond Chi-Wing Wong, Bin Zhang, and Min Xie. \"Hypersphere dominance: an optimal approach.\" In Proceedings of the 2014 ACM SIGMOD International Conference on Management of Data, pp. 111-122. 2014.#", "53.\tChen, Zitong, Yubao Liu, Raymond Chi-Wing Wong, Jiamin Xiong, Ganglin Mai, and Cheng Long. \"Efficient algorithms for optimal location queries in road networks.\" In Proceedings of the 2014 ACM SIGMOD international conference on Management of data, pp. 123-134. 2014.#", "54.\tLan, Jinsong, Cheng Long, Raymond Chi-Wing Wong, Youyang Chen, Yanjie Fu, Danhuai Guo, Shuguang Liu, Yong Ge, Yuanchun Zhou, and Jianhui Li. \"A new framework for traffic anomaly detection.\" In Proceedings of the 2014 SIAM International Conference on Data Mining, pp. 875-883. SIAM, 2014.#", "55.\tLong, Cheng, Raymond Chi-Wing Wong, Philip S. Yu, and Minhao Jiang. \"On optimal worst-case matching.\" In Proceedings of the 2013 ACM SIGMOD International Conference on Management of Data, pp. 845-856. 2013.#", "56.\tLong, Cheng, Raymond Chi-Wing Wong, Ke Wang, and Ada Wai-Chee Fu. \"Collective spatial keyword queries: a distance owner-driven approach.\" In Proceedings of the 2013 ACM SIGMOD International Conference on Management of Data, pp. 689-700. 2013.#", "57.\tLong, Cheng, Raymond Chi-Wing Wong, and H. V. Jagadish. \"Direction-preserving trajectory simplification.\" Proceedings of the VLDB Endowment 6, no. 10 (2013): 949-960.#", "58.\tLong, Cheng, and Raymond Chi-Wing Wong. \"Minimizing seed set for viral marketing.\" In 2011 IEEE 11th International Conference on Data Mining, pp. 427-436. IEEE, 2011.#"], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?hl=en&user=LybJ7ksAAAAJ"}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=LybJ7ksAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00772", "other_websites": ["https://personal.ntu.edu.sg/c.long"]}