{"full_name": "Ong Chin Ann", "designation": "Lecturer, School of Computer Science and Engineering", "name_card": "Ong Chin Ann", "email": "chinann.ong@ntu.edu.sg", "keywords": ["Computer Networks and Communications", "Computer Vision and Sensing"], "biography": "Mr. Ong Chin Ann is a lecturer at the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. He obtained his Bachelor's and Master’s Degree both from the Swinburne University of Technology, Australia in 2009 and 2012, respectively. He was a System Developer at IDS (Asia), Malaysia. He then advances his career as an academician and teaches CompSci courses at various local and foreign universities/schools.His main research interest focuses on computer vision and image processing. Currently, Chin Ann is focusing on Computer Vision research (CNN), specifically on Cross-Domain Adaptation for plant species identification task by fusing herbarium sheets and plant leaves into the same space. He also explores Few Shot Learning strategies to solve long-tail distribution problems which commonly occur for the plant species identification task. In addition to referred international conference and journal paper publications, Chin Ann also served as program/technical committee for international conferences, and reviewer of journals. He was the organizing committee for the 19th SDPS Conference 2014 & the 8th IEEE R10 HTC 2020. Chin Ann is Senior Member of IEEE and Professional Member from the Singapore Computer Society (SCS). He served as an EXCO member for the IEEE Malaysia Sarawak Subsection as well as SCS-Business Analytics Chapter.", "interests": "Computer Vision, Machine Learning", "grants": "Ask Narelle – Your Friendly & Personalized 24-7 Teaching Assistant", "articles": [], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=nonoFcsAAAAJ&hl=en", "web_of_science": "https://www.webofscience.com/wos/author/record/31827840"}, "google_scholar": "https://scholar.google.com/citations?user=nonoFcsAAAAJ&hl=en", "orcid": null, "github": null, "scopus": null, "web_of_science": "https://www.webofscience.com/wos/author/record/31827840", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02123", "other_websites": []}