{"full_name": "Zinovi Rabinovich", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Zinovi Rabinovich", "email": "zinovi@ntu.edu.sg", "keywords": ["Computer Science and Engineering"], "biography": "Zinovi Rabinovich is an Assistant Professor at the School of Computer Science and Engineering of the Nanyang Technological University since February 2017. Prior to that he has spent 5 years as a Senior Algorithms Engineer at the Mobileye Vision Technologies Ltd, a leader in the Advanced Driver Assistant Systems (ADAS) enabling software and hardware, with an outlook at autonomous driving. Between years 2007 and 2012 he was a Postdoctoral Fellow at the University of Sothampton, UK,  as a member of the \"Market-Based Control\" project,  and then a Postdoctoral Researcher in a joint research by the GM Advanced Research Center and the Bar-Ilan University, Israel. His education record includes PhD and MSc in Computer Science, and a joint Computer Science and Mathematics BSc degrees, all from the Hebrew University of Jerusalem, Israel. His research interests include multi-agent systems, artificial intelligence, modelling of manipulative interaction,  perceptual control and emergent behaviour. Common themes of his publications are social behaviour analysis, persuasion, and control via environment response modifications. His research has been presented at leading international conference on Artificial Intelligence, such as  IJCAI, AAAI and AAMAS, included in high ranking journals, such as  Artificial Intelligence, and Robotics and Autonomous Systems, and appeared as a subject of multiple Tutorials for research students.His service to the research community includes participation in program committees of top conferences (IJCAI, AAAI, AAMAS) , workshop advisory boards, and others.", "interests": "Multi-agent Systems, Artificial Intelligence, Modelling of Manipulative Interaction, Perceptual Control and Emergent Behaviour", "grants": "Defendable Social Choice", "articles": [], "books": [], "book_chapters": [], "conferences": ["Jasper Lu, David Zhang, Zinovi Rabinovich, Svetlana Obraztsova and Yevgeniy Vorobeychik. (2019). Proceedings of the 18th International Conference on Autonomous Agents and Multiagent Systems: Manipulating Elections by Selecting Issues. International Conference on Autonomous Agents and Multiagent Systems (AAMAS)."], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00214", "other_websites": ["zinovi.net"]}