{"full_name": "Luke Ong （翁之昊）", "designation": "Distinguished University Professor and Vice President (Research)", "name_card": "Prof Luke Ong （翁之昊）", "email": "luke.ong@ntu.edu.sg", "keywords": ["Mathematics", "Artificial and Augmented Intelligence"], "biography": "Dr Luke Ong is Distinguished University Professor at NTU (since 1 August 2022), and Vice President of Research.Professor Ong holds a B.A. in Mathematics (1984, Triple First), a Postgraduate Diploma in Computer Science (1985, Distinction) from Trinity College, University of Cambridge; and a PhD in Computer Science (1988) from Imperial College, University of London. He joined NTU as a Distinguished University Professor in August 2022, and will take up the appointment of Vice President (Research) in January 2023. Prior to joining NTU, he was Professor of Computer Science at the University of Oxford; Fellow of Merton College, Oxford; Honorary Professor of Computer Science, Bristol University; Shaw Visiting Professor at National University of Singapore; and Prize Research Fellow, Trinity College, Cambridge.", "interests": "Professor Ong's research is broad, ranging across semantics of computation, programming languages, verification, logic and algorithms, and algorithmic game theory. A notable feature of his work is the combination of ideas and methods from semantics and structures, with techniques from automated verification. Professor Ong is one of the leading figures and inventors of game semantics and its applications. His solution (with Hyland) to the PCF Full Abstraction Problem opened up the field of game semantics; and their constructions, known as Hyland-Ong games, have become standard notions in the semantics of programming languages. Professor Ong is also known for his pioneering contribution in the field of verification: his LICS 2006 paper co-initiated higher-order model checking, a new branch of algorithmic verification that combines ideas and methods from semantics with automata-theoretic and allied techniques in automatic verification, with applications to the verification of higher-order programs. His current research interests include computer and cyber security, higher-order logic and satisfiability modulo theories, and probabilistic and differentiable programming. Throughout his long stay in Oxford, Professor Ong has supervised well over 60 doctoral students and postdocs. His contributions to the advancement of computer science have been recognised with leadership positions in major scientific conferences and bodies. Professor Ong was General Chair (2013-2015) of the ACM / IEEE Logic in Computer Science (LiCS), and Founding Vice Chair (2014-2019) of the ACM Special Interest Group in Logic and Computation. He was founding Steering Committee Chair (2015-2018), Formal Structures for Computation and Deduction. He has served as programme chair and on the steering committees of leading scientific meetings, including ACM / IEEE LiCS, European Association of Theoretical Computer Science, European Association of Computer Science Logic, and European Joint Conferences on Theory and Practice of Software. Ong has given numerous keynote presentations and invited lectures, including well over 100 at international research meetings.Professor Ong has received several international and national accolades. He is the joint winner of the ACM / EATCS / EACSL / KGS Alonzo Church Award 2017 for Outstanding Contributions to Logic and Computation. He is also a recipient of the President of the Republic of Singapore Scholarship in 1981, Prime Minister’s Book Prize in 1980, Overseas Merit Scholarship from 1981 to 1984.", "grants": "Bayesian Statistical Probabilistic Programming", "articles": ["Hyland, J. M. E., & Ong, C. -H. L. (2000). On full abstraction for PCF: I, II, and III. Information and Computation, 163(2), 285-408.", "Abramsky, S., & Ong, C. H. L. (1993). Full abstraction in the lazy lambda calculus. Information and Computation, 105(2), 159-267.", "Abramsky, S., Ghica, D. R., Murawski, A. S., & Ong, C. -H. L. (2004). Applying game semantics to compositional software modeling and verification. Lecture Notes In Computer Science (Including subseries Lecture Notes In Artificial Intelligence and Lecture Notes In Bioinformatics), 2988, 421-435.", "Ong, C. -H. L., & Kobayashi, N. (2011). Complexity of Model Checking Recursion Schemes for Fragments of the Modal Mu-Calculus. Logical Methods in Computer Science, 7(4), 1–23.", "Murawski, A. S., & Ong, C. -H. L. (2004). On an interpretation of safe recursion in light affine logic. Theoretical Computer Science, 318(1-2), 197-223.", "Ong, C. -H. L., & Blum, W. (2009). The safe lambda calculus. Logical Methods in Computer Science, 5(1), 1-38.", "Cathcart Burn, T., Ong, C. H. L., & Ramsay, S. J. (2018). Higher-order constrained horn clauses for verification. Proceedings of the ACM on Programming Languages, 2(POPL), 1-28.", "Ong, C. H. L., & Hague, M. (2008). Symbolic backwards-reachability analysis for higher-order pushdown systems. Logical Methods in Computer Science, 4(4).", "Ghica, D. R., Murawski, A. S., & Ong, C. H. (2004). Syntactic control of concurrency. Lecture Notes In Computer Science (Including subseries Lecture Notes In Artificial Intelligence and Lecture Notes In Bioinformatics), 3142, 683-694.", "Murawski, A. S., & Ong, C. H. L. (2006). Fast verification of MLL proof nets via IMLL. ACM Transactions on Computational Logic, 7(3), 473-498."], "books": [], "book_chapters": [], "conferences": ["Ong, C. -H. L. (2006). On model-checking trees generated by higher-order recursion schemes. 21st Annual IEEE Symposium on Logic in Computer Science  (LICS '06), 81-90.", "Kobayashi, N., & Ong, C. -H. L. (2009). A type system equivalent to the modal Mu-calculus model checking of higher-order recursion schemes. 2009 24th Annual IEEE Symposium on Logic in Computer Science, 179-188.", "Hague, M., Murawski, A. S., Ong, C. -H. L., & Serre, O. (2008). Collapsible pushdown automata and recursion schemes. LICS '08: Proceedings of the 2008 23rd Annual IEEE Symposium on Logic in Computer Science, 452-461.", "Ong, C. -H. L., & Stewart, C. A. (1997). Curry-Howard foundation for functional computation with control. POPL '97: Proceedings of the 24th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, 215-227.", "Abramsky, S., Ghica, D. R., Murawski, A. S., Ong, C. -H. L., & Stark, I. D. B. (2004). Nominal games and full abstraction for the nu-calculus. Proceedings of the 19th Annual IEEE Symposium on Logic In Computer Science, 150-159.", "Ong, C. -H. L., & Ramsay, S. J. (2010). Verifying higher-order functional programs with pattern-matching algebraic data types. POPL '11: Proceedings of the 38th Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, 46(1), 587-598.", "Broadbent, C. H., Carayol, A., Ong, C. -H. L., & Serre, O. (2010). Recursion schemes and logical reflection. 2010 25th Annual IEEE Symposium on Logic in Computer Science, 120-129.", "D’Osualdo, E., Kochems, J., & Ong, C. -H. L. (2013). Automatic verification of Erlang-style concurrency. Lecture Notes In Computer Science (Including subseries Lecture Notes In Artificial Intelligence and Lecture Notes In Bioinformatics), 454-476.", "Basu, A., Ong, C. H. L., Rasala, A., Shepherd, F. B., & Wilfong, G. (2002). Route oscillations in I-BGP with route reflection. ACM SIGCOMM Computer Communication Review, 32(4), 235-247.", "Ramsay, S. J., Neatherway, R. P., & Ong, C. H. L. (2014). A type-directed abstraction refinement approach to higher-order model checking. POPL '14: Proceedings of the 41st ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, 61-72.", "Click  here for more publications.", "Kenyon-Roberts, A., & Ong, C. -H. L. (2021). Supermartingales, ranking functions and probabilistic lambda calculus. 2021 36th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS), 1-13.", "Mak, C., Ong, C. -H. L., Paquet, H., & Wagner, D. (2021). Densities of almost surely terminating probabilistic programs are differentiable almost everywhere. 30th European Symposium on Programming, 432-461.", "Ong, C. -H. L., & Wagner, D. (2019). HoCHC: A refutationally complete and semantically invariant system of higher-order logic modulo theories. 2019 34th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS), 1-14.", "Morel, R., Cropper, A., & Ong, C. -H. L. (2019). Typed meta-interpretive learning of logic programs. 16th European Conference on Logics in Artificial Intelligence, 198-213.", "Alvarez-Picallo, M., & Ong, C. -H. L. (2019). Change actions: models of generalised differentiation. 22nd International Conference on Foundations of Software Science and Computation Structures, 45-61.", "Alvarez-Picallo, M., Eyers-Taylor, A., Jones, M. P., & Ong, C. -H. L. (2019). Fixing incremental computation: Derivatives of Fixpoints, and the Recursive Semantics of Datalog. 28th European Symposium on Programming, 525-552.", "Tsukada, T., Asada, K., & Ong, C. -H. L. (2018). Species, profunctors and taylor expansion weighted by SMCC: A unified framework for modelling nondeterministic, probabilistic and quantum programs. Proceedings of the 33rd Annual ACM/IEEE Symposium on Logic in Computer Science, 889-898.", "Duan, Z., Tian, C., Duan, Z., & Ong, C. -H. L. (2018). Interpchecker: Reducing state space via interpolations. 24th International Conference on Tools and Algorithms for the Construction and Analysis of Systems, 432-436.", "Tian, C., Duan, Z., Duan, Z., & Ong, C. -H. L. (2017). More effective interpolations in software model checking. 32nd IEEE/ACM International Conference on Automated Software Engineering, ASE, 2017.", "D’Osualdo, E., Ong, L., & Tiu, A. (2017). Deciding secrecy of security protocols for an unbounded number of sessions: The case of depth-bounded processes. 2017 IEEE 30th Computer Security Foundations Symposium (CSF), 464-480."], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02044", "other_websites": ["https://personal.ntu.edu.sg/luke.ong/index.html"]}