{"full_name": "Pan Xingang", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Pan Xingang", "email": "xingang.pan@ntu.edu.sg", "keywords": [], "biography": "Xingang Pan is an Assistant Professor at the School of Computer Science and Engineering, Nanyang Technological University, Singapore. Prior to joining NTU, he was a postdoc researcher at Max Planck Institute for Informatics, advised by Prof. Christian Theobalt. He received his Ph.D. degree at MMLab of The Chinese University of Hong Kong in 2021, supervised by Prof. Xiaoou Tang. He obtained his Bachelor’s degree from Tsinghua University in 2016. His research interests include computer vision, machine learning, and computer graphics, with a focus on generative AI and neural rendering. He has published over 20 papers on top-tier conferences and journals in relevant fields, including CVPR, ICCV, ECCV, SIGGRAPH, ICLR, NeurIPS, ICML, AAAI, T-PAMI, etc. He received the Hong Kong PhD Fellowship Scheme (HKFPS) award from the Hong Kong government. He won the WAD Drivable Area Segmentation Challenge in 2018 and the Tusimple Lane Detection Challenge in 2017. His main works include DragGAN, GAN2Shape, and Deep Generative Prior.", "interests": "Generative AI, Computer Vision, Machine Learning, Computer Graphics", "grants": "AI-Human Collaborative High-Quality 3D Content Generation", "articles": ["Xiangli, Y., Xu, L., Pan, X., Zhao, N., Rao, A., Theobalt, C., ... & Lin, D. (2022). BungeeNeRF: Progressive Neural Radiance Field for Extreme Multiscale Scene Rendering. In European Conference on Computer Vision (ECCV).", "Pan, X., Xu, X., Loy, C. C., Theobalt, C., & Dai, B. (2021). A Shading-Guided Generative Implicit Model for Shape-Accurate 3D-Aware Image Synthesis. Advances in Neural Information Processing Systems (NeurIPS).", "Pan, X., Dai, B., Liu, Z., Loy, C. C., & Luo, P. (2021). Do 2D GANs Know 3D Shape? Unsupervised 3d Shape Reconstruction from 2D Image GANs. International Conference on Learning Representations (ICLR).", "Pan, X., Zhan, X., Dai, B., Lin, D., Loy, C. C., & Luo, P. (2021). Exploiting Deep Generative Prior for Versatile Image Restoration and Manipulation. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI).", "Pan, X., Zhan, X., Dai, B., Lin, D., Loy, C. C., & Luo, P. (2020). Exploiting Deep Generative Prior for Versatile Image Restoration and Manipulation. In European Conference on Computer Vision (ECCV)."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=uo0q9WgAAAAJ", "orcid": null, "github": "https://xingangpan.github.io/", "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02182", "other_websites": []}