{"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:BUYA1_V_uYcC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/1498915.1498916", "authors": ["Mo Li", "Yunhao Liu"], "publication_date": "2009/3/1", "journal": "ACM Transactions on Sensor Networks (TOSN)", "volume": "5", "issue": "2", "pages": "10", "publisher": "ACM", "description": "Environment monitoring in coal mines is an important application of wireless sensor networks (WSNs) that has commercial potential. We discuss the design of a Structure-Aware Self-Adaptive WSN system, SASA. By regulating the mesh sensor network deployment and formulating a collaborative mechanism based on a regular beacon strategy, SASA is able to rapidly detect structure variations caused by underground collapses. We further develop a sound and robust mechanism for efficiently handling queries under instable circumstances. A prototype is deployed with 27 mica2 motes in a real coal mine. We present our implementation experiences as well as the experimental results. To better evaluate the scalability and reliability of SASA, we also conduct a large-scale trace-driven simulation based on real data collected from the experiments.", "total_citations": {"2007": 14, "2008": 51, "2009": 63, "2010": 77, "2011": 88, "2012": 80, "2013": 93, "2014": 82, "2015": 63, "2016": 59, "2017": 99, "2018": 112, "2019": 79, "2020": 41, "2021": 29, "2022": 23, "2023": 21}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:oNZyr7d5Mn4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2639108.2639111", "authors": ["Lei Yang", "Yekui Chen", "Xiang-Yang Li", "Chaowei Xiao", "Mo Li", "Yunhao Liu"], "publication_date": "2014/9/7", "book": "Proceedings of the 20th annual international conference on Mobile computing and networking", "pages": "237-248", "description": "In many applications, we have to identify an object and then locate the object to within high precision (centimeter- or millimeter-level). Legacy systems that can provide such accuracy are either expensive or suffering from performance degradation resulting from various impacts, e.g., occlusion for computer vision based approaches. In this work, we present an RFID-based system, Tagoram, for object localization and tracking using COTS RFID tags and readers. Tracking mobile RFID tags in real time has been a daunting task, especially challenging for achieving high precision. Our system achieves these three goals by leveraging the phase value of the backscattered signal, provided by the COTS RFID readers, to estimate the location of the object. In Tagoram, we exploit the tag's mobility to build a virtual antenna array by using readings from a few physical antennas over a time window. To illustrate the basic idea of …", "total_citations": {"2014": 3, "2015": 42, "2016": 73, "2017": 104, "2018": 106, "2019": 119, "2020": 106, "2021": 82, "2022": 91, "2023": 50}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:JQOojiI6XY0C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2789168.2790124", "authors": ["Yaxiong Xie", "Zhenjiang Li", "Mo Li"], "publication_date": "2015/9/7", "conference": "Proceedings of the 21st Annual International Conference on Mobile Computing and Networking", "pages": "53-64", "publisher": "ACM", "description": "Power delay profiles characterize multipath channel features, which are widely used in motion- or localization-based applications. Recent studies show that the power delay profile may be derived from the CSI traces collected from commodity WiFi devices, but the performance is limited by two dominating factors. The resolution of the derived power delay profile is determined by the channel bandwidth, which is however limited on commodity WiFi. The collected CSI reflects the signal distortions due to both the channel attenuation and the hardware imperfection. A direct derivation of power delay profiles using raw CSI measures, as has been done in the literature, results in significant inaccuracy. In this paper, we present Splicer, a software-based system that derives high-resolution power delay profiles by splicing the CSI measurements from multiple WiFi frequency bands. We propose a set of key techniques to separate the …", "total_citations": {"2015": 3, "2016": 21, "2017": 48, "2018": 101, "2019": 124, "2020": 118, "2021": 116, "2022": 144, "2023": 95}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:p2g8aNsByqUC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2307636.2307671", "authors": ["Pengfei Zhou", "Yuanqing Zheng", "Mo Li"], "publication_date": "2012/6/25", "conference": "Proceedings of the 10th international conference on Mobile systems, applications, and services", "pages": "379-392", "publisher": "ACM", "description": "The bus arrival time is primary information to most city transport travelers. Excessively long waiting time at bus stops often discourages the travelers and makes them reluctant to take buses. In this paper, we present a bus arrival time prediction system based on bus passengers' participatory sensing. With commodity mobile phones, the bus passengers' surrounding environmental context is effectively collected and utilized to estimate the bus traveling routes and predict bus arrival time at various bus stops. The proposed system solely relies on the collaborative effort of the participating users and is independent from the bus operating companies, so it can be easily adopted to support universal bus service systems without requesting support from particular bus operating companies. Instead of referring to GPS enabled location information, we resolve to more generally available and energy efficient sensing resources …", "total_citations": {"2011": 4, "2012": 6, "2013": 26, "2014": 50, "2015": 94, "2016": 74, "2017": 85, "2018": 82, "2019": 69, "2020": 60, "2021": 43, "2022": 34, "2023": 18}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:M7yex6snE4oC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6244792/", "authors": ["Yunhao Liu", "Yuan He", "Mo Li", "Jiliang Wang", "Kebin Liu", "Xiangyang Li"], "publication_date": "2012/7/19", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "24", "issue": "10", "pages": "1983-1993", "publisher": "IEEE", "description": "Sensor networks are deemed suitable for large-scale deployments in the wild for a variety of applications. In spite of the remarkable efforts the community put to build the sensor systems, an essential question still remains unclear at the system level, motivating us to explore the answer from a point of real-world deployment view. Does the wireless sensor network really scale? We present findings from a large-scale operating sensor network system, GreenOrbs, with up to 330 nodes deployed in the forest. We instrument such an operating network throughout the protocol stack and present observations across layers in the network. Based on our findings from the system measurement, we propose and make initial efforts to validate three conjectures that give potential guidelines for future designs of large-scale sensor networks. 1) A small portion of nodes bottlenecks the entire network, and most of the existing network …", "total_citations": {"2011": 14, "2012": 31, "2013": 52, "2014": 67, "2015": 75, "2016": 61, "2017": 52, "2018": 43, "2019": 29, "2020": 14, "2021": 12, "2022": 9, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:u5HHmVD_uO8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/1287853.1287861", "authors": ["Mo Li", "Yunhao Liu"], "publication_date": "2007/9/9", "conference": "Proceedings of the 13th annual ACM international conference on Mobile computing and networking", "pages": "51-62", "publisher": "ACM", "description": "Sensor positioning is a crucial part of many location-dependent applications that utilize wireless sensor networks (WSNs). Current localization approaches can be divided into two groups: range-based and range-free. Due to the high costs and critical as-sumptions, the range-based schemes are often impractical for WSNs. The existing range-free schemes, on the other hand, suffer from poor accuracy and low scalability. Without the help of a large number of uniformly deployed seed nodes, those schemes fail in anisotropic WSNs with possible holes. To address this issue, we propose the Rendered Path (REP) protocol. To the best of our knowledge, REP is the only range-free protocol for locating sen-sors with constant number of seeds in anisotropic sensor net-works.", "total_citations": {"2007": 7, "2008": 33, "2009": 46, "2010": 48, "2011": 44, "2012": 49, "2013": 44, "2014": 39, "2015": 37, "2016": 30, "2017": 15, "2018": 11, "2019": 11, "2020": 9, "2021": 5, "2022": 11, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:k8Z6L05lTy4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6570755/", "authors": ["Mo Li", "Zhenjiang Li", "Athanasios V Vasilakos"], "publication_date": "2013/7/29", "journal": "Proceedings of the IEEE", "volume": "101", "issue": "12", "pages": "2538-2557", "publisher": "IEEE", "description": "The wireless sensor network (WSN) technology spawns a surge of unforeseen applications. The diversity of these emerging applications represents the great success of this technology. A fundamental performance benchmark of such applications is topology control, which characterizes how well a sensing field is monitored and how well each pair of sensors is mutually connected in WSNs. This paper provides an overview of topology control techniques. We classify existing topology control techniques into two categories: network coverage and network connectivity. For each category, a surge of existing protocols and techniques are presented with the focus on blanket coverage, barrier coverage, sweep coverage, power management, and power control, five rising aspects that attract significant research attention in recent years. In this survey, we emphasize the basic principles of topology control to understand the …", "total_citations": {"2012": 3, "2013": 2, "2014": 29, "2015": 63, "2016": 92, "2017": 62, "2018": 44, "2019": 55, "2020": 32, "2021": 15, "2022": 13, "2023": 11}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:WZBGuue-350C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/1460412.1460424", "authors": ["Yunhao Liu", "Kebin Liu", "Mo Li"], "publication_date": "2009/12/18", "journal": "IEEE/ACM Transactions on networking", "volume": "18", "issue": "4", "pages": "1132-1144", "publisher": "IEEE", "description": "Network diagnosis, an essential research topic for traditional networking systems, has not received much attention for wireless sensor networks. Existing sensor debugging tools like sympathy or EmStar rely heavily on an add-in protocol that generates and reports a large amount of status information from individual sen-sor nodes, introducing network overhead to a resource constrained and usually traffic sensitive sensor network. We report in this study our initial attempt at providing a light-weight network diag-nosis mechanism for sensor networks. We propose PAD, a prob-abilistic diagnosis approach for inferring the root causes of ab-normal phenomena. PAD employs a packet marking algorithm for efficiently constructing and dynamically maintaining the inference model. Our approach does not incur additional traffic overhead for collecting desired information. Instead, we introduce a prob-abilistic inference model …", "total_citations": {"2007": 2, "2008": 1, "2009": 12, "2010": 32, "2011": 41, "2012": 43, "2013": 44, "2014": 36, "2015": 39, "2016": 24, "2017": 18, "2018": 17, "2019": 16, "2020": 5, "2021": 8, "2022": 12, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:Z5m8FVwuT1cC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2659466", "authors": ["Mo Li", "Pengfei Zhou", "Yuanqing Zheng", "Zhenjiang Li", "Guobin Shen"], "publication_date": "2015/3/2", "journal": "ACM Transactions on Sensor Networks (TOSN)", "volume": "11", "issue": "2", "pages": "28", "publisher": "ACM", "description": "The location and context switching, especially the indoor/outdoor switching, provides essential and primitive information for upper-layer mobile applications. In this article, we present IODetector: a lightweight sensing service that runs on the mobile phone and detects the indoor/outdoor environment in a fast, accurate, and efficient manner. Constrained by the energy budget, IODetector primarily leverages lightweight sensing resources, such as light sensors, magnetism sensors, and cell tower signals. For universal applicability, IODetector assumes no prior knowledge (e.g., fingerprints) of the environment and uses only on-board sensors common to mainstream mobile phones. Being a generic and lightweight service component, IODetector greatly benefits many location-based and context-aware applications. We prototype the IODetector on Android mobile phones and evaluate the system comprehensively with data …", "total_citations": {"2013": 9, "2014": 36, "2015": 39, "2016": 36, "2017": 34, "2018": 43, "2019": 43, "2020": 34, "2021": 20, "2022": 24, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:gsN89kCJA0AC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3293534", "authors": ["Jansen C Liando", "Amalinda Gamage", "Agustinus W Tengourtius", "Mo Li"], "publication_date": "2019/2/21", "journal": "ACM Transactions on Sensor Networks (TOSN)", "volume": "15", "issue": "2", "pages": "1-35", "publisher": "ACM", "description": "Long Range (LoRa) is a Low-power Wide-area Network technology designed for the Internet of Things. In recent years, it has gained significant momentum among industrial and research communities. Patented by Semtech, LoRa makes use of chirp spread spectrum modulation to deliver data with promises of long battery life, far-reaching communication distances, and a high node density at the cost of data rate. In this article, we conduct a series of experiments to verify the claims made by Semtech on LoRa technology. Our results show that LoRa is capable of communicating over 10km under line-of-sight environments. However, under non-line-of-sight environments, LoRa’s performance is severely affected by obstructions such as buildings and vegetations. Moreover, the promise of prolonged battery life requires extreme tuning of parameters. Last, a LoRa gateway supports up to 6,000 nodes with PRR …", "total_citations": {"2019": 18, "2020": 58, "2021": 88, "2022": 70, "2023": 55}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:TIZ-Mc8IlK0C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3300061.3300133", "authors": ["Yaxiong Xie", "Jie Xiong", "Mo Li", "Kyle Jamieson"], "publication_date": "2019/5/17", "conference": "The 25th Annual International Conference on Mobile Computing and Networking", "pages": "1-16", "publisher": "ACM", "description": "Wi-Fi localization and tracking face accuracy limitations dictated by antenna count (for angle-of-arrival methods) and frequency bandwidth (for time-of-arrival methods). This paper presents mD-Track, a device-free Wi-Fi tracking system capable of jointly fusing information from as many dimensions as possible to overcome the resolution limit of each individual dimension. Through a novel path separation algorithm, mD-Track can resolve multipath at a much finer-grained resolution, isolating signals reflected off targets of interest. mD-Track can localize human passively at a high accuracy with just a single Wi-Fi transceiver pair. mD-Track also introduces novel methods to greatly streamline its estimation algorithms, achieving real-time operation. We implement mD-Track on both WARP and cheap off-the-shelf commodity Wi-Fi hardware, and evaluate its performance in different indoor environments.", "total_citations": {"2019": 12, "2020": 45, "2021": 62, "2022": 76, "2023": 46}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:eMMeJKvmdy0C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2639108.2639124", "authors": ["Yuanqing Zheng", "Guobin Shen", "Liqun Li", "Chunshui Zhao", "Mo Li", "Feng Zhao"], "publication_date": "2017/10", "journal": "IEEE/ACM Transactions on Networking", "volume": "25", "issue": "5", "pages": "2655-2669", "publisher": "IEEE", "description": "We present Travi-Navi - a vision-guided navigation system that enables a self-motivated user to easily bootstrap and deploy indoor navigation services, without comprehensive indoor localization systems or even the availability of floor maps. Travi-Navi records high quality images during the course of a guider's walk on the navigation paths, collects a rich set of sensor readings, and packs them into a navigation trace. The followers track the navigation trace, get prompt visual instructions and image tips, and receive alerts when they deviate from the correct paths. Travi-Navi also finds the most efficient shortcuts whenever possible. We encounter and solve several challenges, including robust tracking, shortcut identification, and high quality image capture while walking. We implement Travi-Navi and conduct extensive experiments. The evaluation results show that Travi-Navi can track and navigate users with timely …", "total_citations": {"2014": 4, "2015": 14, "2016": 23, "2017": 36, "2018": 43, "2019": 33, "2020": 24, "2021": 20, "2022": 13, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:AXPGKjj_ei8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2639108.2639110", "authors": ["Pengfei Zhou", "Mo Li", "Guobin Shen"], "publication_date": "2014/9/7", "conference": "Proceedings of the 20th annual international conference on Mobile computing and networking", "pages": "605-616", "publisher": "ACM", "description": "The phone attitude is an essential input to many smartphone applications, which has been known very difficult to accurately estimate especially over long time. Based on in-depth understanding of the nature of the MEMS gyroscope and other IMU sensors commonly equipped on smartphones, we propose A3 - an accurate and automatic attitude detector for commodity smartphones. A3 primarily leverages the gyroscope, but intelligently incorporates the accelerometer and magnetometer to select the best sensing capabilities and derive the most accurate attitude estimation. Extensive experimental evaluation on various types of Android smartphones confirms the outstanding performance of A3. Compared with other existing solutions, A3 provides 3x improvement on the accuracy of attitude estimation.", "total_citations": {"2014": 2, "2015": 13, "2016": 18, "2017": 38, "2018": 34, "2019": 35, "2020": 23, "2021": 19, "2022": 20, "2023": 8}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:4MWp96NkSFoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6021963/", "authors": ["Mo Li", "Weifang Cheng", "Kebin Liu", "Yuan He", "Xiangyang Li", "Xiangke Liao"], "publication_date": "2011/11", "journal": "IEEE Transactions on Mobile Computing", "volume": "10", "issue": "11", "pages": "1534-1545", "publisher": "IEEE", "description": "Many efforts have been made for addressing coverage problems in sensor networks. They fall into two categories, full coverage and barrier coverage, featured as static coverage. In this work, we study a new coverage scenario, sweep coverage, which differs with the previous static coverage. In sweep coverage, we only need to monitor certain points of interest (POIs) periodically so the coverage at each POI is time-variant, and thus we are able to utilize a small number of mobile sensors to achieve sweep coverage among a much larger number of POIs. We investigate the definitions and model for sweep coverage. Given a set of POIs and their sweep period requirements, we prove that determining the minimum number of required sensors (min-sensor sweep-coverage problem) is NP-hard, and it cannot be approximated within a factor of 2. We propose a centralized algorithm with constant approximation ratio 3 for …", "total_citations": {"2011": 1, "2012": 10, "2013": 17, "2014": 24, "2015": 19, "2016": 14, "2017": 13, "2018": 12, "2019": 14, "2020": 11, "2021": 9, "2022": 8, "2023": 8}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:2osOgNQ5qMEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4670318/", "authors": ["Mo Li", "Yunhao Liu", "Lei Chen"], "publication_date": "2008/12", "journal": "Knowledge and Data Engineering, IEEE Transactions on", "volume": "20", "issue": "12", "pages": "1699-1711", "publisher": "IEEE", "description": "Event detection is a crucial task for wireless sensor network applications, especially environment monitoring. Existing approaches for event detection are mainly based on some predefined threshold values, and thus are often inaccurate and incapable of capturing complex events. For example, in coal mine monitoring scenarios, gas leakage or water osmosis can hardly be described by the overrun of specified attribute thresholds, but some complex pattern in the full-scale view of the environmental data. To address this issue, we propose a non-threshold based approach for the real 3D sensor monitoring environment. We employ energy-efficient methods to collect a time series of data maps from the sensor network and detect complex events through matching the gathered data to spatio-temporal data patterns. Finally, we conduct trace driven simulations to prove the efficacy and efficiency of this approach on …", "total_citations": {"2007": 2, "2008": 11, "2009": 13, "2010": 14, "2011": 20, "2012": 18, "2013": 15, "2014": 21, "2015": 14, "2016": 10, "2017": 5, "2018": 3, "2019": 5, "2020": 0, "2021": 1, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:9yKSN-GCB0IC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5156503/", "authors": ["Mo Li", "Yunhao Liu"], "publication_date": "2010/5", "journal": "Knowledge and Data Engineering, IEEE Transactions on", "volume": "22", "issue": "5", "pages": "699-710", "publisher": "IEEE", "description": "Contour mapping is a crucial part of many wireless sensor network applications. Many efforts have been made to avoid collecting data from all the sensors in the network and producing maps at the sink, which is proven to be inefficient. The existing approaches (often aggregation based), however, suffer from heavy transmission traffic and incur large computational overheads on each sensor node. We propose Iso-Map, an energy-efficient protocol for contour mapping, which builds contour maps based solely on the reports collected from intelligently selected “isoline nodes” in wireless sensor networks. Iso-Map achieves high-quality contour mapping while significantly reducing the generated traffic from O(n) to O(\\sqrt n), where n is the total number of sensor nodes in the field. The pernode computation overhead is also restrained as a constant. We conduct comprehensive trace-driven simulations to verify this protocol …", "total_citations": {"2008": 14, "2009": 17, "2010": 18, "2011": 18, "2012": 12, "2013": 19, "2014": 13, "2015": 13, "2016": 7, "2017": 4, "2018": 0, "2019": 1, "2020": 3, "2021": 2, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:SeFeTyx0c_EC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6279478/", "authors": ["Yuanqing Zheng", "Mo Li"], "publication_date": "2012/8/22", "journal": "IEEE/ACM Transactions On Networking", "volume": "21", "issue": "3", "pages": "924-934", "publisher": "IEEE", "description": "Fast searching a particular subset in a large number of products attached with radio frequency identification (RFID) tags is of practical importance for a variety of applications, but not yet thoroughly investigated. Since the cardinality of the products can be extremely large, collecting the tag information directly from each of those tags could be highly inefficient. To address the tag searching efficiency in large-scale RFID systems, this paper proposes several algorithms to meet the stringent delay requirement in developing fast tag searching protocols. We formally formulate the tag searching problem in large-scale RFID systems. We propose utilizing compact approximators to efficiently aggregate a large volume of RFID tag information and exchange such information with a two-phase approximation protocol. By estimating the intersection of two compact approximators, the proposed two-phase compact approximator …", "total_citations": {"2011": 1, "2012": 1, "2013": 14, "2014": 22, "2015": 26, "2016": 19, "2017": 18, "2018": 10, "2019": 15, "2020": 9, "2021": 6, "2022": 4, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:qjMakFHDy7sC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4408329/", "authors": ["Zheng Yang", "Mo Li", "Yunhao Liu"], "publication_date": "2007/12/3", "conference": "Real-Time Systems Symposium, 2007. RTSS 2007. 28th IEEE International", "pages": "469-478", "publisher": "IEEE", "description": "Sea depth monitoring is a critical task to ensure the safe operation of harbors. Traditional schemes largely rely on labor-intensive work and expensive hardware. This study explores the possibility of deploying networked sensors on the surface of sea, measuring and reporting sea depth of given areas. We propose a restricted floating sensors (RFS) model, in which sensor nodes are anchored to the sea bottom, floating within a restricted area. Distinguished from traditional stationary or mobile sensor networks, the RFS network consists of sensor nodes with restricted mobility. We construct the network model and elaborate the corresponding localization problem. We show that by locating such RFS sensors, the sea depth can be estimated without the help of any extra ranging devices. A prototype system with 25 Telos sensor nodes is deployed to validate this design. We also examine the efficiency and scalability of this …", "total_citations": {"2006": 1, "2007": 3, "2008": 20, "2009": 14, "2010": 14, "2011": 11, "2012": 4, "2013": 16, "2014": 11, "2015": 4, "2016": 7, "2017": 3, "2018": 13, "2019": 1, "2020": 4, "2021": 4, "2022": 3, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:p__nRnzSRKYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8425299/", "authors": ["Zhidan Liu", "Zhenjiang Li", "Kaishun Wu", "Mo Li"], "publication_date": "2018/7", "journal": "IEEE Network", "volume": "32", "issue": "4", "pages": "40-46", "publisher": "IEEE", "description": "Traffic information is of great importance for urban cities, and accurate prediction of urban traffics has been pursued for many years. Urban traffic prediction aims to exploit sophisticated models to capture hidden traffic characteristics from substantial historical mobility data and then makes use of trained models to predict traffic conditions in the future. Due to the powerful capabilities of representation learning and feature extraction, emerging deep learning becomes a potent alternative for such traffic modeling. In this article, we envision the potential and broard usage of deep learning in predictions of various traffic indicators, for example, traffic speed, traffic flow, and accident risk. In addition, we summarize and analyze some early attempts that have achieved notable performance. By discussing these existing advances, we propose two future research directions to improve the accuracy and efficiency of urban traffic …", "total_citations": {"2018": 1, "2019": 18, "2020": 36, "2021": 36, "2022": 29, "2023": 18}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&citation_for_view=kjiwE6IAAAAJ:uLbwQdceFCQC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2789168.2790101", "authors": ["Jiajue Ou", "Mo Li", "Yuanqing Zheng"], "publication_date": "2017/1/16", "journal": "IEEE/ACM Transactions on Networking", "publisher": "IEEE", "description": "Current commodity RFID systems incur high communication overhead due to severe tag-to-tag collisions. Although some recent works have been proposed to support parallel decoding for concurrent tag transmissions, they require accurate channel measurements, tight tag synchronization, or modifications to standard RFID tag operations. In this paper, we present BiGroup, a novel RFID communication paradigm that allows the reader to decode the collision from multiple COTS (commodity-off-the-shelf) RFID tags in one communication round. In BiGroup, COTS tags can directly join ongoing communication sessions and get decoded in parallel. The collision resolution intelligence is solely put at the reader side. To this end, BiGroup examines the tag collisions at RFID physical layer from constellation domain as well as time domain, exploits the under-utilized channel capacity due to low tag transmission rate, and …", "total_citations": {"2015": 1, "2016": 5, "2017": 15, "2018": 18, "2019": 21, "2020": 27, "2021": 17, "2022": 19, "2023": 9}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:hqOjcs7Dif8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6072210/", "authors": ["Yuanqing Zheng", "Mo Li"], "publication_date": "2011/11/8", "journal": "IEEE Transactions on Mobile Computing", "volume": "11", "issue": "11", "pages": "1763-1774", "publisher": "IEEE", "description": "Estimating the number of RFID tags in the region of interest is an important task in many RFID applications. In this paper, we propose a novel approach for efficiently estimating the approximate number of RFID tags. Compared with existing approaches, the proposed Probabilistic Estimating Tree (PET) protocol achieves {\\cal O}(\\log \\log n) estimation efficiency, which remarkably reduces the estimation time while meeting the accuracy requirement. PET also largely reduces the computation and memory overhead at RFID tags. As a result, we are able to apply PET with passive RFID tags and provide scalable and inexpensive solutions for large-scale RFID systems. We validate the efficacy and effectiveness of PET through theoretical analysis as well as extensive simulations. Our results suggest that PET outperforms existing approaches in terms of estimation accuracy, efficiency, and overhead.", "total_citations": {"2012": 7, "2013": 16, "2014": 22, "2015": 21, "2016": 16, "2017": 12, "2018": 12, "2019": 10, "2020": 5, "2021": 1, "2022": 2, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:roLk4NBRz8UC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5935040/", "authors": ["Zhenjiang Li", "Mo Li", "Jiliang Wang", "Zhichao Cao"], "publication_date": "2011/4/10", "conference": "INFOCOM, 2011 Proceedings IEEE", "pages": "2246-2254", "publisher": "IEEE", "description": "We study the ubiquitous data collection for mobile users in wireless sensor networks. People with handheld devices can easily interact with the network and collect data. We propose a novel approach for mobile users to collect the network-wide data. The routing structure of data collection is additively updated with the movement of the mobile user. With this approach, we only perform a local modification to update the routing structure while the routing performance is bounded and controlled compared to the optimal performance. The proposed protocol is easy to implement. Our analysis shows that the proposed approach is scalable in maintenance overheads, performs efficiently in the routing performance, and provides continuous data delivery during the user movement. We implement the proposed protocol in a prototype system and test its feasibility and applicability by a 49-node testbed. We further conduct …", "total_citations": {"2010": 1, "2011": 2, "2012": 19, "2013": 19, "2014": 20, "2015": 12, "2016": 17, "2017": 12, "2018": 6, "2019": 7, "2020": 2, "2021": 5, "2022": 3, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ML0RJ9NH7IQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4536245/", "authors": ["Weifang Cheng", "Mo Li", "Kebin Liu", "Yunhao Liu", "Xiangyang Li", "Xiangke Liao"], "publication_date": "2008/4/14", "conference": "Parallel and Distributed Processing, 2008. IPDPS 2008. IEEE International Symposium on", "pages": "1-9", "publisher": "IEEE", "description": "Many efforts have been made for addressing coverage problems in sensor networks. They fall into two categories, full coverage and barrier coverage, featured as static coverage. In this work, we study a new coverage scenario, sweep coverage, which differs with the previous static coverage. In sweep coverage, we only need to monitor certain points of interest (POIs) periodically so the coverage at each POI is time-variant, and thus we are able to utilize a small number of mobile sensors to achieve sweep coverage among a much larger number of POIs. We investigate the definitions and model for sweep coverage. Given a set of POIs and their sweep period requirements, we prove that determining the minimum number of required sensors (min-sensor sweep-coverage problem) is NP-hard, and it cannot be approximated within a factor of 2. We propose a centralized algorithm with constant approximation ratio 2 …", "total_citations": {"2009": 7, "2010": 12, "2011": 11, "2012": 10, "2013": 10, "2014": 7, "2015": 9, "2016": 11, "2017": 7, "2018": 7, "2019": 8, "2020": 7, "2021": 7, "2022": 5, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:UeHWp8X0CEIC": {"external_link": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=ccebac18fd99ae8a3c1667ccbc79d523d742c674", "authors": ["Mo Li", "Baijian Yang"], "publication_date": "2006/6/26", "journal": "Proceedings of the International Conference on Wireless Networks", "description": "Topology issues have received more and more attentions in Wireless Sensor Networks (WSN). While WSN applications are normally optimized by the given underlying network topology, another trend is to optimize WSN by means of topology control. A number of approaches have been invested in this area, such as topology directed routing, cooperating schemes, sensor coverage based topology control and network connectivity based topology control. Most of the schemes have proven to be able to provide a better network monitoring and communication performance with prolonged system lifetime. In this survey paper, we provide a full view of the studies in this area. By summarizing previous achievements and analyzing existed problems, we also point out possible research directions for future work", "total_citations": {"2007": 3, "2008": 5, "2009": 16, "2010": 9, "2011": 17, "2012": 8, "2013": 9, "2014": 8, "2015": 3, "2016": 7, "2017": 8, "2018": 3, "2019": 6, "2020": 4, "2021": 5, "2022": 1, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:YsMSGLbcyi4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5993472/", "authors": ["Dezun Dong", "Mo Li", "Yunhao Liu", "Xiang-Yang Li", "Xiangke Liao"], "publication_date": "2011/8/22", "journal": "IEEE/ACM Transactions on Networking", "volume": "19", "issue": "6", "pages": "1787-1796", "publisher": "IEEE", "description": "Wormhole attack is a severe threat to wireless ad hoc and sensor networks. Most existing countermeasures either require specialized hardware devices or make strong assumptions on the network in order to capture the specific (partial) symptom induced by wormholes. Those requirements and assumptions limit the applicability of previous approaches. In this paper, we present our attempt to understand the impact and inevitable symptom of wormholes and develop distributed detection methods by making as few restrictions and assumptions as possible. We fundamentally analyze the wormhole problem using a topology methodology and propose an effective distributed approach, which relies solely on network connectivity information, without any requirements on special hardware devices or any rigorous assumptions on network properties. We formally prove the correctness of this design in continuous geometric …", "total_citations": {"2012": 6, "2013": 16, "2014": 14, "2015": 15, "2016": 17, "2017": 16, "2018": 6, "2019": 7, "2020": 4, "2021": 3, "2022": 3, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:zYLM7Y9cAGgC": {"external_link": "https://dl.acm.org/doi/pdf/10.1145/1460412.1460467", "authors": ["Mo Li", "Yunhao Liu", "Jiliang Wang", "Zheng Yang"], "publication_date": "2009/4/19", "conference": "INFOCOM 2009, IEEE", "pages": "2419-2427", "publisher": "IEEE", "description": "This work proposes to utilize the wireless sensor network as an infrastructure system for navigating internal users under emergencies. The users are equipped with communicating devices like 802.15. 4 compatible PDAs that talk with sensors. Under emergencies, the sensor network explores the dangerous areas and provides necessary guiding information to safely navigate the users out of the field.Many efforts have been made towards guiding navigation using wireless sensor networks. As a natural intuition, most existing approaches assume the availability of locations on each sensor node. Based on the awareness of the locations of dangerous areas, the sensor network incurs easy and efficient route calculations to navigate internal users out of the emergent field. The location information may not be always available in many practical situations, such as underground tunnel or coal mine environment …", "total_citations": {"2009": 5, "2010": 6, "2011": 17, "2012": 16, "2013": 16, "2014": 10, "2015": 9, "2016": 8, "2017": 8, "2018": 4, "2019": 2, "2020": 1, "2021": 1, "2022": 2, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:W5xh706n7nkC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2809695.2809721", "authors": ["Wan Du", "Jansen Christian Liando", "Huanle Zhang", "Mo Li"], "publication_date": "2015/11/1", "conference": "Proceedings of the 13th ACM Conference on Embedded Networked Sensor Systems", "pages": "365-378", "publisher": "ACM", "description": "This paper presents Pando, a completely contention-free data dissemination protocol for wireless sensor networks. Pando encodes data by Fountain codes and disseminates the rateless stream of encoded packets along the fast and parallel pipelines built on constructive interference and channel diversity. Since every encoded packet contains innovative information to the original data object, Pando avoids duplicate retransmissions and fully exploits the wireless broadcast effect in data dissemination. To transform Pando into a practical system, we devise several techniques, including the integration of Fountain coding with the timing-critical operations of constructive interference and pipelining, a silence based feedback scheme for the one-way pipelined dissemination, and packet-level adaptation of network density and channel diversity. Based on these techniques, Pando can accomplish the data dissemination …", "total_citations": {"2015": 1, "2016": 11, "2017": 21, "2018": 20, "2019": 22, "2020": 18, "2021": 7, "2022": 6, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ye4kPcJQO24C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6189315/", "authors": ["Deke Guo", "Tao Chen", "Dan Li", "Mo Li", "Yunhao Liu", "Guihai Chen"], "publication_date": "2013/7", "journal": "IEEE Transactions on Computers", "volume": "62", "issue": "7", "pages": "1303-1317", "publisher": "IEEE", "description": "A fundamental goal of data center networking is to efficiently interconnect a large number of servers with the low equipment cost. Several server-centric network structures for data centers have been proposed. They, however, are not truly expandable and suffer a low degree of regularity and symmetry. Inspired by the commodity servers in today's data centers that come with dual port, we consider how to build expandable and cost-effective structures without expensive high-end switches and additional hardware on servers except the two NIC ports. In this paper, two such network structures, called HCN and BCN, are designed, both of which are of server degree 2. We also develop the low overhead and robust routing mechanisms for HCN and BCN. Although the server degree is only 2, HCN can be expanded very easily to encompass hundreds of thousands servers with the low diameter and high bisection width …", "total_citations": {"2011": 1, "2012": 3, "2013": 1, "2014": 12, "2015": 19, "2016": 17, "2017": 11, "2018": 9, "2019": 9, "2020": 6, "2021": 3, "2022": 9, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:4fKUyHm3Qg0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6823747/", "authors": ["Yuanqing Zheng", "Mo Li"], "publication_date": "2014/5/30", "journal": "IEEE/ACM Transactions on Networking", "volume": "23", "issue": "4", "pages": "1356-1366", "publisher": "IEEE", "description": "Radio frequency identification (RFID) systems are emerging platforms that support a variety of pervasive applications. RFID tags can be used to label items and enable item-level monitoring. The problem of identifying missing tags in RFID systems has attracted wide attention due to its practical importance (e.g., anti-theft). This paper presents P-MTI: a Physical-layer Missing Tag Identification scheme that effectively makes use of the lower-layer information and dramatically improves operational efficiency. Unlike conventional approaches, P-MTI looks into the aggregated tag responses instead of focusing on individual tag responses and extracts useful information from physical-layer collisions. P-MTI leverages the sparsity of missing tag events and reconstructs tag responses through compressive sensing. We prototype P-MTI using the USRP software defined radio and Intel WISP platform. We also evaluate the …", "total_citations": {"2013": 1, "2014": 14, "2015": 18, "2016": 15, "2017": 17, "2018": 9, "2019": 11, "2020": 5, "2021": 4, "2022": 5, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:B3FOqHPlNUQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6567119/", "authors": ["Longfei Shangguan", "Zhenjiang Li", "Zheng Yang", "Mo Li", "Yunhao Liu"], "publication_date": "2013/4/14", "conference": "2013 Proceedings IEEE INFOCOM", "pages": "3066-3074", "publisher": "IEEE", "description": "In many logistics applications of RFID technology, goods attached with tags are placed on moving conveyor belts for processing. It is important to figure out the order of goods on the belts so that further actions like sorting can be accurately taken on proper goods. Due to arbitrary goods placement or the irregularity of wireless signal propagation, neither of the order of tag identification nor the received signal strength provides sufficient evidence on their relative positions on the belts. In this study, we observe, from experiments, a critical region of reading rate when a tag gets close enough to a reader. This phenomenon, as well as other signal attributes, yields the stable indication of tag order. We establish a probabilistic model for recognizing the transient critical region and propose the OTrack protocol to continuously monitor the order of tags. To validate the protocol, we evaluate the accuracy and effectiveness through …", "total_citations": {"2013": 1, "2014": 5, "2015": 10, "2016": 10, "2017": 15, "2018": 16, "2019": 18, "2020": 6, "2021": 3, "2022": 8, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:geHnlv5EZngC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6566879/", "authors": ["Yuanqing Zheng", "Mo Li"], "publication_date": "2013/4/14", "conference": "2013 Proceedings IEEE INFOCOM", "pages": "908-916", "publisher": "IEEE", "description": "Estimating the RFID cardinality with accuracy guarantee is an important task in large-scale RFID systems. This paper proposes a fast RFID cardinality estimation scheme. The proposed Zero-One Estimator (ZOE) protocol rapidly converges to optimal parameter settings and achieves high estimation efficiency. ZOE significantly improves the cardinality estimation efficiency, achieving 3x performance gain compared with existing protocols. Meanwhile, ZOE guarantees arbitrary accuracy requirement without imposing computation and memory overhead at RFID tags. Due to the simplicity and robustness, the ZOE protocol provides reliable cardinality estimation even over noisy channel. We implement a prototype system using the USRP software defined radio and Intel WISP RFID tags. We also evaluate the performance of ZOE with extensive simulations. The evaluation of ZOE shows encouraging results in terms of …", "total_citations": {"2013": 2, "2014": 18, "2015": 14, "2016": 16, "2017": 12, "2018": 7, "2019": 12, "2020": 7, "2021": 2, "2022": 3, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:e_rmSamDkqQC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3564530", "authors": ["Amalinda Gamage", "Jansen Christian Liando", "Chaojie Gu", "Rui Tan", "Mo Li"], "publication_date": "2020/9/21", "book": "Proceedings of the 26th Annual International Conference on Mobile Computing and Networking", "pages": "1-13", "description": "Current LoRa networks including those following the LoRaWAN specification use the primitive ALOHA mechanism for media access control due to LoRa’s lack of carrier sense capability. From our extensive measurements, the channel activity detection feature that was recently introduced to LoRa for energy-efficiently detecting preamble chirps can also detect payload chirps reliably. This sheds light on an efficient carrier-sense multiple access protocol that we refer to as LMAC for LoRa networks. This article presents the designs of three advancing versions of LMAC that respectively implement carrier-sense multiple access, and balance the communication loads among the channels defined by frequencies and spreading factors based on the end nodes’ local information and then additionally the gateway’s global information. Experiments on a 50-node lab testbed and a 16-node university deployment show that …", "total_citations": {"2019": 1, "2020": 1, "2021": 18, "2022": 38, "2023": 38}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:WbkHhVStYXYC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2490256", "authors": ["Zhenjiang Li", "Mo Li", "Yunhao Liu"], "publication_date": "2012/3/25", "conference": "INFOCOM, 2012 Proceedings IEEE", "pages": "801-809", "publisher": "IEEE", "description": "In this article, we investigate the problem of controlling node sleep intervals so as to achieve the min-max energy fairness in asynchronous duty-cycling sensor networks. We propose a mathematical model to describe the energy efficiency of such networks and observe that traditional sleep interval setting strategies, for example, operating sensor nodes with an identical sleep interval, or intuitive control heuristics, for example, greedily increasing sleep intervals of sensor nodes with high energy consumption rates, hardly perform well in practice. There is an urgent need to develop an efficient sleep interval control strategy for achieving fair and high energy efficiency. To this end, we theoretically formulate the Sleep Interval Control (SIC) problem and find out that it is a convex optimization problem. By utilizing the convex property, we decompose the original problem and propose a distributed algorithm, called GDSIC. In …", "total_citations": {"2013": 7, "2014": 10, "2015": 10, "2016": 15, "2017": 11, "2018": 7, "2019": 4, "2020": 4, "2021": 1, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:7T2F9Uy0os0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7390270/", "authors": ["Zhidan Liu", "Zhenjiang Li", "Mo Li", "Wei Xing", "Dongming Lu"], "publication_date": "2016/7", "journal": "IEEE Transactions on Intelligent Transportation Systems", "volume": "17", "issue": "7", "pages": "1880-1893", "publisher": "IEEE", "description": "This paper presents a transport traffic estimation method which leverages road network correlation and sparse traffic sampling via the compressive sensing technique. Through the investigation on a traffic data set of more than 4400 taxis from Shanghai city, China, we observe nontrivial traffic correlations among the traffic conditions of different road segments and derive a mathematical model to capture such relations. After mathematical manipulation, the models can be used to construct representation bases to sparsely represent the traffic conditions of all road segments in a road network. With the trait of sparse representation, we propose a traffic estimation approach that applies the compressive sensing technique to achieve a city-scale traffic estimation with only a small number of probe vehicles, largely reducing the system operating cost. To validate the traffic correlation model and estimation method, we do …", "total_citations": {"2016": 3, "2017": 5, "2018": 7, "2019": 10, "2020": 11, "2021": 16, "2022": 11, "2023": 11}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:LjlpjdlvIbIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6171170/", "authors": ["Zhenjiang Li", "Yunhao Liu", "Mo Li", "Jiliang Wang", "Zhichao Cao"], "publication_date": "2013/2", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "24", "issue": "2", "pages": "312-326", "publisher": "IEEE", "description": "We study the ubiquitous data collection for mobile users in wireless sensor networks. People with handheld devices can easily interact with the network and collect data. We propose a novel approach for mobile users to collect the network-wide data. The routing structure of data collection is additively updated with the movement of the mobile user. With this approach, we only perform a limited modification to update the routing structure while the routing performance is bounded and controlled compared to the optimal performance. The proposed protocol is easy to implement. Our analysis shows that the proposed approach is scalable in maintenance overheads, performs efficiently in the routing performance, and provides continuous data delivery during the user movement. We implement the proposed protocol in a prototype system and test its feasibility and applicability by a 49-node testbed. We further conduct …", "total_citations": {"2012": 1, "2013": 10, "2014": 19, "2015": 9, "2016": 14, "2017": 10, "2018": 2, "2019": 4, "2020": 3, "2021": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:vRqMK49ujn8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2348543.2348584", "authors": ["Zhenjiang Li", "Wenwei Chen", "Cheng Li", "Mo Li", "Xiang-Yang Li", "Yunhao Liu"], "publication_date": "2012/8/22", "conference": "Proceedings of the 18th annual international conference on Mobile computing and networking", "pages": "329-340", "publisher": "ACM", "description": "In this paper, we propose a novel clock calibration approach called FLIGHT, which leverages the fact that the fluorescent light intensity changes with a stable period that equals half of the alternating current's. By tuning to the light emitted from indoor fluorescent lamps, FLIGHT can intelligently extract the light period information and achieve network wide time calibration by referring to such a common time reference. We address a series of practical challenges and implement FLIGHT in TelosB motes. We conduct comprehensive experiments using a 12-node test-bed in both static and mobile environments. Over one-week measurement suggests that compared with existing technologies, FLIGHT can achieve tightly synchronized time with low energy consumption.", "total_citations": {"2012": 4, "2013": 5, "2014": 9, "2015": 14, "2016": 9, "2017": 6, "2018": 7, "2019": 4, "2020": 6, "2021": 6, "2022": 2, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:sSrBHYA8nusC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6463407/", "authors": ["Xiaodong Liu", "Mo Li", "Shanshan Li", "Shaoliang Peng", "Xiangke Liao", "Xiaopei Lu"], "publication_date": "2014/1", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "25", "issue": "1", "pages": "136-145", "publisher": "IEEE", "description": "Influence Maximization aims to find the top- influential individuals to maximize the influence spread within a social network, which remains an important yet challenging problem. Proven to be NP-hard, the influence maximization problem attracts tremendous studies. Though there exist basic greedy algorithms which may provide good approximation to optimal result, they mainly suffer from low computational efficiency and excessively long execution time, limiting the application to large-scale social networks. In this paper, we present IMGPU, a novel framework to accelerate the influence maximization by leveraging the parallel processing capability of graphics processing unit (GPU). We first improve the existing greedy algorithms and design a bottom-up traversal algorithm with GPU implementation, which contains inherent parallelism. To best fit the proposed influence maximization algorithm with the GPU …", "total_citations": {"2013": 1, "2014": 5, "2015": 4, "2016": 9, "2017": 9, "2018": 11, "2019": 8, "2020": 11, "2021": 10, "2022": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:_B80troHkn4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2668332.2668335", "authors": ["Wan Du", "Zhenjiang Li", "Jansen Christian Liando", "Mo Li"], "publication_date": "2016/8", "journal": "IEEE/ACM Transactions on Networking", "volume": "24", "issue": "4", "pages": "2498-2511", "publisher": "IEEE", "description": "This paper presents a distanceless networking approach for wireless sensor networks sparsely deployed in large areas. By leveraging rateless codes, we provide distanceless transmission to expand the communication range of sensor motes and fully exploit network diversity. We address a variety of practical challenges to accommodate rateless coding on resource-constrained sensor motes and devise a communication protocol to efficiently coordinate the distanceless link transmissions. We propose a new metric (expected distanceless transmission time) for routing selection and further adapt the distanceless transmissions to low duty-cycled sensor networks. We implement the proposed scheme in TinyOS on the TinyNode platform and deploy the sensor network in a real-world project, in which 12 wind measurement sensors are installed around a large urban reservoir of 2.5km * 3.0km to monitor the field wind …", "total_citations": {"2014": 1, "2015": 5, "2016": 12, "2017": 13, "2018": 10, "2019": 11, "2020": 10, "2021": 3, "2022": 4, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:t7zJ5fGR-2UC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7837684/", "authors": ["Zhidan Liu", "Shiqi Jiang", "Pengfei Zhou", "Mo Li"], "publication_date": "2017/10", "journal": "IEEE Transactions on Intelligent Transportation Systems", "volume": "18", "issue": "10", "pages": "2851-2864", "publisher": "IEEE", "description": "This paper presents a participatory sensing-based urban traffic monitoring system. Different from existing works that heavily rely on intrusive sensing or full cooperation from probe vehicles, our system exploits the power of participatory sensing and crowdsources the traffic sensing tasks to bus riders' mobile phones. The bus riders are information source providers and, meanwhile, major consumers of the final traffic output. The system takes public buses as dummy probes to detect road traffic conditions, and collects the minimum set of cellular data together with some lightweight sensing hints from the bus riders' mobile phones. Based on the crowdsourced data from participants, the system recovers the bus travel information and further derives the instant traffic conditions of roads covered by bus routes. The real-world experiments with a prototype implementation demonstrate the feasibility of our system, which …", "total_citations": {"2017": 1, "2018": 9, "2019": 16, "2020": 8, "2021": 11, "2022": 13, "2023": 10}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ULOm3_A8WrAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6493321/", "authors": ["Jiliang Wang", "Yunhao Liu", "Mo Li", "Wei Dong", "Yuan He"], "publication_date": "2011/4/10", "conference": "INFOCOM, 2011 Proceedings IEEE", "pages": "775-783", "publisher": "IEEE", "description": "Due to its large scale and constrained communication radius, a wireless sensor network mostly relies on multi-hop transmissions to deliver a data packet along a sequence of nodes. It is of essential importance to measure the forwarding quality of multi-hop paths and such information shall be utilized in designing efficient routing strategies. Existing metrics like ETX, ETF mainly focus on quantifying the link performance in between the nodes while overlooking the forwarding capabilities inside the sensor nodes. The experience on manipulating GreenOrbs, a large-scale sensor network with 330 nodes, reveals that the quality of forwarding inside each sensor node is at the least an equally important factor that contributes to the path quality in data delivery. In this paper we propose QoF, Quality of Forwarding, a new metric which explores the performance in the gray zone inside a node left unattended in previous studies …", "total_citations": {"2012": 1, "2013": 5, "2014": 15, "2015": 6, "2016": 8, "2017": 9, "2018": 8, "2019": 3, "2020": 5, "2021": 3, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:tzM49s52ZIMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7442163/", "authors": ["Saiyu Qi", "Yuanqing Zheng", "Mo Li", "Yunhao Liu", "Jinli Qiu"], "publication_date": "2016/3/25", "journal": "IEEE/ACM transactions on networking", "volume": "24", "issue": "6", "pages": "3551-3564", "publisher": "IEEE", "description": "By attaching RFID tags to products, supply chain participants can identify products and create product data to record the product particulars in transit. Participants along the supply chain share their product data to enable information exchange and support critical decisions in production operations. Such an information sharing essentially requires a data access control mechanism when the product data relate to sensitive business issues. However, existing access control solutions are ill-suited to the RFID-enabled supply chain, as they are not scalable in handling a huge number of tags, introduce vulnerability to the product data, and perform poorly to support privilege revocation of product data. We present a new scalable industry data access control system that addresses these limitations. Our system provides an item-level data access control mechanism that defines and enforces access policies based on both the …", "total_citations": {"2017": 3, "2018": 4, "2019": 10, "2020": 14, "2021": 11, "2022": 12, "2023": 8}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:XiVPGOgt02cC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6846750/", "authors": ["Wan Du", "Zikun Xing", "Mo Li", "Bingsheng He", "Lloyd Hock Chye Chua", "Haiyan Miao"], "publication_date": "2014/4/15", "conference": "IPSN-14 Proceedings of the 13th International Symposium on Information Processing in Sensor Networks", "pages": "167-178", "publisher": "IEEE", "description": "We collaborate with environmental scientists to study the hydrodynamics and water quality in an urban district, where the surface wind distribution is an essential input but undergoes high spatial and temporal variations due to the complex urban landform created by surrounding buildings. In this work, we study an optimal sensor placement scheme to measure the wind distribution over a large urban reservoir with a limited number of wind sensors. Unlike existing sensor placement solutions that assume Gaussian process of target phenomena, this study measures the wind which inherently exhibits strong non-Gaussian yearly distribution. By leveraging the local monsoon characteristics of wind, we segment a year into different monsoon seasons which follow a unique distribution respectively. We also use computational fluid dynamics to learn the spatial correlation of wind in the presence of surrounding buildings. The …", "total_citations": {"2014": 5, "2015": 8, "2016": 7, "2017": 8, "2018": 6, "2019": 9, "2020": 3, "2021": 2, "2022": 8, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:tKAzc9rXhukC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7524510/", "authors": ["Wan Du", "Jansen Christian Liando", "Mo Li"], "publication_date": "2016/4/10", "conference": "IEEE INFOCOM 2016-The 35th Annual IEEE International Conference on Computer Communications", "pages": "1-9", "publisher": "IEEE", "description": "Screen-camera links for Visible Light Communication (VLC) are diverse, as the link quality varies according to many factors, such as ambient light and camera's performance. This paper presents SoftLight, a channel coding approach that considers the unique channel characteristics of VLC links and automatically adapts the transmission data rate to the link qualities of various scenarios. SoftLight incorporates two new ideas: (1) an expanded color modulation interface that provides soft hint about its confidence in each demodulated bit and establishes a bit-level VLC erasure channel, and (2) a rateless coding scheme that achieves bit-level rateless transmissions with low computation complexity and tolerates the false positive of bits provided by the soft hint enabled erasure channel. SoftLight is orthogonal to the visual coding schemes and can be applied atop any barcode layouts. We implement SoftLight on Android …", "total_citations": {"2016": 4, "2017": 8, "2018": 12, "2019": 8, "2020": 13, "2021": 6, "2022": 5, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:8k81kl-MbHgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5934916/", "authors": ["Shuguang Xiong", "Jianzhong Li", "Mo Li", "Jiliang Wang", "Yunhao Liu"], "publication_date": "2011/4/10", "conference": "INFOCOM, 2011 Proceedings IEEE", "pages": "1323-1331", "publisher": "IEEE", "description": "For energy conservation, a wireless sensor network is usually designed to work in a low-duty-cycle mode, in which a sensor node keeps active for a small percentage of time during its working period. In applications where there are multiple data delivery tasks with high data rates and time constraints, low-duty-cycle working mode may cause severe transmission congestion and data loss. In order to alleviate congestion and reduce data loss, the tasks need to be carefully scheduled to balance the workloads among the sensor nodes in both spatial and temporal dimensions. This paper studies the load balancing problem, and proves it is NP-Complete in general network graphs. Two efficient scheduling algorithms to achieve load balance are proposed and analyzed. Furthermore, a task scheduling protocol is designed relying on the proposed algorithms. To the best of our knowledge, this paper is the first one to tackle …", "total_citations": {"2012": 5, "2013": 6, "2014": 12, "2015": 14, "2016": 4, "2017": 6, "2018": 2, "2019": 0, "2020": 4, "2021": 3, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:_Ybze24A_UAC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2789168.2790126", "authors": ["Zhenjiang Li", "Yaxiong Xie", "Mo Li", "Kyle Jamieson"], "publication_date": "2015/9/7", "conference": "Proceedings of the 21st Annual International Conference on Mobile Computing and Networking", "pages": "291-303", "publisher": "ACM", "description": "This paper presents Recitation, the first software system that uses lightweight channel state information (CSI) to accurately predict error-prone bit positions in a packet so that applications atop the wireless physical layer may take the best action during subsequent transmissions. Our key insight is that although Wi-Fi wireless physical layer operations are complex, they are deterministic. This enables us to rehearse physical-layer operations on packet bits before they are transmitted. Based on this rehearsal, we calculate a hidden parameter in the decoding process, called error event probability (EVP). EVP captures fine-grained information about the receiver's convolutional or LDPC decoder, allowing Recitation to derive precise information about the likely fate of every bit in subsequent packets, without any wireless channel training. Recitation is the first system of its kind that is both software-implementable and …", "total_citations": {"2015": 2, "2016": 8, "2017": 7, "2018": 9, "2019": 11, "2020": 10, "2021": 6, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:86PQX7AUzd4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2632951.2632967", "authors": ["Zhidan Liu", "Zhenjiang Li", "Mo Li", "Wei Xing", "Dongming Lu"], "publication_date": "2014/8/11", "book": "Proceedings of the 15th ACM international symposium on Mobile ad hoc networking and computing", "pages": "297-306", "description": "This paper presents CSPR, a compressive sensing based approach for path reconstruction in wireless sensor networks. By viewing the whole network as a path representation space, an arbitrary routing path can be represented by a path vector in the space. As path length is usually much smaller than the network size, such path vectors are sparse, i.e., the majority of elements are zeros. By encoding sparse path representation into packets, the path vector (and thus the represented path) can be recovered from a small amount of packets using compressive sensing technique. CSPR formalizes the sparse path representation and enables accurate and efficient per-packet path reconstruction. CSPR is invulnerable to network dynamics and lossy links due to its distinct design. A set of optimization techniques are further proposed to improve the design. We evaluate CSPR in both testbed-based experiments and large …", "total_citations": {"2015": 7, "2016": 7, "2017": 7, "2018": 9, "2019": 9, "2020": 6, "2021": 3, "2022": 6, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:EYYDruWGBe4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3241539.3241572", "authors": ["Yaxiong Xie", "Yanbo Zhang", "Jansen Christian Liando", "Mo Li"], "publication_date": "2018/10/15", "conference": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking", "pages": "51-66", "publisher": "ACM", "description": "This paper presents our experience in designing, implementing, testing, and applying a general-purpose antenna extension solution with commodity Wi-Fi. The proposed solution, SWAN, builds an array of stitched antennas extended from the radio chains of commodity Wi-Fi. SWAN has low hardware cost and provides easy-to-use interfaces embedded in the Linux kernel. Two application cases for wireless sensing and communication are presented that proves the usefulness of the solution. SWAN is able to provide over 3× performance improvement on Wi-Fi azimuth estimation and localization and over 30% improvement on Wi-Fi throughput over original Wi-Fi AP with three fixed antennas.", "total_citations": {"2018": 1, "2019": 14, "2020": 8, "2021": 14, "2022": 8, "2023": 10}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ZfRJV9d4-WMC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2973750.2973775", "authors": ["Huanle Zhang", "Wan Du", "Pengfei Zhou", "Mo Li", "Prasant Mohapatra"], "publication_date": "2016/10/3", "conference": "Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking", "pages": "294-307", "publisher": "ACM", "description": "This paper presents DopEnc, an acoustic-based encounter profiling system on smartphones. DopEnc can automatically identify the persons that users interact with in the context of encountering. DopEnc performs encounter profiling in two major steps: (1) Doppler profiling to detect that two persons approach and stop in front of each other via an effective trajectory, and (2) voice profiling to confirm that they are thereafter engaged in an interactive conversation. DopEnc is further extended to support parallel acoustic exploration of many users by incorporating a unique multiple access scheme within the limited inaudible acoustic frequency band. All implementation of DopEnc is based on commodity sensors like speakers, microphones and accelerometers integrated on commercial-off-the-shelf smartphones. We evaluate DopEnc with detailed experiments and a real use-case study of 11 participants. Overall DopEnc …", "total_citations": {"2017": 6, "2018": 16, "2019": 8, "2020": 7, "2021": 6, "2022": 6, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:1yQoGdGgb4wC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7298458/", "authors": ["Yuxiao Hou", "Jiajue Ou", "Yuanqing Zheng", "Mo Li"], "publication_date": "2016/10", "journal": "IEEE/ACM Transactions on Networking", "volume": "24", "issue": "5", "pages": "2702-2714", "publisher": "IEEE", "description": "Estimating the number of RFID tags is a fundamental operation in RFID systems and has recently attracted wide attentions. Despite the subtleties in their designs, previous methods estimate the tag cardinality from the slot measurements, which distinguish idle and busy slots and based on that derive the cardinality following some probability models. In order to fundamentally improve the counting efficiency, in this paper we introduce PLACE, a physical layer based cardinality estimator. We show that it is possible to extract more information and infer integer states from the same slots in RFID communications. We propose a joint estimator that optimally combines multiple sub-estimators, each of which independently counts the number of tags with different inferred PHY states. Extensive experiments based on the GNURadio/USRP platform and the large-scale simulations demonstrate that PLACE achieves …", "total_citations": {"2015": 1, "2016": 8, "2017": 9, "2018": 5, "2019": 11, "2020": 7, "2021": 4, "2022": 4, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ipzZ9siozwsC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3281630", "authors": ["Shiqi Jiang", "Zhenjiang Li", "Pengfei Zhou", "Mo Li"], "publication_date": "2019/1/9", "journal": "ACM Transactions on Sensor Networks (TOSN)", "volume": "15", "issue": "1", "pages": "8", "publisher": "ACM", "description": "Due to the increasing popularity of mobile devices, the usage of lifelogging has dramatically expanded. People collect their daily memorial moments and share with friends on the social network, which is an emerging lifestyle. We see great potential of lifelogging applications along with rapid recent growth of the wearables market, where more sensors are introduced to wearables, i.e., electroencephalogram (EEG) sensors, that can further sense the user’s mental activities, e.g., emotions. In this article, we present the design and implementation of Memento, an emotion-driven lifelogging system on wearables. Memento integrates EEG sensors with smart glasses. Since memorable moments usually coincides with the user’s emotional changes, Memento leverages the knowledge from the brain-computer-interface domain to analyze the EEG signals to infer emotions and automatically launch lifelogging based on that …", "total_citations": {"2019": 5, "2020": 11, "2021": 15, "2022": 10, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:Y0pCki6q_DkC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/1374618.1374657", "authors": ["Xiang-Yang Li", "YanWei Wu", "Ping Xu", "GuiHai Chen", "Mo Li"], "publication_date": "2008/5/26", "conference": "Proceedings of the 9th ACM international symposium on Mobile ad hoc networking and computing", "pages": "283-292", "publisher": "ACM", "description": "For multi-hop ad hoc networks formed by individually owned nodes, the endpoints can only observe whether or not the end-to-end transaction was successful or not, but not the individual actions of intermediate nodes. Consequently, in the absence of properly designed incentive schemes, rational (i.e., selfish) intermediate nodes may choose to forward data packets at a very low priority or simply drop the packets at all, and it could put the blame on the unreliable wireless channel. Using a principal-agent model, we propose several efficient methods that can eliminate the hidden actions under hidden information in multi-hop wireless networks with high probability. We design several algorithmic mechanisms for a number of routing scenarios such that each selfish agent will maximize its utility (i.e., profit) when it truthfully declares its type (i.e., cost and its actions) and it truthfully follows its declared actions. Our …", "total_citations": {"2009": 4, "2010": 12, "2011": 6, "2012": 3, "2013": 5, "2014": 2, "2015": 2, "2016": 0, "2017": 2, "2018": 6, "2019": 1, "2020": 1, "2021": 1, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:Ug5p-4gJ2f0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9497358/", "authors": ["Sijie Ji", "Mo Li"], "publication_date": "2021/7/27", "journal": "IEEE Wireless Communications Letters", "volume": "10", "issue": "10", "pages": "2318-2322", "publisher": "IEEE", "description": "The Massive Multiple Input Multiple Output (MIMO) system is a core technology of the next generation communication. With the growing complexity of CSI, CSI feedback in massive MIMO system has become a bottleneck problem. Recently, numerous deep learning-based CSI feedback approaches demonstrate their efficiency and potential. However, most existing methods improve accuracy at the cost of computational complexity by adding more advanced deep learning blocks. This letter presents a novel neural network CLNet tailored for CSI feedback problem based on the intrinsic properties of CSI. CLNet proposes a forged complex-valued input layer to process signals and utilizes spatial-attention to enhance the performance of the network. The experiment result shows that CLNet outperforms the state-of-the-art method by average accuracy improvement of 5.41% in both outdoor and indoor scenarios with …", "total_citations": {"2021": 2, "2022": 19, "2023": 25}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:Se3iqnhoufwC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5361809/", "authors": ["Min Xi", "Kui Wu", "Yong Qi", "Jizhong Zhao", "Yunhao Liu", "Mo Li"], "publication_date": "2009/9/22", "conference": "Parallel Processing, 2009. ICPP'09. International Conference on", "pages": "50-57", "publisher": "IEEE", "description": "Wireless sensor networks have become a promising technology in monitoring physical world. In many applications with wireless sensor networks, it is essential to understand how well an interested area is monitored (covered) by sensors. The traditional way of evaluating sensor coverage requires that every point in the field should be monitored and the sensor network should be connected to transmit messages to a processing center (sink). Such a requirement is too strong to be financially practical in many scenarios. In this study, we address another type of coverage problem, sweep coverage, when we utilize mobile nodes as supplementary in a sparse and probably disconnected sensor network. Different from previous coverage problem, we focus on retrieving data from dynamic Points of Interest (POIs), where a sensor network does not necessarily have fixed data rendezvous points as POIs. Instead, any sensor …", "total_citations": {"2010": 1, "2011": 0, "2012": 3, "2013": 3, "2014": 8, "2015": 5, "2016": 5, "2017": 4, "2018": 3, "2019": 5, "2020": 2, "2021": 2, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:2KloaMYe4IUC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2980115.2980127", "authors": ["Yaxiong Xie", "Jie Xiong", "Mo Li", "Kyle Jamieson"], "publication_date": "2016/10/3", "conference": "Proceedings of the 3rd Workshop on Hot Topics in Wireless", "pages": "39-43", "publisher": "ACM", "description": "We describe the design and implementation of xD-Track, the first practical Wi-Fi based device-free localization system that employs a simultaneous and joint estimation of time-of-flight, angle-of-arrival, angle-of-departure, and Doppler shift to fully characterize the wireless channel between a sender and receiver. Using this full characterization, xD-Track introduces novel methods to measure and isolate the signal path that reflects off a person of interest, allowing it to localize a human with just a single pair of access points, or a single client-access point pair. Searching the multiple dimensions to accomplish the above is highly computationally burdensome, so xD-Track introduces novel methods to prune computational requirements, making our approach suitable for real-time person tracking. We implement xD-Track on the WARP software-defined radio platform and evaluate in a cluttered office environment …", "total_citations": {"2017": 4, "2018": 6, "2019": 9, "2020": 5, "2021": 11, "2022": 6, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:tS2w5q8j5-wC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6338930/", "authors": ["Deke Guo", "Mo Li"], "publication_date": "2013/10", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "25", "issue": "10", "pages": "2367-2380", "publisher": "IEEE", "description": "In this paper, we study the set reconciliation problem, in which each member of a node pair has a set of objects and seeks to deliver its unique objects to the other member. How could each node compute the set difference, however, is challenging in the set reconciliation problem. To address such an issue, we propose a lightweight but efficient method that only requires the pair of nodes to represent objects using a counting Bloom filter (CBF) of size  and exchange with each other, where  denotes the total size of the set differences. A receiving node then subtracts the received CBF from its local one via minus operation proposed in this paper. The resultant CBF can approximately represent the union of the set differences and thus the set difference to each node can be identified after querying the resultant CBF. In this paper, we propose a novel estimator through which each node can accurately estimate not only …", "total_citations": {"2013": 2, "2014": 3, "2015": 2, "2016": 3, "2017": 4, "2018": 3, "2019": 9, "2020": 5, "2021": 3, "2022": 4, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:PELIpwtuRlgC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2700265", "authors": ["Wan Du", "Zikun Xing", "Mo Li", "Bingsheng He", "Lloyd Hock Chye Chua", "Haiyan Miao"], "publication_date": "2015/2/17", "journal": "ACM Transactions on Sensor Networks (TOSN)", "volume": "11", "issue": "3", "pages": "1-27", "publisher": "ACM", "description": "We study the water quality in an urban district, where the surface wind distribution is an essential input but undergoes high spatial and temporal variations due to the impact of surrounding buildings. In this work, we develop an optimal sensor placement scheme to measure the wind distribution over a large urban reservoir using a limited number of wind sensors. Unlike existing solutions that assume Gaussian process of target phenomena, this study measures the wind that inherently exhibits strong non-Gaussian yearly distribution. By leveraging the local monsoon characteristics of wind, we segment a year into different monsoon seasons that follow a unique distribution respectively. We also use computational fluid dynamics to learn the spatial correlation of wind. The output of sensor placement is a set of the most informative locations to deploy the wind sensors, based on the readings of which we can accurately …", "total_citations": {"2014": 1, "2015": 0, "2016": 5, "2017": 7, "2018": 9, "2019": 9, "2020": 3, "2021": 3, "2022": 1, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:eflP2zaiRacC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6656968/", "authors": ["Yuanqing Zheng", "Mo Li"], "publication_date": "2014/12", "journal": "IEEE/ACM Transactions on Networking", "volume": "22", "issue": "6", "pages": "1886-1896", "publisher": "IEEE", "description": "Radio frequency identification (RFID) cardinality estimation with an accuracy guarantee is of practical importance in various large-scale RFID applications. This paper proposes a fast RFID cardinality estimation protocol, named Zero-One Estimator (ZOE). ZOE only requires 1-bit response from the RFID tags per estimation round. More importantly, ZOE rapidly converges to optimal parameter configurations and achieves higher estimation efficiency compared to existing protocols. ZOE guarantees arbitrary accuracy requirement without imposing heavy computation and memory overhead at RFID tags except the routine operations of C1G2 standard. ZOE also provides reliable cardinality estimation with unreliable channels due to the robust protocol design. We prototype ZOE using the USRP software defined radio and the Intel WISP tags. We extensively evaluate the performance of ZOE compared to existing protocols …", "total_citations": {"2014": 1, "2015": 4, "2016": 7, "2017": 6, "2018": 6, "2019": 9, "2020": 4, "2021": 2, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:eJXPG6dFmWUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6626304/", "authors": ["Longfei Shangguan", "Zhenjiang Li", "Zheng Yang", "Mo Li", "Yunhao Liu", "Jinsong Han"], "publication_date": "2014/8", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "25", "issue": "8", "pages": "2114-2125", "publisher": "IEEE", "description": "In many logistics applications of RFID technology, luggage attached with tags are placed on moving conveyor belts for processing. It is important to figure out the order of goods on the belts so that further actions like sorting can be accurately taken on proper goods. Due to arbitrary goods placement or the irregularity of wireless signal propagation, neither of the order of tag identification nor the received signal strength provides sufficient evidence on their relative positions on the belts. In this study, we observe, from experiments, a critical region of reading rate when a tag gets close enough to a reader. This phenomenon, as well as other signal attributes, yields the stable indication of tag order. We establish a probabilistic model for recognizing the transient critical region and propose the OTrack protocol to continuously monitor the order of tags. To validate the protocol, we evaluate the accuracy and effectiveness …", "total_citations": {"2014": 2, "2015": 4, "2016": 7, "2017": 4, "2018": 7, "2019": 3, "2020": 6, "2021": 5, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:PR6Y55bgFSsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6848215/", "authors": ["Lei Yang", "Yong Qi", "Jianbing Fang", "Xuan Ding", "Tianci Liu", "Mo Li"], "publication_date": "2014/4/27", "conference": "IEEE INFOCOM 2014-IEEE Conference on Computer Communications", "pages": "2670-2678", "publisher": "IEEE", "description": "Existing methods in RFID systems often employ presence or absence fashion to detect the tags' motions, so they cannot meet motion detection requirement in many applications. Our recent observations suggest that the signal strength backscattered from the tag is hypersensitive to its position, inspiring us to perceive the tag motion through its radio signal strength changes. Motion perception is not trivial and challenged by weak stability of strength in that any other interference or noise may incur significant changes as well, resulting in high false positives. To tackle this issue, we propose to model the strength via the Mixture of Gaussian Model (MoG). The problem is thus converted to foreground segment in computer vision with the help of Strength Image, where the technique of MoG based background subtraction is employed. We then implement a prototype using commercial off-the-shelf products. The evaluation …", "total_citations": {"2014": 4, "2015": 5, "2016": 6, "2017": 5, "2018": 6, "2019": 4, "2020": 3, "2021": 1, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:VaXvl8Fpj5cC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8481440/", "authors": ["Zhidan Liu", "Pengfei Zhou", "Zhenjiang Li", "Mo Li"], "publication_date": "2018/10/4", "journal": "IEEE Transactions on Mobile Computing", "volume": "18", "issue": "10", "pages": "2446-2459", "publisher": "IEEE", "description": "This paper presents a graph processing based traffic estimation system, GPTE, which is able to achieve high accuracy and high scalability to support city scale traffic estimation. GPTE benefits from its non-linear traffic correlation modeling and the graph-parallel processing framework built on clustered machines. By representing the road network as a property graph, GPTE decomposes the numerous computations involved in non-linear models to vertices and performs traffic estimation via neural network modeling and iterative information propagation. This paper presents our experiences in designing and implementing GPTE on top of the Spark, an emerging cluster computing framework. Extensive experiments are performed with real-world data input from Singapore's transport authority. Experimental results show that GPTE achieves as high as 88 percent accuracy in traffic estimation and up to 8× performance …", "total_citations": {"2019": 5, "2020": 6, "2021": 10, "2022": 11, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:LI9QrySNdTsC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3264962", "authors": ["Yongpan Zou", "Meng Zhao", "Zimu Zhou", "Jiawei Lin", "Mo Li", "Kaishun Wu"], "publication_date": "2018/9/18", "journal": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies", "volume": "2", "issue": "3", "pages": "1-20", "publisher": "ACM", "description": "User authentication on smart devices is indispensable to keep data privacy and security. It is especially significant for emerging wearable devices such as smartwatches considering data sensitivity in them. However, conventional authentication methods are not applicable for wearables due to constraints of size and hardware, which makes present wearable devices lack convenient, secure and low-cost authentication schemes. To tackle this problem, we reveal a novel biometric authentication mechanism which makes use of sounds of human dental occlusion (i.e., tooth click). We demonstrate its feasibility by comprehensive measurement study, and design a prototype-BiLock with two Android platforms. Extensive real-world experiments have been conducted to evaluate the accuracy, robustness and security of BiLock in different environments. The results show that BiLock can achieve less than 5% average false …", "total_citations": {"2018": 1, "2019": 5, "2020": 6, "2021": 12, "2022": 9, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:5awf1xo2G04C": {"external_link": "https://link.springer.com/article/10.1007/s11704-010-0123-2", "authors": ["Yunhao Liu", "Guomo Zhou", "Jizhong Zhao", "Guojun Dai", "Xiang-Yang Li", "Ming Gu", "Huadong Ma", "Lufeng Mo", "Yuan He", "Jiliang Wang", "Mo Li", "Kebin Liu", "Wei Dong", "Wei Xi"], "publication_date": "2010/9/1", "journal": "Frontiers of Computer Science in China", "volume": "4", "issue": "3", "pages": "334-338", "publisher": "SP Higher Education Press", "description": "We introduce GreenOrbs, our recent effort in exploring the fundamental challenges and future direction of long-term large-scale applications of wireless sensor networks. An integrated framework with more than 1000 sensors has been implemented, including the indoor test bed, prototype systems, and forest deployment: comprehensively supporting research, development, and forestry applications.", "total_citations": {"2011": 5, "2012": 6, "2013": 4, "2014": 8, "2015": 3, "2016": 4, "2017": 3, "2018": 0, "2019": 2, "2020": 1, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:J-pR_7NvFogC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7350252/", "authors": ["Yuanqing Zheng", "Mo Li"], "publication_date": "2016/10", "journal": "IEEE/ACM Transactions on Networking", "volume": "24", "issue": "5", "pages": "3098-3108", "publisher": "IEEE", "description": "Without the need of local energy supply, computational RFID (CRFID) sensors are emerging as important platforms enabling a variety of sensing and computing applications. Nevertheless, the data throughput of CRFIDs is very low. This paper aims at efficiently reading bulk data from CRFIDs using commodity RFID readers. We carry out thorough experiment studies to investigate the root cause of the low data throughput of CRFIDs. The experiment results suggest that the fundamental problem of data transfer stems from the mismatch between the stringent timing requirement of commodity standard and the limited packet handling capability of CRFIDs. We further propose several simple yet effective techniques to allow CRFIDs to meet stringent timing requirement of commodity RFID readers and achieve efficient data transfer. We implement a prototype system based on the WISP CRFIDs and commercial off-the-self …", "total_citations": {"2014": 4, "2015": 3, "2016": 5, "2017": 7, "2018": 4, "2019": 7, "2020": 2, "2021": 1, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:edDO8Oi4QzsC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3485730.3485937", "authors": ["Huatao Xu", "Pengfei Zhou", "Rui Tan", "Mo Li", "Guobin Shen"], "publication_date": "2021/11/15", "book": "Proceedings of the 19th ACM Conference on Embedded Networked Sensor Systems", "pages": "220-233", "description": "Deep learning greatly empowers Inertial Measurement Unit (IMU) sensors for various mobile sensing applications, including human activity recognition, human-computer interaction, localization and tracking, and many more. Most existing works require substantial amounts of well-curated labeled data to train IMU-based sensing models, which incurs high annotation and training costs. Compared with labeled data, unlabeled IMU data are abundant and easily accessible. In this work, we present LIMU-BERT, a novel representation learning model that can make use of unlabeled IMU data and extract generalized rather than task-specific features. LIMU-BERT adopts the principle of self-supervised training of the natural language model BERT to effectively capture temporal relations and feature distributions in IMU sensor measurements. However, the original BERT is not adaptive to mobile IMU data. By meticulously …", "total_citations": {"2022": 14, "2023": 21}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:0EnyYjriUFMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6047235/", "authors": ["Zhenjiang Li", "Mo Li", "Junliang Liu", "Shaojie Tang"], "publication_date": "2011/9/13", "conference": "Parallel Processing (ICPP), 2011 International Conference on", "pages": "673-682", "publisher": "IEEE", "description": "In low-duty-cycle networks, sensors stay dormant most of time to save their energy and wake up based on their needs. Such a technique, while prolonging the network lifetime, sets excessive challenges for efficient flooding within the network. Tailored for obtaining short delay in low-duty-cycle networks, recently proposed flooding protocols have achieved some initial success. Many fundamental problems of flooding in low-duty-cycle networks, however, are still not well understood. In this paper, we thoroughly investigate how the flooding behaviors are fundamentally affected from theory to practice in a low-duty-cycle sensor network. We study how practical factors like duty cycle length and link loss affect the flooding delay. We mathematically quantify the performance deterioration caused by those factors and present initial learning in achieving efficient flooding against them. Our theoretical analysis brings us not only …", "total_citations": {"2011": 1, "2012": 2, "2013": 3, "2014": 3, "2015": 4, "2016": 5, "2017": 3, "2018": 5, "2019": 4, "2020": 1, "2021": 1, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:YOwf2qJgpHMC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/1854219.1854223", "authors": ["Kebin Liu", "Zheng Yang", "Mo Li", "Zhongwen Guo", "Ying Guo", "Feng Hong", "Xiaohui Yang", "Yuan He", "Yuan Feng", "Yunhao Liu"], "publication_date": "2010/9/2", "journal": "ACM SIGMOBILE Mobile Computing and Communications Review", "volume": "14", "issue": "2", "pages": "7-9", "publisher": "ACM", "description": "In this project, we explore the possibility of deploying networked sensors on the Ocean's surface, to monitor depth and temperature, as well as other valuable environmental parameters. Sea depth monitoring is a critical task to ensure the safe operation of harbors. Traditional schemes largely rely on labor-intensive work and expensive hardware. We present a new solution for measuring the sea depth with Restricted Floating Sensors. To address the problem of node localization on the changeable sea environment, we propose Perpendicular Intersection (PI), a novel mobile-assisted localization scheme. In the OceanSense project, we propose the concept of passive diagnosis as well as the PAD approach which is both lightweight and adaptive to network dynamics. The OceanSense system has been working for over 16 months and provides large amounts of valuable data about the sea.", "total_citations": {"2011": 2, "2012": 2, "2013": 5, "2014": 6, "2015": 4, "2016": 1, "2017": 2, "2018": 2, "2019": 2, "2020": 2, "2021": 2, "2022": 3, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:b1wdh0AR-JQC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2531602.2531629", "authors": ["Yi Xu", "Chengzheng Sun", "Mo Li"], "publication_date": "2014/2/15", "conference": "Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing", "pages": "505-518", "publisher": "ACM", "description": "In this paper, we present a comprehensive and in-depth study on convergence preservation and avoidance in Operational Transformation (OT) systems. In this study, we discovered basic conditions, transformation patterns, and mechanisms for avoiding Convergence Property 2 (CP2), and established CP2-avoidance correctness of seven major OT systems. Furthermore, we proposed improvements to existing systems and designed a new OT system capable of avoiding CP2 with a unique combination of novel features. These results contribute significantly to the advancement of OT and collaboration-enabling technology.", "total_citations": {"2014": 2, "2015": 6, "2016": 8, "2017": 3, "2018": 5, "2019": 3, "2020": 2, "2021": 3, "2022": 0, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:LPZeul_q3PIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6231625/", "authors": ["Jiliang Wang", "Zhenjiang Li", "Mo Li", "Yunhao Liu", "Zheng Yang"], "publication_date": "2013/7", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "24", "issue": "7", "pages": "1436-1446", "publisher": "IEEE", "description": "We propose a pervasive usage of the sensor network infrastructure as a cyber-physical system for navigating internal users in locations of potential danger. Our proposed application differs from previous work in that they typically treat the sensor network as a media of data acquisition while in our navigation application, in-situ interactions between users and sensors become ubiquitous. In addition, human safety and time factors are critical to the success of our objective. Without any preknowledge of user and sensor locations, the design of an effective and efficient navigation protocol faces nontrivial challenges. We propose to embed a road map system in the sensor network without location information so as to provide users navigating routes with guaranteed safety. We accordingly design efficient road map updating mechanisms to rebuild the road map in the event of changes in dangerous areas. In this navigation …", "total_citations": {"2014": 4, "2015": 5, "2016": 5, "2017": 4, "2018": 4, "2019": 4, "2020": 3, "2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:9Nmd_mFXekcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8057233/", "authors": ["Zhenjiang Li", "Mo Li", "Prasant Mohapatra", "Jinsong Han", "Shuaiyu Chen"], "publication_date": "2017/5/1", "conference": "IEEE INFOCOM 2017-IEEE Conference on Computer Communications", "pages": "1-9", "publisher": "IEEE", "description": "This paper presents iType, a system that uses eye gaze for typing private information on commodity mobile platforms. The design combats three primary challenges: 1) relatively low accuracy of mobile gaze tracking; 2) difficulties in correcting input errors due to lacking the comparison with the true text-entry value; and 3) device motions and other noises that may interfere gaze tracking accuracy and thus the iType performance. We devise a set of effective techniques, including leveraging a collective behavior of the gaze tracking results, unique correlation of the typing error spatial distributions, and motion sensor hints from mobile devices, to address above challenges. A set of enhancement techniques are applied to further improve iType's robustness and reliability. We consolidate above designs and implement iType on iOS platform. Evaluations show that iType achieves high keystroke detection accuracy for the …", "total_citations": {"2016": 1, "2017": 0, "2018": 8, "2019": 9, "2020": 4, "2021": 1, "2022": 5, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:-_dYPAW6P2MC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7736112/", "authors": ["Wan Du", "Jansen Christian Liando", "Huanle Zhang", "Mo Li"], "publication_date": "2017/4", "journal": "IEEE/ACM Transactions on Networking", "volume": "25", "issue": "2", "pages": "820-833", "publisher": "IEEE", "description": "This paper presents Pando, a completely contention-free data dissemination protocol for wireless sensor networks. Pando encodes data by Fountain codes and disseminates the rateless stream of encoded packets along the fast and parallel pipelines built on constructive interference and channel diversity. Since every encoded packet contains innovative information to the original data object, Pando avoids duplicate retransmissions and fully exploits the wireless broadcast effect in data dissemination. To transform Pando into a practical system, we devise several techniques, including the integration of Fountain coding with the timing-critical operations of constructive interference and pipelining, a silence-based feedback scheme for the one-way pipelined dissemination, and packet-level adaptation of network density and channel diversity. Based on these techniques, Pando can accomplish data dissemination …", "total_citations": {"2017": 3, "2018": 4, "2019": 9, "2020": 5, "2021": 0, "2022": 3, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:fQNAKQ3IYiAC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2512448", "authors": ["Mo Li", "Zheng Yang", "Yunhao Liu"], "publication_date": "2013/9/5", "journal": "ACM Transactions on Embedded Computing Systems (TECS)", "volume": "13", "issue": "1", "pages": "1-21", "publisher": "ACM", "description": "Sea depth monitoring is a critical task for ensuring safe operation of harbors. Traditional schemes largely rely on labor-intensive work and expensive hardware. This study explores the possibility of deploying networked sensors on the surface of the sea, measuring and reporting the sea depth of given areas. We propose a Restricted Floating Sensors (RFS) model in which sensor nodes are anchored to the sea bottom, floating within a restricted area. Distinguished from traditional stationary or mobile sensor networks, the RFS network consists of sensor nodes with restricted mobility. We construct the network model and elaborate the corresponding localization problem. We show that by locating such RFS sensors, the sea depth can be estimated without the help of any extra ranging devices. A prototype system with 25 Telos sensor nodes is deployed to validate this design. We also examine the efficiency and …", "total_citations": {"2014": 5, "2015": 1, "2016": 3, "2017": 0, "2018": 10, "2019": 2, "2020": 2, "2021": 2, "2022": 3, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:hkOj_22Ku90C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7164889/", "authors": ["Pengfei Zhou", "Shiqi Jiang", "Mo Li"], "publication_date": "2015/6/29", "conference": "2015 IEEE 35th International Conference on Distributed Computing Systems", "pages": "21-30", "publisher": "IEEE", "description": "Real-time urban traffic conditions are critical to wide populations in the city and serve the needs of many transportation dependent applications. This paper presents our experience of building a participatory urban traffic monitoring system that exploits the power of bus riders' mobile phones. The system takes lightweight sensor hints and collects minimum set of cellular data from the bus riders' mobile phones. Based on such a participatory sensing framework, the system turns buses into dummy probes, monitors their travel statuses, and derives the instant traffic map of the city. Unlike previous works that rely on intrusive detection or full cooperation from \"probe vehicles\", our approach resorts to the crowd-participation of ordinary bus riders, who are the information source providers and major consumers of the final traffic output. The experiment results demonstrate the feasibility of such an approach achieving fine …", "total_citations": {"2015": 1, "2016": 4, "2017": 3, "2018": 7, "2019": 3, "2020": 4, "2021": 1, "2022": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:VLnqNzywnoUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7426406/", "authors": ["Saiyu Qi", "Yuanqing Zheng", "Mo Li", "Li Lu", "Yunhao Liu"], "publication_date": "2016/11/1", "journal": "IEEE Transactions on Computers", "volume": "65", "issue": "11", "pages": "3413-3426", "publisher": "IEEE", "description": "Radio Frequency Identification (RFID) is a key emerging technology for supply chain systems. By attaching RFID tags to various products, product-related data can be efficiently indexed, retrieved and shared among multiple participants involved in an RFID-enabled supply chain. The flexible data access property, however, raises security and privacy concerns. In this paper, we target at security and privacy issues in RFID-enabled supply chain systems. We investigate RFID-enabled Third-party Supply chain (RTS) systems and identify several inherent security and efficiency requirements. We further design a Secure RTS system called SRTS, which leverages RFID tags to deliver computation-lightweight crypto-IDs in the RTS system to meet both the security and efficiency requirements. SRTS introduces a Private Verifiable Signature (PVS) scheme to generate computation-lightweight crypto-IDs for product batches …", "total_citations": {"2017": 3, "2018": 3, "2019": 6, "2020": 10, "2021": 2, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:pqnbT2bcN3wC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6109238/", "authors": ["Rui Chu", "Lin Gu", "Yunhao Liu", "Mo Li", "Xicheng Lu"], "publication_date": "2011/12/14", "journal": "Computers, IEEE Transactions on", "issue": "99", "pages": "1-1", "publisher": "IEEE", "description": "The networked application environment has motivated the development of multitasking operating systems for sensor networks and other low-power electronic devices, but their multitasking capability is severely limited because traditional stack management techniques perform poorly on small-memory systems without virtual memory support. In this paper, we show that combining binary translation and a new kernel runtime can lead to efficient OS designs on resource constrained platforms. We introduce SenSmart, a multitasking OS for sensor networks, and present new OS design techniques for supporting preemptive multitask scheduling, memory isolation, and adaptive stack management. Our solution provides memory isolation and automatic stack relocation on usual sensornet platforms. The adaptive stack management frees programmers from the burden of estimating tasks' stack usage, yet it enables SenSmart …", "total_citations": {"2014": 3, "2015": 5, "2016": 4, "2017": 5, "2018": 4, "2019": 4, "2020": 1, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:uWiczbcajpAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8480032/", "authors": ["Chu Cao", "Zhidan Liu", "Mo Li", "Wenqiang Wang", "Zheng Qin"], "publication_date": "2018/4/11", "conference": "Proceedings of the 17th ACM/IEEE International Conference on Information Processing in Sensor Networks", "pages": "13-24", "publisher": "IEEE Press", "description": "Most digital maps are designed for vehicles and miss a great number of walkways that can facilitate people's daily mobility as pedestrians. Despite of such a fact, most existing map updating approaches only focus on the motorways. To fill the gap, this paper presents VitalAlley, a walkway discovery and verification approach with mobility data from large scale crowdsensing. VitalAlley aims to identify the uncharted walkways from the big but noisy personal mobility data and incorporate these findings into existing incomplete road maps. The implementation of VitalAlley faces the major challenges due to the unstructured nature of the walkways themselves and the noise from crowdsensing data. VitalAlley leverages different aspects of individual mobility to model and estimate the walkable areas, based on which representative walkways that connect known road segments or points of interest are extracted. To verify the …", "total_citations": {"2018": 2, "2019": 2, "2020": 8, "2021": 6, "2022": 5, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:kRWSkSYxWN8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2517351.2517379", "authors": ["Pengfei Zhou", "Zhiyuan Chen", "Mo Li"], "publication_date": "2013/11/11", "book": "Proceedings of the 11th ACM Conference on Embedded Networked Sensor Systems", "pages": "1-2", "description": "Background. Real time urban traffic information is critical to wide populations living in the city but undergoes significant spatial and temporal variation especially in the urban areas and calls for well monitoring. For the past decades, increasing efforts have been put into exploring an accurate, efficient, and inexpensive way to instantly monitor the urban traffic conditions. Conventional methods rely on intrusive sensing, where people deploy infrastructural devices like loop detectors or traffic cameras at roadsides to actively detect traffic references. Installing such intrusive devices incurs substantial deployment and maintenance costs and can only provide limited observation at sparse positions. Recent studies resort to the GPS traces collected from \"probe vehicles\" like taxis or private cars to estimate the road traffic conditions [2, 5]. Such a passive probing method avoids cumbrous infrastructure deployment and enjoys …", "total_citations": {"2014": 3, "2015": 2, "2016": 3, "2017": 6, "2018": 4, "2019": 1, "2020": 3, "2021": 0, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ZHo1McVdvXMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6076626/", "authors": ["Luo Mai", "Longfei Shangguan", "Chao Lang", "Junzhao Du", "Hui Liu", "Zhenjiang Li", "Mo Li"], "publication_date": "2011/10/17", "journal": "2011 Eighth IEEE International Conference on Mobile Ad-Hoc and Sensor Systems", "pages": "282-291", "publisher": "IEEE", "description": "We study the rendezvous data collection problem for the mobile sink in wireless sensor networks. We introduce to jointly optimize trajectory planning for the mobile sink and workload balancing for the network. By doing so, the mobile sink is able to efficiently collect network-wide data within a given delay bound and the network can eliminate the energy bottleneck to dramatically prolong its lifetime. Such a joint optimization problem is shown to be NP-hard and we propose an approximation algorithm, named RPS-LB, to approach the optimal solution. In RPS-LB, according to observed properties of the median reference structure in the network, a series of Rendezvous Points (RPs) are selected to construct the trajectory for the mobile sink and the derived approximation ratio of RPSLB guarantees that the formed trajectory is comparable with the optimal solution. The workload allocated to each RP is proven to be …", "total_citations": {"2011": 1, "2012": 2, "2013": 2, "2014": 3, "2015": 3, "2016": 6, "2017": 2, "2018": 4, "2019": 1, "2020": 1, "2021": 0, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:HbR8gkJAVGIC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3447993.3448617", "authors": ["Panrong Tong", "Mingqian Li", "Mo Li", "Jianqiang Huang", "Xiansheng Hua"], "publication_date": "2021/10/11", "book": "Proceedings of the 27th Annual International Conference on Mobile Computing and Networking", "pages": "188-200", "description": "Vehicle trajectories provide essential information to understand the urban mobility and benefit a wide range of urban applications. State-of-the-art solutions for vehicle sensing may not build accurate and complete knowledge of all vehicle trajectories. In order to fill the gap, this paper proposes VeTrac, a comprehensive system that employs widely deployed traffic cameras as a sensing network to trace vehicle movements and reconstruct their trajectories in a large scale. VeTrac fuses mobility correlation and vision-based analysis to reduce uncertainties in identifying vehicles. A graph convolution process is employed to maintain the identity consistency across different camera observations, and a self-training process is invoked when aligning with the urban road network to reconstruct vehicle trajectories with confidence. Extensive experiments with real-world data input of over 7 million vehicle snapshots from over one …", "total_citations": {"2021": 3, "2022": 9, "2023": 13}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:PoWvk5oyLR8C": {"external_link": "https://ojs.aaai.org/index.php/AAAI/article/view/16104", "authors": ["Mingqian Li", "Panrong Tong", "Mo Li", "Zhongming Jin", "Jianqiang Huang", "Xian-Sheng Hua"], "publication_date": "2021/5/18", "journal": "Proceedings of the AAAI Conference on Artificial Intelligence", "volume": "35", "issue": "1", "pages": "294-302", "description": "This paper proposes a spatiotemporal deep learning framework, Trajectory-based Graph Neural Network (TrGNN), that mines the underlying causality of flows from historical vehicle trajectories and incorporates that into road traffic prediction. The vehicle trajectory transition patterns are studied to explicitly model the spatial traffic demand via graph propagation along the road network; an attention mechanism is designed to learn the temporal dependencies based on neighborhood traffic status; and finally, a fusion of multi-step prediction is integrated into the graph neural network design. The proposed approach is evaluated with a real-world trajectory dataset. Experiment results show that the proposed TrGNN model achieves over 5% error reduction when compared with the state-of-the-art approaches across all metrics for normal traffic, and up to 14% for atypical traffic during peak hours or abnormal events. The advantage of trajectory transitions especially manifest itself in inferring high fluctuation of flows as well as non-recurrent flow patterns.", "total_citations": {"2021": 2, "2022": 12, "2023": 11}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:MLfJN-KU85MC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8994104/", "authors": ["Kaishun Wu", "Qiang Yang", "Baojie Yuan", "Yongpan Zou", "Rukhsana Ruby", "Mo Li"], "publication_date": "2020/2/11", "journal": "IEEE Transactions on Mobile Computing", "volume": "20", "issue": "5", "pages": "1789-1803", "publisher": "IEEE", "description": "Recently, wearable devices have become increasingly popular in our lives because of their neat features and stylish appearance. However, their tiny sizes bring about new challenges to human-device interaction such as texts input. Although some novel methods have been put forward, they possess different defects and are not applicable to deal with the problem. As a result, we propose an acoustic-based texts-entry system, i.e., EchoWrite, by which texts can be entered with a finger writing in the air without wearing any additional device. More importantly, different from many previous works, EchoWrite runs in a training-free style which reduces the training overhead and improves system scalability. We implement EchoWrite with commercial devices and conduct comprehensive experiments to evaluate its texts-entry performance. Experimental results show that EchoWrite enables users to enter texts at a speed of 7 …", "total_citations": {"2019": 1, "2020": 1, "2021": 7, "2022": 9, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:kuK5TVdYjLIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8737553/", "authors": ["Shuyu Shi", "Yaxiong Xie", "Mo Li", "Alex X Liu", "Jun Zhao"], "publication_date": "2019/4/29", "conference": "IEEE INFOCOM 2019-IEEE Conference on Computer Communications", "pages": "181-189", "publisher": "IEEE", "description": "Respiration rate monitoring is beneficial for the diagnosis of a variety of diseases, such as heart failure and sleep disorders. Radio Frequency (RF) based respiration rate monitoring systems, namely ultra-wideband radar and COTS device, have been proposed without requiring any direct contact with the detected person. However, existing RF based systems either require expensive UWB radio (radar based) or work only in stationary environments (COTS device based). To address the limitations of both radar based and COTS device based systems, in this paper, we propose RespiRadio, a system that can detect a person’s respiration rate in dynamic ambient environments via a single TX-RX pair of WiFi cards. The key novelty of RespiRadio is that it overcomes the limit of existing COTS device based respiration rate systems by synthesizing a wider-bandwidth WiFi radio. With the synthesized WiFi radio, we can …", "total_citations": {"2019": 1, "2020": 3, "2021": 7, "2022": 8, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:tuHXwOkdijsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8685777/", "authors": ["Dapeng Wu", "Zhenjiang Li", "Jianping Wang", "Yuanqing Zheng", "Mo Li", "Qiuyuan Huang"], "publication_date": "2019/4/11", "journal": "IEEE Wireless Communications", "volume": "26", "issue": "4", "pages": "117-123", "publisher": "IEEE", "description": "In the creation of a smart future information society, IoT and CCN break two key barriers for both front-end sensing and back-end networking. However, we still observe the missing piece of the research that dominates current networking traffic control and system management, for example, lacking the knowledge penetrated into both sensing and networking to glue them holistically. In this article, we propose leveraging emerging machine learning or deep learning techniques to create aspects of knowledge to facilitate the designs. In particular, we can extract knowledge from collected data to facilitate reduced data volume, enhanced system intelligence and interactivity, improved service quality, communication with better controllability and lower cost. We this knowledge-oriented traffic control and networking management paradigm Knowledge Centric Networking (KCN). This article presents the rationale for KCN, its …", "total_citations": {"2018": 3, "2019": 5, "2020": 6, "2021": 3, "2022": 3, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ILKRHgRFtOwC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3287033", "authors": ["Chu Cao", "Zhenjiang Li", "Pengfei Zhou", "Mo Li"], "publication_date": "2018/12/27", "journal": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies", "volume": "2", "issue": "4", "pages": "1-24", "publisher": "ACM", "description": "This paper presents Amateur, an augmented reality based vehicle navigation system using commodity smart phones. Amateur reads the navigation information from a digital map, matches it into live road condition video captured by smart phone, and directly annotates the navigation instructions on the video stream. The Amateur design entails two major challenges, including the lane identification and the intersection inference so as to correctly annotate navigation instructions for lane-changing and intersection-turning. In this paper, we propose a particle filter based design, assisted by inertial motion sensors and lane markers, to tolerate incomplete and even erroneous detection of road conditions. We further leverage traffic lights as land markers to estimate the position of each intersection to accurately annotate the navigation instructions. We develop a prototype system on Android mobile phones and test our …", "total_citations": {"2019": 2, "2020": 3, "2021": 5, "2022": 8, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:fEOibwPWpKIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7448931/", "authors": ["Wan Du", "Jansen Christian Liando", "Mo Li"], "publication_date": "2017/2/1", "journal": "IEEE Transactions on Mobile Computing", "volume": "16", "issue": "2", "pages": "527-537", "publisher": "IEEE", "description": "Screen-camera links for Visible Light Communication (VLC) are diverse, as the link quality varies according to many factors, such as ambient light and camera's performance. This paper presents SoftLight, a channel coding approach that considers the unique channel characteristics of VLC links and automatically adapts the transmission data rate to the link qualities of various scenarios. SoftLight incorporates two new ideas: (1) an expanded color modulation interface that provides soft hint about its confidence in each demodulated bit and establishes a bit-level VLC erasure channel, and (2) a rateless coding scheme that achieves bit-level rateless transmissions with low computation complexity and tolerates the false positive of bits provided by the soft hint enabled erasure channel. SoftLight is orthogonal to the visual coding schemes and can be applied atop any barcode layouts. We implement SoftLight on Android …", "total_citations": {"2016": 1, "2017": 2, "2018": 7, "2019": 3, "2020": 2, "2021": 5, "2022": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:VOx2b1Wkg3QC": {"external_link": "https://www.mdpi.com/1996-1073/6/9/4551", "authors": ["Marcel Bruelisauer", "Kian Wee Chen", "Rupesh Iyengar", "Hansjürg Leibundgut", "Cheng Li", "Mo Li", "Matthias Mast", "Forrest Meggers", "Clayton Miller", "Dino Rossi", "Esmail M Saber Arno Schlueter", "Kwok Wai Tham"], "publication_date": "2013/9/2", "journal": "Energies", "volume": "6", "issue": "9", "pages": "4551-4571", "publisher": "Multidisciplinary Digital Publishing Institute", "description": "We present the design, construction and operation of a novel building systems laboratory, the BubbleZERO—Zero Emission Research Operation. Our objective was to design a space to evaluate the performance of Swiss-developed low exergy building systems in the tropical climate of Singapore using an integrated design approach. The method we employed for evaluation in the tropics was to design and build a test bed out of the shipping containers that transported the prototype low exergy systems from Switzerland to Singapore. This approach resulted in a novel laboratory environment containing radiant cooling panels and decentralized air supply, along with a self-shading, inflated “bubble” skin, experimental low emissivity (LowE) glazing, LED lighting, wireless sensors and distributed control. The laboratory evaluates and demonstrates for the first time in Singapore an integrated high-temperature cooling system with separate demand-controlled ventilation adapted for the tropics. It is a functional lab testing system in real tropical conditions. As such, the results showing the ability to mitigate the risk of condensation by maintaining a dew point below 18 °C by the separate decentralized ventilation are significant and necessary for potential future implementation in buildings. In addition, the control system provides new proof of concept for distributed wireless sensors and control for reliable automation of the systems. These key results are presented along with the integrated design process and real-life tropical operation of the laboratory.", "total_citations": {"2014": 5, "2015": 4, "2016": 5, "2017": 2, "2018": 1, "2019": 3, "2020": 3, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:SpbeaW3--B0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5339673/", "authors": ["Dezun Dong", "Mo Li", "Yunhao Liu", "Xiang-Yang Li", "Xiangke Liao"], "publication_date": "2009/10/13", "conference": "2009 17th IEEE International Conference on Network Protocols", "pages": "314-323", "publisher": "IEEE", "description": "Wormhole attack is a severe threat to wireless ad hoc and sensor networks. Most existing countermeasures either require specialized hardware devices or make strong assumptions on the network in order to capture the specific (partial) symptom induced by wormholes. Those requirements and assumptions limit the applicability of previous approaches. In this work, we present our attempt to understand the impact and inevitable symptom of wormholes and develop distributed detection methods by making as few restrictions and assumptions as possible. We fundamentally analyze the wormhole problem using a topology methodology, and propose an effective distributed approach, which relies solely on network connectivity information, without any requirements on special hardware devices or any rigorous assumptions on network properties. We rigorously prove the correctness of this design in continuous geometric …", "total_citations": {"2010": 4, "2011": 3, "2012": 5, "2013": 3, "2014": 2, "2015": 3, "2016": 1, "2017": 0, "2018": 1, "2019": 0, "2020": 1, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ufrVoPGSRksC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5395220/", "authors": ["Dezun Dong", "Mo Li", "Yunhao Liu", "Xiangke Liao"], "publication_date": "2009/12/8", "conference": "Parallel and Distributed Systems (ICPADS), 2009 15th International Conference on", "pages": "72-79", "publisher": "IEEE", "description": "Wormhole attack is a severe threat against wireless ad hoc and sensor networks. It can be launched without compromising any legitimate node or cryptographic mechanisms, and often serves as a stepping stone for many serious attacks. Most existing countermeasures often make critical assumptions or require specialized hardware devices in the network. Those assumptions and requirements limit the applicability of previous approaches. In this work, we explore the impact of wormhole attacks on network connectivity topologies, and develop a simple distributed method to detect wormholes, called WormCircle-. WormCircle relies solely on local connectivity information without any requirements on special hardware devices or making any rigorous assumptions on network properties. We establish the correctness of this design in continuous geometric domains and extend it into discrete networks. We evaluate the …", "total_citations": {"2011": 2, "2012": 4, "2013": 3, "2014": 1, "2015": 1, "2016": 1, "2017": 0, "2018": 4, "2019": 0, "2020": 1, "2021": 1, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ZuybSZzF8UAC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2746285.2746308", "authors": ["Zhenjiang Li", "Wan Du", "Yuanqing Zheng", "Mo Li", "Dapeng Wu"], "publication_date": "2017/2", "journal": "IEEE/ACM transactions on networking", "volume": "25", "issue": "1", "pages": "69-82", "publisher": "IEEE", "description": "This paper presents a hopless networking paradigm. Incorporating recent techniques of rateless codes, senders break packets into rateless information streams and each single stream automatically adapts to diverse channel qualities at all potential receivers, regardless of their hop distances. The receivers are capable of accumulating rateless information pieces from different senders and jointly decoding the packet, largely improving throughput. We develop a practical protocol, called HOPE, which instantiates the hopless networking paradigm. Compared with the existing opportunistic routing protocol family, HOPE best exploits the wireless channel diversity and takes full advantage of the wireless broadcast effect. HOPE incurs minimum protocol overhead and serves general networking applications. We extensively evaluate the performance of HOPE with indoor network traces collected from USRP N210s and …", "total_citations": {"2015": 4, "2016": 3, "2017": 2, "2018": 5, "2019": 3, "2020": 3, "2021": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:1qzjygNMrQYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6848086/", "authors": ["Saiyu Qi", "Yuanqing Zheng", "Mo Li", "Li Lu", "Yunhao Liu"], "publication_date": "2014/4/27", "conference": "INFOCOM, 2014 Proceedings IEEE", "pages": "1510-1518", "publisher": "IEEE", "description": "Batch recall is a practically important problem for most industry manufacturers. The batches of products which contain flawed parts need to be recalled by manufacturers in time to prevent further economic and health loss. Accurate batch recall could be a challenging issue as flawed parts may have already been integrated into a large number of products and distributed to customers. The recent development of Radio Frequency Identification (RFID) provides us a promising opportunity to implement batch recall in an accurate and efficient way. RFID-enabled batch recall provides us the opportunity to further enhance the security of batch recall operation, allowing us to achieve recognition of problematic products, privacy preserving of production pattern, recall authentication and non-repudiation, etc. In this paper, we thoroughly study the security aspects and identify the unique requirements in RFID-enabled batch …", "total_citations": {"2014": 2, "2015": 4, "2016": 2, "2017": 3, "2018": 2, "2019": 3, "2020": 4, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:WqliGbK-hY8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6747315/", "authors": ["Zhenjiangi Li", "Wenwei Chen", "Mo Li", "Jingsheng Lei"], "publication_date": "2015/1", "journal": "IEEE transactions on parallel and distributed systems", "volume": "26", "issue": "1", "pages": "163-173", "publisher": "IEEE", "description": "Time synchronization is one of the most fundamental services for wireless sensor networks. Prior studies have investigated the clock stability due to environmental dynamics. In this paper, we demonstrate by experiment that in spite of the surrounding environment, time synchronization is unavoidably impacted by in-network energy heterogeneity, which may incur up to 30-40 ppm clock uncertainty. We mathematically analyze the root cause of such clock uncertainty and propose a protocol called EATS. Sensor nodes with EATS can intelligently select the best synchronization parents that minimize the negative impact of the energy heterogeneity. The selection is robust to multiple impacting factors in the network and provides fine-grained synchronization accuracy. In addition, nodes can make use of local energy information and further calibrate the clocks. In light of this, the logic time maintained among different nodes …", "total_citations": {"2015": 7, "2016": 6, "2017": 4, "2018": 1, "2019": 1, "2020": 0, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:4TOpqqG69KYC": {"external_link": "https://repository.ust.hk/ir/Record/1783.1-35453", "authors": ["MIN XI", "YONG QI", "KUI WU", "JIZHONG ZHAO", "MO LI"], "publication_date": "2011", "journal": "Ad Hoc & Sensor Wireless Networks", "volume": "12", "pages": "229-251", "description": "Wireless sensor networks have become a promising technology in monitoring physical world. In many applications with wireless sensor networks, it is essential to understand how well an interested area is monitored (covered) by sensors. The traditional way of evaluating sensor coverage requires that every point in the field should be monitored and the sensor network should be connected to transmit messages to a processing center (sink). Such a requirement is too strong to be financially practical in many scenarios. In this study, we address another type of coverage problem, sweep coverage, where we utilize mobile nodes to help data retrieval in a sensor network. Different from previous coverage problems, we focus on retrieving data from dynamic Points of Interest (POIs), where a sensor network does not necessarily have fixed data rendezvous points as POIs. Instead, any sensor node within the network may become a POI. We first analyze the relationship among information access delay, information access probability, and the number of required mobile nodes. We then design a distributed algorithm based on a virtual 3D map of local gradient information to guide the movement of mobile nodes to achieve sweep coverage of dynamic POIs. Using the analytical results as the guideline for setting the system parameters, we examine the performance of our algorithm compared to existing approaches.", "total_citations": {"2012": 2, "2013": 4, "2014": 0, "2015": 0, "2016": 0, "2017": 2, "2018": 0, "2019": 3, "2020": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:wbdj-CoPYUoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6848193/", "authors": ["Jiajue Ou", "Yuanqing Zheng", "Mo Li"], "publication_date": "2014/4/27", "conference": "IEEE INFOCOM 2014-IEEE Conference on Computer Communications", "pages": "2472-2480", "publisher": "IEEE", "description": "802.11 WLANs suffer from high packet losses due to interference and noise. Packet retransmission is a fundamental way to recover a lost packet. To extract useful information from incorrect symbols and improve retransmission efficiency, we present MISC, a packet retransmission scheme that merges incorrect symbols from multiple transmissions to produce correct ones. MISC proactively creates constellation diversity by rearranging the constellation maps in retransmissions. MISC addresses practical implementation issues and makes minimum amendments to integrate into current 802.11 WLAN framework. We implement MISC in an 802.11-based GNURadio/USRP platform and conduct extensive experiments to evaluate its efficacy. Experiment results demonstrate that MISC can substantially improve the throughput.", "total_citations": {"2015": 4, "2016": 3, "2017": 6, "2018": 1, "2019": 2, "2020": 0, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:j8SEvjWlNXcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7524450/", "authors": ["Yaxiong Xie", "Zhenjiang Li", "Mo Li", "Kyle Jamieson"], "publication_date": "2016/4/10", "conference": "IEEE INFOCOM 2016-The 35th Annual IEEE International Conference on Computer Communications", "pages": "1-9", "publisher": "IEEE", "description": "Due to frequency selective fading, modern wideband 802.11 transmissions have unevenly distributed bit BERs in a packet. In this paper, we propose to unequally protect packet bits according to their BERs. By doing so, we can best match the effective transmission rate of each bit to channel condition, and improve throughput. The major design challenge lies in deriving an accurate relationship between the frequency selective channel condition and the decoded packet bit BERs, all the way through the complex 802.11 PHY layer. Based on our study, we find that the decoding error of a packet bit corresponds to dense errors in the underlying codeword bits, and the BER can be truthfully approximated by the codeword bit error density. With above observation, we propose UnPKT, scheme that protects packet bits using different MAC-layer FEC redundancies based on bit-wise BER estimation to augment wide-band 802 …", "total_citations": {"2016": 1, "2017": 4, "2018": 4, "2019": 1, "2020": 3, "2021": 1, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:bz8QjSJIRt4C": {"external_link": "https://scholar.google.com/scholar?cluster=3411575629439451531&hl=en&oi=scholarr", "authors": ["Yaxiong Xie", "M Li"], "publication_date": "2016", "journal": "URl: http://wands. sg/research/wifi/AtherosCSI", "total_citations": {"2017": 1, "2018": 2, "2019": 2, "2020": 3, "2021": 3, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:kNdYIx-mwKoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5762773/", "authors": ["Kebin Liu", "Mo Li", "Yunhao Liu", "Xiang-Yang Li", "Minglu Li", "Huadong Ma"], "publication_date": "2010/10/5", "conference": "Network Protocols (ICNP), 2010 18th IEEE International Conference on", "pages": "243-252", "publisher": "IEEE", "description": "The high mobility of VANET makes information exchange across the network excessively difficult. Traditional approaches designed for stationary networks are not applicable due to the high dynamics among the nodes. Applying the routing techniques tailored for general mobile networks inevitably brings huge traffic burden to the crowded urban VANET and leads to low efficiency. To make the information exchange fluent and efficient, we explore the unique features of the urban VANET. By exploring the invariants in the mobile network topology, we are able to efficiently manage the information on top of the “intersection graph” transformed from the underlying network of road segments in the urban area. Our approach can thus achieve efficient query dissemination and data retrieval on this information organization. We intensively investigate and analyze a trace that records the movement of more than 4000 taxies in …", "total_citations": {"2012": 1, "2013": 2, "2014": 3, "2015": 3, "2016": 3, "2017": 0, "2018": 2, "2019": 0, "2020": 1, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:ruyezt5ZtCIC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3447548.3467158", "authors": ["Chu Cao", "Mo Li"], "publication_date": "2021/8/14", "book": "Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining", "pages": "2610-2620", "description": "This paper presents TrajGen, an approach to generate artificial datasets of mobility trajectories based on an original trajectory dataset while retaining the utility of the original data in supporting various mobility applications. The generated mobility data is disentangled with the original data and can be shared without compromising the data privacy. TrajGen leverages Generative Adversarial Nets combined with a Seq2Seq model to generate the spatial-temporal trajectory data. TrajGen is implemented and evaluated with real-world taxi trajectory data in Singapore. The extensive experimental results demonstrate that TrajGen is able to generate artificial trajectory data that retain key statistical characteristics of the original data. Two case studies, i.e. road map updating and Origin-Destination demand estimation are performed with the generated artificial data, and the results show that the artificial trajectories generated …", "total_citations": {"2022": 3, "2023": 12}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:JoZmwDi-zQgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6980367/", "authors": ["Saiyu Qi", "Yuanqing Zheng", "Mo Li", "Yunhao Liu", "Jinli Qiu"], "publication_date": "2014/10/21", "conference": "2014 IEEE 22nd International Conference on Network Protocols", "pages": "71-82", "publisher": "IEEE", "description": "By attaching RFID tags to products, supply chain participants can identify products and create product data to record the product particulars in transit. Participants along the supply chain share their product data to enable information exchange and support critical decisions in production operations. Such an information sharing essentially requires a data access control mechanism when the product data relates to sensitive business issues. However, existing access control solutions are ill suited to the RFID-enabled supply chain, as they are not scalable in handling a huge number of tags, introduce vulnerability to the product data, and performs poorly to support privilege revocation of product data. We present a new scalable data access control system that addresses these limitations. Our system provides an item-level data access control mechanism that defines and enforces access policies based on both the …", "total_citations": {"2016": 2, "2017": 2, "2018": 2, "2019": 2, "2020": 3, "2021": 1, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:aqlVkmm33-oC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/1374699.1374705", "authors": ["Yuan He", "Mo Li", "Yunhao Liu"], "publication_date": "2008/5/30", "conference": "Proceeding of the 1st ACM international workshop on Heterogeneous sensor and actor networks", "pages": "25-30", "publisher": "ACM", "description": "Demands on better interacting with physical world require an effective and comprehensive collaboration mechanism among multiple heterogeneous sensor networks. Previous works mainly focus on improving each single and specific sensor network, thus fail to address this newly emerged issue. In this paper, we study the issue of collaborative query processing among multiple heterogeneous sensor networks and formulate it into an optimization problem with respect to energy efficiency, called EE-QPS. To the best of our knowledge, we are the first one considering the collaborative query processing among heterogeneous sensor networks. By utilizing the implications among sensor networks, we design a heuristic approach named IAP to resolve EE-QPS. The experimental results validate our scheme and show that IAP achieves optimized energy efficiency under various environments.", "total_citations": {"2009": 2, "2010": 2, "2011": 2, "2012": 0, "2013": 1, "2014": 1, "2015": 3, "2016": 0, "2017": 0, "2018": 2, "2019": 0, "2020": 1, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:0N-VGjzr574C": {"external_link": "https://www.usenix.org/conference/nsdi22/presentation/li-songfan", "authors": ["Songfan Li", "Hui Zheng", "Chong Zhang", "Yihang Song", "Shen Yang", "Minghua Chen", "Li Lu", "Mo Li"], "publication_date": "2022", "conference": "19th USENIX Symposium on Networked Systems Design and Implementation (NSDI 22)", "pages": "913-928", "description": "The uplink and downlink transmissions in most backscatter communication systems are highly asymmetric. The downlink transmission often suffers from its short range and vulnerability to interference, which limits the practical application and deployment of backscatter communication systems. In this paper, we propose passive DSSS to improve the downlink communication for practical backscatter systems. Passive DSSS is able to increase the downlink signal-to-interference-plus-noise ratio (SINR) by using direct sequence spread-spectrum (DSSS) techniques to suppress interference and noise. The key challenge lies in the demodulation of DSSS signals, where the conventional solutions require power-hungry computations to synchronize a locally generated spreading code with the received DSSS signal, which is infeasible on energy-constrained backscatter devices. Passive DSSS addresses such a challenge by shifting the generation and synchronization of the spreading code from the receiver to the gateway side, and therefore achieves ultra-low power DSSS demodulation. We prototype passive DSSS for proof of concept. The experimental results show that passive DSSS improves the downlink SINR by 16.5 dB, which translates to a longer effective downlink range for backscatter communication systems.", "total_citations": {"2022": 3, "2023": 11}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=20&pagesize=80&citation_for_view=kjiwE6IAAAAJ:XoXfffV-tXoC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3474368", "authors": ["Chaojie Gu", "Linshan Jiang", "Rui Tan", "Mo Li", "Jun Huang"], "publication_date": "2021/10/5", "journal": "ACM Transactions on Sensor Networks (TOSN)", "volume": "18", "issue": "1", "pages": "1-31", "publisher": "ACM", "description": "Low-power wide-area network technologies such as long-range wide-area network (LoRaWAN) are promising for collecting low-rate monitoring data from geographically distributed sensors, in which timestamping the sensor data is a critical system function. This article considers a synchronization-free approach to timestamping LoRaWAN uplink data based on signal arrival time at the gateway, which well matches LoRaWAN’s one-hop star topology and releases bandwidth from transmitting timestamps and synchronizing end devices’ clocks at all times. However, we show that this approach is susceptible to a frame delay attack consisting of malicious frame collision and delayed replay. Real experiments show that the attack can affect the end devices in large areas up to about 50,000, m2. In a broader sense, the attack threatens any system functions requiring timely deliveries of LoRaWAN frames. To address this …", "total_citations": {"2020": 1, "2021": 2, "2022": 4, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:S16KYo8Pm5AC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3372224.3419182", "authors": ["Songfan Li", "Chong Zhang", "Yihang Song", "Hui Zheng", "Lu Liu", "Li Lu", "Mo Li"], "publication_date": "2020/9/21", "book": "Proceedings of the 26th Annual International Conference on Mobile Computing and Networking", "pages": "1-14", "description": "Energy consumption of Internet-of-Things end devices is a major constraint that limits their long-term and large-scale deployment. Conventionally, the radios and processors used in these end devices are major power consumption that drains at the level of milliwatts (mWs). However, in recent decades, backscatter communication has dramatically reduced the power consumed by the radios in end devices to microwatts (μWs), and thus the processor remains the major bottleneck for energy optimization. In this paper, we propose a processor-free architecture as a novel design that allows the radio to interface directly with peripheral sensor chips for control and data collection, thereby separating the processors from the end device design to significantly reduce the energy consumed by end devices. The main problem is that the peripheral chips are designed to be accessed by the processor via a standard digital bus …", "total_citations": {"2022": 7, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:BwyfMAYsbu0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8404117/", "authors": ["Fan Dang", "Ennan Zhai", "Zhenhua Li", "Pengfei Zhou", "Aziz Mohaisen", "Kaigui Bian", "Qingfu Wen", "Mo Li"], "publication_date": "2018/7/5", "journal": "IEEE Transactions on Mobile Computing", "volume": "18", "issue": "5", "pages": "1159-1173", "publisher": "IEEE", "description": "Automated Fare Collection (AFC) systems have been globally deployed for decades, particularly in the public transportation network where the transit fee is calculated based on the length of the trip (a.k.a., distance-based pricing AFC systems). Although most messages of AFC systems are insecurely transferred in plaintext, system operators did not pay much attention to this vulnerability, since the AFC network is basically isolated from the public network (e.g., the Internet)-there is no way of exploiting such a vulnerability from the outside of the AFC network. Nevertheless, in recent years, the advent of Near Field Communication (NFC)-equipped smartphones has opened up a channel to invade into the AFC network from the mobile Internet, i.e., by Host-based Card Emulation (HCE) over NFC-equipped smartphones. In this paper, we identify a novel paradigm of attacks, called LessPay, against modern distance-based …", "total_citations": {"2019": 3, "2020": 3, "2021": 3, "2022": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:XD-gHx7UXLsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8057219/", "authors": ["Fan Dang", "Pengfei Zhou", "Zhenhua Li", "Ennan Zhai", "Aziz Mohaisen", "Qingfu Wen", "Mo Li"], "publication_date": "2017/5/1", "conference": "IEEE INFOCOM 2017-IEEE Conference on Computer Communications", "pages": "1-9", "publisher": "IEEE", "description": "Automated Fare Collection (AFC) systems have been globally deployed for decades, particularly in public transportation. Although the transaction messages of AFC systems are mostly transferred in plaintext, which is obviously insecure, system operators do not need to pay much attention to this issue, since the AFC network is well isolated from public network (e.g., the Internet). Nevertheless, in recent years, the advent of Near Field Communication (NFC)-equipped smartphones has bridged the gap between the AFC network and the Internet through Host-based Card Emulation (HCE). Motivated by this fact, we design and practice a novel paradigm of attack on modern distance-based pricing AFC systems, enabling users to pay much less than actually required. Our constructed attack has two important properties: 1) it is invisible to AFC system operators because the attack never causes any inconsistency in the …", "total_citations": {"2017": 2, "2018": 2, "2019": 2, "2020": 2, "2021": 2, "2022": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:D_sINldO8mEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6583156/", "authors": ["Zhenjiang Li", "Wenwei Chen", "Cheng Li", "Mo Li", "Xiang-Yang Li", "Yunhao Liu"], "publication_date": "2014/7", "journal": "IEEE Transactions on Mobile Computing", "volume": "13", "issue": "7", "pages": "1495-1508", "publisher": "IEEE", "description": "In this paper, we propose a novel clock calibration approach called FLIGHT, which leverages the fact that the fluorescent light intensity changes with a stable period that equals half of the alternating current's. By tuning to the light emitted from indoor fluorescent lamps, FLIGHT can intelligently extract the light period information and achieve network wide time calibration by referring to such a common time reference. The light period can be also viewed as an indoor context indicator. As sampling the light sensor consumes substantially less energy, FLIGHT provides us a lightweight clock calibration and time synchronization solution. In addition, FLIGHT suits various mobility-enabled scenarios and it can work well even when the network is temporarily disconnected. We address a series of practical challenges and implement FLIGHT in TelosB motes. We conduct comprehensive experiments using a 12-node test-bed in …", "total_citations": {"2016": 4, "2017": 0, "2018": 1, "2019": 1, "2020": 1, "2021": 3, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:uWQEDVKXjbEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6152099/", "authors": ["Yuan He", "Mo Li"], "publication_date": "2012/2/13", "journal": "Parallel and Distributed Systems, IEEE Transactions on", "issue": "99", "pages": "1-1", "publisher": "IEEE", "description": "Demands on better interacting with physical world require an effective and efficient collaboration mechanism of multiple heterogeneous sensor networks. Previous works mainly focus on each single and specific sensor network, thus failing to address issues in the newly emerging scenario. In this paper, we propose COSE, a query-centric framework of collaborative heterogeneous sensor networks, where sensor networks collaborate with each other for effective and efficient processing of queries. Finding an optimal strategy of query processing with respect to energy efficiency is a crucial issue in COSE, which we formulate into an optimization problem, called EE-QPS. We prove the NP-hardness of EE-QPS, and then design a heuristic approach named IAP by utilizing the correlation (called implication in this paper) among different sensor networks. The experimental results demonstrate that in the context of COSE …", "total_citations": {"2013": 4, "2014": 3, "2015": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:HoB7MX3m0LUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5963658/", "authors": ["Mo Li", "Xiaoye Jiang", "Leonidas Guibas"], "publication_date": "2011/7/21", "journal": "Parallel and Distributed Systems, IEEE Transactions on", "issue": "99", "pages": "1-1", "publisher": "IEEE", "description": "We demonstrate that the network flux over the sensor network provides fingerprint information about the mobile users within the field. Such information is exoteric in the physical space and easy to access through passive sniffing. We present a theoretical model to abstract the network flux according to the statuses of mobile users. We fit the theoretical model with the network flux measurements through Nonlinear Least Squares (NLS) and develop an algorithm that iteratively approaches the NLS solution by Sequential Monte Carlo Estimation. With sparse measurements of the flux information at individual sensor nodes, we show that it is easy to identify the mobile users within the network and instantly track their movements without breaking into the details of the communicational packets. Our study indicates that most of existing systems are vulnerable to such attack against the privacy of mobile users. We further …", "total_citations": {"2013": 1, "2014": 4, "2015": 3, "2016": 1, "2017": 0, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:lmc2jWPfTJgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9031291/", "authors": ["Wan Du", "Panrong Tong", "Mo Li"], "publication_date": "2020/3/10", "journal": "IEEE Transactions on Mobile Computing", "volume": "20", "issue": "7", "pages": "2505-2517", "publisher": "IEEE", "description": "Current localization schemes on mobile devices are experiencing great diversity that is mainly shown in two aspects: the large number of available localization schemes and their diverse performance. This paper presents UniLoc, a unified framework that gains improved performance from multiple localization schemes by exploiting their diversity. UniLoc predicts the localization error of each scheme online based on an error model and real-time context. It further combines the results of all available schemes based on the error prediction results and an ensemble learning algorithm. The combined result is more accurate than any individual schemes. With the flexible design of error modeling and ensemble learning, UniLoc can easily integrate a new localization scheme. The energy consumption of UniLoc is low, since its computation, including both error prediction and ensemble learning, only involves simple linear …", "total_citations": {"2019": 2, "2020": 0, "2021": 2, "2022": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:-FonjvnnhkoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8928938/", "authors": ["Panrong Tong", "Wan Du", "Mo Li", "Jianqiang Huang", "Wenqiang Wang", "Zheng Qin"], "publication_date": "2019/12/9", "journal": "IEEE Transactions on Intelligent Transportation Systems", "volume": "22", "issue": "1", "pages": "293-306", "publisher": "IEEE", "description": "By processing a large dataset composed of daily trajectories of thousands of students in Singapore, we find that, instead of simply picking up students from their homes, an optimal school shuttle planning system needs to learn the real transportation usage and plan across all potential pickup locations for every student to generate need-satisfying routes. It is challenging, however, to perform route planning over a large number of students each having multiple potential pickup locations. We develop a graph-based data structure that embeds potential pickup locations of all students with the awareness of real-world constraints and existing public transits. Based on the graph structure, we prove that the optimal last-mile school shuttle planning problem is NP-hard and thereafter design a Tabu-based expansion algorithm to solve the problem, which strikes at a proper balance between the savings of students' commute …", "total_citations": {"2018": 1, "2019": 0, "2020": 1, "2021": 2, "2022": 3, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:LkGwnXOMwfcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5541659/", "authors": ["Mo Li", "Xiaoye Jiang", "Leonidas Guibas"], "publication_date": "2010/6/21", "conference": "Distributed Computing Systems (ICDCS), 2010 IEEE 30th International Conference on", "pages": "478-487", "publisher": "IEEE", "description": "We demonstrate that the network flux over the sensor network provides us fingerprint information about the mobile users within the field. Such information is exoteric in the physical space and easy to access through passive sniffing. We present a theoretical model to the network flux according to the statuses of mobile users. We fit the theoretical model with the network flux measurements through Non-linear Least Squares (NLS) and develop an algorithm that iteratively approaches the NLS solution by Sequential Monte Carlo Estimation. With sparse measurements of the flux information at individual sensor nodes, we are able to identify the mobile users within the network and instantly track their movements without breaking into the details of the communicational packets. A particular advantage of this approach is that compared to the vast information we can reveal the required knowledge is extremely cheap. As all …", "total_citations": {"2011": 2, "2012": 2, "2013": 1, "2014": 2, "2015": 0, "2016": 0, "2017": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:5qfkUJPXOUwC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3560905.3568517", "authors": ["Sijie Ji", "Yaxiong Xie", "Mo Li"], "publication_date": "2022", "description": "Falls are one of the leading causes of death in the elderly people aged 65 and above. In order to prevent death by sending prompt fall detection alarms, non-invasive radio-frequency (RF) based fall detection has attracted significant attention, due to its wide coverage and privacy preserving nature. Existing RF-based fall detection systems process fall as an activity classification problem and assume that human falls introduce reproducible patterns to the RF signals. We, however, argue that the fall is essentially an accident, hence, its impact is uncontrollable and unforeseeable. We propose to solve the fall detection problem in a fundamentally different manner. Instead of directly identifying the human falls which are difficult to quantify, we recognize the normal repeatable human activities and then identify the fall as abnormal activities out of the normal activity distribution. We implement our idea and build a prototype …", "total_citations": {"2023": 8}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:foquWX3nUaYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9355597/", "authors": ["Chaojie Gu", "Linshan Jiang", "Rui Tan", "Mo Li", "Jun Huang"], "publication_date": "2020/11/1", "conference": "2020 IEEE 40th International Conference on Distributed Computing Systems (ICDCS)", "pages": "100-110", "publisher": "IEEE", "description": "Low-power wide-area network technologies such as LoRaWAN are promising for collecting low-rate monitoring data from geographically distributed sensors, in which timestamping the sensor data is a critical system function. This paper considers a synchronization-free approach to timestamping LoRaWAN uplink data based on signal arrival time at the gateway, which well matches LoRaWAN’s one-hop star topology and releases bandwidth from transmitting timestamps and synchronizing end devices’ clocks at all times. However, we show that this approach is susceptible to a frame delay attack consisting of malicious frame collision and delayed replay. Real experiments show that the attack can affect the end devices in large areas up to about 50, 000 m 2 . In a broader sense, the attack threatens any system functions requiring timely deliveries of LoRaWAN frames. To address this threat, we propose a LoRaTS …", "total_citations": {"2020": 1, "2021": 2, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:tYavs44e6CUC": {"external_link": "https://www.inderscienceonline.com/doi/abs/10.1504/IJAHUC.2015.069061", "authors": ["Saiyu Qi", "Li Lu", "Zhenjiang Li", "Mo Li"], "publication_date": "2012/12/17", "conference": "2012 IEEE 18th International Conference on Parallel and Distributed Systems", "pages": "424-431", "publisher": "IEEE", "description": "Radio frequency identification (RFID) technique is gaining increasing popularity in supply chain for product management. By attaching a tag to each product, a reader can employ an authentication protocol to interrogate the tag's information for verification, which facilitates the automatic processing and monitoring of products in many applications. However, most current solutions can not be directly used as they can not balance the tradeoff between the privacy and efficiency for individual parties. In this paper, we design a bidirectional efficiency-privacy transferable (BEST) authentication protocol to address this issue. In a relatively secure domain, BEST works in an efficient manner to authenticate batches of tags with less privacy guarantee. Once the tags flow into open environment, BEST can migrate to provide stronger privacy protection to the tags with moderate efficiency degradation. The analytic result shows that …", "total_citations": {"2014": 1, "2015": 1, "2016": 2, "2017": 0, "2018": 0, "2019": 2, "2020": 0, "2021": 0, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:_kc_bZDykSQC": {"external_link": "https://www.researchgate.net/profile/Xiang-Ke-Liao/publication/220587024_Connectivity-Based_Wormhole_Detection_in_Ubiquitous_Sensor_Networks/links/00b7d52e713cef0c87000000/Connectivity-Based-Wormhole-Detection-in-Ubiquitous-Sensor-Networks.pdf", "authors": ["DEZUN DONG", "MO LI", "YUNHAO LIU", "XIANGKE LIAO"], "publication_date": "2011", "journal": "Journal of information science and engineering", "volume": "27", "pages": "65-78", "description": "Wormhole attack is a severe threat against ubiquitous sensor networks. It can be launched without compromising any legitimate node or cryptographic mechanisms, and often serves as a stepping stone for many serious attacks. Most existing countermeasures often make critical assumptions or require specialized hardware devices in the network. Those assumptions and requirements limit the applicability of previous approaches. In this work, we explore the impact of wormhole attacks on network connectivity topologies, and develop a simple distributed method to detect wormholes, called WormCircle. WormCircle relies solely on local connectivity information without any requirements on special hardware devices or making any rigorous assumptions on network properties. We establish the correctness of this design in continuous geometric domains and extend it into discrete networks. We evaluate the effectiveness in randomly deployed sensor networks through extensive simulations.", "total_citations": {"2012": 2, "2013": 2, "2014": 0, "2015": 1, "2016": 1, "2017": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:Zph67rFs4hoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4700449/", "authors": ["Hanhua Chen", "Mo Li", "Hai Jin", "Yunhao Liu", "Lionel M Ni"], "publication_date": "2008/11/30", "conference": "Real-Time Systems Symposium, 2008", "pages": "355-364", "publisher": "IEEE", "description": "Geographical hash table (GHT) has been widely used to provide energy efficiency for data-centric storage in wireless sensor networks. Such a mechanism, however, suffers from high communication cost when we apply multi-dimensional event search in the network. In this work, we present MDS, a flexible, complete, and efficient multi-dimensional search mechanism atop traditional GHT based data-centric storage architecture. MDS utilizes bloom filters to reduce the communication cost of in-network intersection and union operations for multi-dimensional queries in wireless sensor networks. This scheme can be easily extended to support multi-dimensional range queries. Our mathematical analysis indicates the optimal settings for the bloom filters that maximize the traffic savings according to the information popularities. We conduct comprehensive simulations to evaluate our design. Results show that MDS …", "total_citations": {"2012": 2, "2013": 0, "2014": 3, "2015": 1, "2016": 0, "2017": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:WF5omc3nYNoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4383454/", "authors": ["Mo Li", "Lei Chen", "Jizhong Zhao", "Qian Zhang", "Yunhao Liu"], "publication_date": "2008/9", "journal": "Vehicular Technology, IEEE Transactions on", "volume": "57", "issue": "5", "pages": "3146-3154", "publisher": "IEEE", "description": "Wireless sensor networks (WSNs) are widely used in many application fields. Because sensor nodes are generally battery powered, to prolong network lifetime, energy conservation becomes a major concern in answering queries over sensor networks. In addition, a robust and fault-tolerant data-collection method is highly desirable against a lossy network with low-quality wireless communication links and unreliable sensor nodes. We propose a signature-file-based approach to approximately answer queries over WSNs. By combining the duplicate-insensitive structure of signature files and the redundant multipath routing approach, we create a robust in-network aggregation scheme, which can answer both aggregative and range queries with high accuracy while significantly reducing the cost of message transmissions. Simulations have been conducted to evaluate the performance of this approach under various …", "total_citations": {"2009": 2, "2010": 0, "2011": 2, "2012": 2, "2013": 0, "2014": 1, "2015": 0, "2016": 0, "2017": 0, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:epqYDVWIO7EC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8119566/", "authors": ["Huanle Zhang", "Wan Du", "Pengfei Zhou", "Mo Li", "Prasant Mohapatra"], "publication_date": "2017/11/23", "journal": "IEEE Transactions on Mobile Computing", "publisher": "IEEE", "description": "This paper presents DopEnc, an acoustic-based encounter profiling system on commercial off-the-shelf smartphones. DopEnc automatically identifies the persons that users interact with in the context of encountering. DopEnc performs encounter profiling in two major steps: (1) Doppler profiling to detect that two persons approach and stop in front of each other via an effective trajectory, and (2) voice profiling to confirm that they are thereafter engaged in an interactive conversation. DopEnc is further extended to support parallel acoustic exploration of many users by incorporating a unique multiple access scheme within the limited inaudible acoustic frequency band. All implementation of DopEnc is based on commodity sensors like speakers, microphones, and accelerometers integrated on mainstream smartphones. We evaluate DopEnc with detailed experiments and a real use-case study of 11 participants. Overall …", "total_citations": {"2019": 1, "2020": 5, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:VL0QpB8kHFEC": {"external_link": "https://journals.sagepub.com/doi/abs/10.1155/2015/135150", "authors": ["Shiqi Jiang", "Pengfei Zhou", "Mo Li"], "publication_date": "2015/11/2", "journal": "International Journal of Distributed Sensor Networks", "volume": "11", "issue": "11", "pages": "135150", "publisher": "SAGE Publications", "description": "With the wide development of smartphones, mobile data usage has enjoyed rapid growth in recent years. Unfortunately many users are plagued with Phantom Data Usage (PDU), which refers to the unexpected mobile data usage that does not accord with user perception. We investigate about 400 real PDU issues and find the causes of PDU are not only the exceptions of applications, for example, software bugs or malware, but also the user's personalized misuse. Based on the observations that each user preserves specific data usage patterns under particular environmental context, we present PDS, a PDU detection system, which automatically detects whether the current data usage is consumed as expected. Results from our evaluation experiments show that 72% of PDU cases detected by PDS are confirmed by users.", "total_citations": {"2016": 3, "2017": 1, "2018": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:eq2jaN3J8jMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6786460/", "authors": ["Wan Du", "Mo Li", "Jingsheng Lei"], "publication_date": "2014/12", "journal": "IEEE Transactions on Wireless Communications", "volume": "13", "issue": "12", "pages": "6643-6654", "publisher": "IEEE", "description": "Based on plenty of sensors on smartphones and tablets, their location information becomes more accurate and easy to access. Many position-based applications have thus been developed. As these mobile devices have become the main access approach of 802.11-based wireless local area networks (WLAN), location information also provides opportunities to improve the performance of underlying wireless communication. This paper presents CO-MAP (Co-Occurrence MAP), which leverages location information to handle exposed and hidden terminal problems, which are still a major cause of throughput degradation in mobile WLANs. With the positions of nodes, CO-MAP rapidly builds a co-occurrence map showing which two links can occur concurrently. Meanwhile, to avoid potential collisions, it selects the best settings of frame transmissions based on a novel analytic network model when hidden terminals are …", "total_citations": {"2014": 2, "2015": 1, "2016": 1, "2017": 0, "2018": 0, "2019": 2, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:08ZZubdj9fEC": {"external_link": "https://www.research-collection.ethz.ch/bitstream/handle/20.500.11850/153571/eth-6558-01.pdf#page=166", "authors": ["Cheng Li", "Forrest Meggers", "Mo Li", "Jithendrian Sundaravaradan", "Fei Xue", "HockBeng Lim", "Arno Schlueter"], "publication_date": "2013/2/14", "journal": "Proceedings of the ICT4S", "volume": "13", "pages": "159-166", "description": "Buildings consume a great amount of energy. The sustainability requirement asks for more efficient energy usage. The first step towards energy efficiency is to understand in detail how, when, and where energy is consumed in buildings. Advances in Information and Communication Technologies (ICT), especially the embedded sensing and wireless communication techniques, enable an intelligent building monitoring for such an understanding. In this paper, we design and deploy a wireless sensor network based monitoring system in a building test-bed, composed of two containers (named BubbleZERO). We deploy a variety of sensors, including temperature, humidity, flow-rate, and CO2 concentration sensors, to monitor our new energy efficient Heating Ventilation and Cooling (HVAC) system. We develop a data management system to manage and distribute the harvested data to all subscribed users. The system has an user-friendly web based interface. Users can access, retrieve, download and visualize the data from their internet browsers.", "total_citations": {"2013": 3, "2014": 0, "2015": 0, "2016": 0, "2017": 2, "2018": 0, "2019": 1, "2020": 0, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:5nxA0vEk-isC": {"external_link": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=3a2e32c1e74a68df157860be4f866e702b69f4e4", "authors": ["Mo Li", "Jiliang Wang", "Zheng Yang", "Jingyao Dai"], "publication_date": "2008", "journal": "Proceedings of ACM SenSys", "pages": "391-392", "publisher": "New York, USA", "description": "This work proposes to utilize the wireless sensor network as an infrastructure system for navigating internal users under emergencies. The users are equipped with communicating devices like 802.15. 4 compatible PDAs that talk with sensors. Under emergencies, the sensor network explores the dangerous areas and provides necessary guiding information to safely navigate the users out of the field. Many efforts have been made towards guiding navigation using wireless sensor networks. As a natural intuition, most existing approaches assume the availability of locations on each sensor node. Based on the awareness of the locations of dangerous areas, the sensor network incurs easy and efficient route calculations to navigate internal users out of the emergent field. The location information may not be always available in many practical situations, such as underground tunnel or coal mine environment, complicated indoor area, etc. As reported in our recent work for the coal mine surveillance sensor network [1], it is essential to navigate miners to retreat from the coal mine tunnels after emergency happens, yet obtaining accurate location for each sensor is quite difficult in the GPS-less underground environment. Indeed, the requirement of location information largely limits the applicability of existing approaches on location-free environment. Besides, existing approaches do not specifically consider the impact of the variations on dangerous areas, eg, the emerging, expanding, shrinking or diminishing of dangerous areas. In reality, such variations might significantly degrade the effectiveness or even overwhelm existing navigation protocols …", "total_citations": {"2008": 1, "2009": 1, "2010": 0, "2011": 0, "2012": 2, "2013": 1, "2014": 1, "2015": 0, "2016": 0, "2017": 0, "2018": 0, "2019": 0, "2020": 0, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:_FxGoFyzp5QC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1690621/", "authors": ["Jianfeng Cai", "Yunhuai Liu", "Jie Lian", "Mo Li", "Udo Pooch", "Lionel Ni"], "publication_date": "2006/8/14", "conference": "Parallel Processing, 2006. ICPP 2006. International Conference on", "pages": "203-210", "publisher": "IEEE", "description": "In wireless mobile ad hoc networks (MANETs), energy is a crucial resource. Topology control technology allows network nodes to reduce their transmission power while preserving the network connectivity. A MANET is a non-cooperative system so that only when a node earns its payment, which can cover its cost, the cooperation can be stimulated. We design a truthful topology control mechanism (TRUECON) for MANETs to induce the selfish, but rational, network nodes to collaborate. Truth-telling is a dominant strategy in TRUECON. A node needs to reveal its true value in order to obtain the maximum expected utility. We prove the overpayment of TRUECON has a bound depending on different radio propagation models", "total_citations": {"2008": 1, "2009": 0, "2010": 0, "2011": 1, "2012": 1, "2013": 2, "2014": 0, "2015": 0, "2016": 1, "2017": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:mvPsJ3kp5DgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6471978/", "authors": ["Mo Li", "Zhenjiang Li", "Longfei Shangguan", "Shaojie Tang", "X Li"], "issue": "99", "pages": "1-1", "publisher": "IEEE", "description": "In many sensor network applications, multiple data forwarding tasks usually exist with different source-destination node pairs. Due to limitations of the duty-cycling operation and interference, however, not all tasks can be guaranteed to be scheduled within their required delay constraints. We investigate a fundamental scheduling problem of both theoretical and practical importance, called multi-task schedulability problem, i.e., given multiple data forwarding tasks, to determine the maximum number of tasks that can be scheduled within their deadlines and work out such a schedule. We formulate the multi-task schedulability problem, prove its NP-Hardness, and propose an approximate algorithm with analysis on the performance bound and complicity. We further extend the proposed algorithm by explicitly altering duty cycles of certain sensor nodes so as to fully support applications with stringent delay requirements …", "total_citations": {"2014": 3, "2015": 2, "2016": 1, "2017": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:8AbLer7MMksC": {"external_link": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=f430e742f92b2d72e0dc34b35297b3c28a4c3567", "authors": ["Xiangyang Li", "Yajun Wang", "Wangsen Feng", "Mo Li", "YunHao Liu"], "publication_date": "2009", "journal": "The 15th International Computing and Combinatorics Conference", "description": "In a pioneering work, Gupta and Kumar [9] studied the critical transmission range needed for the connectivity of random wireless networks. Their result implies that, given a square region of", "total_citations": {"2011": 1, "2012": 0, "2013": 2, "2014": 0, "2015": 0, "2016": 0, "2017": 1, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:EkHepimYqZsC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3070720", "authors": ["Die Wu", "Li Lu", "Muhammad Jawad Hussain", "Songfan Li", "Mo Li", "Fengli Zhang"], "publication_date": "2018/1/12", "journal": "ACM Transactions on Embedded Computing Systems (TECS)", "volume": "17", "issue": "1", "pages": "9", "publisher": "ACM", "description": "Computational Radio Frequency Identification (CRFID) tags operate solely on harvested energy and have emerged as viable platforms for a variety of ubiquitous sensing and computation applications. Due to their battery-less nature, these tags can be permanently deployed in hard-to-reach places where the possibility of tag access is eliminated. In such scenarios, maintaining and upgrading the tag’s firmware becomes infeasible because programming tools, including wired interface and PC-based software, are required to erase, modify, or reprogram the microcontroller unit’s memory. Such limitations necessitate the demand for an over-the-air (OTA) scheme, which can wirelessly reprogram or upgrade the firmware in CRFID tags. In this article, we present R3—a reliable OTA reprogramming scheme that is compliant with EPC protocol and requires no hardware upgrade to RFID reader or CRFID tag. We …", "total_citations": {"2018": 1, "2019": 2, "2020": 0, "2021": 0, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:eQOLeE2rZwMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4724373/", "authors": ["Shanshan Li", "Xiaoping Wang", "Mo Li", "Xiangke Liao"], "publication_date": "2008/12/8", "conference": "Parallel and Distributed Systems, 2008. ICPADS'08. 14th IEEE International Conference on", "pages": "623-630", "publisher": "IEEE", "description": "In wireless sensor networks, mobile sensors are often employed for enhancing the sensing coverage and detection accuracy. Current approaches assume mobile sensors with the capability of arbitrary movement. The usage of such sensors with unlimited mobility, however, requires complicated sensor manufactures and high intelligence of movement which are practically unrealistic in many practical applications. We investigate the usage of cable-based mobile sensors which move along pre-deployed cables to accomplish sensing tasks at different positions. A target area is said to be reachable, if for any point in this area, at least one mobile sensor can move along the cable and achieve coverage to the point within a specified delay bound. We propose to achieve k reachability for the sensing field with minimum mobile sensors along the cable. Further, during special events, mobile sensors need to move and help …", "total_citations": {"2010": 3, "2011": 1, "2012": 0, "2013": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:NJ774b8OgUMC": {"external_link": "https://link.springer.com/article/10.1007/s11276-015-1170-2", "authors": ["Yuxiao Hou", "Yuanqing Zheng", "Mo Li"], "publication_date": "2017/2", "journal": "Wireless Networks", "volume": "23", "pages": "467-486", "publisher": "Springer US", "description": "In wireless local area network (WLAN), improving the quality of service (QoS) of users is often at odd with striking fairness among users. In this work, we suggest that in WLAN, multiple types of network resources should be jointly allocated to users to achieve “QoS fairness”, which is a new fairness concept targeting at balancing QoS and fairness in WLAN by allocating multiple types of network resources to users. To this end, we first transform user QoS requirements to multi-resource demands and apply the dominant resource fairness scheme to allocate network resources for each user. We prove several salient QoS-based fairness properties based on a model mapping between QoS and resources. We further discuss about more general conditions for diverse mapping models where QoS fairness properties can be satisfied. We find that the QoS fairness properties can be guaranteed as long as the mapping …", "total_citations": {"2018": 1, "2019": 2, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:0KyAp5RtaNEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7562268/", "authors": ["Shiqi Jiang", "Pengfei Zhou", "Zhenjiang Li", "Mo Li"], "publication_date": "2016/4/10", "conference": "2016 IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "1091-1092", "publisher": "IEEE", "description": "Background. Lifelogging stands for an activity to digitalize human daily lives, which was widely adopted in the therapy for a series of neurodegenerative diseases using dedicated devices [5]. Nowadays, due to the increasing popularity of mobile devices, the usage of lifelogging has been dramatically expended. For instance, it already becomes an emerging culture for people to collect their daily memorial moments and share them on social network. Although people can use various on-board sensors from mobile devices to log their lives in many different ways, e.g., the text, image, audio clip, video, etc., it requires excessive user's interventions. Many brief but valuable moments could be easily missed due to the lag when a user performs lifelogging. On the other hand, the intervention overhead causes non-negligible burdens and may impair user willingness to conduct lifelogging. Recently, wearable devices, e.g …", "total_citations": {"2015": 1, "2016": 0, "2017": 1, "2018": 0, "2019": 1, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:9vf0nzSNQJEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6680285/", "authors": ["Jiliang Wang", "Wei Dong", "Mo Li", "Yunhao Liu"], "publication_date": "2013/10/14", "conference": "2013 IEEE 10th International Conference on Mobile Ad-Hoc and Sensor Systems", "pages": "452-460", "publisher": "IEEE", "description": "Channel utilization for wireless sensor networks is far from efficient, especially for convergecast in which multiple nodes are sending packets to a receiver. In this paper, we analyze the channel utilization when multiple nodes contend for the channel in convergecast and show that channel utilization can be improved by accumulating packets on each node. However, the number of accumulated packets should be carefully determined. Otherwise, the system performance may not be improved or even be degraded, e.g., incurring additional packet delay. Based on the analysis result, we present STAGGER to achieve channel utilization improvement while guarantee the worst case performance. We implement STAGGER in TinyOS 2.1 and evaluate its performance on TelosB nodes. STAGGER only uses local information to determine the number of accumulated packets without incurring additional overhead. It adopts …", "total_citations": {"2020": 2, "2021": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:bnK-pcrLprsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6681594/", "authors": ["Wan Du", "Mo Li"], "publication_date": "2013/7/8", "conference": "2013 IEEE 33rd International Conference on Distributed Computing Systems", "pages": "246-255", "publisher": "IEEE", "description": "Benefiting from the abundant sensor hints of current mobile devices, their location information has become pervasively available and easy to access. As smartphones and tablets have become recently the main access devices of 802.11-based WLAN, location information provides large opportunity to improve the performance of underlying wireless communication. This paper presents CO-MAP (Co-Occurrence MAP) which leverages the position of devices to handle exposed and hidden terminal problems in mobile WLANs so as to improve the multiple access efficiency. With the location information, CO-MAP rapidly builds a co-occurrence map showing which two links can occur concurrently. Meanwhile, it selects the best settings of frame transmissions based on a novel analytical network model when hidden terminals are distinguished. CO-MAP improves the goodputs of both downlinks and uplinks in instant and …", "total_citations": {"2014": 2, "2015": 0, "2016": 0, "2017": 0, "2018": 0, "2019": 1, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:MXK_kJrjxJIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5779062/", "authors": ["Xiaoye Jiang", "Mo Li", "Yuan Yao", "Leonidas J Guibas"], "publication_date": "2011/4/12", "conference": "Information Processing in Sensor Networks (IPSN), 2011 10th International Conference on", "pages": "25-36", "publisher": "IEEE", "description": "This paper presents a scalable algorithm for managing property information about moving objects tracked by a sensor network. Property information is obtained via distributed sensor observations, but will be corrupted when objects mix up with each other. The association between properties and objects then becomes ambiguous. We build a novel representation framework, exploiting an overcomplete Radon basis dictionary to model property uncertainty in such circumstances. By making use of the combinatorial structure of the basis design and sparse representations we can efficiently approximate the underlying probability distribution of the association between target properties and tracks, overcoming the exponential space that would otherwise be required. We conduct comparative simulations and the results validate the effectiveness of our approach.", "total_citations": {"2011": 1, "2012": 1, "2013": 0, "2014": 1, "2015": 0, "2016": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:3fE2CSJIrl8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5541666/", "authors": ["Rui Chu", "Lin Gu", "Yunhao Liu", "Mo Li", "Xicheng Lu"], "publication_date": "2010/6/21", "conference": "Distributed Computing Systems (ICDCS), 2010 IEEE 30th International Conference on", "pages": "388-397", "publisher": "IEEE", "description": "The networked application environment has motivated the development of multitasking operating systems for sensor networks and other low-power electronic devices, but their multitasking capability is severely limited because traditional stack management techniques perform poorly on small memory systems. In this paper, we show that combining binary translation and a new kernel runtime can lead to efficient OS designs on resource-constrained platforms. We introduce SenSmart, a multitasking OS for sensor networks, and present new OS design techniques for supporting preemptive multi-task scheduling, memory isolation, and versatile stack management. We have implemented SenSmart on MICA2/MICAz motes. Evaluation shows that SenSmart performs efficient binary translation and demonstrates a significantly better capability in managing concurrent tasks than other sensor net operating systems.", "total_citations": {"2011": 1, "2012": 0, "2013": 2, "2014": 0, "2015": 0, "2016": 0, "2017": 0, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:ClCfbGk0d_YC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3495243.3517023", "authors": ["Pengfei Zhou", "Yi Ding", "Yang Li", "Mo Li", "Guobin Shen", "Tian He"], "publication_date": "2022/10/14", "book": "Proceedings of the 28th Annual International Conference on Mobile Computing And Networking", "pages": "94-105", "description": "This paper presents our experience in adopting recent research results of mobile phone based indoor/outdoor detection (IODetector) to support the real world business of on-demand food delivery. The real world deployment of the adopted IODetector involves three phases spanning 20 months, during which the deployment scales from a feasibility study across a few areas of interest to a city-wide trial in Shanghai, and eventually to nationwide deployment over 367 cities in China. Iterative development has been performed throughout different deployment phases to excel the IODetector. Large scale evaluation and comparative A/B testing suggest key value of adopting indoor/outdoor detection in the real world business. We also present the lessons learned from the deployment experience including real world know-hows, practical limits and constraints, as well as discussions on design alternatives. We believe this …", "total_citations": {"2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:xtoqd-5pKcoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9458618/", "authors": ["E Jinlong", "Mo Li", "Jianqiang Huang"], "publication_date": "2021/4/19", "conference": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "2219-2224", "publisher": "IEEE", "description": "While the urban rail transit systems are playing an increasingly important role in meeting the transportation demands of people, the precise awareness of how the human crowd is distributed within the urban rail transit system is highly necessary, which serves to a range of important applications including emergency response, transit recommendation, commercial valuation, etc. Most urban rail transit systems are closed systems where once entered the travelers are free to move around all stations that are connected into the system and are difficult to track. In this paper, we attempt to estimate the crowd distribution within the urban rail transit system based only on the entrance and exit records of all the rail riders. Specifically, we study Singapore MRT (Mass Rapid Transit) as a vehicle and leverage the tap-in and tap-out records of the EZ-Link transit cards to estimate the crowd distribution. Guided by a key observation …", "total_citations": {"2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:SdhP9T11ey4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6914330/", "authors": ["Yuxiao Hou", "Mo Li", "Yuanqing Zheng"], "publication_date": "2014/5/26", "conference": "2014 IEEE 22nd International Symposium of Quality of Service (IWQoS)", "pages": "290-295", "publisher": "IEEE", "description": "We consider the problem of allocating two network resources (wireless bandwidth and backhaul router buffer) to support fair QoS in WLAN. We transform the QoS requirements to multi-resource demands and apply the DRF scheme to achieve fair allocation of the two different types of resources. We define a QoS utility function which measures the user QoS satisfaction. We briefly prove the property of resource-based strategy proofness of DRF, the corresponding mathematical expression is used to prove QoS-based strategy-proofness in terms of both resource share and user QoS. Finally our simulation results confirm the properties of DRF and demonstrate that our DRF-based approach performs better than several multi-resource allocation schemes with respect to both fairness and utility.", "total_citations": {"2016": 1, "2017": 1, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:qxL8FJ1GzNcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5663953/", "authors": ["Jiliang Wang", "Mo Li", "Yunhao Liu"], "publication_date": "2010/11/8", "conference": "Mobile Adhoc and Sensor Systems (MASS), 2010 IEEE 7th International Conference on", "pages": "137-145", "publisher": "IEEE", "description": "Wireless sensor networks are deployed in various territories executing different tasks. In many applications, it is very useful to understand their topological characteristics. This paper studies the problem of discovering the topological properties of a sensor network such as boundaries and holes. Previous works have revealed that, such a problem could be addressed with knowledge of node locations, measures of interdistances, or ideal assumptions of particular communication models, e.g., unit disk graph model. In this work, however, we explore the possibility of discovering sensor network topology merely with connectivity information. We propose a virtual voronoi diagram approach to detect both the inner and outer boundaries of a sensor network. We do not rely on any communication models, yet any geometric knowledge of the network. Compared with previous connectivity based approaches, we further release …", "total_citations": {"2012": 1, "2013": 1, "2014": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:nrtMV_XWKgEC": {"external_link": "https://repository.ust.hk/ir/Record/1783.1-8954", "authors": ["Hanhua Chen", "Mo Li", "Hai Jin", "Yunhao Liu", "Lionel Ni"], "publication_date": "2008", "journal": "The 29th IEEE Real-Time Systems Symposium", "description": "MDS: Efficient Multi-dimensional Search in Wireless Sensor Networks - HKUST SPD | The \nInstitutional Repository Skip to content Search Publications Advanced Search Profiles MDS: \nEfficient Multi-dimension... Please use this identifier to cite or link to this item: https://hdl.handle.net/1783.1/8954 \nMDS: Efficient Multi-dimensional Search in Wireless Sensor Networks Author Chen, Hanhua \nLi, Mo Jin, Hai Liu, Yunhao Ni, Lionel Ming-Shuan View this author's profile Issue Date 2008 \nConference The 29th IEEE Real-Time Systems Symposium, Barcelona, Spain, 30 November \n- 3 December 2008 Language English Type Conference paper Usage Metrics Page views \nFull-text downloads Similar Items MDS : efficient multi-dimensional query processing in \ndata-centric WSNs Author(s): Chen, Hanhua; Li, Mo; Jin, Hai... 2008 Efficient multi-keyword \nsearch over P2P web Author(s): Chen, Hanhua; Jin, Hai; Wang, Jiliang... 2008 …", "total_citations": {"2009": 2, "2010": 0, "2011": 0, "2012": 0, "2013": 0, "2014": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:PVjk1bu6vJQC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3560905.3568531", "authors": ["Linshan Jiang", "Qun Song", "Rui Tan", "Mo Li"], "publication_date": "2022/11/6", "book": "Proceedings of the 20th ACM Conference on Embedded Networked Sensor Systems", "pages": "164-178", "description": "Mobile cloud offloading is indispensable for inference tasks based on large-scale deep models. However, transmitting privacy-rich inference data to the cloud incurs concerns. This paper presents the design of a system called PriMask, in which the mobile device uses a secret small-scale neural network called MaskNet to mask the data before transmission. PriMask significantly weakens the cloud's capability to recover the data or extract certain private attributes. The MaskNet is cascadable in that the mobile can opt in to or out of its use seamlessly without any modifications to the cloud's inference service. Moreover, the mobiles use different MaskNets, such that the collusion between the cloud and some mobiles does not weaken the protection for other mobiles. We devise a split adversarial learning method to train a neural network that generates a new MaskNet quickly (within two seconds) at run time. We apply …", "total_citations": {"2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:_axFR9aDTf0C": {"external_link": "https://arxiv.org/abs/2208.11333", "authors": ["Sijie Ji", "Mo Li"], "publication_date": "2022/8/24", "journal": "arXiv preprint arXiv:2208.11333", "description": "CSI feedback is an important problem of Massive multiple-input multiple-output (MIMO) technology because the feedback overhead is proportional to the number of sub-channels and the number of antennas, both of which scale with the size of the Massive MIMO system. Deep learning-based CSI feedback methods have been widely adopted recently owing to their superior performance. Despite the success, current approaches have not fully exploited the relationship between the characteristics of CSI data and the deep learning framework. In this paper, we propose a jigsaw puzzles aided training strategy (JPTS) to enhance the deep learning-based Massive MIMO CSI feedback approaches by maximizing mutual information between the original CSI and the compressed CSI. We apply JPTS on top of existing state-of-the-art methods. Experimental results show that by adopting this training strategy, the accuracy can be boosted by 12.07% and 7.01% on average in indoor and outdoor environments, respectively. The proposed method is ready to adopt to existing deep learning frameworks of Massive MIMO CSI feedback. Codes of JPTS are available on GitHub for reproducibility.", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:q3CdL3IzO_QC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3517015", "authors": ["Xiaoyun Mo", "Chu Cao", "Mo Li", "David ZW Wang"], "publication_date": "2021/4/19", "conference": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "2249-2254", "publisher": "IEEE", "description": "Service disruptions of rail transit systems have become more frequent in the past decade in urban cities, due to various reasons, such as power failures, signal errors, and so on. Smart transit cards provide detailed tapping records of commuters, which enable us to infer their trajectories under both normal and disruptive circumstances. In this article, we study and predict the impact of disruptions on commuters and further evaluate the vulnerability of the rail system. Specifically, we define two metrics, stay ratio and travel delay, to quantify the impact, and we derive the predictor of each metric based on the inferred alternative route choices of commuters under disruptive circumstances. We demonstrate that the alternative route choices contribute to more similar feature distribution among different disruptions, which is crucial to tackling the main challenge of abnormal data scarcity and is beneficial for obtaining more …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:vbGhcppDl1QC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8428475/", "authors": ["Huanle Zhang", "Wan Du", "Mo Li", "Kaishun Wu", "Prasant Mohapatra"], "publication_date": "2018/8/7", "journal": "IEEE Transactions on Mobile Computing", "volume": "18", "issue": "7", "pages": "1674-1687", "publisher": "IEEE", "description": "This paper presents StrLight, the first practical VLC system that leverages widely-deployed string lights to transmit data. The data transmission is imperceptible to human eyes. Users can decode the data by mobile devices (e.g., smartphones) equipped with cameras. StrLight primarily differs from existing VLC systems in using string lights which are composed of a large number of small LEDs and thus the unique design to address practical issues including a special data modulation/encoding scheme, a data representation with unstructured/unknown topologies of LEDs in the string light, and a fault tolerance against broken and blocked LEDs. To the best of our knowledge, StrLight is the first practical VLC system of its kind. We build several prototypes of string light transmitters and test with different smartphone models and a customized mobile device as receivers. The experiment results show that StrLight provides an …", "total_citations": {"2020": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:evX43VCCuoAC": {"external_link": "https://patents.google.com/patent/US9955238B2/en", "inventors": "DU Wan, Jansen Christian Liando, Mo Li, Bingsheng He", "publication_date": "2018/4/24", "patent_office": "US", "patent_number": "9955238", "application_number": "15001523", "description": "A network of environmental sensor nodes is proposed in which data is transmitted wirelessly between the nodes using a rateless erasure code with a redundancy which is matched to the effective data rate, thereby permitting distanceless link transmissions. The wireless sensor networks is suitable to be sparsely deployed over wide area. A communication protocol is proposed to efficiently coordinate the distanceless link transmissions. A new metric (expected distanceless transmission time) is proposed for routing selection. The distanceless transmissions are well-adapted to low duty-cycled sensor networks.", "total_citations": {"2020": 1, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:uJ-U7cs_P_0C": {"external_link": "https://dro.deakin.edu.au/articles/conference_contribution/Cloud_assisted_water_quality_management_in_Singapore/20939911/1", "authors": ["Cheng Liu", "Zikun Xing", "Lloyd HC Chua", "Bingsheng He", "Mo Li", "Eikaas Hans"], "publication_date": "2012/1/1", "conference": "SIWW 2012: Notes from the Singapore International Water Week", "pages": "1-1", "publisher": "[The Conference]", "total_citations": {"2013": 1, "2014": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:GtLg2Ama23sC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3570361.3613274", "authors": ["Yinghui He", "Jianwei Liu", "Mo Li", "Guanding Yu", "Jinsong Han", "Kui Ren"], "publication_date": "2023/10/2", "book": "Proceedings of the 29th Annual International Conference on Mobile Computing and Networking", "pages": "1-16", "description": "Given the fact that WiFi-based sensing can be realized by reusing WiFi communication facilities and communication frequency bands, integrated sensing and communication (ISAC) is considered a crucial development direction for future WiFi standards, such as IEEE 802.11bf. Traditional WiFi sensing systems extract channel state information (CSI) from customized WiFi packets to quantify the characteristics of the sensing target. This poses challenges for existing WiFi systems originally designed for communication purposes, as it requires high-quality and sufficient CSI measurements. In this paper, we propose SenCom, which extracts CSI from general WiFi packets. SenCom enables CSI calibration across different WiFi communication modes and provides unified CSI measurements for upper-layer sensing applications. We also devise a fitting-resampling scheme to derive evenly sampled CSI with consistent …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:hCrLmN-GePgC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3568113.3568124", "authors": ["Huatao Xu", "Pengfei Zhou", "Rui Tan", "Mo Li", "Guobin Shen"], "publication_date": "2022/10/11", "journal": "GetMobile: Mobile Computing and Communications", "volume": "26", "issue": "3", "pages": "39-42", "publisher": "ACM", "description": "Deep learning greatly empowers Inertial Measurement Unit (IMU) sensors for a wide range of sensing applications. Most existing works require substantial amounts of wellcurated labeled data to train IMU-based sensing models, which incurs high annotation and training costs. Compared with labeled data, unlabeled IMU data are abundant and easily accessible. This article presents a novel representation learning model that can make use of unlabeled IMU data and extract generalized rather than task-specific features. With the representations learned via our model, task-specific models trained with limited labeled samples can achieve superior performances in typical IMU sensing applications, such as Human Activity Recognition (HAR).", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:t6usbXjVLHcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6990343/", "authors": ["Wan Du", "Mo Li", "Zikun Xing", "Bingsheng He", "Lloyd Hock Chye Chua", "Zhenjiang Li", "Yuanqiang Zheng", "Pengfei Zhou"], "publication_date": "2014/6/30", "conference": "2014 Eleventh Annual IEEE International Conference on Sensing, Communication, and Networking (SECON)", "pages": "161-163", "publisher": "IEEE", "description": "Water quality monitoring and prediction are critical for ensuring the sustainability of water resources which are essential for social security, especially for countries with limited land like Singapore. For example, the Singapore government identified water as a new growth sector and committed in 2006 to invest S$ 330 million over the following five years for water research and development [1]. To investigate the water quality evolution numerically, some key water quality parameters at several discrete locations in the reservoir (e.g., dissolved oxygen, chlorophyll, and temperature) and some environmental parameters (e.g., the wind distribution above water surface, air temperature and precipitation) are used as inputs to a three-dimensional hydrodynamics-ecological model, Estuary Lake and Coastal Ocean Model — Computational Aquatic Ecosystem Dynamics Model (ELCOM-CAEDYM) [2]. Based on the calculation in …", "total_citations": {"2015": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:M3ejUd6NZC8C": {"external_link": "https://www.inderscienceonline.com/doi/abs/10.1504/IJAHUC.2011.041625", "authors": ["Kebin Liu", "Mo Li", "Jiliang Wang", "Qiang Ma", "Minglu Li"], "publication_date": "2011/1/1", "journal": "International Journal of Ad Hoc and Ubiquitous Computing", "volume": "8", "issue": "1", "pages": "96-105", "publisher": "Inderscience Enterprises Ltd", "description": "In randomly deployed sensor networks, usually the node density is not uniform. The network lifetime is thus restricted by the sparsely covered regions. One solution to this problem is to send mobile sensors to low-node-density regions to supplement sensing capability. In this study, we show that with a limited number of mobile sensors, the network lifetime can be largely extended under our integrated scheduling on both mobile and stationary sensors. We also address the challenge of concurrently optimising the motion planning of mobile sensors and the duty cycles of stationary sensors. Simulation results show that our approach achieves high performance.", "total_citations": {"2015": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:Tiz5es2fbqcC": {"external_link": null, "authors": ["Xiaoye Jiang", "Mo Li", "Yuan Yao", "Leonidas Guibas"], "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:4fGpz3EwCPoC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3570361.3613299", "authors": ["Huatao Xu", "Pengfei Zhou", "Rui Tan", "Mo Li"], "publication_date": "2023/10/2", "book": "Proceedings of the 29th Annual International Conference on Mobile Computing and Networking", "pages": "1-15", "description": "Existing inertial measurement unit (IMU) based human activity recognition (HAR) approaches still face a major challenge when adopted across users in practice. The severe heterogeneity in IMU data significantly undermines model generalizability in wild adoption. This paper presents UniHAR, a universal HAR framework for mobile devices. To address the challenge of data heterogeneity, we thoroughly study augmenting data with the physics of the IMU sensing process and present a novel adoption of data augmentations for exploiting both unlabeled and labeled data. We consider two application scenarios of UniHAR, which can further integrate federated learning and adversarial training for improved generalization. UniHAR is fully prototyped on the mobile platform and introduces low overhead to mobile devices. Extensive experiments demonstrate its superior performance in adapting HAR models across four …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:kh2fBNsKQNwC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3588941", "authors": ["Kaiqi Liu", "Panrong Tong", "Mo Li", "Yue Wu", "Jianqiang Huang"], "publication_date": "2023/5/30", "journal": "Proceedings of the ACM on Management of Data", "volume": "1", "issue": "1", "pages": "1-28", "publisher": "ACM", "description": "Data scientists and researchers utilize enormous spatio-temporal data and build machine learning models to solve practical problems in diverse domains including intelligent transportation, urban planning, epidemic prediction, and many more. Extracting application-specific features from big spatio-temporal data poses system requirements of heterogeneous data support, efficient and scalable computing over spatial and temporal dimensions, as well as a user-friendly programming interface. This paper presents ST4ML, a distributed spatio-temporal data processing system to support scalable machine-learning-oriented applications. We propose a three-stage pipelining computing framework, namely \"selection-conversion-extraction\" to abstract the distributed computing flow and implement it based on Apache Spark. To the best of our knowledge, ST4ML is the first of its kind to realize our design considerations …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:9pM33mqn1YgC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3624478", "authors": ["Ya Nan", "Shiqi Jiang", "Mo Li"], "publication_date": "2023", "journal": "ACM Transactions on Sensor Networks", "publisher": "ACM", "description": "Deep learning-based video analytics demands high network bandwidth to ferry the large volume of data when deployed on the cloud. When incorporated at the edge side, only lightweight DNN models are affordable due to computational constraint. In this paper, a cloud-edge collaborative architecture is proposed combining edge-based inference with cloud-assisted continuous learning. Lightweight DNN models are maintained at the edge servers and continuously retrained with a more comprehensive model on the cloud to achieve high video analytics performance while reducing the amount of data transmitted between edge servers and the cloud. The proposed design faces the challenge of constraints of both computation resources at the edge servers and network bandwidth of the edge-cloud links. An accuracy gradient-based resource allocation (AGRA) algorithm is proposed to allocate the limited computation …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:Ri6SYOTghG4C": {"external_link": "https://wands.sg/publications/full_list/papers/MobiCom_23_1.pdf", "authors": ["Xianjin Xia", "Qianwu Chen", "Ningning Hou", "Yuanqing Zheng", "Mo Li"], "publication_date": "2023", "description": "LoRaWAN suffers dramatic performance degradation over a long communication range due to signal attenuation and blockages. To ensure reliable data transfer, LoRaWAN adopts retransmission mechanism where an unacknowledged packet is retransmitted multiple times in the hope of successfully delivering the packet at least once over harsh wireless channels. This retransmission mechanism is ill-suited for LoRa: 1) unsuccessful retransmissions lead to high power consumption for battery-powered LoRa nodes, and 2) a retransmission at another time does not necessarily improve the signal strength over harsh wireless channels. This paper presents the design and implementation of XCopy, which effectively improves the signal strength by coherently combining retransmitted packets received over weak links that would otherwise be thrown away. XCopy develops and puts together novel algorithms to 1) accurately identify the signal copies of the same packet over multiple retransmissions in the presence of interfering packets, and 2) precisely align the signal copies (in time, frequency, and phase) to ensure constructive combining, which turns out to be very challenging in ultra-low SNRs, but made possible by XCopy. Evaluations show that XCopy can deliver significant SNR gains and yield higher packet reception ratio and longer lifetime of LoRa nodes."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:FPJr55Dyh1AC": {"external_link": "https://link.springer.com/chapter/10.1007/978-3-031-05933-9_4", "authors": ["Xiaoyun Mo", "Mingqian Li", "Mo Li"], "publication_date": "2022/5/10", "book": "Pacific-Asia Conference on Knowledge Discovery and Data Mining", "pages": "41-53", "publisher": "Springer International Publishing", "description": "Abnormal events in rail systems, including train service delays and disruptions, are pains of the public transit system that have plagued urban cities for many years. The prediction of when and where an abnormal event may occur, can benefit train service providers for taking early actions to mitigate the impact or to eliminate the faults. Prior works rely on rich sources of sensor or log data that require extensive efforts in sensor deployment, data gathering and preparation. In this article, we aim at predicting abnormal events by leveraging only basic information of historical events (e.g., dates, technical causes) that can be easily obtained from existing open records. We propose a non-trivial method which categorizes event pairs based on their basic information, and then characterizes inter-event influence between event pairs via a multivariate Hawkes process. The proposed method overcomes the major hurdle of data …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:i2xiXl-TujoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8480060/", "authors": ["Chu Cao", "Zhidan Liu", "Mo Li", "Wenqiang Wang", "Zheng Qin"], "publication_date": "2018/4/11", "conference": "2018 17th ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN)", "pages": "148-149", "publisher": "IEEE", "description": "Existing digital maps mainly focus on motorways and miss many walkways facilitating people's daily mobility especially for pedestrians. Based on in-depth analysis of massive human mobility trajectories collected from the National Science Experiment (NSE) in Singapore, we propose a system, discovering walkways from the large scale crowdsensing mobility data. In this demo, we show the new-found walkways discovered by our system in Singapore through a custom visualization platform."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:dTyEYWd-f8wC": {"external_link": null, "authors": ["Zhidan Liu", "Zhenjiang Li", "Mo Li", "Wei Xing", "Dongming Lu"], "publication_date": "2015/6/9", "journal": "IEEE/ACM Transactions on Networking", "volume": "24", "issue": "4", "pages": "1948-1960", "publisher": "IEEE"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:YohjEiUPhakC": {"external_link": "https://cir.nii.ac.jp/crid/1363388844720396800", "authors": ["Wan Du", "Jansen Christian Liando", "Huanle Zhang", "Mo Li"], "publication_date": "2015", "journal": "Proceedings of the 13th ACM Conference on Embedded Networked Sensor Systems", "publisher": "ACM", "description": "When Pipelines Meet Fountain | CiNii Research CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ\n] 詳細へ移動 検索フォームへ移動 論文・データをさがす 大学図書館の本をさがす 日本の博士論文を\nさがす English 検索 タイトル 人物/団体名 所属機関 ISSN DOI 期間 ~ 本文リンク 本文リンクあり \nデータソース JaLC IRDB Crossref DataCite NDL NDL-Digital RUDA JDCat NINJAL CiNii \nArticles CiNii Books CiNii Dissertations DBpedia Nikkei BP KAKEN Integbio 公共データカタログ \nすべて 研究データ 論文 本 博士論文 プロジェクト When Pipelines Meet Fountain DOI Web Site \n被引用文献1件 Wan Du Nanyang Technological University, Singapore, Singapore Jansen \nChristian Liando Nanyang Technological University, Singapore, Singapore Huanle Zhang \nNanyang Technological University, Singapore, Singapore Mo Li Nanyang Technological \nUniversity, Singapore, Singapore 書誌事項 タイトル別名 Fast Data Dissemination in Wireless …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:Y5dfb0dijaUC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2639108.2641738", "authors": ["Pengfei Zhou", "Weiming Chan", "Shiqi Jiang", "Jiajue Ou", "Mo Li", "Guobin Shen"], "publication_date": "2014/9/7", "conference": "Proceedings of the 20th annual international conference on Mobile computing and networking", "pages": "333-336", "publisher": "ACM", "description": "The phone attitude is an essential input to many smartphone applications. Based on in-depth understanding of the nature of the MEMS gyroscope and other IMU sensors, we propose A3 - an accurate and automatic attitude detector for commodity smartphones. In the demo, we show the performance of our attitude tracking algorithm and its usability in attitude-based mobile applications."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:35r97b3x0nAC": {"external_link": null, "inventors": "Jinsong HAN Mo Li, Yunhao LIU, Jiliang Wang, Xi Zhou", "publication_date": "2014/1/7", "patent_office": "US", "patent_number": "US8626444 B2", "application_number": "US 12/720,889"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:tOudhMTPpwUC": {"external_link": "https://journals.sagepub.com/doi/full/10.1155/2012/296396", "authors": ["Mo Li", "Yunhao Liu", "Xiang-Yang Li"], "publication_date": "2012/7/5", "journal": "International Journal of Distributed Sensor Networks", "volume": "2012", "publisher": "Hindawi Publishing Corporation", "description": "Advanced wireless sensing and networking techniques enable mobile sensing and actuating with ubiquitous computing on numerous smart sensors, mobile devices, RFIDs, and so forth, which revolutionize a variety of application areas with unprecedented pervasive physical world instrumentation. The development and deployment of such mobile sensing and actuating systems has become significant across a variety of application domains, including environmental surveillance, traffic and logistics, personal area networks, smart buildings, and emergent navigation. The major challenges come with the required system sustainability, mobility, scalability, and fault resilience in ensuring constant services across dynamic application environment. In this special issue, we have accepted a few papers that address the above key aspects in providing mobile sensing and actuating services."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=kjiwE6IAAAAJ&cstart=100&pagesize=100&citation_for_view=kjiwE6IAAAAJ:Dip1O2bNi0gC": {"external_link": "https://sites.ucmerced.edu/files/wdu/files/tits_19_1_last_mile.pdf", "authors": ["WanDu PanrongTong", "Mo Li", "Jianqiang Huang", "Wenqiang Wang", "Zheng Qin"], "description": "By processing a large dataset composed of daily trajectories of thousands of students in Singapore, we find that, instead of simply picking up students from their homes, an optimal school shuttle planning system needs to learn the real transportation usage and plan across all potential pickup locations for every student to generate need-satisfying routes. It is challenging, however, to perform route planning over a large number of students each having multiple potential pickup locations. We develop a graph-based data structure that embeds potential pickup locations of all students with the awareness of real-world constraints and existing public transits. Based on the graph structure, we prove that the optimal last-mile school shuttle planning problem is NP-hard and thereafter design a Tabu-based expansion algorithm to solve the problem, which strikes at a proper balance between the savings of students’ commute time and the total cost of operating the shuttle buses. Extensive experiments with large-scale real-world crowdsensed trajectory data demonstrate that our last-mile school shuttles can save the traveling time for most students by over 20% and the savings can be up to 65% for 10% of the students."}}