{"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:Tyk-4Ss8FVUC": {"external_link": "https://hub.hku.hk/bitstream/10722/232839/1/content.pdf?accept=1", "authors": ["Yixiang Fang", "CK Cheng", "Siqiang Luo", "Jiafeng Hu"], "publication_date": "2016", "journal": "Proceedings of the VLDB Endowment", "publisher": "Proceedings of the VLDB Endowment International Conference on Very Large Data Bases. The Journal's web site is located at http://vldb. org/pvldb/index. html", "description": "Given a graph G and a vertex q∈ G, the community search query returns a subgraph of G that contains vertices related to q. Communities, which are prevalent in attributed graphs such as social networks and knowledge bases, can be used in emerging applications such as product advertisement and setting up of social events. In this paper, we investigate the attributed community query (or ACQ), which returns an attributed community (AC) for an attributed graph. The AC is a subgraph of G, which satisfies both structure cohesiveness (ie, its vertices are tightly connected) and keyword cohesiveness (ie, its vertices share common keywords). The AC enables a better understanding of how and why a community is formed (eg, members of an AC have a common interest in music, because they all have the same keyword “music”). An AC can be “personalized”; for example, an ACQ user may specify that an AC returned should be related to some specific keywords like “research” and “sports”.To enable efficient AC search, we develop the CL-tree structure and three algorithms based on it. We evaluate our solutions on four large graphs, namely Flickr, DBLP, Tencent, and DBpedia. Our results show that ACs are more effective and efficient than existing community retrieval approaches. Moreover, an AC contains more precise and personalized information than that of existing community search and detection methods.", "total_citations": {"2016": 4, "2017": 14, "2018": 26, "2019": 43, "2020": 55, "2021": 48, "2022": 62, "2023": 31}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:UebtZRa9Y70C": {"external_link": "https://hub.hku.hk/bitstream/10722/243528/1/content.pdf?accept=1", "authors": ["Yixiang Fang", "CK Cheng", "S Luo", "J Hu", "X Li"], "publication_date": "2017", "journal": "Proceedings of the VLDB Endowment (PVLDB)", "publisher": "Very Large Data Base (VLDB) Endowment Inc. The Journal's web site is located at http://vldb. org/pvldb/index. html", "description": "Communities are prevalent in social networks, knowledge graphs, and biological networks. Recently, the topic of community search (CS) has received plenty of attention. Given a query vertex, CS looks for a dense subgraph that contains it. Existing CS solutions do not consider the spatial extent of a community. They can yield communities whose locations of vertices span large areas. In applications that facilitate the creation of social events (eg, finding conference attendees to join a dinner), it is important to find groups of people who are physically close to each other. In this situation, it is desirable to have a spatial-aware community (or SAC), whose vertices are close structurally and spatially. Given a graph G and a query vertex q, we develop exact solutions for finding an SAC that contains q. Since these solutions cannot scale to large datasets, we have further designed three approximation algorithms to compute an SAC. We have performed an experimental evaluation for these solutions on both large real and synthetic datasets. Experimental results show that SAC is better than the communities returned by existing solutions. Moreover, our approximation solutions can find SACs accurately and efficiently.", "total_citations": {"2016": 1, "2017": 9, "2018": 16, "2019": 28, "2020": 45, "2021": 34, "2022": 41, "2023": 18}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:9yKSN-GCB0IC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2463676.2465277", "authors": ["Andy Diwen Zhu", "Hui Ma", "Xiaokui Xiao", "Siqiang Luo", "Youze Tang", "Shuigeng Zhou"], "publication_date": "2013/6/22", "book": "Proceedings of the 2013 ACM SIGMOD International Conference on Management of Data", "pages": "857-868", "description": "Given two locations s and t in a road network, a distance query returns the minimum network distance from s to t, while a shortest path query computes the actual route that achieves the minimum distance. These two types of queries find important applications in practice, and a plethora of solutions have been proposed in past few decades. The existing solutions, however, are optimized for either practical or asymptotic performance, but not both. In particular, the techniques with enhanced practical efficiency are mostly heuristic-based, and they offer unattractive worst-case guarantees in terms of space and time. On the other hand, the methods that are worst-case efficient often entail prohibitive preprocessing or space overheads, which render them inapplicable for the large road networks (with millions of nodes) commonly used in modern map applications. This paper presents Arterial Hierarchy (AH), an index …", "total_citations": {"2013": 2, "2014": 15, "2015": 17, "2016": 18, "2017": 26, "2018": 11, "2019": 11, "2020": 11, "2021": 11, "2022": 11, "2023": 11}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:5nxA0vEk-isC": {"external_link": "https://link.springer.com/article/10.1007/s00778-017-0482-5", "authors": ["Yixiang Fang", "Reynold Cheng", "Yankai Chen", "Siqiang Luo", "Jiafeng Hu"], "publication_date": "2017/12", "journal": "The VLDB Journal", "volume": "26", "pages": "803-828", "publisher": "Springer Berlin Heidelberg", "description": "Given a graph G and a vertex , the community search query returns a subgraph of G that contains vertices related to q. Communities, which are prevalent in attributed graphs such as social networks and knowledge bases, can be used in emerging applications such as product advertisement and setting up of social events. In this paper, we investigate the attributed community query (or ACQ), which returns an attributed community (AC) for an attributed graph. The AC is a subgraph of G, which satisfies both structure cohesiveness (i.e., its vertices are tightly connected) and keyword cohesiveness (i.e., its vertices share common keywords). The AC enables a better understanding of how and why a community is formed (e.g., members of an AC have a common interest in music, because they all have the same keyword “music”). An AC can be “personalized”; for example, an ACQ user may specify that an AC …", "total_citations": {"2017": 1, "2018": 2, "2019": 9, "2020": 21, "2021": 18, "2022": 24, "2023": 10}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:-f6ydRqryjwC": {"external_link": "https://proceedings.mlr.press/v162/li22ad.html", "authors": ["Xiang Li", "Renyu Zhu", "Yao Cheng", "Caihua Shan", "Siqiang Luo", "Dongsheng Li", "Weining Qian"], "publication_date": "2022/6/28", "conference": "International Conference on Machine Learning", "pages": "13242-13256", "publisher": "PMLR", "description": "We investigate graph neural networks on graphs with heterophily. Some existing methods amplify a node’s neighborhood with multi-hop neighbors to include more nodes with homophily. However, it is a significant challenge to set personalized neighborhood sizes for different nodes. Further, for other homophilous nodes excluded in the neighborhood, they are ignored for information aggregation. To address these problems, we propose two models GloGNN and GloGNN++, which generate a node’s embedding by aggregating information from global nodes in the graph. In each layer, both models learn a coefficient matrix to capture the correlations between nodes, based on which neighborhood aggregation is performed. The coefficient matrix allows signed values and is derived from an optimization problem that has a closed-form solution. We further accelerate neighborhood aggregation and derive a linear time complexity. We theoretically explain the models’ effectiveness by proving that both the coefficient matrix and the generated node embedding matrix have the desired grouping effect. We conduct extensive experiments to compare our models against 11 other competitors on 15 benchmark datasets in a wide range of domains, scales and graph heterophilies. Experimental results show that our methods achieve superior performance and are also very efficient.", "total_citations": {"2021": 1, "2022": 17, "2023": 46}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:Zph67rFs4hoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8375664/", "authors": ["Yixiang Fang", "Zheng Wang", "Reynold Cheng", "Xiaodong Li", "Siqiang Luo", "Jiafeng Hu", "Xiaojun Chen"], "publication_date": "2018/6/8", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "31", "issue": "4", "pages": "783-798", "publisher": "IEEE", "description": "Communities are prevalent in social networks, knowledge graphs, and biological networks. Recently, the topic of community search (CS) has received plenty of attention. The CS problem aims to look for a dense subgraph that contains a query vertex. Existing CS solutions do not consider the spatial extent of a community. They can yield communities whose locations of vertices span large areas. In applications that facilitate setting social events (e.g., finding conference attendees to join a dinner), it is important to find groups of people who are physically close to each other, so it is desirable to have a  spatial-aware community  (or SAC), whose vertices are close structurally and spatially. Given a graph    and a query vertex   , we develop an exact solution to find the SAC containing   , but it cannot scale to large datasets, so we design three approximation algorithms. We further study the problem of continuous SAC …", "total_citations": {"2018": 2, "2019": 10, "2020": 13, "2021": 15, "2022": 16, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:UeHWp8X0CEIC": {"external_link": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=c1eeaaf25d0bf81d923eb5d956c913dfdb056238", "authors": ["Siqiang Luo", "Yifeng Luo", "Shuigeng Zhou", "Gao Cong", "Jihong Guan", "Zheng Yong"], "publication_date": "2014/3/24", "conference": "EDBT", "pages": "235-246", "description": "Spatial-keyword queries on road networks are receiving increasing attention with the prominence of location-based services. There is a growing need to handle queries on road networks in distributed environments because a large network is typically distributed over multiple machines and it will improve query throughput. However, all the existing work on spatial keyword queries is based on a centralized setting. In this paper, we develop a distributed solution to answering spatial keyword queries on road networks. Example queries include “find locations near a supermarket and a hospital,” and “find Chinese restaurants within 500 meters from my current location.” We define an operation for answering such queries and reduce the problem of answering a query into computing a function of such operations. We propose a new distributed index that enables each machine to independently evaluate the operation on its network fragment in a distributed setting. We theoretically prove the space optimality of the proposed index technique. We conduct experiments with a distributed setting. Experimental results demonstrate the promising performance of our method.", "total_citations": {"2014": 1, "2015": 8, "2016": 1, "2017": 13, "2018": 5, "2019": 9, "2020": 3, "2021": 4, "2022": 3, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:u5HHmVD_uO8C": {"external_link": "https://www.sciencedirect.com/science/article/pii/S0164121212003184", "authors": ["Yifeng Luo", "Siqiang Luo", "Jihong Guan", "Shuigeng Zhou"], "publication_date": "2013/3/1", "journal": "Journal of Systems and Software", "volume": "86", "issue": "3", "pages": "744-750", "publisher": "Elsevier", "description": "Few cloud storage systems can handle random read accesses efficiently. In this paper, we present a RAMCloud Storage System, RCSS, to enable efficient random read accesses in cloud environments. Based on the Hadoop Distributed File System (HDFS), RCSS integrates the available memory resources in an HDFS cluster to form a cloud storage system, which backs up all data on HDFS-managed disks, and fetches data from disks into memory for handy accesses when files are opened for read or specified by users for memory storage. We extend the storage capacity of RCSS to that of the substrate disk-based HDFS by multiplexing all the available memory resources. Furthermore, RCSS supports MapReduce, which is a popular cloud computing paradigm. By serving data from memory instead of disks, RCSS can yield high random I/O performance with low latency and high throughput, and can achieve good …", "total_citations": {"2013": 2, "2014": 6, "2015": 6, "2016": 11, "2017": 9, "2018": 3, "2019": 4, "2020": 5, "2021": 2, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:4DMP91E08xMC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3318464.3389731", "authors": ["Siqiang Luo", "Subarna Chatterjee", "Rafael Ketsetsidis", "Niv Dayan", "Wilson Qin", "Stratos Idreos"], "publication_date": "2020/6/11", "book": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data", "pages": "2071-2086", "description": "We introduce Rosetta, a probabilistic range filter designed specifically for LSM-tree based key-value stores. The core intuition is that we can sacrifice filter probe time because it is not visible in end-to-end key-value store performance, which in turn allows us to significantly reduce the filter false positive rate for every level of the tree. Rosetta indexes all binary prefixes of a key using a hierarchically arranged set of Bloom filters. It then converts each range query into multiple probes, one for each non-overlapping binary prefix. Rosetta has the ability to track workload patterns and adopt a beneficial tuning for each individual LSM-tree run by adjusting the number of Bloom filters it uses and how memory is spread among them to optimize the FPR/CPU cost balance. We show how to integrate Rosetta in a full system, RocksDB, and we demonstrate that it brings as much as a 40x improvement compared to default RocksDB …", "total_citations": {"2020": 6, "2021": 9, "2022": 20, "2023": 14}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:8k81kl-MbHgC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3132847.3132885", "authors": ["Jiafeng Hu", "Reynold Cheng", "Zhipeng Huang", "Yixang Fang", "Siqiang Luo"], "publication_date": "2017/11/6", "book": "Proceedings of the 2017 ACM on Conference on Information and Knowledge Management", "pages": "157-166", "description": "Graph data are prevalent in communication networks, social media, and biological networks. These data, which are often noisy or inexact, can be represented by uncertain graphs, whose edges are associated with probabilities to indicate the chances that they exist. Recently, researchers have studied various algorithms (e.g., clustering, classification, and k-NN) for uncertain graphs. These solutions face two problems: (1) high dimensionality: uncertain graphs are often highly complex, which can affect the mining quality; and (2) low reusability, where an existing mining algorithm has to be redesigned to deal with uncertain graphs. To tackle these problems, we propose a solution called URGE, or UnceRtain Graph Embedding. Given an uncertain graph G, URGE generates G's embedding, or a set of low-dimensional vectors, which carry the proximity information of nodes in G. This embedding enables the …", "total_citations": {"2017": 1, "2018": 5, "2019": 4, "2020": 11, "2021": 9, "2022": 9, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:LkGwnXOMwfcC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2983323.2983748", "authors": ["Jiafeng Hu", "Xiaowei Wu", "Reynold Cheng", "Siqiang Luo", "Yixiang Fang"], "publication_date": "2016/10/24", "book": "Proceedings of the 25th ACM International on Conference on Information and Knowledge Management", "pages": "1241-1250", "description": "Given a graph G and a set Q of query nodes, we examine the Steiner Maximum-Connected Subgraph (SMCS). The SMCS, or G's induced subgraph that contains Q with the largest connectivity, can be useful for customer prediction, product promotion, and team assembling. Despite its importance, the SMCS problem has only been recently studied. Existing solutions evaluate the maximum SMCS, whose number of nodes is the largest among all the SMCSs of Q. However, the maximum SMCS, which may contain a lot of nodes, can be difficult to interpret. In this paper, we investigate the minimal SMCS, which is the minimal subgraph of G with the maximum connectivity containing Q. The minimal SMCS contains much fewer nodes than its maximum counterpart, and is thus easier to be understood. However, the minimal SMCS can be costly to evaluate. We thus propose efficient Expand-Refine algorithms, as well as …", "total_citations": {"2017": 6, "2018": 7, "2019": 3, "2020": 6, "2021": 5, "2022": 11, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:hqOjcs7Dif8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7990053/", "authors": ["Jiafeng Hu", "Xiaowei Wu", "Reynold Cheng", "Siqiang Luo", "Yixiang Fang"], "publication_date": "2017/7/24", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "29", "issue": "11", "pages": "2455-2469", "publisher": "IEEE", "description": "Given a graph G and a set Q of query nodes, we examine the Steiner Maximum-Connected Subgraph (SMCS) problem. The SMCS, or G's induced subgraph that contains Q with the largest connectivity, can be useful for customer prediction, product promotion, and team assembling. Despite its importance, the SMCS problem has only been recently studied. Existing solutions evaluate the maximum SMCS, whose number of nodes is the largest among all the SMCSs of Q. However, the maximum SMCS, which may contain a lot of nodes, can be difficult to interpret. In this paper, we investigate the minimal SMCS, which is the minimal subgraph of G with the maximum connectivity containing Q. The minimal SMCS contains much fewer nodes than its maximum counterpart, and is thus easier to be understood. However, the minimal SMCS can be costly to evaluate. We thus propose efficient Expand-Refine algorithms, as …", "total_citations": {"2017": 3, "2018": 2, "2019": 4, "2020": 10, "2021": 7, "2022": 4, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:0EnyYjriUFMC": {"external_link": "https://hub.hku.hk/bitstream/10722/243526/1/content.pdf?accept=1", "authors": ["Yixiang Fang", "CK Cheng", "Siqiang Luo", "Jiafeng Hu", "Kai Huang"], "publication_date": "2017", "journal": "Proceedings of the VLDB Endowment (PVLDB)", "publisher": "Very Large Data Base (VLDB) Endowment Inc. The Journal's web site is located at http://vldb. org/pvldb/index. html", "description": "Community retrieval (CR) algorithms, which enable the extraction of subgraphs from large social networks (eg, Facebook and Twitter), have attracted tremendous interest. Various CR solutions, such as k-core and CODICIL, have been proposed to obtain graphs whose vertices are closely related. In this paper, we propose the C-Explorer system to assist users in extracting, visualizing, and analyzing communities. C-Explorer provides online and interactive CR facilities, allowing a user to view her interesting graphs, indicate her required vertex q, and display the communities to which q belongs. A seminal feature of C-Explorer is that it uses an attributed graph, whose vertices are associated with labels and keywords, and looks for an attributed community (or AC), whose vertices are structurally and semantically related. Moreover, C-Explorer implements several state-of-the-art CR algorithms, as well as functions for analyzing their effectiveness. We plan to make C-Explorer an open-source web-based platform, and design API functions for software developers to test their CR algorithms in our system.", "total_citations": {"2017": 3, "2018": 4, "2019": 6, "2020": 4, "2021": 7, "2022": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:u-x6o8ySG0sC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S0262885612000960", "authors": ["Siqiang Luo", "Junping Zhang", "Qian Zhang", "Xiaoru Yuan"], "publication_date": "2012/9/1", "journal": "image and vision computing", "volume": "30", "issue": "9", "pages": "655-667", "publisher": "Elsevier", "description": "Multi-operator image resizing can preserve important objects and structure in an image by combining multiple image resizing operators. However, traditional multi-operator methods do not take both horizontal and vertical content-aware resizing potential into consideration, which essentially leads to squeeze/stretch effect in the resultant images. In this paper, we propose a new multi-operator scheme that addresses aforementioned issue by integrating direct and indirect seam carving. Compared with previous methods, the proposed scheme remarkably reduces the cost of deciding when to change operators, by employing a newly defined image artifact measure. Furthermore, we propose a novel seam carving enhancement, named ACcumulated Energy Seam Carving (ACESC), as a basic operator to improve global structure preservation. By combining horizontal and vertical seam carving, our scheme preserves the …", "total_citations": {"2013": 1, "2014": 6, "2015": 2, "2016": 5, "2017": 5, "2018": 1, "2019": 2, "2020": 1, "2021": 2, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:kNdYIx-mwKoC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3177732.3177736", "authors": ["Siqiang Luo", "Ben Kao", "Guoliang Li", "Jiafeng Hu", "Reynold Cheng", "Yudian Zheng"], "publication_date": "2018/1/1", "journal": "Proceedings of the VLDB Endowment", "volume": "11", "issue": "5", "pages": "594-606", "publisher": "VLDB Endowment", "description": "We study the classical kNN queries on road networks. Existing solutions mostly focus on reducing query processing time. In many applications, however, system throughput is a more important measure. We devise a mathematical model that describes throughput in terms of a number of system characteristics. We show that query time is only one of the many parameters that impact throughput. Others include update time and query/update arrival rates. We show that the traditional approach of improving query time alone is generally inadequate in optimizing throughput. Moreover, existing solutions lack flexibility in adapting to environments of different characteristics. We propose Toain, which is a very flexible algorithm that can be easily trained to adapt to a given environment for maximizing query throughput. We conduct extensive experiments on both real and synthetic data and show that Toain gives significantly …", "total_citations": {"2018": 2, "2019": 6, "2020": 5, "2021": 8, "2022": 5, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:d1gkVwhDpl0C": {"external_link": "https://dl.acm.org/doi/abs/10.14778/2367502.2367549", "authors": ["Siqiang Luo", "Yifeng Luo", "Shuigeng Zhou", "Gao Cong", "Jihong Guan"], "publication_date": "2012/8/1", "journal": "Proceedings of the VLDB Endowment", "volume": "5", "issue": "12", "pages": "1966-1969", "publisher": "VLDB Endowment", "description": "Query (e.g., shortest path) on road networks has been extensively studied. Although most of the existing query processing approaches are designed for centralized environments, there is a growing need to handle queries on road networks in distributed environments due to the increasing query workload and the challenge of querying large networks. In this demonstration, we showcase a distributed system called DISKs (DIstributed Spatial Keyword search) that is capable of efficiently supporting spatial group keyword search (S-GKS) on road networks. Given a group of keywords X and a distance r, an SGKS returns locations on a road network, such that for each returned location p, there exists a set of nodes (on the road network), which are located within a network distance r from p and collectively contains X. We will demonstrate the innovative modules, performance and interactive user interfaces of DISKs.", "total_citations": {"2014": 2, "2015": 2, "2016": 2, "2017": 3, "2018": 0, "2019": 2, "2020": 1, "2021": 4, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:_kc_bZDykSQC": {"external_link": "https://ojs.aaai.org/index.php/AAAI/article/view/4363", "authors": ["Siqiang Luo"], "publication_date": "2019/7/17", "journal": "Proceedings of the AAAI Conference on Artificial Intelligence", "volume": "33", "issue": "01", "pages": "4496-4503", "description": "PageRank is a classic measure that effectively evaluates the node importance in large graphs, and has been applied in numerous applications ranging from data mining, Web algorithms, recommendation systems, load balancing, search, and identifying connectivity structures. Computing PageRank for large graphs is challenging and this has motivated the studies of distributed algorithms to compute PageRank. Previously, little works have been spent on the distributed PageRank algorithms with provably desired complexity and accuracy. Given a graph with n nodes and if we model the distributed computation model as the well-known congested clique model, the state-of-the-art algorithm takes O (√ logn) communication rounds to approximate the PageRank value of each node in G, with a probability at least 1− 1/n. In this paper, we present improved distributed algorithms for computing PageRank. Particularly, our algorithm performs O (log log√ n) rounds (a significant improvement compared with O (√ logn) rounds) to approximate the PageRank values with a probability at least 1− 1/n. Moreover, under a reasonable assumption, our algorithm also reduces the edge bandwidth (ie, the maximum communication message size that can be exchanged through an edge during a communication round) by a O (logn) factor compared with the state-of-the-art algorithm. Finally, we show that our algorithm can be adapted to efficiently compute another variant of PageRank, ie, the batch one-hop Personalized PageRanks, in O (log logn) communication rounds.", "total_citations": {"2019": 1, "2020": 3, "2021": 3, "2022": 7, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:hC7cP41nSMkC": {"external_link": "https://arxiv.org/abs/2205.02767", "authors": ["Zulun Zhu", "Jiaying Peng", "Jintang Li", "Liang Chen", "Qi Yu", "Siqiang Luo"], "publication_date": "2022/5/5", "journal": "arXiv preprint arXiv:2205.02767", "description": "Graph Convolutional Networks (GCNs) achieve an impressive performance due to the remarkable representation ability in learning the graph information. However, GCNs, when implemented on a deep network, require expensive computation power, making them difficult to be deployed on battery-powered devices. In contrast, Spiking Neural Networks (SNNs), which perform a bio-fidelity inference process, offer an energy-efficient neural architecture. In this work, we propose SpikingGCN, an end-to-end framework that aims to integrate the embedding of GCNs with the biofidelity characteristics of SNNs. The original graph data are encoded into spike trains based on the incorporation of graph convolution. We further model biological information processing by utilizing a fully connected layer combined with neuron nodes. In a wide range of scenarios (e.g. citation networks, image graph classification, and recommender systems), our experimental results show that the proposed method could gain competitive performance against state-of-the-art approaches. Furthermore, we show that SpikingGCN on a neuromorphic chip can bring a clear advantage of energy efficiency into graph data analysis, which demonstrates its great potential to construct environment-friendly machine learning models.", "total_citations": {"2022": 4, "2023": 12}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:M3ejUd6NZC8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8731411/", "authors": ["Siqiang Luo", "Xiaokui Xiao", "Wenqing Lin", "Ben Kao"], "publication_date": "2019/4/8", "conference": "2019 IEEE 35th International Conference on Data Engineering (ICDE)", "pages": "1562-1565", "publisher": "IEEE", "description": "Personalized PageRank (PPR) is a classic measure of the relevance among different nodes in a graph. Existing work on PPR has mainly focused on three general types of queries, namely, single-pair PPR, single-source PPR, and all-pair PPR. However, there are applications that rely on a new query type (referred to as batch one-hop PPR), which takes as input a set S of source nodes and, for each node s in S and each of s's neighbor v, asks for the PPR value of v with respect to s. None of the existing PPR algorithms is able to efficiently process batch one-hop queries, due to the inherent differences between batch one-hop PPR and the three general query types. To address the limitations of existing algorithms, this paper presents Baton, an algorithm for batch one-hop PPR that offers strong practical efficiency.", "total_citations": {"2019": 4, "2020": 1, "2021": 2, "2022": 3, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&citation_for_view=ZDwbMg4AAAAJ:ZeXyd9-uunAC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S092523122200457X", "authors": ["Peng Zhu", "Dawei Cheng", "Siqiang Luo", "Fangzhou Yang", "Yifeng Luo", "Weining Qian", "Aoying Zhou"], "publication_date": "2022/7/14", "journal": "Neurocomputing", "volume": "494", "pages": "33-42", "publisher": "Elsevier", "description": "High-quality news recommendation heavily relies on accurate and timely representations of news documents and user interests. Social information, which usually contains the most recent information about the activities of users and their friends, naturally reflects the dynamics and diversities of user interests. However, existing news recommendation approaches often overlook these dynamic items, and thus lead to suboptimal performance. In this paper, we propose a novel approach by embedding users’ interests from their social information by attentional graph convolutional network (GCN). We also improve news representations by jointly optimizing the titles and contents of news via attention mechanisms. Extensive experiments on three benchmark datasets show that our approach effectively improves news recommendation performance compared with state-of-the-art baselines. We also evaluate our model on a …", "total_citations": {"2022": 4, "2023": 9}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:4TOpqqG69KYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8695727/", "authors": ["Siqiang Luo", "Xiaokui Xiao", "Wenqing Lin", "Ben Kao"], "publication_date": "2019/4/23", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "32", "issue": "10", "pages": "1897-1908", "publisher": "IEEE", "description": "Personalized PageRank (PPR) is a classic measure of the relevance among different nodes in a graph, and has been applied in numerous systems, such as Twitter's Who-To-Follow and Pinterest's Related Pins. Existing work on PPR has mainly focused on three general types of queries, namely, single-pair PPR, single-source PPR, and all-pair PPR. However, we observe that there are applications that rely on a new query type (referred to as batch one-hop PPR), which takes as input a set S of source nodes and, for each nodes E ϵ S and each of s's neighbor v, asks for the PPR value of v with respect to s. None of the existing PPR algorithms is able to efficiently process batch one-hop queries, due to the inherent differences between batch one-hop PPR and the three general query types. To address the limitations of existing algorithms, this paper presents Baton, an algorithm for batch one-hop PPR that offers both …", "total_citations": {"2020": 1, "2021": 1, "2022": 4, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:KlAtU1dfN6UC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3178876.3185993", "authors": ["Xiang Li", "Ben Kao", "Siqiang Luo", "Martin Ester"], "publication_date": "2018/4/23", "book": "Proceedings of the 2018 World Wide Web Conference", "pages": "157-166", "description": "We investigate the effectiveness of spectral methods in clustering multi-scale data, which is data whose clusters are of various sizes and densities. We review existing spectral methods that are designed to handle multi-scale data and propose an alternative approach that is orthogonal to existing methods. We put forward the algorithm ROSC, which computes an affinity matrix that takes into account both objects' feature similarity and reachability similarity. We perform extensive experiments comparing ROSC against 9 other methods on both real and synthetic datasets. Our results show that ROSC performs very well against the competitors. In particular, it is very robust in that it consistently performs well over all the datasets tested. Also, it outperforms others by wide margins for datasets that are highly multi-scale.", "total_citations": {"2019": 3, "2020": 6, "2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:dhFuZR0502QC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3459637.3482317", "authors": ["Dingheng Mo", "Siqiang Luo"], "publication_date": "2021/10/26", "book": "Proceedings of the 30th ACM International Conference on Information & Knowledge Management", "pages": "1315-1324", "description": "Given a source node s and a target node t in a graph G, the Personalized PageRank (PPR) from s to t is the probability of a random walk starting from s terminates at t. PPR is a classic measure of the relevance among different nodes in a graph, and has been applied in numerous real-world systems. However, existing techniques for PPR queries are not robust to dynamic real-world graphs, which typically have different evolving speeds. Their performance is significantly degraded either at a lower graph evolving rate (e.g., much more queries than updates) or a higher rate. To address the above deficiencies, we propose Agenda to efficiently process, with strong approximation guarantees, the single-source PPR (SSPPR) queries on dynamically evolving graphs with various evolving speeds. Compared with previous methods, Agenda has significantly better workload robustness, while ensuring the same result …", "total_citations": {"2022": 4, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:hFOr9nPyWt4C": {"external_link": "https://www.sciencedirect.com/science/article/pii/S1570826822000142", "authors": ["Peng Zhu", "Dawei Cheng", "Siqiang Luo", "Ruyao Xu", "Yuqi Liang", "Yifeng Luo"], "publication_date": "2022/10/1", "journal": "Journal of Web Semantics", "volume": "74", "pages": "100722", "publisher": "Elsevier", "description": "Knowledge graph (KG) techniques have achieved successful results in many tasks, especially in semantic web and natural language processing domains. In recent years, representation learning on KG has been successfully applied to e-business applications, such as event-driven automatic investment strategies. However, there is still limited research about learning events’ influence on KG for modern quantitative investment. In this paper, we propose a novel event influence learning framework to predict stock market trends, called ST-Trend, leveraging enterprise knowledge graph to represent company correlation relationships, for mining the deep background knowledge of web events, with three self-supervised learning tasks. In particular, we devise two jointly self-supervised tasks to identify the relations between web events and companies. The first task is for generating ground-truth event-company correlation …", "total_citations": {"2022": 5, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:9ZlFYXVOiuMC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3340531.3412707", "authors": ["Mengzhen Fan", "Dawei Cheng", "Fangzhou Yang", "Siqiang Luo", "Yifeng Luo", "Weining Qian", "Aoying Zhou"], "publication_date": "2020/10/19", "book": "Proceedings of the 29th ACM International Conference on Information & Knowledge Management", "pages": "2413-2420", "description": "Many institutions are devoted to providing investment advising services to stock investors to help them make sound investment decisions. Industry analysts at these institutions need to analyze huge amounts of financial news documents, and yield investment advising reports to the service subscribers. Automatic document classification is required to organize collected financial news documents into pre-defined fine-grained categories, before the document analysis tasks. It is challenging to implement accurate fine-grained classification over massive financial documents, because documents from close fine-grained categories are highly semantically similar, while existing classification methods may fail to differentiate the subtle differences for documents from close fine-grained categories. In this paper, we implement a document classification framework, named GraphSEAT, to classify financial documents for a leading …", "total_citations": {"2021": 3, "2022": 1, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:L8Ckcad2t8MC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3514221.3526137", "authors": ["Junghoon Kim", "Siqiang Luo", "Gao Cong", "Wenyuan Yu"], "publication_date": "2022/6/10", "book": "Proceedings of the 2022 International Conference on Management of Data", "pages": "889-903", "description": "Community Search, or finding a connected subgraph (known as a community) containing the given query nodes in a social network, is a fundamental problem. Most of the existing community search models only focus on the internal cohesiveness of a community. However, a high-quality community often has high modularity, which means dense connections inside communities and sparse connections to the nodes outside the community. In this paper, we conduct a pioneer study on searching a community with high modularity. We point out that while modularity has been popularly used in community detection (without query nodes), it has not been adopted for community search, surprisingly, and its application in community search (related to query nodes) brings in new challenges. We address these challenges by designing a new graph modularity function named Density Modularity. To the best of our knowledge …", "total_citations": {"2022": 3, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:QIV2ME_5wuYC": {"external_link": "http://proceedings.mlr.press/v119/luo20a.html", "authors": ["Siqiang Luo"], "publication_date": "2020/11/21", "conference": "International Conference on Machine Learning", "pages": "6459-6467", "publisher": "PMLR", "description": "PageRank is a widely used approach for measuring the importance of a node in a graph. Due to the rapid growth of the graph size in the real world, the importance of computing PageRanks in a distributed environment has been increasingly recognized. However, only a few previous works can provide a provable complexity and accuracy for distributed PageRank computation. Given a constant  and a graph of  nodes, the state-of-the-art approach, Radar-Push, uses  communication rounds to approximate the PageRanks within a relative error  under a generalized congested clique distributed computation model. However, Radar-Push entails as large as  bits of bandwidth (eg, the communication cost between a pair of nodes per round). In this paper, we provide a new algorithm that uses asymptotically the same communication round complexity while using only  bits of bandwidth.", "total_citations": {"2021": 2, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:qxL8FJ1GzNcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8731530/", "authors": ["Siqiang Luo", "Ben Kao", "Xiaowei Wu", "Reynold Cheng"], "publication_date": "2019/4/8", "conference": "2019 IEEE 35th International Conference on Data Engineering (ICDE)", "pages": "1310-1321", "publisher": "IEEE", "description": "We study the problem of executing road-network k-nearest-neighbor (kNN) search on multi-core machines. State-of-the-art kNN algorithms on road networks often involve elaborate index structures and complex computational logic. Moreover, most kNN algorithms are inherently sequential. These make the traditional approach of parallel programming very costly, laborious, and ineffective when they are applied to kNN algorithms. We propose the MPR (Multi-layer Partitioning-Replication) mechanism that orchestrates CPU cores and schedules kNN query and index update processes to run on the cores. The MPR mechanism performs workload analysis to determine the best arrangement of the cores with the objective of optimizing quality-of-service (QoS) measures, such as system throughput and query response time. We demonstrate the effectiveness of MPR by applying it to a number of state-of-the-art kNN …", "total_citations": {"2019": 2, "2020": 1, "2021": 1, "2022": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:HDshCWvjkbEC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S0020025522005461", "authors": ["Siqiang Luo", "Xiaowei Wu", "Ben Kao"], "publication_date": "2022/8/1", "journal": "Information Sciences", "volume": "607", "pages": "109-125", "publisher": "Elsevier", "description": "PageRank is a classic measure that effectively evaluates the importance of nodes in large graphs. It has been applied in numerous applications spanning data mining, Web algorithms, recommendation systems, load balancing, search and connectivity structures identification. Computing PageRank for large graphs is challenging and this has motivated the studies of distributed algorithms to compute PageRank. Previously, little works have been spent on the distributed PageRank algorithms with strong guarantees on both complexity and accuracy. In this paper, we focus on the theoretical aspect and study the complexity of distributed PageRank computation based on the well-known congested-clique model with a bandwidth generalization. An existing algorithm proposed by Sarma et al.(2015) can be applied in this model, which estimates PageRanks in an n-node graph using, with high probability, O (log n …", "total_citations": {"2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:TQgYirikUcIC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3514221.3526167", "authors": ["Eric R Knorr", "Baptiste Lemaire", "Andrew Lim", "Siqiang Luo", "Huanchen Zhang", "Stratos Idreos", "Michael Mitzenmacher"], "publication_date": "2022/6/10", "book": "Proceedings of the 2022 International Conference on Management of Data", "pages": "1670-1684", "description": "We introduce Proteus, a novel self-designing approximate range filter, which configures itself based on sampled data in order to optimize its false positive rate (FPR) for a given space requirement. Proteus unifies the probabilistic and deterministic design spaces of state-of-the-art range filters to achieve robust performance across a larger variety of use cases. At the core of Proteus lies our Contextual Prefix FPR (CPFPR) model - a formal framework for the FPR of prefix-based filters across their design spaces. We empirically demonstrate the accuracy of our model and Proteus' ability to optimize over both synthetic workloads and real-world datasets. We further evaluate Proteus in RocksDB and show that it is able to improve end-to-end performance by as much as 5.3x over more brittle state-of-the-art methods such as SuRF and Rosetta. Our experiments also indicate that the cost of modeling is not significant …", "total_citations": {"2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:7PzlFSSx8tAC": {"external_link": "https://arxiv.org/abs/2204.01057", "authors": ["Kai Siong Yow", "Siqiang Luo"], "publication_date": "2022/4/3", "source": "arXiv preprint arXiv:2204.01057", "description": "Over the years, many graph problems specifically those in NP-complete are studied by a wide range of researchers. Some famous examples include graph colouring, travelling salesman problem and subgraph isomorphism. Most of these problems are typically addressed by exact algorithms, approximate algorithms and heuristics. There are however some drawback for each of these methods. Recent studies have employed learning-based frameworks such as machine learning techniques in solving these problems, given that they are useful in discovering new patterns in structured data that can be represented using graphs. This research direction has successfully attracted a considerable amount of attention. In this survey, we provide a systematic review mainly on classic graph problems in which learning-based approaches have been proposed in addressing the problems. We discuss the overview of each framework, and provide analyses based on the design and performance of the framework. Some potential research questions are also suggested. Ultimately, this survey gives a clearer insight and can be used as a stepping stone to the research community in studying problems in this field.", "total_citations": {"2022": 1, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:3fE2CSJIrl8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3132847.3133073", "authors": ["Siqiang Luo", "Jiafeng Hu", "Reynold Cheng", "Jing Yan", "Ben Kao"], "publication_date": "2017/11/6", "book": "Proceedings of the 2017 ACM on Conference on Information and Knowledge Management", "pages": "2179-2182", "description": "Spatial object search is prevalent in map services (e.g., Google Maps). To rent an apartment, for example, one will take into account its nearby facilities, such as supermarkets, hospitals, and subway stations. Traditional keyword search solutions, such as the nearby function in Google Maps, are insufficient in expressing the often complex attribute/spatial requirements of users. Those require- ments, however, are essential to reflect the user search intention. In this paper, we propose the Spatial Exemplar Query (SEQ), which allows the user to input a result example over an interface inside the map service. We then propose an effective similarity measure to evaluate the proximity between a candidate answer and the given example. We conduct a user study to validate the effectiveness of SEQ. Our result shows that more than 88% of users would like to have an example assisted search in map services. Moreover, SEQ …", "total_citations": {"2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:j3f4tGmQtD8C": {"external_link": null, "authors": ["N Liao", "D Mo", "S Luo", "X Li", "P Yin"], "publication_date": "2022", "journal": "Proceedings of the VLDB Endowment", "volume": "15", "issue": "11", "pages": "3240-3248", "total_citations": {"2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:4JMBOYKVnBMC": {"external_link": "https://openproceedings.org/2023/conf/edbt/paper-176.pdf", "authors": ["Siqiang Luo", "Zichen Zhu", "Xiaokui Xiao", "Yin Yang", "Chunbo Li", "Ben Kao"], "publication_date": "2023", "journal": "Proceedings of the 26th International Conference on Extending Database Technology", "pages": "247-259", "description": "Vertex-centric (VC) graph systems are at the core of large-scale distributed graph processing. For such systems, a common usage pattern is the concurrent processing of multiple tasks (multiprocessing for short), which aims to execute a large number of unit tasks in parallel. In this paper, we point out that multi-processing has not been sufficiently studied or evaluated in previous work; hence, we fill this critical gap with three major contributions. First, we examine the tradeoff between two important measures in VC-systems: the number of communication rounds and message congestion. We show that this tradeoff is crucial to system performance; yet, existing approaches fail to achieve an optimal tradeoff, leading to poor performance. Second, based on extensive experimental evaluations on mainstream VC systems (eg, Giraph, Pregel+, GraphD) and benchmark multi-processing tasks (eg, Batch Personalized PageRanks, Multiple Source Shortest Paths), we present several important insights on the correlation between system performance and configurations, which is valuable to practitioners in optimizing system performance. Third, based on the insights drawn from our experimental evaluations, we present a cost-based tuning framework that optimizes the performance of a representative VC-system. This demonstrates the usefulness of the insights.", "total_citations": {"2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:e5wmG9Sq2KIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9861197/", "authors": ["Zequan Xu", "Siqiang Luo", "Jieming Shi", "Hui Li", "Chen Lin", "Qihang Sun", "Shaofeng Hu"], "publication_date": "2022/6/6", "conference": "2022 23rd IEEE International Conference on Mobile Data Management (MDM)", "pages": "238-245", "publisher": "IEEE", "description": "Instant messaging client (IMC) is now an essential tool for mobile users. In the representative IMC We Chat, cybercriminals deceive frauds, causing financial loss to normal users. Through statistical analysis, we find that certain fraud interactions commonly occur among WeChat users who are not k-hop neighbors. Therefore, efficiently answering whether the distance between two vertices is not longer than k at a certain time point (i.e., k-hop reachability queries) over the dynamic social graph of WeChat becomes a crucial task for fraud feature extraction in the detection system: it can help human experts quickly identify suspicious user interactions and the query results can be further used as the input feature to the downstream machine learning based detection methods. In this paper, we illustrate Bidirectional k-hop Reachability Query Processing over a Dynamic Graph (BREAD) that is used in WeChat for extracting the k-hop …", "total_citations": {"2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:qUcmZB5y_30C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3485447.3511996", "authors": ["Meng Li", "Deyi Chen", "Haipeng Dai", "Rongbiao Xie", "Siqiang Luo", "Rong Gu", "Tong Yang", "Guihai Chen"], "publication_date": "2022/4/25", "book": "Proceedings of the ACM Web Conference 2022", "pages": "2759-2767", "description": "Bloom filter is an efficient data structure for filtering negative keys (keys not in a given set) with substantially small space. However, in real-world applications, there widely exist vulnerable negative keys, which will bring high costs if not being properly filtered, especially when positive keys are added/deleted dynamically. To address the problem, we propose SeeSaw Counting Filter (SSCF), which is innovated with encapsulating the vulnerable negative keys into a unified counter array named seesaw counter array, and dynamically modulating (or varying) the applied hash functions to guard the encapsulated keys from being misidentified. Moreover, we propose ada-SSCF to handle the scenarios where the vulnerable negative keys cannot be obtained in advance. We extensively evaluate our SSCF, which shows that SSCF outperforms the cutting-edge filters by 3 × on averages regarding accuracy while ensuring a …", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:blknAaTinKkC": {"external_link": "https://ojs.aaai.org/index.php/AAAI/article/view/25618", "authors": ["Wenting Zhao", "Gongping Xu", "Zhen Cui", "Siqiang Luo", "Cheng Long", "Tong Zhang"], "publication_date": "2023/6/26", "journal": "Proceedings of the AAAI Conference on Artificial Intelligence", "volume": "37", "issue": "4", "pages": "4920-4928", "description": "In the scene of self-supervised graph learning, Mutual Information (MI) was recently introduced for graph encoding to generate robust node embeddings. A successful representative is Deep Graph Infomax (DGI), which essentially operates on the space of node features but ignores topological structures, and just considers global graph summary. In this paper, we present an effective model called Deep Graph Structural Infomax (DGSI) to learn node representation. We explore to derive the structural mutual information from the perspective of Information Bottleneck (IB), which defines a trade-off between the sufficiency and minimality of representation on the condition of the topological structure preservation. Intuitively, the derived constraints formally maximize the structural mutual information both edge-wise and local neighborhood-wise. Besides, we develop a general framework that incorporates the global representational mutual information, local representational mutual information, and sufficient structural information into the node representation. Essentially, our DGSI extends DGI and could capture more fine-grained semantic information as well as beneficial structural information in a self-supervised manner, thereby improving node representation and further boosting the learning performance. Extensive experiments on different types of datasets demonstrate the effectiveness and superiority of the proposed method.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:bEWYMUwI8FkC": {"external_link": "https://arxiv.org/abs/2304.04015", "authors": ["Siqiang Luo", "Zulun Zhu"], "publication_date": "2023/4/8", "journal": "arXiv preprint arXiv:2304.04015", "description": "SimRank is one of the most fundamental measures that evaluate the structural similarity between two nodes in a graph and has been applied in a plethora of data management tasks. These tasks often involve single-source SimRank computation that evaluates the SimRank values between a source node  and all other nodes. Due to its high computation complexity, single-source SimRank computation for large graphs is notoriously challenging, and hence recent studies resort to distributed processing. To our surprise, although SimRank has been widely adopted for two decades, theoretical aspects of distributed SimRanks with provable results have rarely been studied. In this paper, we conduct a theoretical study on single-source SimRank computation in the Massive Parallel Computation (MPC) model, which is the standard theoretical framework modeling distributed systems such as MapReduce, Hadoop, or Spark. Existing distributed SimRank algorithms enforce either  communication round complexity or  machine space for a graph of  nodes. We overcome this barrier. Particularly, given a graph of  nodes, for any query node  and constant error , we show that using  rounds of communication among machines is almost enough to compute single-source SimRank values with at most  absolute errors, while each machine only needs a space sub-linear to . To the best of our knowledge, this is the first single-source SimRank algorithm in MPC that can overcome the  round complexity barrier with provable result accuracy.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:maZDTaKrznsC": {"external_link": "https://siqiangluo.com/docs/COCLEP__Contrastive_Learning_based_Semi_Supervised_Community_Search__camera_ready_.pdf", "authors": ["Ling Li", "Siqiang Luo", "Yuhai Zhao", "Caihua Shan", "Zhengkui Wang", "Lu Qin"], "publication_date": "2023", "journal": "IEEE 39th ICDE", "description": "Community search is a fundamental graph processing task that aims to find a community containing the given query node. Recent studies show that machine learning (ML)-based community search can return higher-quality communities than the classic methods such as k-core and k-truss. However, the state-of-the-art ML-based models require a large number of labeled data (ie, nodes in ground-truth communities) for training that are difficult to obtain in real applications, and incur unaffordable memory costs or query time for large datasets. To address these issues, in this paper, we present the community search based on contrastive learning with partition, namely COCLEP, which only requires a few labels and is both memory and query efficient. In particular, given a small collection of query nodes and a few (eg, three) corresponding ground-truth community nodes for each query, COCLEP learns a querydependent model through the proposed graph neural network and the designed label-aware contrastive learner. The former perceives query node information, low-order neighborhood information, and high-order hypergraph structure information, the latter contrasts low-order intra-view, high-order intra-view, and low-high-order inter-view representations of the nodes. Further, we theoretically prove that COCLEP can be scalable to large datasets with the min-cut over the graph. To the best of our knowledge, this is the first attempt to adopt contrastive learning for community search task that is nontrivial. Extensive experiments on real-world datasets show that COCLEP simultaneously achieves better community effectiveness and comparably high …", "total_citations": {"2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:mB3voiENLucC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9785611/", "authors": ["Dingheng Mo", "Siqiang Luo"], "publication_date": "2022/5/30", "journal": "IEEE Transactions on Knowledge and Data Engineering", "publisher": "IEEE", "description": "Given a source node    and a target node    in a graph   , the Personalized PageRank (PPR) from    to    is the probability of a random walk starting from    terminates at   . PPR is a classic measure of the relevance between two nodes in a graph. It has been applied in numerous real-world systems. However, existing techniques for PPR queries are not robust to dynamic real-world graphs, which typically have different evolving speeds. Their performance is significantly degraded either at a lower graph evolving rate (e.g., much more queries than updates) or a higher rate. To address the above deficiencies, we propose  Agenda  to efficiently process, with strong approximation guarantees, the single-source PPR (SSPPR) queries on dynamically evolving graphs with various evolving speeds. Compared with previous methods,  Agenda  has significantly better workload robustness, while ensuring the same …", "total_citations": {"2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:RHpTSmoSYBkC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9835264/", "authors": ["Zichen Zhu", "Siqiang Luo", "Xiaokui Xiao", "Yin Yang", "Dingheng Mo", "Yufei Han"], "publication_date": "2022/5/9", "conference": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "3142-3145", "publisher": "IEEE", "description": "Distributed vertex-centric graph systems, or VC-systems, have achieved tremendous success in the industry. A common usage pattern of VC-systems is multi-processing, or the concurrent processing of multiple unit tasks. Example multi-processing includes answering multiple single-source shortest path queries on a graph. However, concurrent processing of all the unit tasks may overload the system with excessive memory usage, leading to intolerable system delays. To ad-dress the important challenge, we present V C- Tune, a system with a convenient interface to help practitioners orchestrate the unit tasks for improving the overall performance within the system limit. This demonstration allows the audience to interact with our system to explore the configuration space of multi-processing in VC-systems and compare different sys-tem configurations. In addition, we embed into the system an automatic configuration …", "total_citations": {"2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:_Qo2XoVZTnwC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9835291/", "authors": ["Hanyuan Zhang", "Siqiang Luo", "Jieming Shi", "Jing Nathan Yan", "Weiwei Sun"], "publication_date": "2022/5/9", "conference": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "539-551", "publisher": "IEEE", "description": "Searching spatial objects is a fundamental task in spatial services such as online maps. Traditional search methods are based on filtering conditions, burdening users to specify their requirements. This paper focuses on spatial search via examples. Particularly, the user can specify an example, which is a set of objects of interest, and the purpose is to find a list of results, each containing a set of objects with similar properties to the given example. We conducted a user study, showing that a search interface based on examples can effectively complement existing approaches. However, the existing example-based search is not scalable, hindering its applications to larger datasets. To address this challenge, we propose two new algorithms, namely HSP and LORA, to efficiently answer example-based spatial queries. HSP is an algorithm based on a hierarchical partitioning of the search space, and it achieves up to 20 …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:JV2RwH3_ST0C": {"external_link": "https://ui.adsabs.harvard.edu/abs/2022arXiv220401057Y/abstract", "authors": ["Kai Siong Yow", "Ningyi Liao", "Siqiang Luo", "Reynold Cheng", "Chenhao Ma", "Xiaolin Han"], "publication_date": "2022/4", "source": "arXiv e-prints", "pages": "arXiv: 2204.01057", "description": "A subgraph is constructed by using a subset of vertices and edges of a given graph. There exist many graph properties that are hereditary for subgraphs. Hence, researchers from different communities have paid a great deal of attention in studying numerous subgraph problems, on top of the ordinary graph problems. Many algorithms are proposed in studying subgraph problems, where one common approach is by extracting the patterns and structures of a given graph. Due to the complex structures of certain types of graphs and to improve overall performances of the existing frameworks, machine learning techniques have recently been employed in dealing with various subgraph problems. In this article, we present a comprehensive review on five well known subgraph problems that have been tackled by using machine learning methods. They are subgraph isomorphism (both counting and matching), maximum …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:YOwf2qJgpHMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8669822/", "authors": ["Siqiang Luo", "Reynold Cheng", "Ben Kao", "Xiaokui Xiao", "Shuigeng Zhou", "Jiafeng Hu"], "publication_date": "2019/3/19", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "32", "issue": "8", "pages": "1595-1609", "publisher": "IEEE", "description": "Novel road-network applications often recommend a moving object (e.g., a vehicle) about interesting services or tasks on its way to a destination. A taxi-sharing system, for instance, suggests a new passenger to a taxi while it is serving another one. The traveling cost is then shared among these passengers. A fundamental query is: given two nodes s and t, and an area A on road network graph , is there a “good” route (e.g., short enough path) P from s to t that crosses A in G? In a taxi-sharing system, s and t can be a taxi's current and destined locations, and A contains all the places to which a person waiting for a taxi is willing to walk. Answering this Route and Area Matching (ROAM) Query allows the application involved to recommend appropriate services to users efficiently. In this paper, we examine efficient ROAM query algorithms. Particularly, we develop solutions for finding a ρ-route, which is an s-t path that …", "total_citations": {"2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:Se3iqnhoufwC": {"external_link": "https://www.cs.hku.hk/data/techreps/document/TR-2016-03.pdf", "authors": ["Siqiang Luo", "Reynold Cheng", "Xiaokui Xiao", "Ben Kao", "Shuigeng Zhou", "Jiafeng Hu"], "publisher": "Technical Report TR-2016-03, The University of Hong Kong, 2016. http://www. cs. hku. hk/research/techreps/document/TR-2016-03. pdf", "description": "Novel road-network services, such as ride sharing, spatial crowdsourcing and keyword-aware routing often need to find out whether there exists a route that can go through (or match) a service area. A ride-sharing system, for instance, may need to find for a moving taxi a route that passes through a region in which a passenger is located. A fundamental question is: given two locations s and t, and an area A on the road network, is there a “reasonably short” route from s to t that also crosses A? This Route and Area Matching (ROAM) query is important as 1) its efficient evaluation allows the application involved to recommend appropriate services to objects in an online manner; 2) its algorithm can be incorporated into some sophisticated systems to optimize their performance. Despite its importance, the ROAM query has not been well studied especially when “service area” instead of “service point” is concerned. We examine efficient ROAM query algorithms. Particularly, we develop solutions for testing the existence of a ρ-route, which is an st path that passes through A, with a length of at most (1+ ρ) times the shortest distance between s and t. We propose index-free and index-based algorithms. Our index structures, with a size linear to the number of road network nodes, enable significant query improvement over baseline approaches. We have performed extensive experiments on several large road network datasets to validate the efficiency and scalability of our approaches. In addition, we incorporate our efficient algorithm to an existing keyword-aware routing system and one dynamic ride-sharing system. Our experiments show that an efficient …", "total_citations": {"2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:YFjsv_pBGBYC": {"external_link": "https://arxiv.org/abs/2308.07013", "authors": ["Dingheng Mo", "Fanchao Chen", "Siqiang Luo", "Caihua Shan"], "publication_date": "2023/8/14", "journal": "arXiv preprint arXiv:2308.07013", "description": "LSM-trees are widely adopted as the storage backend of key-value stores. However, optimizing the system performance under dynamic workloads has not been sufficiently studied or evaluated in previous work. To fill the gap, we present RusKey, a key-value store with the following new features: (1) RusKey is a first attempt to orchestrate LSM-tree structures online to enable robust performance under the context of dynamic workloads; (2) RusKey is the first study to use Reinforcement Learning (RL) to guide LSM-tree transformations; (3) RusKey includes a new LSM-tree design, named FLSM-tree, for an efficient transition between different compaction policies -- the bottleneck of dynamic key-value stores. We justify the superiority of the new design with theoretical analysis; (4) RusKey requires no prior workload knowledge for system adjustment, in contrast to state-of-the-art techniques. Experiments show that RusKey exhibits strong performance robustness in diverse workloads, achieving up to 4x better end-to-end performance than the RocksDB system under various settings."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:BqipwSGYUEgC": {"external_link": "https://dl.acm.org/doi/abs/10.14778/3611540.3611571", "authors": ["Kai Siong Yow", "Ningyi Liao", "Siqiang Luo", "Reynold Cheng"], "publication_date": "2023/8/1", "source": "Proceedings of the VLDB Endowment", "volume": "16", "issue": "12", "pages": "3864-3867", "publisher": "VLDB Endowment", "description": "Subgraphs are obtained by extracting a subset of vertices and a subset of edges from the associated original graphs, and many graph properties are known to be inherited by subgraphs. Subgraphs can be applied in many areas such as social networks, recommender systems, biochemistry and fraud discovery. Researchers from various communities have paid a great deal of attention to investigate numerous subgraph problems, by proposing algorithms that mainly extract important structures of a given graph. There are however some limitations that should be addressed, with regard to the efficiency, effectiveness and scalability of these traditional algorithms. As a consequence, machine learning techniques---one of the most latest trends---have recently been employed in the database community to address various subgraph problems considering that they have been shown to be beneficial in dealing with graph …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:NMxIlDl6LWMC": {"external_link": "https://dl.acm.org/doi/abs/10.14778/3603581.3603591", "authors": ["Wei Tian", "Jieming Shi", "Siqiang Luo", "Hui Li", "Xike Xie", "Yuanhang Zou"], "publication_date": "2023/6/1", "journal": "Proceedings of the VLDB Endowment", "volume": "16", "issue": "10", "pages": "2512-2524", "publisher": "VLDB Endowment", "description": "We study route planning that utilizes historical trajectories to predict a realistic route from a source to a destination on a road network at given departure time. Route planning is a fundamental task in many location-based services. It is challenging to capture latent patterns implied by complex trajectory data for accurate route planning. Recent studies mainly resort to deep learning techniques that incur immense computational costs, especially on massive data, while their effectiveness are complicated to interpret. This paper proposes DRPK, an effective and efficient route planning method that achieves state-of-the-art performance via a series of novel algorithmic designs. In brief, observing that a route planning query (RPQ) with closer source and destination is easier to be accurately predicted, we fulfill a promising idea in DRPK to first detect the key segment of an RPQ by a classification model KSD, in order to split …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:M3NEmzRMIkIC": {"external_link": "https://arxiv.org/abs/2305.09974", "authors": ["Kai Wang", "Siqiang Luo", "Dan Lin"], "publication_date": "2023/5/17", "journal": "arXiv preprint arXiv:2305.09974", "description": "We study Graph Neural Networks (GNNs)-based embedding techniques for knowledge graph (KG) reasoning. For the first time, we link the path redundancy issue in the state-of-the-art KG reasoning models based on path encoding and message passing to the transformation error in model training, which brings us new theoretical insights into KG reasoning, as well as high efficacy in practice. On the theoretical side, we analyze the entropy of transformation error in KG paths and point out query-specific redundant paths causing entropy increases. These findings guide us to maintain the shortest paths and remove redundant paths for minimized-entropy message passing. To achieve this goal, on the practical side, we propose an efficient Graph Percolation Process motivated by the percolation model in Fluid Mechanics, and design a lightweight GNN-based KG reasoning framework called Graph Percolation Embeddings (GraPE). GraPE outperforms previous state-of-the-art methods in both transductive and inductive reasoning tasks while requiring fewer training parameters and less inference time."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:k_IJM867U9cC": {"external_link": "https://arxiv.org/abs/2305.09958", "authors": ["Haoyu Liu", "Ningyi Liao", "Siqiang Luo"], "publication_date": "2023/5/17", "journal": "arXiv preprint arXiv:2305.09958", "description": "Graph neural networks (GNNs) realize great success in graph learning but suffer from performance loss when meeting heterophily, i.e. neighboring nodes are dissimilar, due to their local and uniform aggregation. Existing attempts in incoorporating global aggregation for heterophilous GNNs usually require iteratively maintaining and updating full-graph information, which entails  computation efficiency for a graph with  nodes, leading to weak scalability to large graphs. In this paper, we propose SIMGA, a GNN structure integrating SimRank structural similarity measurement as global aggregation. The design of SIMGA is simple, yet it leads to promising results in both efficiency and effectiveness. The simplicity of SIMGA makes it the first heterophilous GNN model that can achieve a propagation efficiency near-linear to . We theoretically demonstrate its effectiveness by treating SimRank as a new interpretation of GNN and prove that the aggregated node representation matrix has expected grouping effect. The performances of SIMGA are evaluated with 11 baselines on 12 benchmark datasets, usually achieving superior accuracy compared with the state-of-the-art models. Efficiency study reveals that SIMGA is up to 5 faster than the state-of-the-art method on the largest heterophily dataset pokec with over 30 million edges."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:isC4tDSrTZIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10120975/", "authors": ["Meng Li", "Deyi Chen", "Haipeng Dai", "Rongbiao Xie", "Siqiang Luo", "Rong Gu", "Tong Yang", "Guihai ChenFellow"], "publication_date": "2023/5/8", "journal": "IEEE Transactions on Knowledge and Data Engineering", "publisher": "IEEE", "description": "Bloom filter is an efficient data structure for filtering negative keys (keys not in a given set) with substantially small space. However, in real-world applications, there widely exist vulnerable negative keys, which will bring high costs if not being properly filtered, especially when positive keys are added/deleted dynamically. Such problem gets more severe when keys within one set are dynamically added or deleted. Recently, there are works focusing on handling such (vulnerable) negative keys by incorporating learning techniques. These learning-based filters fail to work as the learning techniques can hardly handle incremental insertions or deletions. To address the problem, we propose SeeSaw Counting Filter (SSCF), which is innovated with encapsulating the vulnerable negative keys into a unified counter array named seesaw counter array, and dynamically modulating (or varying) the applied hash functions to …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:TFP_iSt0sucC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10103170/", "authors": ["Ling Li", "Yuhai Zhao", "Siqiang Luo", "Guoren Wang", "Zhengkui Wang"], "publication_date": "2023/4/17", "journal": "IEEE Transactions on Knowledge and Data Engineering", "publisher": "IEEE", "description": "Given a graph, searching for a community containing a query vertex is a fundamental problem and has found many applications. Most existing community search models are based on non-attributed or vertex-attributed graphs. In many real-world graphs, however, the edges carry the richest information to describe the interactions between vertices; hence, it is important to take the information into account in community search. In this paper, we conduct a pioneer study on the community search on edge-attributed graphs. We proposed the Edge-Attributed Community Search (EACS) problem, which aims to extract a subgraph that contains the given query vertex while its edges have the maximum attribute similarity. We prove that the EACS problem is NP-hard and propose both exact and 2-approximation algorithms to address EACS. Our exact algorithms run up to 2320.34 times faster than the baseline solution. Our …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:hMod-77fHWUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10184622/", "authors": ["Jun Xuan Yew", "Ningyi Liao", "Dingheng Mo", "Siqiang Luo"], "publication_date": "2023/4/3", "conference": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "3635-3638", "publisher": "IEEE", "description": "Location search in spatial services such as online maps nowadays is usually based on criteria filtering methods. Due to its algorithmic design, the traditional method only searches for one target location per query, ignoring the relation among multiple objects. In large-scale tasks of finding a number of targets, it is particularly inconvenient as users are required to specify each criterion. To address this issue, we present Example Searcher, a system that allows users to search more efficiently in such tasks. Example Searcher adopts a novel way of location search that allows rich and interactive user inputs and searches for multiple target locations simultaneously. The system is powered by the state-of-the-art spatial search algorithm LORA, which efficiently performs spatial queries and searches for a set of locations that are similar to the given input examples as a whole. An introduction video of Example Searcher is …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:iH-uZ7U-co4C": {"external_link": "https://arxiv.org/abs/2303.15702", "authors": ["Peng Fang", "Arijit Khan", "Siqiang Luo", "Fang Wang", "Dan Feng", "Zhenli Li", "Wei Yin", "Yuchao Cao"], "publication_date": "2023/3/28", "journal": "arXiv preprint arXiv:2303.15702", "description": "Graph embedding maps graph nodes to low-dimensional vectors, and is widely adopted in machine learning tasks. The increasing availability of billion-edge graphs underscores the importance of learning efficient and effective embeddings on large graphs, such as link prediction on Twitter with over one billion edges. Most existing graph embedding methods fall short of reaching high data scalability. In this paper, we present a general-purpose, distributed, information-centric random walk-based graph embedding framework, DistGER, which can scale to embed billion-edge graphs. DistGER incrementally computes information-centric random walks. It further leverages a multi-proximity-aware, streaming, parallel graph partitioning strategy, simultaneously achieving high local partition quality and excellent workload balancing across machines. DistGER also improves the distributed Skip-Gram learning model to generate node embeddings by optimizing the access locality, CPU throughput, and synchronization efficiency. Experiments on real-world graphs demonstrate that compared to state-of-the-art distributed graph embedding frameworks, including KnightKing, DistDGL, and Pytorch-BigGraph, DistGER exhibits 2.33x-129x acceleration, 45% reduction in cross-machines communication, and > 10% effectiveness improvement in downstream tasks."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:r0BpntZqJG4C": {"external_link": "https://arxiv.org/abs/2303.10983", "authors": ["Weiping Yu", "Siqiang Luo"], "publication_date": "2023/3/20", "journal": "arXiv preprint arXiv:2303.10983", "description": "We present FasCo, a simple yet effective learning-based estimator for the cost of executing a database query plan. FasCo uses significantly shorter training time and a lower inference cost than the state-of-the-art approaches, while achieving higher estimation accuracy. The effectiveness of FasCo comes from embedding abundant explicit execution-plan-based features and incorporating a novel technique called cardinality calibration. Extensive experimental results show that FasCo achieves orders of magnitude higher efficiency than the state-of-the-art methods: on the JOB-M benchmark dataset, it cuts off training plans by 98\\%, reducing training time from more than two days to about eight minutes while entailing better accuracy. Furthermore, in dynamic environments, FasCo can maintain satisfactory accuracy even without retraining, narrowing the gap between learning-based estimators and real systems."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:IWHjjKOFINEC": {"external_link": "https://link.springer.com/chapter/10.1007/978-3-031-00129-1_39", "authors": ["Ruyao Xu", "Dawei Cheng", "Cen Chen", "Siqiang Luo", "Yifeng Luo", "Weining Qian"], "publication_date": "2022/4/8", "book": "International Conference on Database Systems for Advanced Applications", "pages": "455-467", "publisher": "Springer International Publishing", "description": "The prediction of the stock market trends is an important problem and has attracted tremendous research interest. However, previous methods often consider modeling each stock separately and rarely leverage the information between different stocks to jointly train a model. In this paper, we address the problem of predicting the stock market trends and bring two key insights. First, we show that a better prediction model can be trained by simultaneously considering the features of correlated stocks. Unlike previous methods, our model does not rely on any prior manual input knowledge. Second, we observe that stock trend information on a single time scale is confined and not sufficient because the holding period can be different among investors. We thus design an encoder with multiple time scales to capture features for different time granularity. On top of these, we present a novel stock trend prediction framework …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:Wp0gIr-vW9MC": {"external_link": "https://hub.hku.hk/handle/10722/280864", "authors": ["Siqiang Luo"], "publication_date": "2019", "journal": "HKU Theses Online (HKUTO)", "publisher": "The University of Hong Kong (Pokfulam, Hong Kong)", "description": "Performance optimization is one of the central problems in data systems because the systems are facing heavy computation workloads. For example, taxi-hailing services (e.g., Uber) require powerful database systems to process massive volumes of operations (e.g., kNN queries, location updates) efficiently; user-ranking services in Tencent involves millions of Personalized PageRank (PPR) queries on billion-edge social networks.  In performance optimization, we have to take into account the variation of the application features. For example, the query/update workloads vary in taxi-hailing services, as the workloads depend on the scales of the services and the diversities of the cities that deploy the services. From the perspective of database solutions, it is desirable to have a solution that can be well adapted to different workloads, or has the workload adaptability.  Further, the system hardware to deploy the service can change from time to time. As a location-based service expands and scales, its system needs to be upgraded to more powerful machines (e.g., one with many CPU cores). To effectively optimize the performance, a good database solution should be able to exploit the full potential of high-performance hardware with minimum engineering efforts. In other words, it is interesting to design a solution that has good system adaptability.  In addition, the workloads also change with the given requirements on the application. Take the task of approximating PPRs as an example, we often require that the estimations should be within e relative errors. A natural question is, whether the computation optimization should be dependent on e? This …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:aqlVkmm33-oC": {"external_link": "https://ui.adsabs.harvard.edu/abs/2013arXiv1304.2576D/abstract", "authors": ["Andy Diwen Zhu", "Hui Ma", "Xiaokui Xiao", "Siqiang Luo", "Youze Tang", "Shuigeng Zhou"], "publication_date": "2013/4", "journal": "arXiv e-prints", "pages": "arXiv: 1304.2576", "description": "Given two locations  and  in a road network, a distance query returns the minimum network distance from  to , while a shortest path query computes the actual route that achieves the minimum distance. These two types of queries find important applications in practice, and a plethora of solutions have been proposed in past few decades. The existing solutions, however, are optimized for either practical or asymptotic performance, but not both. In particular, the techniques with enhanced practical efficiency are mostly heuristic-based, and they offer unattractive worst-case guarantees in terms of space and time. On the other hand, the methods that are worst-case efficient often entail prohibitive preprocessing or space overheads, which render them inapplicable for the large road networks (with millions of nodes) commonly used in modern map applications. This paper presents {\\em Arterial Hierarchy (AH)}, an index structure that …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:ULOm3_A8WrAC": {"external_link": "https://i.cs.hku.hk/~ckcheng/CV/complete_publication_list.pdf", "authors": ["R Cheng", "S Prabhakar", "R Cheng", "Y Fang", "J Chen", "B Kao", "S Luo", "J Hu", "X Li"], "description": "Research Output (journal articles, conference papers, book chapters, software) Ph.D. Thesis \nScholarly Books, Monographs, and Cha Page 1 Page 1 of 9 Research Output (journal articles, \nconference papers, book chapters, software) Note: 1) A “*” before the author name means \nhe/she is my postdoc. fellow, graduate student, or research assistant. 2) The citation numbers \nare obtained from Google scholar on 7th December, 2010. Only the top 25 citations are \nshown. Ph.D. Thesis 1. R. Cheng. Managing Uncertainty in Constantly-Evolving Environments. \nPh.D thesis, Purdue University, 2005. Scholarly Books, Monographs, and Chapters 2. R. \nCheng. Uncertain Spatial Data Management. In the Encyclopedia of Database Systems, L. Liu \nand T. Ozsu (eds.), Springer New York, pp. 1-6, 2017 (online). ISBN: 978-1-4899-7993-3. 3. S. \nPrabhakar and R. Cheng. Indexing Uncertain Data. In the Encyclopedia of Database Systems…"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=ZDwbMg4AAAAJ&cstart=20&pagesize=80&citation_for_view=ZDwbMg4AAAAJ:W7OEmFMy1HYC": {"external_link": "https://scholar.google.com/scholar?cluster=5535094206564495728&hl=en&oi=scholarr", "authors": ["Yixiang Fang", "Reynold Cheng", "Siqiang Luo", "Jiafeng Hu"], "description": "Recently, the retrieval of a community from large graph databases has captured a lot of attention. Given a vertex q of a graph, the community search operation finds a subgraph, or community, which contains vertices closely related to q. Communities are prevalent in social networks, bibliographical graphs, and knowledge bases, and they enable emerging applications like product advertisement and setting up of social events. Existing community search algorithms, which are based mainly on the relationships (or edges) between vertices, overlook the important information carried by the attributes of vertices. We found that communities returned by these algorithms often consist of vertices having keywords about a variety of topics, and this makes it difficult to interpret the meanings behind those communities.In this paper, we investigate how vertex attributes can be used to generate communities that are easier to analyze. Particularly, we propose the label-aware community (or LAC), which not just requires vertices to be structurally close to each other, but also needs to have common labels. The LAC allows a better understanding of how and why a community is formed (eg, members of an LAC have a common interest in yoga, because they all have the same label “yoga”). To enable efficient LAC search, we develop a data structure called the CL-tree, and investigate novel query algorithms based on it. We evaluate our solutions on four large graphs, namely Flickr, DBLP, Tencent, and DBpedia. Our experimental results show that LACs can be extracted efficiently. Moreover, they reflect more precise meanings than communities found by existing …"}}