{"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=8A7kHCYAAAAJ&pagesize=100&sortby=pubdate&citation_for_view=8A7kHCYAAAAJ:buQ7SEKw-1sC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10089518/", "authors": ["Chao Zhang", "Wenting Dai", "Valerio Isoni", "Alexei Sourin"], "publication_date": "2023/3/31", "journal": "IEEE Transactions on Industrial Informatics", "publisher": "IEEE", "description": "The manufacturing process in the pharmaceutical industry requires for using vessels or tanks which inner surfaces can undergo fouling and/or may develop visible defects that have to be cleaned away. Surface contamination can present itself in different forms, and there is no available image database of stains. In this paper, we propose to use an unsupervised anomaly detection approach which trains models on one or just a few images of clean surfaces. First, we propose an inpainting GAN with global and local generators to make full use of every single image and to reduce the overfitting caused by a limited number of images in the training dataset. Furthermore, we propose a periodic noise injection technique to increase the number of images for training and to improve the detection performance of the network. The experimental results demonstrate that the proposed network and noise injection technique …", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=8A7kHCYAAAAJ&pagesize=100&sortby=pubdate&citation_for_view=8A7kHCYAAAAJ:NyGDZy8z5eUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9937390/", "authors": ["Hanqin Wang", "Alexei Sourin"], "publication_date": "2022/9/27", "conference": "2022 International Conference on Cyberworlds (CW)", "pages": "159-162", "publisher": "IEEE", "description": "We performed a feasibility study on new ways of using sound in interactive computer graphics to improve visual interaction as well as to replace or augment haptic interaction. We considered using sound during surface interaction tasks performed with a desktop haptic device and an optical hand tracking device and evaluated the efficiency of such interactive geometry sonification in terms of its precision and speed. We also considered scenarios of using sound for easing navigation while moving along a path or surface."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=8A7kHCYAAAAJ&pagesize=100&sortby=pubdate&citation_for_view=8A7kHCYAAAAJ:0CzhzZyukY4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9937394/", "authors": ["Alexei Sourin"], "publication_date": "2022/9/27", "conference": "2022 International Conference on Cyberworlds (CW)", "pages": "175-176", "publisher": "IEEE", "description": "This paper presents an approach to procedural modeling and the interactive software tool ShapeExplorer designed to make geometric shapes and visual appearances defined by mathematical functions (explicit, implicit and parametric). It can run on Windows, MacOS and Linux. It is just one interactive window where the user can type the definitions scripts and other parameters. The purpose of ShapeExplorer is to work as a quick all-in-one multi-platform design and visualization tool providing mathematical models for virtual environments."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=8A7kHCYAAAAJ&pagesize=100&sortby=pubdate&citation_for_view=8A7kHCYAAAAJ:HtS1dXgVpQUC": {"external_link": "https://link.springer.com/article/10.1007/s00371-021-02137-y", "authors": ["Wenting Dai", "Marius Erdt", "Alexei Sourin"], "publication_date": "2022/4", "journal": "The Visual Computer", "volume": "38", "issue": "4", "pages": "1181-1194", "publisher": "Springer Berlin Heidelberg", "description": "In manufacturing, artificial intelligence is attracting widespread attention to maximize industrial productivity. Image clustering, as a fundamental research direction in unsupervised learning, has been applied in various fields. Since no label information is demanded in clustering, a preliminary analysis of the unlabeled data can be done while saving lots of manpower. In this paper, we propose a novel Self-supervised Pairing Image Clustering network. It predicts clustering results in an end-to-end pair classification network, which is trained excluding any label information. Specifically, we devised a self-supervised pairing module that is able to accurately and efficiently create both types of pairs as training data after exploiting the pair distribution. Cooperating with the pair classification loss function, we added two regularization terms to ensure the clustering results to be unambiguous and close to the real data distribution …", "total_citations": {"2022": 3, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=8A7kHCYAAAAJ&citation_for_view=8A7kHCYAAAAJ:u5HHmVD_uO8C": {"external_link": "https://link.springer.com/article/10.1007/BF02464333", "authors": ["Alexander Pasko", "Valery Adzhiev", "Alexei Sourin", "Vladimir Savchenko"], "publication_date": "1995/8", "journal": "The visual computer", "volume": "11", "pages": "429-446", "publisher": "Springer-Verlag", "description": "Concepts of functionally based geometric modeling including sets of objects, operations, and relations are discussed. Transformations of a defining real function are described for set-theoretic operations, blending, offsetting, bijective mapping, projection, cartesian products, and metamorphosis. Inclusion, point membership, and intersection relations are also described. We use a high-level geometric language that can extend the interactive modeling system by input symbolic descriptions of primitives, operations, and predicates. This approach supports combinations of representational styles, including constructive geometry, sweeping, soft objects, voxel-based objects, deformable and other animated objects. Application examples of aesthetic design, collisions simulation, NC machining, range data processing, and 3D texture generation are given.", "total_citations": {"1995": 2, "1996": 8, "1997": 14, "1998": 16, "1999": 24, "2000": 16, "2001": 33, "2002": 36, "2003": 32, "2004": 59, "2005": 49, "2006": 38, "2007": 35, "2008": 37, "2009": 40, "2010": 33, "2011": 17, "2012": 16, "2013": 30, "2014": 18, "2015": 20, "2016": 16, "2017": 24, "2018": 22, "2019": 27, "2020": 15, "2021": 28, "2022": 15, "2023": 15}}}