{"full_name": "Zheng Jianmin", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Zheng Jianmin", "email": "asjmzheng@ntu.edu.sg", "image_path": "./profile_img/zheng_jianmin.jpg", "keywords": ["Computer Science and Engineering", "Interactive Digital Media", "Mathematics", "Mechanical & Manufacturing Engineering", "Art, Design and Media"], "biography": "Dr Jianmin Zheng is a professor in the School of Computer Science and Engineering of Nanyang Technological University. He received his Bachelor degree and Ph.D. degree from Zhejiang University. His research interests include computer aided geometric design, computer graphics, geometric modeling, CAD, Visualization, and interactive digital media. He has done significant research work in his research areas (such as T-spline technology, subdivision surfaces, rational geometric continuity, surface/surface intersection, curve/surface implicitization, and digital media processing algorithms) and published over 200 papers in international journals and conferences such as SIGGRAPH, ACM TOG, IEEE T-PAMI, IEEE TVCG, and IEEE TIP. He has served as a program committee member for many international conferences. Dr Zheng is an associate editor of six journals including \"Computer-Aided Design\", \"The Visual Computer\" and \"Computers & Graphics\".", "interests": "Dr Zheng's areas of expertise are computer aided geometric design, reality computing, computer graphics, applied geometry, and 3D digital geometry processing. His current research work focuses on T-spline technology and its applications in isogeometric processing, reality computing and 3D capturing, intelligent 3D printing, visualization for AI, and virtual/augmented reality .", "grants": "AI in Art Studio Creating image-based artworks using machine learning and science dataAutomated Defect Detection using deep learning approach (HP)Intelligent Reality Computing [ CoE Industrial Excellence Award 2023]Mesh Deep Learning for 3D Shape Parsing", "articles": ["S.Xiong, J.Zhang, J.Zheng, J.Cai, L.Liu. (2014). Robust surface reconstruction via dictionary learning. ACM Transactions on Graphics, 33(6), 1-12.", "P.Song, C.W.Fu, P.Goswami, J.Zheng, N.Mitra, D.Cohen-Or. (2013). Reciprocal frame structures made easy. ACM Transactions on Graphics, 32(4), 1-13.", "J.Zhang, J.Zheng, C.Wu, J.Cai. (2012). Variational mesh decomposition. ACM Transactions on Graphics, 31(3), 21.", "T Sederberg, J. Zheng, A Bakenov, A Nasri. (2003). T-splines and T-NURCCs. ACM Transactions on Graphics, 22(3), 477-484."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00072", "other_websites": ["https://personal.ntu.edu.sg/asjmzheng"]}