{"full_name": "Goh Wooi Boon", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Goh Wooi Boon", "email": "aswbgoh@ntu.edu.sg", "image_path": "./profile_img/goh_wooi_boon.jpg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Interactive Digital Media", "Machines & Systems"], "biography": "Wooi-Boon Goh received a B.Sc (1st Class Hons) in Computer Science and Electronic Engineering from the University of Birmingham, UK (1984), a M.Phil from University of Warwick, UK (1992), and a Ph.D. from Nanyang Technological University, Singapore (2006). He is currently an Associate Professor and Associate Chair (Faculty) in the School of Computer Science and Engineering, Nanyang Technological University, and his research interests include human-computer interaction and computer vision. Before joining NTU, he was senior engineer and later engineering section manager at the Mechanization and Automation department of Hewlett Packard Singapore. His industrial engineering expertise is in the area of developing robot-assisted automation systems.", "interests": "Human Computer Interaction, Computer Vision", "grants": "Collaborative multi-touch learning environments for children with autism", "articles": ["W.B.Goh, M. Chen, C.H. Trinh, J. Tan, W. Shou. (2014). The MOY Framework for Collaborative Play Design in Integrated Shared and Private Interactive Spaces. The ACM Conference on Human Factors in Computing Systems (CHI2014).", "W.B. Goh., L.L.C. Kasun, Fitriani, Jacquelyn Tan, W. Shou. (2012). Proceedings of the Designing Interactive Systems Conference: The i-Cube: Design Considerations for Block-based Digital Manipulatives and Their Applications. Designing Interactive Systems (DIS2012) (pp. 398-407)Newcastle, UK: ACM.", "P.Song, W.B. Goh, W. Hutama, C.W. Fu, X. Liu. (2012). Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: A Handle Bar Metaphor for Virtual Object Manipulation with Mid-Air Interaction.. The 30th ACM Conference on Human Factors in Computing Systems (CHI2012) (pp. 1297-1306)Austin, Texas, USA: ACM.", "Chi-Wing Fu, Wooi-Boon Goh, and Junxiang Ng, Allen. (2010). ACM Conference on Human Factors in Computing Systems: Multi-touch techniques for Exploring Large-Scale 3D Astrophysical Simulations. CHI 2010 (pp. Atlanta, USA)2213-2223: ACM SIGCHI."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00693", "other_websites": []}