{"full_name": "Chia Liang Tien", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Chia Liang Tien", "email": "asltchia@ntu.edu.sg", "image_path": "./profile_img/chia_liang_tien.jpg", "keywords": ["Info-Communication Technology", "Interactive Digital Media", "Computer Science and Engineering", "Internet & Communications"], "biography": "Liang-Tien, Chia received his B.Sc degree in Electrical and Electronics Engineering and PhD from Loughborough University (of Technology) in 1990 and 1994 respectively. During this period, he was awarded the University Traveling Prize for his academic achievements and he was a recipient of the Overseas Research Scholarship Award. He is currently an Associate Professor in the School of Computer Engineering, Nanyang Technological University, Singapore. He was the Director, Centre for Multimedia and Network Communications from 2002-2007 and is currently Head, Division of Computer Communications. Liang-Tien, Chia’s research interests can be broadly categorized into two main areas, Internet related research with emphasis on the Semantic Web and Multimedia Understanding for Information Management through media analysis, annotation and adaptation. Related topics include multimedia storage & retrieval, multimedia processing, multimodal data fusion and multimedia adaptation/transmission.  He is involved in a number of funded research projects and he serves as a member on numerous conference program committees and reviews for some international journals and he has published over 100 referred international conference and journal papers. He was awarded the A*Star Overseas Attachment Programme and spent one month in Microsoft Research Asia. Liang-Tien, Chia is a council member of the Infocomm Technology Standards Committee and serves as the technical chairman of ITSC Plugfest 2006.  As a Singaporean, he is an active National Serviceman serving as a Signal Officer in the Singapore Armed Forces.", "interests": "His research interests can be broadly categorized into the following areas, Internet related research with emphasis on the Semantic Web, Multimedia Understanding through media analysis, annotation and adaptation, Multimodal data fusion and Multimodality Ontology for Multimedia.. He has published over 100 refereed research papers.", "grants": null, "articles": ["Y. Hu, D. Rajan, L. T. Chia. (2009). Attention-from-Motion: A Factorization Approach for Detecting Attention Objects in Motion. Computer Vision and Image Understanding, 113(3), 319-331.", "Ziming Zhang, Yiqun Hu, Syin Chan, Liang-Tien Chia. (2008). Motion Context: A New Representation for Human Action Recognition. ECCV 2008: 10th European Conference on Computer Vision (biennial) (pp. 817 - 829).", "Huan Wang, Jiang Xing, Liang-Tien Chia, Ah Hwee Tan. (2008). Ontology Enhanced Web Image Retrieval: Aided by Wikipedia & Spreading Activation Theory. ACM MIR '08: 14th annual ACM international conference on Multimedia Information Retrieval.", "Xiangang Cheng, Yiqun Hu, and Liang-Tien Chia. (2008). Near-Duplicate Retrieval Using Local Dependencies in Spatial-Scale Space. ACM MULTIMEDIA '08: 16th annual ACM international conference on Multimedia."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00991", "other_websites": ["http://cemnet.ntu.edu.sg/home/asltchia/index.html"]}