{"full_name": "Pan, Sinno Jialin", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Pan, Sinno Jialin", "email": "sinnopan@ntu.edu.sg", "image_path": "./profile_img/pan,_sinno_jialin.jpg", "keywords": ["Computer Science and Engineering"], "biography": "Dr. Sinno Jialin Pan is a Provost's Chair Professor at the School of Computer Science and Engineering at Nanyang Technological University (NTU), Singapore. He received his Ph.D. degree in computer science from the Hong Kong University of Science and Technology (HKUST) in 2011. Prior to joining NTU, he was a scientist and Lab Head of text analytics with the Data Analytics Department, Institute for Infocomm Research, Singapore. He joined NTU as a Nanyang Assistant Professor in 2014 and was promoted to Associate Professor and Professor in 2019 and 2022, respectively. He was appointed as a Provost's Chair in Computer Science and Engineering in 2019. He was named to the list of \"AI 10 to Watch\" by the IEEE Intelligent Systems magazine in 2018. He serves as an Associate Editor for IEEE TPAMI, AIJ, and ACM TIST. His research interests include transfer learning and its real-world applications.", "interests": "Machine learning and artificial intelligence, especially transfer learning and its applications.", "grants": "Continual Transfer Learning via Integrating Logic into Deep LearningProvost's Chair in Computer Science and Engineering", "articles": ["Pan, S. J., Tsang, I. W., Kwok, J. T., & Yang, Q. (2010). Domain adaptation via transfer component analysis. IEEE Transactions on Neural Networks, 22(2), 199-210.", "Long, M., Wang, J., Ding, G., Pan, S. J., & Philip, S. Y. (2013). Adaptation regularization: A general framework for transfer learning. IEEE Transactions on Knowledge and Data Engineering, 26(5), 1076-1089.", "Xia, X., Lo, D., Pan, S. J., Nagappan, N., & Wang, X. (2016). Hydra: Massively compositional model for cross-project defect prediction. IEEE Transactions on Software Engineering, 42(10), 977-998.", "Pan, J. J., Pan, S. J., Yin, J., Ni, L. M., & Yang, Q. (2011). Tracking mobile users in wireless networks via semi-supervised colocalization. IEEE Transactions on Pattern Analysis and Machine Intelligence, 34(3), 587-600.", "Xu, Y., Pan, S. J., Xiong, H., Wu, Q., Luo, R., Min, H., & Song, H. (2017). A unified framework for metric transfer learning. IEEE Transactions on Knowledge and Data Engineering, 29(6), 1158-1171.", "Yang, Q., Pan, S. J., & Zheng, V. W. (2008). Estimating Location Using Wi-Fi. IEEE Intelligent Systems, 23(1), 8-13.", "Pan, R., Yang, Q., & Pan, S. J. (2007). Mining competent case bases for case-based reasoning. Artificial Intelligence, 171(16-17), 1039-1068.", "Cheng, L., & Pan, S. J. (2014). Semi-supervised domain adaptation on manifolds. IEEE Transactions on Neural Networks and Learning Systems, 25(12), 2240-2249.", "Zhao, L., Pan, S. J., & Yang, Q. (2017). A unified framework of active transfer learning for cross-system recommendation. Artificial Intelligence, 245, 38-55.", "Xu, Q., Pan, S. J., Xue, H. H., & Yang, Q. (2010). Multitask learning for protein subcellular location prediction. IEEE/ACM Transactions on Computational Biology and Bioinformatics, 8(3), 748-759.", "Click  here for more publications.", "Wang, W., & Pan, S. J. (2021). Variational Deep Logic Network for Joint Inference of Entities and Relations. Computational Linguistics, 47(4), 775-812.", "Lv, F., Lin, G., Liu, P., Yang, G., Pan, S. J., & Duan, L. (2020). Weakly-supervised cross-domain road scene segmentation via multi-level curriculum adaptation. IEEE Transactions on Circuits and Systems for Video Technology, 31(9), 3493-3503.", "Qian, H., Pan, S. J., & Miao, C. (2021). Weakly-supervised sensor-based activity segmentation and recognition via learning from distributions. Artificial Intelligence, 292, 103429.", "Li, H., Pan, S. J., Wang, S., & Kot, A. C. (2019). Heterogeneous domain adaptation via nonlinear matrix factorization. IEEE Transactions on Neural Networks and Learning Systems, 31(3), 984-996.", "Qiang Zhou, Yu Chen, Sinno Jialin Pan. (2020). Communication-efficient distributed multi-task learning with matrix sparsity regularization. Machine Learning, 109(3), 569-601.", "Shangyu Chen, Wenya Wang, Sinno Jialin Pan. (2019). MetaQuant: Learning to Quantize by Learning to Penetrate Non-differentiable Quantization. Advances in Neural Information Processing Systems 32 (pp. 3918-3928).", "Joey Tianyi Zhou, Ivor W. Tsang, Sinno Jialin Pan and Mingkui Tan. (2019). Multi-class Heterogeneous Domain Adaptation. Journal of Machine Learning Research, 20, 51:1-51:31.", "Wenya Wang and Sinno Jialin Pan. (2019). Syntactically Meaningful and Transferable Recursive Neural Networks        for Aspect and Opinion Extraction. Computational Linguistics, 45(4), 705-736.", "Wenya Wang, Sinno Jialin Pan, Daniel Dahlmeier. (2018). Memory Networks for Fine-grained Opinion Mining. Artificial Intelligence, 265, 1-17."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=P6WcnfkAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/1237845", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=22939024800"}, "google_scholar": "https://scholar.google.com/citations?user=P6WcnfkAAAAJ&hl=en&oi=ao", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=22939024800", "web_of_science": "https://www.webofscience.com/wos/author/record/1237845", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00122", "other_websites": ["https://personal.ntu.edu.sg/sinnopan/"]}