{"full_name": "Owen Noel Newton Fernando", "designation": "Senior Lecturer, School of Computer Science and Engineering", "name_card": "Dr Owen Noel Newton Fernando", "email": "ofernando@ntu.edu.sg", "image_path": "./profile_img/owen_noel_newton_fernando.jpg", "keywords": ["Computer Science and Engineering", "Interactive Digital Media", "Art, Design and Media", "Info-Communication Technology", "Graphics and Interactive Computing"], "biography": "Dr. Fernando is a Senior Lecturer at the School of Computer Engineering at the Nanyang Technological University, Singapore. His research interests involve Crowdsourcing & Social Computing, Mobile Augmented Reality, Multimodal interfaces & interactive systems, and Human-Computer Interaction. He has published his works in highly competitive Journals (MIT Press’ journal “Presence,” Oxford Press’ journal “Interacting with Computers,” and “IEEE Trans. Syst. Man and Cybern.”) and prestigious conferences (ACM DIS, ACM CSCW, IEEE ISMAR, and ACM SIGGRAPH). His research was received several international awards, including awards from Laval Virtual Revolution and Nokia UbiMedia MindTrek. Dr. Fernando has been the recipient of the Japanese Government (MEXT: Monbukagakusho) Scholarship. Currently he serves as Associate Editor for Entertainment Computing (Elsevier) and has previously served as guest editor of the AHCI journal and Associate Editor for ACM CiE: Computers in Entertainment.", "interests": "Crowdsourcing & Social ComputingMobile Augmented Reality Multimodal Interfaces and Interactive SystemsHuman-Computer Interaction", "grants": "The Hidden Shrines Of Singapore: Mapping And Narrating Multi-Religious Heritages", "articles": ["May O Lwin, Santosh Vijaykumar, Gentatsu Lim, Owen Noel Newton Fernando, Vajira Sampath Rathnayake, Schubert Foo. (2015). Baseline Evaluation of a Participatory Mobile Health Intervention for Dengue Prevention in Sri Lanka. Health Education & Behavior, 2015.", "Zhu, K., Nii, H., Fernando, O.N.N, Koh, J.T.K.V., Aue, K., Cheok, A.D. (2013). Designing Interactive Paper-Craft Systems with Selective Inductive Power Transmission. Interacting with Computers, 25 (2)(2), 143-153.", "Peiris, L.R., Koh, J.T.K.V, Tharakan, M.L., Fernando, O.N.N, Cheok, A.D. (2013). AmbiKraf Byobu: Merging Technology with Traditional Craft. Interacting with Computers, 25 (2)(2), 173-182.", "Cohen, M., Bolhassan, N.A., Fernando, O.N.N. (2007). A Multiuser Multiperspective Stereographic QTVR Browser Complemented by Java3D Visualizer and Emulator. Presence, 16 (4)(4), 414-438."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00400", "other_websites": ["https://personal.ntu.edu.sg/ofernando"]}