{"full_name": "Zhao Jun", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Zhao Jun", "email": "junzhao@ntu.edu.sg", "image_path": "./profile_img/zhao_jun.jpg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Mathematics", "Science, Technology and Society", "Energy", "Computer Networks and Communications"], "biography": "Jun Zhao is an Assistant Professor in the School of Computer Science and Engineering (SCSE) at Nanyang Technological University (NTU). He received a PhD degree in Electrical and Computer Engineering from Carnegie Mellon University (CMU), Pittsburgh, PA, USA in May 2015, and a bachelor's degree in Information Engineering from Shanghai Jiao Tong University, China in June 2010. Prospective PhD students, postdocs, and visiting students/researchers can email JunZhao@NTU.edu.sg, or add WhatsApp request at https://personal.ntu.edu.sg/junzhao/whatsapp.jpg or add Wechat request at https://personal.ntu.edu.sg/junzhao/wechat.jpg", "interests": "• AI and Data Science: federated learning, deep learning, adversarial machine learning, computer vision (CV), reinforcement learning, optimization, etc.• City Brain and Smart Nation: federated learning, Internet of Things IoT, cloud/edge/fog computing, 6G wireless communications.• Security and Privacy: federated learning, blockchains, adversarial machine learning, differential privacy.", "grants": "Blockchain Empowered Internet of Vehicles towards Intelligent TransportationBlockchain Theory and Practice: Security, Scalability and Novel ApplicationsCombinatorial Stochastic Analysis for the Connectivity of Random Graphs - Applications to Vehicular and Wireless NetworksDeep reinforcement learning based scheduling strategy for federated learning in sensor-cloud systemsDigital Trust Centre (a.k.a. The National Centre for Research in Digital Trust (NCDT))Intelligent Reflecting Surface Aided Wireless Networks with Mobile Edge ComputingStrategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)", "articles": ["Huimei Han, Jun Zhao, Dusit Niyato, Marco Di Renzo, Quoc-Viet Pham. (2019). Intelligent Reflecting Surface Aided Network: Power Control for Physical-Layer Broadcasting. arXiv, .", "Jun Zhao. (2019). Optimizations with Intelligent Reflecting Surfaces (IRSs) in 6G Wireless Networks: Power Control, Quality of Service, Max-Min Fair Beamforming for Unicast, Broadcast, and Multicast with Multi-antenna Mobile Users and Multiple IRSs. arXiv, .", "Jun ZHAO. (2019). tbd.", "Ning Wang, Xiaokui Xiao, Yin Yang, Jun Zhao, Siu Cheung Hui, Hyejin Shin, Junbum Shin, and Ge Yu. (2019). Collecting and analyzing multidimensional data with local differential privacy. IEEE 35th Annual International Conference on Data Engineering (ICDE)."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": "http://junzhaogroupntu.github.io", "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00501", "other_websites": []}