{"full_name": "Thambipillai Srikanthan", "designation": "Executive Director, Cyber Security Research Centre @ NTU", "name_card": "Prof Thambipillai Srikanthan", "email": "astsrikan@ntu.edu.sg", "image_path": "./profile_img/thambipillai_srikanthan.jpg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Cyber Security and Forensics", "Hardware and Embedded Systems", "Computing Hardware and Architecture"], "biography": "Dr Srikanthan joined Nanyang Technological University (NTU), Singapore in June 1991. At present, he holds a full professor and joint appointment as Director of a 100 strong Centre for High Performance Embedded Systems (CHiPES). He founded CHiPES in 1998 and elevated it to a university level research Centre in February 2000. He has also served as founding Director of the Intelligent Devices and Systems (IDeAS) cluster for 2 years (2005-2007). His other appointments include at the university level include Chair of the review committee for promotion and tenure (SRCPT) as from April 2007 and member of the Nanyang Business School (NBS) Dean Search Committee (Feb 2006 to Oct 2007). His research interests include design methodologies for complex embedded systems, architectural translations of compute intensive algorithms, computer arithmetic and high-speed techniques for image processing and dynamic routing. He has published more than 250 technical papers including 60 journals in IEEE Transactions, IEE Proceedings and other reputed international journals. His services as a key consultant to embedded systems industry, both locally and internationally are continually being sought for.He contributed to all aspects of the curriculum development and operation of the undergraduate and post graduate programs. In particular, he proposed and developed a Master of Science course in Embedded Systems Engineering, based on his expertise in this emerging field of Computer Engineering. He was nominated for the ‘Best Teacher’ award for six consecutive years and won this award in 2002. He was the finalist and Merit award winner at the National Business Plan Competition on Voice Authentication at the National Business Plan Competition in 2003. He was awarded the Public Administration Medal (Bronze) on 2006 National Day in recognition of his contributions to education in Singapore.", "interests": "His research interests include design methodologies for complex embedded systems, architectural translations of compute intensive algorithms, computer arithmetic and high-speed techniques for image processing and dynamic routing. He has published more than 250 technical papers including 60 journals in IEEE Transactions, IEE Proceedings and other reputed international journals. His services as a key consultant to embedded systems industry, both locally and internationally are continually being sought for.His specific research contributions have led to design and development of a number of innovative embedded solutions for consumer market. His pioneering efforts in low-cost roadway navigation and image processing solutions have led to commercially viable intellectual properties. He has pioneered the development of techniques based on artificial intelligence heuristics to accelerate embedded computations. His current projects involve the development of novel techniques for vision-enabled embedded systems as well as design methodologies to shorten the Time-To-Market (TTM) and to reduce Non-Recurring Engineering (NRE) costs.", "grants": "Cyber Physical Security for Law EnforcementCyber security capabilities for Autonomous Vehicles and Intelligent Transport Systems (ITS)Cyber-Secure Autonomous VehiclesDark-Net And Crypto-CurrenciesNTU - Cyber security capabilities for Autonomous Vehicles and Intelligent Transport Systems (ITS)", "articles": ["My Chuong Lieu, Siew Kei Lam, Thambipillai Srikanthan. (2007). Rapid Area-Time Estimation Technique for Porting C-Based Applications onto FPGA Platforms. Scalable Computing: Practice and Experience, 8(4), 359-371.", "Wu Jigang, T. Srikanthan, Xiaodong Wang. (2007). Integrated Row and Column Re-routing for Reconfiguration of VLSI Arrays with 4-port Switches. IEEE Transactions on Computers, 56(10), 1387-1400.", "S.K. Lam, T. Srikanthan, C.T. Clarke. (2006). Rapid Generation of Custom Instructions Using Predefined Dataflow Structures. Microprocessors & Microsystems, 30(6), 355-366."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00841", "other_websites": []}