{"full_name": "Zhang Hanwang", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Zhang Hanwang", "email": "hanwangzhang@ntu.edu.sg", "image_path": "./profile_img/zhang_hanwang.jpg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Interactive Digital Media", "Language & Communication", "Mathematics"], "biography": "Hanwang Zhang is an Assistant Professor at Nanyang Technological University, Singapore. He was a research scientist at the Department of Computer Science, Columbia University, USA and a senior research fellow at the School of Computing, National University of Singapore, Singapore. He has received the B.Eng (Hons.) degree in computer science from Zhejiang University, Hangzhou, China, in 2009, and the Ph.D. degree in computer science from the National University of Singapore in 2014. His research interest includes computer vision, multimedia, and social media. Dr. Zhang is the recipient of the Best Demo runner-up award in ACM MM 2012, the Best Student Paper award in ACM MM 2013, and the Best Paper Honorable Mention in ACM SIGIR 2016. He is also the winner of Best Ph.D. Thesis Award of School of Computing, National University of Singapore, 2014.", "interests": "1. Multimodal Graph Construction and Inference2. Learning Compositional Structures in Vision and Language.3. Multimodal Machine Reasoning", "grants": "Build-To-Order Neural Networks for Interactive Vision-Language SystemsGoogle PhD FellowshipInterplay between Machine Learning and Precision Optical MeasurementOn the Completeness of Self-Supervised Learning: Group Theory, Causality, and Their CombinationsResource Efficient AI: Zero-shot learning, few-show learning, meta structure learning, casual learningSingaKids Pic2Speak: Multilingual AI Tutor – Uplifting Singapore’s Bilingual EdgeTowards Building Unified Autonomous Vehicle Scene Representation for Physical AV Adversarial Attacks and Visual Robustness EnhancementXMAN: Explainable Multimodal Artificial Networks for Machine Reasoning", "articles": ["Gao, L., Guo, Z., Zhang, H., Xu, X., & Shen, H. T. (2017). Video captioning with attention-based LSTM and semantic consistency. IEEE Transactions on Multimedia, 19(9), 2045-2055.", "Liao, L., He, X., Zhang, H., & Chua, T. S. (2018). Attributed social network embedding. IEEE Transactions on Knowledge and Data Engineering, 30(12), 2257-2270.", "Song, J., Zhang, H., Li, X., Gao, L., Wang, M., & Hong, R. (2018). Self-supervised video hashing with hierarchical binary auto-encoder. IEEE Transactions on Image Processing, 27(7), 3210-3221.", "Zhang, H., Shang, X., Luan, H., Wang, M., & Chua, T. S. (2016). Learning from collective intelligence: Feature learning using social images and tags. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), 13(1), 1-23.", "Bian, J., Yang, Y., Zhang, H., & Chua, T. S. (2014). Multimedia summarization for social events in microblog stream. IEEE Transactions on Multimedia, 17(2), 216-228.", "Zhang, X., Zhang, H., Zhang, Y., Yang, Y., Wang, M., Luan, H., ... & Chua, T. S. (2015). Deep fusion of multiple semantic cues for complex event recognition. IEEE Transactions on Image Processing, 25(3), 1033-1046.", "Liu, L., Xiong, C., Zhang, H., Niu, Z., Wang, M., & Yan, S. (2015). Deep aging face verification with large gaps. IEEE Transactions on Multimedia, 18(1), 64-75.", "Zhang, H., Zha, Z. J., Yang, Y., Yan, S., & Chua, T. S. (2014). Robust (semi) nonnegative graph embedding. IEEE transactions on Image Processing, 23(7), 2996-3012.", "Zhang, M., Yang, Y., Zhang, H., Ji, Y., Shen, H. T., & Chua, T. S. (2018). More is better: Precise and detailed image captioning using online positive recall and missing concepts mining. IEEE Transactions on Image Processing, 28(1), 32-44.", "Zha, Z. J., Zhang, H., Wang, M., Luan, H., & Chua, T. S. (2012). Detecting group activities with multi-camera context. IEEE Transactions on Circuits and Systems for Video Technology, 23(5), 856-869.", "Click  here for more publications.", "Shi, Z., Chang, C., Chen, H., Du, X., & Zhang, H. (2022). PR‐NET: progressively‐refined neural network for image manipulation localization. International Journal of Intelligent Systems, 37(5), 3166-3188.", "Yang, X., Zhang, H., & Cai, J. (2022). Auto-encoding and distilling scene graphs for image captioning. IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(5), 2313–2327.", "Hong, R., Liu, D., Mo, X., He, X., & Zhang, H. (2022). Learning to compose and reason with language tree structures for visual grounding. IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(2), 684–696.", "Zha, Z. J., Liu, D., Zhang, H., Zhang, Y., & Wu, F. (2022). Context-aware visual policy network for fine-grained image captioning. IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(2), 710–722.", "Yuan, J., Zhu, S., Huang, S., Zhang, H., Xiao, Y., Li, Z., & Wang, M. (2022). Discriminative Style Learning for Cross-Domain Image Captioning. IEEE Transactions on Image Processing, 31, 1723-1736."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=YG0DFyYAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55366935100"}, "google_scholar": "https://scholar.google.com/citations?user=YG0DFyYAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0001-7374-8739", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55366935100", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01149", "other_websites": ["https://personal.ntu.edu.sg/hanwangzhang/"]}