{"2020": [{"title": "Federated learning in mobile edge networks: A comprehensive survey", "description": "In recent years, mobile devices are equipped with increasingly advanced sensing and computing capabilities. Coupled with advancements in Deep Learning (DL), this opens up countless possibilities for meaningful applications, e.g., for medical purposes and in vehicular networks. Traditional cloud-based Machine Learning (ML) approaches require the data to be centralized in a cloud server or data center. However, this results in critical issues related to unacceptable latency and communication inefficiency. To this end, Mobile Edge Computing (MEC) has been proposed to bring intelligence closer to the edge, where data is produced. However, conventional enabling technologies for ML at mobile edge networks still require personal data to be shared with external parties, e.g., edge servers. Recently, in light of increasingly stringent data privacy legislations and growing privacy concerns, the concept of Federated …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:roLk4NBRz8UC"}, {"title": "Hierarchical incentive mechanism design for federated machine learning in mobile networks", "description": "In recent years, the enhanced sensing and computation capabilities of Internet-of-Things (IoT) devices have opened the doors to several mobile crowdsensing applications. In mobile crowdsensing, a model owner announces a sensing task following which interested workers collect the required data. However, in some cases, a model owner may have insufficient data samples to build an effective machine learning model. To this end, we propose a federated learning (FL)-based privacy-preserving approach to facilitate collaborative machine learning among multiple model owners in mobile crowdsensing. Our system model allows collaborative machine learning without compromising data privacy given that only the model parameters instead of the raw data are exchanged within the federation. However, there are two main challenges of incentive mismatches between workers and model owners, as well as among …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:ufrVoPGSRksC"}, {"title": "Federated learning in the sky: Aerial-ground air quality sensing framework with UAV swarms", "description": "Due to air quality significantly affects human health, it is becoming increasingly important to accurately and timely predict the air quality index (AQI). To this end, this article proposes a new federated learning (FL)-based aerial-ground air quality sensing framework for fine-grained 3-D air quality monitoring and forecasting. Specifically, in the air, this framework leverages a lightweight Dense-MobileNet model to achieve energy-efficient end-to-end learning from haze features of haze images taken by unmanned aerial vehicles (UAVs) for predicting AQI scale distribution. Furthermore, the FL framework not only allows various organizations or institutions to collaboratively learn a well-trained global model to monitor AQI without compromising privacy but also expands the scope of UAV swarms monitoring. For ground sensing systems, we propose a graph convolutional neural network-based long short-term memory (GC …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:8k81kl-MbHgC"}, {"title": "Joint auction-coalition formation framework for communication-efficient federated learning in UAV-enabled internet of vehicles", "description": "Due to the advanced capabilities of the Internet of Vehicles (IoV) components such as vehicles, Roadside Units (RSUs) and smart devices as well as the increasing amount of data generated, Federated Learning (FL) becomes a promising tool given that it enables privacy-preserving machine learning that can be implemented in the IoV. However, the performance of the FL suffers from the failure of communication links and missing nodes, especially when continuous exchanges of model parameters are required. Therefore, we propose the use of Unmanned Aerial Vehicles (UAVs) as wireless relays to facilitate the communications between the IoV components and the FL server and thus improving the accuracy of the FL. However, a single UAV may not have sufficient resources to provide services for all iterations of the FL process. In this paper, we present a joint auction-coalition formation framework to solve the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:0EnyYjriUFMC"}, {"title": "UAV-assisted wireless energy and data transfer with deep reinforcement learning", "description": "As a typical scenario in future generation communication network applications, UAV-assisted communication can perform autonomous data delivery for massive machine type communication (mMTC), where the data generated from Internet of Things (IoT) devices can be carried and delivered to the corresponding locations with no direct communication channels to the IoT devices. Wireless energy transfer technique can recharge the UAV when the system is in operation, assisting the UAV to continuously collect and deliver data. In this work, we formulate a Markov decision process (MDP) model to describe the energy and data transfer optimization problem for the UAV. To maximize the long-term utility of the UAV, the MDP model is solved by value iteration algorithm to obtain the optimal strategies of the UAV to collect data, deliver data, and receive transferred energy to replenish on-device battery energy storage …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:Zph67rFs4hoC"}, {"title": "Dynamic contract design for federated learning in smart healthcare applications", "description": "Currently, the data collected by the Internet of Healthcare Things, i.e., healthcare oriented Internet of Things (IoT), still rely on cloud-based centralized data aggregation and processing. To reduce the need for transmission of data to the cloud, the edge computing architecture may be adopted to facilitate machine learning at the edge of the network through leveraging on the amassed computation resources of pervasive IoT devices. In this article, federated learning (FL) is proposed to enable privacy-preserving collaborative model training at the edge of the network across distributed IoT users. However, the users in the FL network may have different willingness to participate (WTP), a hidden information unknown to the model owner. Furthermore, the development of healthcare applications typically requires sustainable user participation, e.g., for the continuous collection of data during which a user’s WTP may change …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:_kc_bZDykSQC"}, {"title": "Communication-efficient federated learning for anomaly detection in industrial internet of things", "description": "With the rapid development of the Industrial Internet of Things (IIoT), various IoT devices and sensors generate massive industrial sensing data. Sensing big data can be analyzed for insights that lead to better decisions and strategic industrial production by using advanced machine learning technologies. However, vulnerable IoT devices are easy to be compromised thus causing IoT devices failures (i.e., anomalies). The anomalies seriously affect the production of industrial products, thereby, it is increasingly important to accurately and timely detect anomalies. To this end, we first introduce a Federated Learning (FL) framework to enable decentralized edge devices to collaboratively train a Deep Anomaly Detection (DAD) model, which can improve its generalization ability. Second, we propose a Convolutional Neural Network-Long Short Term Memory (CNN-LSTM) model to accurately detect anomalies. The CNN …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:3fE2CSJIrl8C"}, {"title": "When information freshness meets service latency in federated learning: A task-aware incentive scheme for smart industries", "description": "For several industrial applications, a sole data owner may lack sufficient training samples to train effective machine learning based models. As such, we propose a federated learning (FL) based approach to promote privacy-preserving collaborative machine learning for applications in smart industries. In our system model, a model owner initiates an FL task involving a group of workers, i.e., data owners, to perform model training on their locally stored data before transmitting the model updates for aggregation. There exists a tradeoff between service latency, i.e., the time taken for the training request to be completed, and age of information (AoI), i.e., the time elapsed between data aggregation from the deployed industrial Internet of Things devices to completion of the FL-based training. On one hand, if the data are collected only upon the model owner's request, the AoI is low. On the other hand, the service latency …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:aqlVkmm33-oC"}, {"title": "Incentive mechanism design for resource sharing in collaborative edge learning", "description": "In 5G and Beyond networks, Artificial Intelligence applications are expected to be increasingly ubiquitous. This necessitates a paradigm shift from the current cloud-centric model training approach to the Edge Computing based collaborative learning scheme known as edge learning, in which model training is executed at the edge of the network. In this article, we first introduce the principles and technologies of collaborative edge learning. Then, we establish that a successful, scalable implementation of edge learning requires the communication, caching, computation, and learning resources (3C-L) of end devices and edge servers to be leveraged jointly in an efficient manner. However, users may not consent to contribute their resources without receiving adequate compensation. In consideration of the heterogeneity of edge nodes, e.g., in terms of available computation resources, we discuss the challenges of incentive mechanism design to facilitate resource sharing for edge learning. Furthermore, we present a case study involving optimal auction design using Deep Learning to price fresh data contributed for edge learning. The performance evaluation shows the revenue maximizing properties of our proposed auction over the benchmark schemes.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:WF5omc3nYNoC"}, {"title": "Toward efficient data trading in AI enabled reconfigurable wireless sensor network using contract and game theories", "description": "Reconfigurable Wireless Sensor Network (RWSN) schedules a set of devices with reconfigurable wireless interface to accomplish different data collection plans in a cost-effective way. AI technologies are applied to optimize decision making for high-level network reconfiguration. Besides, AI based data mining tools are exploited by third parities to extract useful information underlying raw data. This leads to the emergence of AI enabled RWSN. We further study a data trading market to provide the data-centric environment for large-scale applications of AI enabled RWSN. A network operator employs the devices to gather environmental data, and sells the collected data to interested third parities as data consumers. After that, two-level optimizations are performed to ensure efficient data trading. In data collection, a contract based incentive mechanism is presented for the network operator to stimulate the devices and …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:MXK_kJrjxJIC"}, {"title": "Communication-efficient federated learning in UAV-enabled IOV: a joint auction-coalition approach", "description": "Due to the advanced capabilities of the Internet of Vehicles (IoV) components such as vehicles, Roadside Units (RSUs) and smart devices as well as the increasing amount of data generated, Federated Learning (FL) becomes a promising tool given that it enables privacy-preserving machine learning. However, the performance of the FL suffers from the failure of communication links and missing nodes. Therefore, we propose the use of Unmanned Aerial Vehicles (UAVs) as wireless relays to facilitate the communications between the IoV components and the FL server and thus improving the accuracy of the FL. However, a single UAV may not have sufficient resources for all iterations of the FL process. In this paper, we present a joint auction-coalition formation framework. The joint auctioncoalition formation algorithm is proposed to achieve a stable partition of UAV coalitions in which an auction scheme is applied …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:QIV2ME_5wuYC"}, {"title": "Privacy is not free: Energy-aware federated learning for mobile and edge intelligence", "description": "In mobile and edge intelligence systems, federated learning (FL) enables local data training and learning model sharing without obtaining actual data from mobile and edge users, which are data owners. Data training processes are performed at the user side with only trained gradients passed to an aggregator, i.e., learning server. The learning server continually trains and updates corresponding learning models by collecting gradients. The updated learning models are delivered back to the mobile and edge users for improved data training results. Despite the advantages of federated learning in preserving privacy, the local data training process will consume an adequate amount of energy from the perspective of mobile and edge users. In mobile and edge intelligence systems, mobile users may not always prefer to apply federated learning to reduce energy consumption. There is a trade-off between applying …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:qxL8FJ1GzNcC"}, {"title": "Incentive mechanism design for mobile data rewards using multi-dimensional contract", "description": "Mobile data rewards is now leading a new economic trend in wireless networks, where the operators stimulate mobile users to view ads with data rewards and ask for corresponding payments from advertisers. Yet, due to the uncertain nature of users’ preferences, it is always challenging for the advertiser to find the best choice of data rewards to attain an optimum balance between ad revenue and rewards spent. In this paper, we develop a general contract-theoretic framework to address the problem of data rewards design in a realistic asymmetric information scenario, where each user is associated with multidimensional private information. Specifically, we model the interplay between the advertiser and users by using a multidimensional contract design approach, and theoretically analyze optimal data rewarding schemes. To ensure global incentive compatibility, we convert the multi-dimensional contract problem …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:UebtZRa9Y70C"}, {"title": "Dynamic resource allocation for hierarchical federated learning", "description": "One of the enabling technologies of Edge Intelligence is the privacy preserving machine learning paradigm called Federated Learning (FL). However, communication inefficiency remains a key bottleneck in FL. To reduce node failures and device dropouts, the Hierarchical Federated Learning (HFL) framework has been proposed whereby cluster heads are designated to support the data owners through intermediate model aggregation. This decentralized learning approach reduces the reliance on a central controller, e.g., the model owner. However, the issues of resource allocation and incentive design are not well-studied in the HFL framework. In this paper, we consider a two-level resource allocation and incentive mechanism design problem. In the lower level, the cluster heads offer rewards in exchange of the data owners' participation, and the data owners are free to choose among any clusters to join …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:qUcmZB5y_30C"}, {"title": "An incentive scheme for federated learning in the sky", "description": "The enhanced capabilities of Unmanned Aerial Vehicles have promoted the rapid growth of the Drones-as-a-Service (DaaS) market. To enable privacy-preserving collaborative machine learning among independent DaaS providers, we propose a Federated Learning (FL) based approach. There exists a tradeoff between Service Latency (SL), i.e., the time taken for the training request to be completed, and Age of Information (AoI), i.e., the time elapsed between data aggregation to completion of the FL based training. Given that different training tasks may have varying AoI requirements, we propose a contract-theoretic task-aware incentive scheme that can be calibrated based on the weighted preferences of the model owner. Performance evaluation validates the incentive compatibility and flexibility of our contract design amid information asymmetry.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ULOm3_A8WrAC"}, {"title": "Collaborative Coded Computation Offloading: An All-pay Auction Approach", "description": "As the amount of data collected for crowdsensing applications increases rapidly due to improved sensing capabilities and the increasing number of Internet of Things (IoT) devices, the cloud server is no longer able to handle the large-scale datasets individually. Given the improved computational capabilities of the edge devices, coded distributed computing has become a promising approach given that it allows computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of devices are needed to reconstruct the final result. However, there is no incentive for the edge devices to complete the computation tasks. In this paper, we present an all-pay auction to incentivize the edge devices to participate in the coded computation tasks. In this auction, the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:mVmsd5A6BfQC"}, {"title": "A Survey of Coded Distributed Computing", "description": "Distributed computing has become a common approach for large-scale computation of tasks due to benefits such as high reliability, scalability, computation speed, and costeffectiveness. However, distributed computing faces critical issues related to communication load and straggler effects. In particular, computing nodes need to exchange intermediate results with each other in order to calculate the final result, and this significantly increases communication overheads. Furthermore, a distributed computing network may include straggling nodes that run intermittently slower. This results in a longer overall time needed to execute the computation tasks, thereby limiting the performance of distributed computing. To address these issues, coded distributed computing (CDC), ie, a combination of coding theoretic techniques and distributed computing, has been recently proposed as a promising solution. Coding theoretic …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:KlAtU1dfN6UC"}], "2022": [{"title": "A full dive into realizing the edge-enabled metaverse: Visions, enabling technologies, and challenges", "description": "Dubbed “the successor to the mobile Internet,” the concept of the Metaverse has grown in popularity. While there exist lite versions of the Metaverse today, they are still far from realizing the full vision of an immersive, embodied, and interoperable Metaverse. Without addressing the issues of implementation from the communication and networking, as well as computation perspectives, the Metaverse is difficult to succeed the Internet, especially in terms of its accessibility to billions of users today. In this survey, we focus on the edge-enabled Metaverse to realize its ultimate vision. We first provide readers with a succinct tutorial of the Metaverse, an introduction to the architecture, as well as current developments. To enable ubiquitous, seamless, and embodied access to the Metaverse, we discuss the communication and networking challenges and survey cutting-edge solutions and concepts that leverage next …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:J_g5lzvAfSwC", "topics": "Distributed Systems, Networking, Communication"}, {"title": "Realizing the metaverse with edge intelligence: A match made in heaven", "description": "Dubbed \"the successor to the mobile Internet\", the concept of the Metaverse has recently exploded in popularity. While there exists lite versions of the Metaverse today, we are still far from realizing the vision of a seamless, shardless, and interoperable Metaverse given the stringent sensing, communication, and computation requirements. Moreover, the birth of the Metaverse comes amid growing privacy concerns among users. In this article, we begin by providing a preliminary definition of the Metaverse. We discuss the architecture of the Metaverse and mainly focus on motivating the convergence of edge intelligence and the infrastructure layer of the Metaverse. We present major edge-based technological developments and their integration to support the Metaverse engine. Then, we present our research attempts through a case study of virtual city development in the Metaverse. Finally, we discuss the open …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:hMod-77fHWUC", "topics": "Edge Intelligence, Metaverse, Privacy Concerns"}, {"title": "Deep learning-powered vessel trajectory prediction for improving smart traffic services in maritime Internet of Things", "description": "The maritime Internet of Things (IoT) has recently emerged as a revolutionary communication paradigm where a large number of moving vessels are closely interconnected in intelligent maritime networks. However, the tremendous growth of vessel trajectories, collected from the combined satellite-terrestrial AIS (automatic identification system) base stations, could lead to unsatisfactory maritime safety and efficacy. To promote smart traffic services in maritime IoT, it is necessary to accurately and robustly predict the spatiotemporal vessel trajectories. It is beneficial for collision avoidance, maritime surveillance, and abnormal behavior detection, etc. Motivated by the strong learning capacity of deep neural networks, this work proposes an AIS data-driven trajectory prediction framework, whose main component is a long short term memory (LSTM) network. In particular, the vessel traffic conflict situation modeling …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:NMxIlDl6LWMC", "topics": "Deep Learning, Maritime Internet of Things, Trajectory Prediction"}, {"title": "Semantic communications for future internet: Fundamentals, applications, and challenges", "description": "With the increasing demand for intelligent services, the sixth-generation (6G) wireless networks will shift from a traditional architecture that focuses solely on a high transmission rate to a new architecture that is based on the intelligent connection of everything. Semantic communication (SemCom), a revolutionary architecture that integrates user as well as application requirements and the meaning of information into data processing and transmission, is predicted to become a new core paradigm in 6G. While SemCom is expected to progress beyond the classical Shannon paradigm, several obstacles need to be overcome on the way to a SemCom-enabled smart Internet. In this paper, we first highlight the motivations and compelling reasons for SemCom in 6G. Then, we provide an overview of SemCom-related theory development. After that, we introduce three types of SemCom, i.e., semantic-oriented …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:pqnbT2bcN3wC", "topics": "Semantic Communications, Future Internet, Intelligent Services"}, {"title": "Unified resource allocation framework for the edge intelligence-enabled metaverse", "description": "Dubbed as the next-generation Internet, the meta-verse is a virtual world that allows users to interact with each other or objects in real-time using their avatars. The metaverse is envisioned to support novel ecosystems of service provision in an immersive environment brought about by an intersection of the virtual and physical worlds. The native AI systems in metaverse will personalized user experience over time and shape the experience in a scalable, seamless, and synchronous way. However, the metaverse is characterized by diverse resource types amid a highly dynamic demand environment. In this paper, we propose the case study of virtual education in the metaverse and address the unified resource allocation problem amid stochastic user demand. We propose a stochastic optimal resource allocation scheme (SORAS) based on stochastic integer programming with the objective of minimizing the cost of the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:isC4tDSrTZIC", "topics": "Virtual Reality, Resource Allocation, Stochastic Optimization"}, {"title": "Semantic communication meets edge intelligence", "description": "The development of emerging applications, such as autonomous transportation systems, is expected to result in an explosive growth in mobile data traffic. As the available spectrum resource becomes more and more scarce, there is a growing need for a paradigm shift from Shannon's Classical Information Theory (CIT) to semantic communication (SemCom). Specifically, the former adopts a “transmit-before-understanding” approach while the latter leverages artificial intelligence (AI) techniques to “understand-before-transmit,” thereby alleviating bandwidth pressure by reducing the amount of data to be exchanged without negating the semantic effectiveness of the transmitted symbols. However, the semantic extraction (SE) procedure incurs costly computation and storage overheads. In this article, we introduce an edge-driven training, maintenance, and execution of SE. We further investigate how edge intelligence …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:GnPB-g6toBAC", "topics": "Artificial Intelligence, Edge Computing"}, {"title": "Aerial refueling: Scheduling wireless energy charging for UAV enabled data collection", "description": "The working scope and working time of small size unmanned aerial vehicles (UAVs) are limited because of the limited battery capacity. In this work, inspired by aerial refueling for aircrafts, we propose a wireless power transmission (WPT) scheme by categorizing the UAVs into charging UAV (CUAV) and mission UAV (MUAV) for charging UAVs without interrupting the mission. In the proposed aerial refueling scheme, mission UAVs (MUAV) can be recharged by charging UAVs on the fly and operate in a perpetual manner. The feasibility of aerially wireless charging for small UAVs is firstly discussed and evaluated. Then we consider a practical application scenario of multiple MUAVs for collecting data from several points of interest, where the MUAVs are recharged by CUAVs. Accordingly, the issue of scheduling the flying path and charging process of each CUAV to minimize the mission time arises. Deep …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:lSLTfruPkqcC", "topics": "Wireless Energy Charging, Unmanned Aerial Vehicles, Scheduling"}, {"title": "Economics of semantic communication system in wireless powered internet of things", "description": "The semantic communication system enables wireless devices to communicate effectively with the semantic meaning of the data. Wireless powered Internet of Things (IoT) that adopts the semantic communication system relies on harvested energy to transmit semantic information. However, the issue of energy constraint in the semantic communication system is not well studied. In this paper, we propose a semantic-based energy valuation and take an economic approach to solve the energy allocation problem as an incentive mechanism design. In our model, IoT devices (bidders) place their bids for the energy and power transmitter (auctioneer) decides the winner and payment by using deep learning based optimal auction. Results show that the revenue of wireless power transmitter is maximized while satisfying Individual Rationality (IR) and Incentive Compatibility (IC).", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:TFP_iSt0sucC", "topics": "Wireless Communication, Internet of Things, Energy Constraint"}, {"title": "Stochastic resource allocation for semantic communication-aided virtual transportation networks in the metaverse", "description": "The physical-virtual world synchronization to develop the Metaverse will require a massive transmission and exchange of data. In this paper, we introduce semantic communication for the development of virtual transportation networks in the Metaverse. Leveraging the perception capabilities of edge devices, virtual service providers (VSPs) can subscribe to their preferred edge devices to receive the semantic data of interest. However, the demands of the VSPs are highly dependent on the users that they are serving. To address the resource allocation problem amid stochastic user demand, we propose a stochastic semantic transmission scheme (SSTS) based on two-stage stochastic integer programming. Using real data captured by edge devices we deploy in Singapore, the simulation results show that SSTS can minimize the transmission cost of the VSPs while accounting for the users' demand uncertainties.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:zA6iFVUQeVQC", "topics": "Semantic Communication, Virtual Transportation Networks, Stochastic Resource Allocation"}, {"title": "Reputation-Aware Federated Learning Client Selection based on Stochastic Integer Programming", "description": "Federated Learning(FL) has attracted wide research interest due to its potential in building machine learning models while preserving users' data privacy. However, due to the distributive nature of FL, it is vulnerable to misbehavior from participating worker nodes. Thus, it is important to select clients to participate in FL. Recent studies on FL client selection focus on the perspective of improving model training efficiency and performance, without holistically considering potential misbehavior and the cost of hiring. To bridge this gap, we propose a first-of-its-kind reputation-aware Stochastic integer programming-based FL Client Selection method (SCS). It can optimally select and compensate clients with different reputation profiles. Extensive experiments show that SCS achieves the most advantageous performance-cost trade-off compared to other existing state-of-the-art approaches.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:HoB7MX3m0LUC", "topics": "Federated Learning, Stochastic Integer Programming, Reputation-Aware Client Selection"}, {"title": "Stochastic Coded Offloading Scheme for Unmanned-Aerial-Vehicle-Assisted Edge Computing", "description": "Unmanned aerial vehicles (UAVs) have gained wide research interests due to their technological advancement and high mobility. The UAVs are equipped with increasingly advanced capabilities to run computationally intensive applications enabled by machine learning techniques. However, because of both energy and computation constraints, the UAVs face issues hovering in the sky while performing computation due to weather uncertainty. To overcome the computation constraints, the UAVs can partially or fully offload their computation tasks to the edge servers. In ordinary computation offloading operations, the UAVs can retrieve the result from the returned output. Nevertheless, if the UAVs are unable to retrieve the entire result from the edge servers, i.e., straggling edge servers, this operation will fail. In this article, we propose a coded distributed computing (CDC) approach for computation offloading to mitigate …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:YFjsv_pBGBYC", "topics": "Edge Computing, Distributed Computing, Computation Offloading"}, {"title": "Federated Learning Over Wireless Edge Networks", "description": "This book first presents a tutorial on Federated Learning (FL) and its role in enabling Edge Intelligence over wireless edge networks. This provides readers with a concise introduction to the challenges and state-of-the-art approaches towards implementing FL over the wireless edge network. Then, in consideration of resource heterogeneity at the network edge, the authors provide multifaceted solutions at the intersection of network economics, game theory, and machine learning towards improving the efficiency of resource allocation for FL over the wireless edge networks. A clear understanding of such issues and the presented theoretical studies will serve to guide practitioners and researchers in implementing resource-efficient FL systems and solving the open issues in FL respectively.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:fPk4N6BV_jEC", "topics": "Wireless Networks, Edge Computing, Federated Learning"}, {"title": "UAV-assisted Wireless Power Charging for Efficient Hybrid Coded Edge Computing Network", "description": "With the ubiquitous sensing enabled by the Internet-of-Things (IoT), massive amount of data is generated every second, transforming the way we interact with the world. To manage big data and enable analytics at the edge of the network, large amount of computation power is required to perform the computation intensive tasks. However, the energy-constrained IoT devices are not able to perform the computation tasks without compromising the quality-of-service of the applications. In this paper, we propose a hybrid network in which users can offload their computation tasks to edge servers through coded edge offloading or perform local computation with the wireless power transfer derived from coalitions of unmanned aerial vehicles (UAVs) serving as mobile charging stations. We consider a two-level optimization approach where an optimal UAV coalitional structure that minimizes the network cost is formed. In the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:3s1wT3WcHBgC", "topics": "Edge Computing, Wireless Power Charging, UAV-assisted Computing"}, {"title": "Intelligent Edge-Aided Network Slicing for 5G and Beyond Networks", "description": "Network slicing at the edge is becoming a new enabler for 5G and beyond networks to support diverse and differential services, with efficient employment of virtualized resources provided by edge and cloud layers. However, as the arrival patterns of user requests are complicated and unpredictable in practical network scenarios, conventional system architectures and scheduling algorithms for core network slicing cannot handle the uncertain edge user task arrivals properly. Meanwhile, dynamic and intelligent allocation of multi-dimensional resources for edge-aided network slices is also a crucial issue. In this work, we develop a novel intelligent edge-aided network slicing scheme to reduce the system response time. Firstly, a deep belief network (DBN)-based task classification scheme is proposed. Due to the multi-layer structure of DBNs, the nonlinear features of user requests can be extracted efficiently with …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:D03iK_w7-QYC", "topics": "Network Slicing, Edge Computing, Resource Allocation"}, {"title": "Evolutionary Model Owner Selection for Federated Learning with Heterogeneous Privacy Budgets", "description": "Leveraging on the wealth of data and advancements in Artificial Intelligence, smart cities have demonstrated their great potential in providing solutions to challenges that the urban population faces today. However, as the urban population becomes more privacy sensitive and with the introduction of stringent privacy regulations, the differential-private FL (DPFL) is a promising technology that can enable privacy-preserving collaborative model training. In this paper, we consider an FL network of model owners and data owners with heterogeneous privacy budgets and preferences respectively. In exchange for their participation in the training, the model owner offers a reward pool that is shared among the data owners that take part in the FL training. In turn, the FL worker with heterogeneous privacy preferences may select the model owner to contribute its parameters to. To model the dynamic and strategic behaviour of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ZHo1McVdvXMC", "topics": "Federated Learning, Differential Privacy, Privacy-Preserving Collaborative Model Training"}, {"title": "Dynamic Incentive Mechanism Design for COVID-19 Social Distancing", "description": "As countries enter the endemic phase of COVID-19, people's risk of exposure to the virus is greater than ever. There is a need to make more informed decisions in our daily lives on avoiding crowded places. Crowd monitoring systems typically require costly infrastructure. We propose a crowd-sourced crowd monitoring platform which leverages user inputs to generate crowd counts and forecast location crowdedness. A key challenge for crowd-sourcing is a lack of incentive for users to contribute. We propose a Reinforcement Learning based dynamic incentive mechanism to optimally allocate rewards to encourage user participation.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:f2IySw72cVMC", "topics": "Reinforcement Learning, Incentive Mechanism Design, Crowd-sourcing"}, {"title": "CrowdFL: A Marketplace for Crowdsourced Federated Learning", "description": "Amid data privacy concerns, Federated Learning (FL) has emerged as a promising machine learning paradigm that enables privacy-preserving collaborative model training. However, there exists a need for a platform that matches data owners (supply) with model requesters (demand). In this paper, we present CrowdFL, a platform to facilitate the crowdsourcing of FL model training. It coordinates client selection, model training, and reputation management, which are essential steps for the FL crowdsourcing operations. By implementing model training on actual mobile devices, we demonstrate that the platform improves model performance and training efficiency. To the best of our knowledge, it is the first platform to support crowdsourcing-based FL on edge devices.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:pyW8ca7W8N0C", "topics": "Federated Learning, Crowdsourcing, Privacy-Preserving Collaborative Model Training"}, {"title": "Classification and recovery of data from flash memory", "description": "Classification and recovery of data are critical components of digital forensics. Numerous forensic activities need the decoding of memory dumps, the interpretation of residual data, and the recovery of data from crashed hard drives. Typically, a forensic analyst is tasked with determining the underlying file types when supplied with only file fragments and no access to the file system. The motivation is to apply various methods of feature extraction from file fragments in conjunction with machine learning and artificial intelligence for the task of file format categorization. This project will evaluate, test, and compare the accuracy and performance of the Fragments-Expert software in file fragment classification.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:rO6llkc54NcC", "topics": "Information Retrieval, Machine Learning, Artificial Intelligence"}], "2021": [{"title": "Towards federated learning in uav-enabled internet of vehicles: A multi-dimensional contract-matching approach", "description": "Coupled with the rise of Deep Learning, the wealth of data and enhanced computation capabilities of Internet of Vehicles (IoV) components enable effective Artificial Intelligence (AI) based models to be built. Beyond ground data sources, Unmanned Aerial Vehicles (UAVs) based service providers for data collection and AI model training, i.e., Drones-as-a-Service (DaaS), is becoming increasingly popular in recent years. However, the stringent regulations governing data privacy potentially impedes data sharing across independently owned UAVs. To this end, we propose the adoption of a Federated Learning (FL) based approach to enable privacy-preserving collaborative Machine Learning across a federation of independent DaaS providers for the development of IoV applications, e.g., for traffic prediction and car park occupancy management. Given the information asymmetry and incentive mismatches between …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:_FxGoFyzp5QC"}, {"title": "Decentralized edge intelligence: A dynamic resource allocation framework for hierarchical federated learning", "description": "To enable the large scale and efficient deployment of Artificial Intelligence (AI), the confluence of AI and Edge Computing has given rise to Edge Intelligence, which leverages on the computation and communication capabilities of end devices and edge servers to process data closer to where it is produced. One of the enabling technologies of Edge Intelligence is the privacy preserving machine learning paradigm known as Federated Learning (FL), which enables data owners to conduct model training without having to transmit their raw data to third-party servers. However, the FL network is envisioned to involve thousands of heterogeneous distributed devices. As a result, communication inefficiency remains a key bottleneck. To reduce node failures and device dropouts, the Hierarchical Federated Learning (HFL) framework has been proposed whereby cluster heads are designated to support the data owners …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:e5wmG9Sq2KIC"}, {"title": "Dynamic edge association and resource allocation in self-organizing hierarchical federated learning networks", "description": "Federated Learning (FL) is a promising privacy-preserving distributed machine learning paradigm. However, communication inefficiency remains the key bottleneck that impedes its large-scale implementation. Recently, hierarchical FL (HFL) has been proposed in which data owners, i.e., workers, can first transmit their updated model parameters to edge servers for intermediate aggregation. This reduces the instances of global communication and straggling workers. To enable efficient HFL, it is important to address the issues of edge association and resource allocation in the context of non-cooperative players, i.e., workers, edge servers, and model owner. However, the existing studies merely focus on static approaches and do not consider the dynamic interactions and bounded rationalities of the players. In this paper, we propose a hierarchical game framework to study the dynamics of edge association and …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:bEWYMUwI8FkC"}, {"title": "A comprehensive survey on coded distributed computing: Fundamentals, challenges, and networking applications", "description": "Distributed computing has become a common approach for large-scale computation tasks due to benefits such as high reliability, scalability, computation speed, and cost-effectiveness. However, distributed computing faces critical issues related to communication load and straggler effects. In particular, computing nodes need to exchange intermediate results with each other in order to calculate the final result, and this significantly increases communication overheads. Furthermore, a distributed computing network may include straggling nodes that run intermittently slower. This results in a longer overall time needed to execute the computation tasks, thereby limiting the performance of distributed computing. To address these issues, coded distributed computing (CDC), i.e., a combination of coding theoretic techniques and distributed computing, has been recently proposed as a promising solution. Coding theoretic …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:R3hNpaxXUhUC"}, {"title": "UAV-assisted communication efficient federated learning in the era of the artificial intelligence of things", "description": "Artificial Intelligence (AI) based models are increasingly deployed in the Internet of Things (IoT), paving the evolution of the IoT into the AI of things (AIoT). Currently, the predominant approach for AI model training is cloud-centric and involves the sharing of data with external parties. To preserve privacy while enabling collaborative model training across distributed IoT devices, the machine learning paradigm called Federated Learning (FL) has been proposed. The future FL network is envisioned to involve up to millions of distributed IoT devices involved in collaborative learning. However, communication failures and dropouts by nodes can lead to inefficient FL. Inspired by the UAV-assisted communications in 5G heterogeneous networks (HetNet), we propose the UAV-assisted FL in this article. The FL model owner may employ UAVs to provide the intermediate model aggregation in the sky and mobile relay of the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:r0BpntZqJG4C"}, {"title": "A hierarchical incentive design toward motivating participation in coded federated learning", "description": "Federated Learning (FL) is a privacy-preserving collaborative learning approach that trains artificial intelligence (AI) models without revealing local datasets of the FL workers. While FL ensures the privacy of the FL workers, its performance is limited by several bottlenecks, which become significant given the increasing amounts of data generated and the size of the FL network. One of the main challenges is the straggler effects where the significant computation delays are caused by the slow FL workers. As such, Coded Federated Learning (CFL), which leverages coding techniques to introduce redundant computations to the FL server, has been proposed to reduce the computation latency. In CFL, the FL server helps to compute a subset of the partial gradients based on the composite parity data and aggregates the computed partial gradients with those received from the FL workers. In order to implement the coding …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:M3NEmzRMIkIC"}, {"title": "A double auction mechanism for resource allocation in coded vehicular edge computing", "description": "The development of smart vehicles and rich cloud services have led to the emergence of vehicular edge computing. To perform the distributed computation tasks efficiently, Coded Distributed Computing (CDC) was proposed to reduce communication costs and mitigate the straggler effects through the use of coding techniques. In this paper, we propose a double auction mechanism to allocate the resources of the edge servers to the vehicles in order to complete the CDC tasks. Specifically, the vehicles use the PolyDot codes to manage the tradeoff between communication costs and recovery threshold. Given the requirements of various vehicles, the double auction mechanism matches the edge servers with the required resources to the vehicles. Besides, the double auction mechanism also determines the prices that the vehicles need to pay for the resources of the edge servers. The analyses show that the double …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:O3NaXMp0MMsC"}, {"title": "Reputation-aware hedonic coalition formation for efficient serverless hierarchical federated learning", "description": "Amid growing concerns on data privacy, Federated Learning (FL) has emerged as a promising privacy preserving distributed machine learning paradigm. Given that the FL network is expected to be implemented at scale, several studies have proposed system architectures towards improving the network scalability and efficiency. Specifically, the Hierarchical FL (HFL) network utilizes cluster heads, e.g., base stations, for the intermediate aggregation and relay of model parameters. Serverless FL is also proposed recently, in which the data owners, i.e., workers, exchange the local model parameters among a neighborhood of workers. This decentralized approach reduces the risk of a single point of failure but inevitably incurs significant communication overheads. To achieve the best of both worlds, we propose the Serverless Hierarchical Federated Learning (SHFL) framework in this article. The SHFL framework …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:blknAaTinKkC"}, {"title": "Communication-efficient and Scalable Decentralized Federated Edge Learning", "description": "Federated Edge Learning (FEL) is a distributed Machine Learning (ML) framework for collaborative training on edge devices. FEL improves data privacy over traditional centralized ML model training by keeping data on the devices and only sending local model updates to a central coordinator for aggregation. However, challenges still remain in existing FEL architectures where there is high communication overhead between edge devices and the coordinator. In this paper, we present a working prototype of blockchain-empowered and communication-efficient FEL framework, which enhances the security and scalability towards largescale implementation of FEL.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:4JMBOYKVnBMC"}, {"title": "A game-theoretic approach towards collaborative coded computation offloading", "description": "Coded distributed computing (CDC) has emerged as a promising approach because it enables computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of edge servers can be used to reconstruct the final result. However, incentive issues have not been studied systematically for the edge servers to complete the CDC tasks. In this paper, we propose a tractable two-level game-theoretic approach to incentivize the edge servers to complete the CDC tasks. Specifically, in the lower level, a hedonic coalition formation game is formulated where the edge servers share their resources within their coalitions. By forming coalitions, the edge servers have more Central Processing Unit (CPU) power to complete the computation tasks. In the upper level, given the CPU power of the coalitions of edge servers, an all-pay auction is designed to incentivize the edge servers to participate in the CDC tasks. In the all-pay auction, the bids of the edge servers are represented by the allocation of their CPU power to the CDC tasks. The all-pay auction is designed to maximize the utility of the cloud server by determining the allocation of rewards to the winners. Simulation results show that the edge servers are incentivized to allocate more CPU power when multiple rewards are offered, i.e., there are multiple winners, instead of rewarding only the edge server with the largest CPU power allocation. Besides, the utility of the cloud server is maximized when it offers multiple homogeneous rewards, instead of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:L8Ckcad2t8MC"}, {"title": "Towards parkinson’s disease prognosis using self-supervised learning and anomaly detection", "description": "Parkinson’s disease (PD) is a chronic disease with a high risk of incidence after the age of 60 and is a problem for many countries facing an aging population. Current works have mainly focused on supervised learning using data collected from various sensors to differentiate between PD and healthy subjects. However, such supervised methods are not ideal for prognosis where there are no labels (i.e., we do not know in advance which subjects will develop PD in the future). We propose to tackle the problem as a semi-supervised anomaly detection task, where we model the physiological patterns of healthy subjects instead. A self-supervised learning technique first learns a good representation of the sensor signals. The representations are then adapted to capture inter-class patterns for anomaly detection. Evaluation on a large-scale PD dataset shows that our approach can learn discriminative features.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:hC7cP41nSMkC"}, {"title": "Optimal stochastic coded computation offloading in unmanned aerial vehicles network", "description": "Today, modern unmanned aerial vehicles (UAVs) are equipped with increasingly advanced capabilities that can run applications enabled by machine learning techniques, which require computationally intensive operations such as matrix multiplications. Due to computation constraints, the UAVscan offload their computation tasks to edge servers. To mitigate stragglers, coded distributed computing (CDC) based offloading can be adopted. In this paper, we propose an Optimal Task Allocation Scheme (OTAS) based on Stochastic Integer Programming with the objective to minimize energy consumption during computation offloading. The simulation results show that amid uncertainty of task completion, the energy consumption in the UAV network is minimized.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:k_IJM867U9cC"}, {"title": "Collaborative Coded Computation Offloading: An All-pay Auction Approach", "description": "As the amount of data collected for crowdsensing applications increases rapidly due to improved sensing capabilities and the increasing number of Internet of Things (IoT) devices, the cloud server is no longer able to handle the large-scale datasets individually. Given the improved computational capabilities of the edge devices, coded distributed computing has become a promising approach given that it allows computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of devices are needed to reconstruct the final result. However, there is no incentive for the edge devices to complete the computation tasks. In this paper, we present an all-pay auction to incentivize the edge devices to participate in the coded computation tasks. In this auction, the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:4TOpqqG69KYC"}, {"title": "Deep-learning based auction resource allocation in coded computation offloading for Internet-of-Things", "description": "Edge computing has been a promising approach that allows resource-constrained Internet-of-Things (IoT) devices to offload their computation-intensive tasks to the edge of the networks. Instead of offloading the entire computation task to a single edge device, the IoT devices can leverage on the resources of multiple edge devices. In order to improve the performance of the distributed computation tasks, coded distributed computing is proposed to mitigate the straggler effects. However, the edge devices may not have sufficient bandwidth to transmit the computed results to the IoT devices reliably. Hence, we present a deep-learning based auction for the edge devices to buy and utilize bandwidth from the service providers. In particular, the edge devices compete for the bandwidth of the service providers and the service providers allocate bandwidth to the edge devices that value it most while maximizing their …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:RHpTSmoSYBkC"}, {"title": "AI-Empowered decision support for COVID-19 social distancing", "description": "The COVID-19 pandemic is one of the most severe challenges the world faces today. In order to contain the transmission of COVID-19, people around the world have been advised to practise social distancing. However, maintaining social distance is a challenging problem, as we often do not know beforehand how crowded the places we intend to visit are. In this paper, we demonstrate crowded. sg, an AI-empowered platform that leverages on Unmanned Aerial Vehicles (UAVs), crowdsourced images, and computer vision techniques to provide social distancing decision support.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:dhFuZR0502QC"}, {"title": "Predictive Analytics for COVID-19 Social Distancing", "description": "The COVID-19 pandemic has disrupted the lives of millions across the globe. In Singapore, promoting safe distancing by managing crowds in public areas have been the cornerstone of containing the community spread of the virus. One of the most important solutions to maintain social distancing is to monitor the crowdedness of indoor and outdoor points of interest. Using Nanyang Technological University (NTU) as a testbed, we develop and deploy a platform that provides live and predicted crowd counts for key locations on campus to help users plan their trips in an informed manner, so as to mitigate the risk of community transmission.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:j3f4tGmQtD8C"}, {"title": "A Hierarchical Incentive Mechanism for Coded Federated Learning", "description": "Federated Learning (FL) is a privacy-preserving collaborative learning approach that trains artificial intelligence (AI) models without revealing local datasets of the FL workers. One of the main challenges is the straggler effects where the significant computation delays are caused by the slow FL workers. As such, Coded Federated Learning (CFL), which leverages coding techniques to introduce redundant computations to the FL server, has been proposed to reduce the computation latency. In order to implement the coding schemes over the FL network, incentive mechanisms are important to allocate the resources of the FL workers and data owners efficiently in order to complete the CFL training tasks. In this paper, we consider a two-level incentive mechanism design problem. In the lower level, the data owners are allowed to support the FL training tasks of the FL workers by contributing their data. To model the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ldfaerwXgEUC"}, {"title": "Dynamic Edge Association in Hierarchical Federated Learning Networks", "description": "Federated Learning (FL) is a promising privacy-preserving distributed machine learning paradigm. However, communication inefficiency remains the key bottleneck that impedes its large-scale implementation. Recently, hierarchical FL (HFL) has been proposed in which data owners, i.e., workers, can first transmit their updated model parameters to edge servers for intermediate aggregation. This reduces the instances of global communication and straggling workers. To enable efficient HFL, it is important to address the issues of edge association in the context of non-cooperative players, i.e., workers, edge servers, and model owner. However, the existing studies merely focus on static approaches and do not consider the dynamic interactions and bounded rationalities of the players. In this paper, we propose the edge association strategies of the workers to be modelled using an evolutionary game. Then, we provide …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:RYcK_YlVTxYC"}, {"title": "An Incentive Mechanism for Resource Allocation in Coded Distributed Computing", "description": "Coded distributed computing (CDC) has emerged as a promising approach because it enables computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. However, incentive issues have not been studied systematically for the edge servers to complete the CDC tasks. In this paper, we propose a tractable two-level game-theoretic approach to incentivize the edge servers to complete the CDC tasks. Specifically, in the lower level, a hedonic coalition formation game is formulated where the edge servers share their resources within their coalitions. In the upper level, given the CPU power of the coalitions of edge servers, an all-pay auction is designed to incentivize the edge servers to participate in the CDC tasks. Simulation results show that the edge servers are incentivized to allocate more CPU power when multiple rewards …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:RGFaLdJalmkC"}, {"title": "A Game-theoretic Approach Towards Collaborative Coded Computation Offloading", "description": "Coded distributed computing (CDC) has emerged as a promising approach because it enables computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of edge servers can be used to reconstruct the final result. However, incentive issues have not been studied systematically for the edge servers to complete the CDC tasks. In this paper, we propose a tractable two-level game-theoretic approach to incentivize the edge servers to complete the CDC tasks. Specifically, in the lower level, a hedonic coalition formation game is formulated where the edge servers share their resources within their coalitions. By forming coalitions, the edge servers have more Central Processing Unit (CPU) power to complete the computation tasks. In the upper level, given …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ZeXyd9-uunAC"}, {"title": "A Double Auction Mechanism for Coded Distributed Computing in Smart Vehicles.", "description": "The development of smart vehicles and rich cloud services have led to the emergence of vehicular edge computing. To perform the distributed computation tasks efficiently, Coded Distributed Computing (CDC) was proposed to reduce communication costs and mitigate the straggler effects through the use of coding techniques. In this paper, we propose a double auction mechanism to allocate the resources of the edge servers to the vehicles in order to complete the CDC tasks. Specifically, the vehicles use the PolyDot codes to manage the tradeoff between communication costs and recovery threshold. Given the requirements of various vehicles, the double auction mechanism matches the edge servers with the required resources to the vehicles. Besides, the double auction mechanism also determines the prices that the vehicles need to pay for the resources of the edge servers. The double auction mechanism satisfies the properties of individual rationality, incentive compatibility and budget-balance.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:iH-uZ7U-co4C"}], "2023": [{"title": "Towards green metaverse networking: Technologies, advancements and future directions", "description": "As the Metaverse is iteratively being defined, its potential to unleash the next wave of digital disruption and create real-life value becomes increasingly clear. With distinctive features of immersive experience, simultaneous interactivity, and user agency, the Metaverse has the capability to transform all walks of life. However, the enabling technologies of the Metaverse, i.e., digital twin, artificial intelligence, blockchain, and extended reality, are known to be energy-hungry, therefore raising concerns about the sustainability of its large-scale deployment and development. This article proposes Green Metaverse Networking for the first time to optimize energy efficiencies of all network components for Metaverse sustainable development. We first analyze energy consumption, efficiency, and sustainability of energy-intensive technologies in the Metaverse. Next, focusing on computation and networking, we present major …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:bFI3QPDXJZMC"}, {"title": "Economics of Semantic Communication System: An Auction Approach", "description": "Semantic communication technologies enable wireless edge devices to communicate effectively by transmitting semantic meanings of data. Edge components, such as vehicles in next-generation intelligent transport systems, use well-trained semantic models to encode and decode semantic information extracted from raw and sensor data. However, the limitation in computing resources makes it difficult to support the training process of accurate semantic models on edge devices. As such, edge devices can buy the pretrained semantic models from semantic model providers, which is called “semantic model trading”. Upon collecting semantic information with the semantic models, the edge devices can then sell the extracted semantic information, e.g., information about urban road conditions or traffic signs, to the interested buyers for profit, which is called “semantic information trading”. To facilitate both types of the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:SeFeTyx0c_EC"}, {"title": "Cooperative resource management in quantum key distribution (QKD) networks for semantic communication", "description": "The increasing focus on privacy and security in 6G networks, which are intelligence-native, necessitates the use of quantum key distribution-secured semantic information communication (QKD-SIC) to protect confidential data. In QKD-SIC systems, edge devices connected via quantum channels can efficiently encrypt semantic information from the semantic source, and securely transmit the encrypted semantic information to the semantic destination. In this paper, we consider an efficient resource (i.e., QKD and KM wavelengths) sharing problem to support QKD-SIC systems under the uncertainty of semantic information generated by edge devices. In such a system, QKD service providers offer QKD services with different subscription options to the edge devices. The QKD services are envisioned to follow cloud computing that has the subscription in the reservation and on-demand options, i.e., for long and short …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:u_35RYKgDlwC"}, {"title": "Economics of Semantic Communication in Metaverse: An Auction Approach", "description": "Metaverse provides embodied artificial-reality experience to the users in the virtual spaces. Many innovative and creative services such as virtual conference and tourism have been realized in the digital twins maintained by the virtual service providers (VSP) in Metaverse. Digital twins are digital copies of the physical world constructed virtually by the VSPs using real-world data. For a realistic experience, VSPs need to collect data that is up-to-date and relevant to their services. In this paper, we propose an incentive design framework to support the data trading between VSPs and edge devices. In the auction model, we model the valuation of data by considering data relatedness and data freshness. In our model, the semantic communication model is used to filter the relevant data, and the age of information (AoI) metric is used to assess the data freshness. Results show that by considering the data freshness, our …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:xtRiw3GOFMkC"}, {"title": "Reputation-Aware Opportunistic Budget Optimization for Auction-based Federation Learning", "description": "As an emerging privacy-preserving collaborative machine learning paradigm, the success of federated learning (FL) relies heavily on effectively motivating data owners (a.k.a. FL clients) to contribute high-quality local data and computational resources towards FL model training. Rewarding clients with incentives has been identified as a useful approach towards this goal. It is often implemented in conjunction with auction-based federated learning (AFL). Nevertheless, this approach introduces new challenges for FL servers (a.k.a. federations) as they must work within a limited budget and make trade-off decisions between hiring FL clients, saving costs and achieving target model performance. The dynamic nature of AFL further complicates this problem as federations need to consider potential competition from other federations. To address this challenge, we propose the Reputation-aware Opportunistic Budget …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:1sJd4Hv_s6UC"}, {"title": "Mechanism Design for Semantic Communication in UAV-Assisted Metaverse: A Combinatorial Auction Approach", "description": "Metaverse enables users to experience a virtual space that resembles the real world. In the Metaverse, virtual service providers (VSPs) maintain digital twins (DTs) of real-world entities to offer innovative services such as virtual conferences and tourism. However, to provide a realistic experience, VSPs need to collect up-to-date and relevant data, which is latency-sensitive and resource-intensive, from edge devices such as unmanned aerial vehicles (UAVs). To address this challenge, we propose a semantic communication framework that leverages extraction and trading of scene graphs to reduce communication costs and motivate data transfer for Metaverse services. In the framework, we propose a semantic communication system where data for building DTs is encoded as semantic information, such as scene graphs. VSPs can use these graphs to build or update their DTs. To facilitate data trading between VSPs …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:P5F9QuxV20EC"}, {"title": "Blockchain for Decentralized Know Your Customer (KYC) and Customer Due Diligence (CDD) Pipelines in the Metaverse", "description": "Transactions conducted in the Metaverse must be validated in an interoperable and decentralized manner in order to prevent money laundering risks. Some processes to ensure that transactions are legal include the Know Your Customer (KYC) and Customer Due Diligence (CDD) processes. However, there are many problems that currently exist with traditionalKYC and CDD pipelines that include lengthy and repetitive processes, as well as the bundling problem that compromises the privacy of customers’ information. As more transactions happen in the Metaverse domain, these problems can be exacerbated. In this paper, we present a system using permissioned blockchain technology, which makes use of public and private smart contracts to efficiently validate the legitimacy of transactions executed in the Metaverse.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:KxtntwgDAa4C"}, {"title": "Edge-enabled Consumer Digital Twins in Industrial Metaverse", "description": "Industrial Metaverse has recently attracted considerable attention from both academia and industry due to its real-world mirroring, decentralization, and interoperability for enabling next-generation Internet services such as virtual consumer banking and retail. Consumer digital twins, i.e., the digital replica of a consumer, can be important in the industrial Metaverse, since multiple sales strategies, consumer engagement interventions, and advertising campaigns can be tested on consumer DT before an actual intervention, significantly increasing business efficiency and profits. A consumer DT may involve multi-dimensional dynamic real-time data (e.g., location and behavioral data) which requires assistance via the IoT devices (such as wearables and mobile phones). However, some information regarding consumers is confidential and private. In this paper, we propose a edge-based privacy-preserving training …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:nb7KW1ujOQ8C"}, {"title": "Sustainable AIGC Workload Scheduling of Geo-Distributed Data Centers: A Multi-Agent Reinforcement Learning Approach", "description": "Recent breakthroughs in generative artificial intelligence have triggered a surge in demand for machine learning training, which poses significant cost burdens and environmental challenges due to its substantial energy consumption. Scheduling training jobs among geographically distributed cloud data centers unveils the opportunity to optimize the usage of computing capacity powered by inexpensive and low-carbon energy and address the issue of workload imbalance. To tackle the challenge of multi-objective scheduling, i.e., maximizing GPU utilization while reducing operational costs, we propose an algorithm based on multi-agent reinforcement learning and actor-critic methods to learn the optimal collaborative scheduling strategy through interacting with a cloud system built with real-life workload patterns, energy prices, and carbon intensities. Compared with other algorithms, our proposed method improves the system utility by up to 28.6% attributable to higher GPU utilization, lower energy cost, and less carbon emission.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:CHSYGLWDkRkC"}, {"title": "Resource Optimization for UAV-assisted Wireless Power Charging Enabled Hybrid Coded Edge Computing Network", "description": "With the ubiquitous sensing enabled by the Internet-of-Things (IoT), massive amount of data is generated every second, transforming the way we interact with the world. To manage big data and enable analytics at the edge of the network, large amount of computation power is required to perform the computation intensive tasks. However, the energy-constrained IoT devices are not able to perform the computation tasks without compromising the quality-of-service of the applications. In this paper, we propose a hybrid network in which users can fully offload their computation tasks to edge servers through coded edge offloading or perform local computation with the wireless power transfer derived from coalitions of unmanned aerial vehicles (UAVs) serving as mobile charging stations. To minimize the cost of the network, we consider a two-level optimization approach. At the lower level, an optimal UAV coalition that …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:abG-DnoFyZgC"}], "2020": [{"title": "Federated learning in mobile edge networks: A comprehensive survey", "description": "In recent years, mobile devices are equipped with increasingly advanced sensing and computing capabilities. Coupled with advancements in Deep Learning (DL), this opens up countless possibilities for meaningful applications, e.g., for medical purposes and in vehicular networks. Traditional cloud-based Machine Learning (ML) approaches require the data to be centralized in a cloud server or data center. However, this results in critical issues related to unacceptable latency and communication inefficiency. To this end, Mobile Edge Computing (MEC) has been proposed to bring intelligence closer to the edge, where data is produced. However, conventional enabling technologies for ML at mobile edge networks still require personal data to be shared with external parties, e.g., edge servers. Recently, in light of increasingly stringent data privacy legislations and growing privacy concerns, the concept of Federated …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:roLk4NBRz8UC"}, {"title": "Hierarchical incentive mechanism design for federated machine learning in mobile networks", "description": "In recent years, the enhanced sensing and computation capabilities of Internet-of-Things (IoT) devices have opened the doors to several mobile crowdsensing applications. In mobile crowdsensing, a model owner announces a sensing task following which interested workers collect the required data. However, in some cases, a model owner may have insufficient data samples to build an effective machine learning model. To this end, we propose a federated learning (FL)-based privacy-preserving approach to facilitate collaborative machine learning among multiple model owners in mobile crowdsensing. Our system model allows collaborative machine learning without compromising data privacy given that only the model parameters instead of the raw data are exchanged within the federation. However, there are two main challenges of incentive mismatches between workers and model owners, as well as among …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:ufrVoPGSRksC"}, {"title": "Federated learning in the sky: Aerial-ground air quality sensing framework with UAV swarms", "description": "Due to air quality significantly affects human health, it is becoming increasingly important to accurately and timely predict the air quality index (AQI). To this end, this article proposes a new federated learning (FL)-based aerial-ground air quality sensing framework for fine-grained 3-D air quality monitoring and forecasting. Specifically, in the air, this framework leverages a lightweight Dense-MobileNet model to achieve energy-efficient end-to-end learning from haze features of haze images taken by unmanned aerial vehicles (UAVs) for predicting AQI scale distribution. Furthermore, the FL framework not only allows various organizations or institutions to collaboratively learn a well-trained global model to monitor AQI without compromising privacy but also expands the scope of UAV swarms monitoring. For ground sensing systems, we propose a graph convolutional neural network-based long short-term memory (GC …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:8k81kl-MbHgC"}, {"title": "Joint auction-coalition formation framework for communication-efficient federated learning in UAV-enabled internet of vehicles", "description": "Due to the advanced capabilities of the Internet of Vehicles (IoV) components such as vehicles, Roadside Units (RSUs) and smart devices as well as the increasing amount of data generated, Federated Learning (FL) becomes a promising tool given that it enables privacy-preserving machine learning that can be implemented in the IoV. However, the performance of the FL suffers from the failure of communication links and missing nodes, especially when continuous exchanges of model parameters are required. Therefore, we propose the use of Unmanned Aerial Vehicles (UAVs) as wireless relays to facilitate the communications between the IoV components and the FL server and thus improving the accuracy of the FL. However, a single UAV may not have sufficient resources to provide services for all iterations of the FL process. In this paper, we present a joint auction-coalition formation framework to solve the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:0EnyYjriUFMC"}, {"title": "UAV-assisted wireless energy and data transfer with deep reinforcement learning", "description": "As a typical scenario in future generation communication network applications, UAV-assisted communication can perform autonomous data delivery for massive machine type communication (mMTC), where the data generated from Internet of Things (IoT) devices can be carried and delivered to the corresponding locations with no direct communication channels to the IoT devices. Wireless energy transfer technique can recharge the UAV when the system is in operation, assisting the UAV to continuously collect and deliver data. In this work, we formulate a Markov decision process (MDP) model to describe the energy and data transfer optimization problem for the UAV. To maximize the long-term utility of the UAV, the MDP model is solved by value iteration algorithm to obtain the optimal strategies of the UAV to collect data, deliver data, and receive transferred energy to replenish on-device battery energy storage …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:Zph67rFs4hoC"}, {"title": "Dynamic contract design for federated learning in smart healthcare applications", "description": "Currently, the data collected by the Internet of Healthcare Things, i.e., healthcare oriented Internet of Things (IoT), still rely on cloud-based centralized data aggregation and processing. To reduce the need for transmission of data to the cloud, the edge computing architecture may be adopted to facilitate machine learning at the edge of the network through leveraging on the amassed computation resources of pervasive IoT devices. In this article, federated learning (FL) is proposed to enable privacy-preserving collaborative model training at the edge of the network across distributed IoT users. However, the users in the FL network may have different willingness to participate (WTP), a hidden information unknown to the model owner. Furthermore, the development of healthcare applications typically requires sustainable user participation, e.g., for the continuous collection of data during which a user’s WTP may change …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:_kc_bZDykSQC"}, {"title": "Communication-efficient federated learning for anomaly detection in industrial internet of things", "description": "With the rapid development of the Industrial Internet of Things (IIoT), various IoT devices and sensors generate massive industrial sensing data. Sensing big data can be analyzed for insights that lead to better decisions and strategic industrial production by using advanced machine learning technologies. However, vulnerable IoT devices are easy to be compromised thus causing IoT devices failures (i.e., anomalies). The anomalies seriously affect the production of industrial products, thereby, it is increasingly important to accurately and timely detect anomalies. To this end, we first introduce a Federated Learning (FL) framework to enable decentralized edge devices to collaboratively train a Deep Anomaly Detection (DAD) model, which can improve its generalization ability. Second, we propose a Convolutional Neural Network-Long Short Term Memory (CNN-LSTM) model to accurately detect anomalies. The CNN …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:3fE2CSJIrl8C"}, {"title": "When information freshness meets service latency in federated learning: A task-aware incentive scheme for smart industries", "description": "For several industrial applications, a sole data owner may lack sufficient training samples to train effective machine learning based models. As such, we propose a federated learning (FL) based approach to promote privacy-preserving collaborative machine learning for applications in smart industries. In our system model, a model owner initiates an FL task involving a group of workers, i.e., data owners, to perform model training on their locally stored data before transmitting the model updates for aggregation. There exists a tradeoff between service latency, i.e., the time taken for the training request to be completed, and age of information (AoI), i.e., the time elapsed between data aggregation from the deployed industrial Internet of Things devices to completion of the FL-based training. On one hand, if the data are collected only upon the model owner's request, the AoI is low. On the other hand, the service latency …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:aqlVkmm33-oC"}, {"title": "Incentive mechanism design for resource sharing in collaborative edge learning", "description": "In 5G and Beyond networks, Artificial Intelligence applications are expected to be increasingly ubiquitous. This necessitates a paradigm shift from the current cloud-centric model training approach to the Edge Computing based collaborative learning scheme known as edge learning, in which model training is executed at the edge of the network. In this article, we first introduce the principles and technologies of collaborative edge learning. Then, we establish that a successful, scalable implementation of edge learning requires the communication, caching, computation, and learning resources (3C-L) of end devices and edge servers to be leveraged jointly in an efficient manner. However, users may not consent to contribute their resources without receiving adequate compensation. In consideration of the heterogeneity of edge nodes, e.g., in terms of available computation resources, we discuss the challenges of incentive mechanism design to facilitate resource sharing for edge learning. Furthermore, we present a case study involving optimal auction design using Deep Learning to price fresh data contributed for edge learning. The performance evaluation shows the revenue maximizing properties of our proposed auction over the benchmark schemes.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:WF5omc3nYNoC"}, {"title": "Toward efficient data trading in AI enabled reconfigurable wireless sensor network using contract and game theories", "description": "Reconfigurable Wireless Sensor Network (RWSN) schedules a set of devices with reconfigurable wireless interface to accomplish different data collection plans in a cost-effective way. AI technologies are applied to optimize decision making for high-level network reconfiguration. Besides, AI based data mining tools are exploited by third parities to extract useful information underlying raw data. This leads to the emergence of AI enabled RWSN. We further study a data trading market to provide the data-centric environment for large-scale applications of AI enabled RWSN. A network operator employs the devices to gather environmental data, and sells the collected data to interested third parities as data consumers. After that, two-level optimizations are performed to ensure efficient data trading. In data collection, a contract based incentive mechanism is presented for the network operator to stimulate the devices and …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:MXK_kJrjxJIC"}, {"title": "Communication-efficient federated learning in UAV-enabled IOV: a joint auction-coalition approach", "description": "Due to the advanced capabilities of the Internet of Vehicles (IoV) components such as vehicles, Roadside Units (RSUs) and smart devices as well as the increasing amount of data generated, Federated Learning (FL) becomes a promising tool given that it enables privacy-preserving machine learning. However, the performance of the FL suffers from the failure of communication links and missing nodes. Therefore, we propose the use of Unmanned Aerial Vehicles (UAVs) as wireless relays to facilitate the communications between the IoV components and the FL server and thus improving the accuracy of the FL. However, a single UAV may not have sufficient resources for all iterations of the FL process. In this paper, we present a joint auction-coalition formation framework. The joint auctioncoalition formation algorithm is proposed to achieve a stable partition of UAV coalitions in which an auction scheme is applied …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:QIV2ME_5wuYC"}, {"title": "Privacy is not free: Energy-aware federated learning for mobile and edge intelligence", "description": "In mobile and edge intelligence systems, federated learning (FL) enables local data training and learning model sharing without obtaining actual data from mobile and edge users, which are data owners. Data training processes are performed at the user side with only trained gradients passed to an aggregator, i.e., learning server. The learning server continually trains and updates corresponding learning models by collecting gradients. The updated learning models are delivered back to the mobile and edge users for improved data training results. Despite the advantages of federated learning in preserving privacy, the local data training process will consume an adequate amount of energy from the perspective of mobile and edge users. In mobile and edge intelligence systems, mobile users may not always prefer to apply federated learning to reduce energy consumption. There is a trade-off between applying …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:qxL8FJ1GzNcC"}, {"title": "Incentive mechanism design for mobile data rewards using multi-dimensional contract", "description": "Mobile data rewards is now leading a new economic trend in wireless networks, where the operators stimulate mobile users to view ads with data rewards and ask for corresponding payments from advertisers. Yet, due to the uncertain nature of users’ preferences, it is always challenging for the advertiser to find the best choice of data rewards to attain an optimum balance between ad revenue and rewards spent. In this paper, we develop a general contract-theoretic framework to address the problem of data rewards design in a realistic asymmetric information scenario, where each user is associated with multidimensional private information. Specifically, we model the interplay between the advertiser and users by using a multidimensional contract design approach, and theoretically analyze optimal data rewarding schemes. To ensure global incentive compatibility, we convert the multi-dimensional contract problem …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:UebtZRa9Y70C"}, {"title": "Dynamic resource allocation for hierarchical federated learning", "description": "One of the enabling technologies of Edge Intelligence is the privacy preserving machine learning paradigm called Federated Learning (FL). However, communication inefficiency remains a key bottleneck in FL. To reduce node failures and device dropouts, the Hierarchical Federated Learning (HFL) framework has been proposed whereby cluster heads are designated to support the data owners through intermediate model aggregation. This decentralized learning approach reduces the reliance on a central controller, e.g., the model owner. However, the issues of resource allocation and incentive design are not well-studied in the HFL framework. In this paper, we consider a two-level resource allocation and incentive mechanism design problem. In the lower level, the cluster heads offer rewards in exchange of the data owners' participation, and the data owners are free to choose among any clusters to join …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:qUcmZB5y_30C"}, {"title": "An incentive scheme for federated learning in the sky", "description": "The enhanced capabilities of Unmanned Aerial Vehicles have promoted the rapid growth of the Drones-as-a-Service (DaaS) market. To enable privacy-preserving collaborative machine learning among independent DaaS providers, we propose a Federated Learning (FL) based approach. There exists a tradeoff between Service Latency (SL), i.e., the time taken for the training request to be completed, and Age of Information (AoI), i.e., the time elapsed between data aggregation to completion of the FL based training. Given that different training tasks may have varying AoI requirements, we propose a contract-theoretic task-aware incentive scheme that can be calibrated based on the weighted preferences of the model owner. Performance evaluation validates the incentive compatibility and flexibility of our contract design amid information asymmetry.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ULOm3_A8WrAC"}, {"title": "Collaborative Coded Computation Offloading: An All-pay Auction Approach", "description": "As the amount of data collected for crowdsensing applications increases rapidly due to improved sensing capabilities and the increasing number of Internet of Things (IoT) devices, the cloud server is no longer able to handle the large-scale datasets individually. Given the improved computational capabilities of the edge devices, coded distributed computing has become a promising approach given that it allows computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of devices are needed to reconstruct the final result. However, there is no incentive for the edge devices to complete the computation tasks. In this paper, we present an all-pay auction to incentivize the edge devices to participate in the coded computation tasks. In this auction, the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:mVmsd5A6BfQC"}, {"title": "A Survey of Coded Distributed Computing", "description": "Distributed computing has become a common approach for large-scale computation of tasks due to benefits such as high reliability, scalability, computation speed, and costeffectiveness. However, distributed computing faces critical issues related to communication load and straggler effects. In particular, computing nodes need to exchange intermediate results with each other in order to calculate the final result, and this significantly increases communication overheads. Furthermore, a distributed computing network may include straggling nodes that run intermittently slower. This results in a longer overall time needed to execute the computation tasks, thereby limiting the performance of distributed computing. To address these issues, coded distributed computing (CDC), ie, a combination of coding theoretic techniques and distributed computing, has been recently proposed as a promising solution. Coding theoretic …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:KlAtU1dfN6UC"}], "2022": [{"title": "A full dive into realizing the edge-enabled metaverse: Visions, enabling technologies, and challenges", "description": "Dubbed “the successor to the mobile Internet,” the concept of the Metaverse has grown in popularity. While there exist lite versions of the Metaverse today, they are still far from realizing the full vision of an immersive, embodied, and interoperable Metaverse. Without addressing the issues of implementation from the communication and networking, as well as computation perspectives, the Metaverse is difficult to succeed the Internet, especially in terms of its accessibility to billions of users today. In this survey, we focus on the edge-enabled Metaverse to realize its ultimate vision. We first provide readers with a succinct tutorial of the Metaverse, an introduction to the architecture, as well as current developments. To enable ubiquitous, seamless, and embodied access to the Metaverse, we discuss the communication and networking challenges and survey cutting-edge solutions and concepts that leverage next …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:J_g5lzvAfSwC", "topics": "Distributed Systems, Networking, Communication"}, {"title": "Realizing the metaverse with edge intelligence: A match made in heaven", "description": "Dubbed \"the successor to the mobile Internet\", the concept of the Metaverse has recently exploded in popularity. While there exists lite versions of the Metaverse today, we are still far from realizing the vision of a seamless, shardless, and interoperable Metaverse given the stringent sensing, communication, and computation requirements. Moreover, the birth of the Metaverse comes amid growing privacy concerns among users. In this article, we begin by providing a preliminary definition of the Metaverse. We discuss the architecture of the Metaverse and mainly focus on motivating the convergence of edge intelligence and the infrastructure layer of the Metaverse. We present major edge-based technological developments and their integration to support the Metaverse engine. Then, we present our research attempts through a case study of virtual city development in the Metaverse. Finally, we discuss the open …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:hMod-77fHWUC", "topics": "Edge Intelligence, Metaverse, Privacy Concerns"}, {"title": "Deep learning-powered vessel trajectory prediction for improving smart traffic services in maritime Internet of Things", "description": "The maritime Internet of Things (IoT) has recently emerged as a revolutionary communication paradigm where a large number of moving vessels are closely interconnected in intelligent maritime networks. However, the tremendous growth of vessel trajectories, collected from the combined satellite-terrestrial AIS (automatic identification system) base stations, could lead to unsatisfactory maritime safety and efficacy. To promote smart traffic services in maritime IoT, it is necessary to accurately and robustly predict the spatiotemporal vessel trajectories. It is beneficial for collision avoidance, maritime surveillance, and abnormal behavior detection, etc. Motivated by the strong learning capacity of deep neural networks, this work proposes an AIS data-driven trajectory prediction framework, whose main component is a long short term memory (LSTM) network. In particular, the vessel traffic conflict situation modeling …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:NMxIlDl6LWMC", "topics": "Deep Learning, Maritime Internet of Things, Trajectory Prediction"}, {"title": "Semantic communications for future internet: Fundamentals, applications, and challenges", "description": "With the increasing demand for intelligent services, the sixth-generation (6G) wireless networks will shift from a traditional architecture that focuses solely on a high transmission rate to a new architecture that is based on the intelligent connection of everything. Semantic communication (SemCom), a revolutionary architecture that integrates user as well as application requirements and the meaning of information into data processing and transmission, is predicted to become a new core paradigm in 6G. While SemCom is expected to progress beyond the classical Shannon paradigm, several obstacles need to be overcome on the way to a SemCom-enabled smart Internet. In this paper, we first highlight the motivations and compelling reasons for SemCom in 6G. Then, we provide an overview of SemCom-related theory development. After that, we introduce three types of SemCom, i.e., semantic-oriented …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:pqnbT2bcN3wC", "topics": "Semantic Communications, Future Internet, Intelligent Services"}, {"title": "Unified resource allocation framework for the edge intelligence-enabled metaverse", "description": "Dubbed as the next-generation Internet, the meta-verse is a virtual world that allows users to interact with each other or objects in real-time using their avatars. The metaverse is envisioned to support novel ecosystems of service provision in an immersive environment brought about by an intersection of the virtual and physical worlds. The native AI systems in metaverse will personalized user experience over time and shape the experience in a scalable, seamless, and synchronous way. However, the metaverse is characterized by diverse resource types amid a highly dynamic demand environment. In this paper, we propose the case study of virtual education in the metaverse and address the unified resource allocation problem amid stochastic user demand. We propose a stochastic optimal resource allocation scheme (SORAS) based on stochastic integer programming with the objective of minimizing the cost of the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:isC4tDSrTZIC", "topics": "Virtual Reality, Resource Allocation, Stochastic Optimization"}, {"title": "Semantic communication meets edge intelligence", "description": "The development of emerging applications, such as autonomous transportation systems, is expected to result in an explosive growth in mobile data traffic. As the available spectrum resource becomes more and more scarce, there is a growing need for a paradigm shift from Shannon's Classical Information Theory (CIT) to semantic communication (SemCom). Specifically, the former adopts a “transmit-before-understanding” approach while the latter leverages artificial intelligence (AI) techniques to “understand-before-transmit,” thereby alleviating bandwidth pressure by reducing the amount of data to be exchanged without negating the semantic effectiveness of the transmitted symbols. However, the semantic extraction (SE) procedure incurs costly computation and storage overheads. In this article, we introduce an edge-driven training, maintenance, and execution of SE. We further investigate how edge intelligence …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:GnPB-g6toBAC", "topics": "Artificial Intelligence, Edge Computing"}, {"title": "Aerial refueling: Scheduling wireless energy charging for UAV enabled data collection", "description": "The working scope and working time of small size unmanned aerial vehicles (UAVs) are limited because of the limited battery capacity. In this work, inspired by aerial refueling for aircrafts, we propose a wireless power transmission (WPT) scheme by categorizing the UAVs into charging UAV (CUAV) and mission UAV (MUAV) for charging UAVs without interrupting the mission. In the proposed aerial refueling scheme, mission UAVs (MUAV) can be recharged by charging UAVs on the fly and operate in a perpetual manner. The feasibility of aerially wireless charging for small UAVs is firstly discussed and evaluated. Then we consider a practical application scenario of multiple MUAVs for collecting data from several points of interest, where the MUAVs are recharged by CUAVs. Accordingly, the issue of scheduling the flying path and charging process of each CUAV to minimize the mission time arises. Deep …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:lSLTfruPkqcC", "topics": "Wireless Energy Charging, Unmanned Aerial Vehicles, Scheduling"}, {"title": "Economics of semantic communication system in wireless powered internet of things", "description": "The semantic communication system enables wireless devices to communicate effectively with the semantic meaning of the data. Wireless powered Internet of Things (IoT) that adopts the semantic communication system relies on harvested energy to transmit semantic information. However, the issue of energy constraint in the semantic communication system is not well studied. In this paper, we propose a semantic-based energy valuation and take an economic approach to solve the energy allocation problem as an incentive mechanism design. In our model, IoT devices (bidders) place their bids for the energy and power transmitter (auctioneer) decides the winner and payment by using deep learning based optimal auction. Results show that the revenue of wireless power transmitter is maximized while satisfying Individual Rationality (IR) and Incentive Compatibility (IC).", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:TFP_iSt0sucC", "topics": "Wireless Communication, Internet of Things, Energy Constraint"}, {"title": "Stochastic resource allocation for semantic communication-aided virtual transportation networks in the metaverse", "description": "The physical-virtual world synchronization to develop the Metaverse will require a massive transmission and exchange of data. In this paper, we introduce semantic communication for the development of virtual transportation networks in the Metaverse. Leveraging the perception capabilities of edge devices, virtual service providers (VSPs) can subscribe to their preferred edge devices to receive the semantic data of interest. However, the demands of the VSPs are highly dependent on the users that they are serving. To address the resource allocation problem amid stochastic user demand, we propose a stochastic semantic transmission scheme (SSTS) based on two-stage stochastic integer programming. Using real data captured by edge devices we deploy in Singapore, the simulation results show that SSTS can minimize the transmission cost of the VSPs while accounting for the users' demand uncertainties.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:zA6iFVUQeVQC", "topics": "Semantic Communication, Virtual Transportation Networks, Stochastic Resource Allocation"}, {"title": "Reputation-Aware Federated Learning Client Selection based on Stochastic Integer Programming", "description": "Federated Learning(FL) has attracted wide research interest due to its potential in building machine learning models while preserving users' data privacy. However, due to the distributive nature of FL, it is vulnerable to misbehavior from participating worker nodes. Thus, it is important to select clients to participate in FL. Recent studies on FL client selection focus on the perspective of improving model training efficiency and performance, without holistically considering potential misbehavior and the cost of hiring. To bridge this gap, we propose a first-of-its-kind reputation-aware Stochastic integer programming-based FL Client Selection method (SCS). It can optimally select and compensate clients with different reputation profiles. Extensive experiments show that SCS achieves the most advantageous performance-cost trade-off compared to other existing state-of-the-art approaches.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:HoB7MX3m0LUC", "topics": "Federated Learning, Stochastic Integer Programming, Reputation-Aware Client Selection"}, {"title": "Stochastic Coded Offloading Scheme for Unmanned-Aerial-Vehicle-Assisted Edge Computing", "description": "Unmanned aerial vehicles (UAVs) have gained wide research interests due to their technological advancement and high mobility. The UAVs are equipped with increasingly advanced capabilities to run computationally intensive applications enabled by machine learning techniques. However, because of both energy and computation constraints, the UAVs face issues hovering in the sky while performing computation due to weather uncertainty. To overcome the computation constraints, the UAVs can partially or fully offload their computation tasks to the edge servers. In ordinary computation offloading operations, the UAVs can retrieve the result from the returned output. Nevertheless, if the UAVs are unable to retrieve the entire result from the edge servers, i.e., straggling edge servers, this operation will fail. In this article, we propose a coded distributed computing (CDC) approach for computation offloading to mitigate …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:YFjsv_pBGBYC", "topics": "Edge Computing, Distributed Computing, Computation Offloading"}, {"title": "Federated Learning Over Wireless Edge Networks", "description": "This book first presents a tutorial on Federated Learning (FL) and its role in enabling Edge Intelligence over wireless edge networks. This provides readers with a concise introduction to the challenges and state-of-the-art approaches towards implementing FL over the wireless edge network. Then, in consideration of resource heterogeneity at the network edge, the authors provide multifaceted solutions at the intersection of network economics, game theory, and machine learning towards improving the efficiency of resource allocation for FL over the wireless edge networks. A clear understanding of such issues and the presented theoretical studies will serve to guide practitioners and researchers in implementing resource-efficient FL systems and solving the open issues in FL respectively.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:fPk4N6BV_jEC", "topics": "Wireless Networks, Edge Computing, Federated Learning"}, {"title": "UAV-assisted Wireless Power Charging for Efficient Hybrid Coded Edge Computing Network", "description": "With the ubiquitous sensing enabled by the Internet-of-Things (IoT), massive amount of data is generated every second, transforming the way we interact with the world. To manage big data and enable analytics at the edge of the network, large amount of computation power is required to perform the computation intensive tasks. However, the energy-constrained IoT devices are not able to perform the computation tasks without compromising the quality-of-service of the applications. In this paper, we propose a hybrid network in which users can offload their computation tasks to edge servers through coded edge offloading or perform local computation with the wireless power transfer derived from coalitions of unmanned aerial vehicles (UAVs) serving as mobile charging stations. We consider a two-level optimization approach where an optimal UAV coalitional structure that minimizes the network cost is formed. In the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:3s1wT3WcHBgC", "topics": "Edge Computing, Wireless Power Charging, UAV-assisted Computing"}, {"title": "Intelligent Edge-Aided Network Slicing for 5G and Beyond Networks", "description": "Network slicing at the edge is becoming a new enabler for 5G and beyond networks to support diverse and differential services, with efficient employment of virtualized resources provided by edge and cloud layers. However, as the arrival patterns of user requests are complicated and unpredictable in practical network scenarios, conventional system architectures and scheduling algorithms for core network slicing cannot handle the uncertain edge user task arrivals properly. Meanwhile, dynamic and intelligent allocation of multi-dimensional resources for edge-aided network slices is also a crucial issue. In this work, we develop a novel intelligent edge-aided network slicing scheme to reduce the system response time. Firstly, a deep belief network (DBN)-based task classification scheme is proposed. Due to the multi-layer structure of DBNs, the nonlinear features of user requests can be extracted efficiently with …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:D03iK_w7-QYC", "topics": "Network Slicing, Edge Computing, Resource Allocation"}, {"title": "Evolutionary Model Owner Selection for Federated Learning with Heterogeneous Privacy Budgets", "description": "Leveraging on the wealth of data and advancements in Artificial Intelligence, smart cities have demonstrated their great potential in providing solutions to challenges that the urban population faces today. However, as the urban population becomes more privacy sensitive and with the introduction of stringent privacy regulations, the differential-private FL (DPFL) is a promising technology that can enable privacy-preserving collaborative model training. In this paper, we consider an FL network of model owners and data owners with heterogeneous privacy budgets and preferences respectively. In exchange for their participation in the training, the model owner offers a reward pool that is shared among the data owners that take part in the FL training. In turn, the FL worker with heterogeneous privacy preferences may select the model owner to contribute its parameters to. To model the dynamic and strategic behaviour of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ZHo1McVdvXMC", "topics": "Federated Learning, Differential Privacy, Privacy-Preserving Collaborative Model Training"}, {"title": "Dynamic Incentive Mechanism Design for COVID-19 Social Distancing", "description": "As countries enter the endemic phase of COVID-19, people's risk of exposure to the virus is greater than ever. There is a need to make more informed decisions in our daily lives on avoiding crowded places. Crowd monitoring systems typically require costly infrastructure. We propose a crowd-sourced crowd monitoring platform which leverages user inputs to generate crowd counts and forecast location crowdedness. A key challenge for crowd-sourcing is a lack of incentive for users to contribute. We propose a Reinforcement Learning based dynamic incentive mechanism to optimally allocate rewards to encourage user participation.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:f2IySw72cVMC", "topics": "Reinforcement Learning, Incentive Mechanism Design, Crowd-sourcing"}, {"title": "CrowdFL: A Marketplace for Crowdsourced Federated Learning", "description": "Amid data privacy concerns, Federated Learning (FL) has emerged as a promising machine learning paradigm that enables privacy-preserving collaborative model training. However, there exists a need for a platform that matches data owners (supply) with model requesters (demand). In this paper, we present CrowdFL, a platform to facilitate the crowdsourcing of FL model training. It coordinates client selection, model training, and reputation management, which are essential steps for the FL crowdsourcing operations. By implementing model training on actual mobile devices, we demonstrate that the platform improves model performance and training efficiency. To the best of our knowledge, it is the first platform to support crowdsourcing-based FL on edge devices.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:pyW8ca7W8N0C", "topics": "Federated Learning, Crowdsourcing, Privacy-Preserving Collaborative Model Training"}, {"title": "Classification and recovery of data from flash memory", "description": "Classification and recovery of data are critical components of digital forensics. Numerous forensic activities need the decoding of memory dumps, the interpretation of residual data, and the recovery of data from crashed hard drives. Typically, a forensic analyst is tasked with determining the underlying file types when supplied with only file fragments and no access to the file system. The motivation is to apply various methods of feature extraction from file fragments in conjunction with machine learning and artificial intelligence for the task of file format categorization. This project will evaluate, test, and compare the accuracy and performance of the Fragments-Expert software in file fragment classification.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:rO6llkc54NcC", "topics": "Information Retrieval, Machine Learning, Artificial Intelligence"}], "2021": [{"title": "Towards federated learning in uav-enabled internet of vehicles: A multi-dimensional contract-matching approach", "description": "Coupled with the rise of Deep Learning, the wealth of data and enhanced computation capabilities of Internet of Vehicles (IoV) components enable effective Artificial Intelligence (AI) based models to be built. Beyond ground data sources, Unmanned Aerial Vehicles (UAVs) based service providers for data collection and AI model training, i.e., Drones-as-a-Service (DaaS), is becoming increasingly popular in recent years. However, the stringent regulations governing data privacy potentially impedes data sharing across independently owned UAVs. To this end, we propose the adoption of a Federated Learning (FL) based approach to enable privacy-preserving collaborative Machine Learning across a federation of independent DaaS providers for the development of IoV applications, e.g., for traffic prediction and car park occupancy management. Given the information asymmetry and incentive mismatches between …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:_FxGoFyzp5QC"}, {"title": "Decentralized edge intelligence: A dynamic resource allocation framework for hierarchical federated learning", "description": "To enable the large scale and efficient deployment of Artificial Intelligence (AI), the confluence of AI and Edge Computing has given rise to Edge Intelligence, which leverages on the computation and communication capabilities of end devices and edge servers to process data closer to where it is produced. One of the enabling technologies of Edge Intelligence is the privacy preserving machine learning paradigm known as Federated Learning (FL), which enables data owners to conduct model training without having to transmit their raw data to third-party servers. However, the FL network is envisioned to involve thousands of heterogeneous distributed devices. As a result, communication inefficiency remains a key bottleneck. To reduce node failures and device dropouts, the Hierarchical Federated Learning (HFL) framework has been proposed whereby cluster heads are designated to support the data owners …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:e5wmG9Sq2KIC"}, {"title": "Dynamic edge association and resource allocation in self-organizing hierarchical federated learning networks", "description": "Federated Learning (FL) is a promising privacy-preserving distributed machine learning paradigm. However, communication inefficiency remains the key bottleneck that impedes its large-scale implementation. Recently, hierarchical FL (HFL) has been proposed in which data owners, i.e., workers, can first transmit their updated model parameters to edge servers for intermediate aggregation. This reduces the instances of global communication and straggling workers. To enable efficient HFL, it is important to address the issues of edge association and resource allocation in the context of non-cooperative players, i.e., workers, edge servers, and model owner. However, the existing studies merely focus on static approaches and do not consider the dynamic interactions and bounded rationalities of the players. In this paper, we propose a hierarchical game framework to study the dynamics of edge association and …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:bEWYMUwI8FkC"}, {"title": "A comprehensive survey on coded distributed computing: Fundamentals, challenges, and networking applications", "description": "Distributed computing has become a common approach for large-scale computation tasks due to benefits such as high reliability, scalability, computation speed, and cost-effectiveness. However, distributed computing faces critical issues related to communication load and straggler effects. In particular, computing nodes need to exchange intermediate results with each other in order to calculate the final result, and this significantly increases communication overheads. Furthermore, a distributed computing network may include straggling nodes that run intermittently slower. This results in a longer overall time needed to execute the computation tasks, thereby limiting the performance of distributed computing. To address these issues, coded distributed computing (CDC), i.e., a combination of coding theoretic techniques and distributed computing, has been recently proposed as a promising solution. Coding theoretic …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:R3hNpaxXUhUC"}, {"title": "UAV-assisted communication efficient federated learning in the era of the artificial intelligence of things", "description": "Artificial Intelligence (AI) based models are increasingly deployed in the Internet of Things (IoT), paving the evolution of the IoT into the AI of things (AIoT). Currently, the predominant approach for AI model training is cloud-centric and involves the sharing of data with external parties. To preserve privacy while enabling collaborative model training across distributed IoT devices, the machine learning paradigm called Federated Learning (FL) has been proposed. The future FL network is envisioned to involve up to millions of distributed IoT devices involved in collaborative learning. However, communication failures and dropouts by nodes can lead to inefficient FL. Inspired by the UAV-assisted communications in 5G heterogeneous networks (HetNet), we propose the UAV-assisted FL in this article. The FL model owner may employ UAVs to provide the intermediate model aggregation in the sky and mobile relay of the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:r0BpntZqJG4C"}, {"title": "A hierarchical incentive design toward motivating participation in coded federated learning", "description": "Federated Learning (FL) is a privacy-preserving collaborative learning approach that trains artificial intelligence (AI) models without revealing local datasets of the FL workers. While FL ensures the privacy of the FL workers, its performance is limited by several bottlenecks, which become significant given the increasing amounts of data generated and the size of the FL network. One of the main challenges is the straggler effects where the significant computation delays are caused by the slow FL workers. As such, Coded Federated Learning (CFL), which leverages coding techniques to introduce redundant computations to the FL server, has been proposed to reduce the computation latency. In CFL, the FL server helps to compute a subset of the partial gradients based on the composite parity data and aggregates the computed partial gradients with those received from the FL workers. In order to implement the coding …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&citation_for_view=K2CHjf0AAAAJ:M3NEmzRMIkIC"}, {"title": "A double auction mechanism for resource allocation in coded vehicular edge computing", "description": "The development of smart vehicles and rich cloud services have led to the emergence of vehicular edge computing. To perform the distributed computation tasks efficiently, Coded Distributed Computing (CDC) was proposed to reduce communication costs and mitigate the straggler effects through the use of coding techniques. In this paper, we propose a double auction mechanism to allocate the resources of the edge servers to the vehicles in order to complete the CDC tasks. Specifically, the vehicles use the PolyDot codes to manage the tradeoff between communication costs and recovery threshold. Given the requirements of various vehicles, the double auction mechanism matches the edge servers with the required resources to the vehicles. Besides, the double auction mechanism also determines the prices that the vehicles need to pay for the resources of the edge servers. The analyses show that the double …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:O3NaXMp0MMsC"}, {"title": "Reputation-aware hedonic coalition formation for efficient serverless hierarchical federated learning", "description": "Amid growing concerns on data privacy, Federated Learning (FL) has emerged as a promising privacy preserving distributed machine learning paradigm. Given that the FL network is expected to be implemented at scale, several studies have proposed system architectures towards improving the network scalability and efficiency. Specifically, the Hierarchical FL (HFL) network utilizes cluster heads, e.g., base stations, for the intermediate aggregation and relay of model parameters. Serverless FL is also proposed recently, in which the data owners, i.e., workers, exchange the local model parameters among a neighborhood of workers. This decentralized approach reduces the risk of a single point of failure but inevitably incurs significant communication overheads. To achieve the best of both worlds, we propose the Serverless Hierarchical Federated Learning (SHFL) framework in this article. The SHFL framework …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:blknAaTinKkC"}, {"title": "Communication-efficient and Scalable Decentralized Federated Edge Learning", "description": "Federated Edge Learning (FEL) is a distributed Machine Learning (ML) framework for collaborative training on edge devices. FEL improves data privacy over traditional centralized ML model training by keeping data on the devices and only sending local model updates to a central coordinator for aggregation. However, challenges still remain in existing FEL architectures where there is high communication overhead between edge devices and the coordinator. In this paper, we present a working prototype of blockchain-empowered and communication-efficient FEL framework, which enhances the security and scalability towards largescale implementation of FEL.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:4JMBOYKVnBMC"}, {"title": "A game-theoretic approach towards collaborative coded computation offloading", "description": "Coded distributed computing (CDC) has emerged as a promising approach because it enables computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of edge servers can be used to reconstruct the final result. However, incentive issues have not been studied systematically for the edge servers to complete the CDC tasks. In this paper, we propose a tractable two-level game-theoretic approach to incentivize the edge servers to complete the CDC tasks. Specifically, in the lower level, a hedonic coalition formation game is formulated where the edge servers share their resources within their coalitions. By forming coalitions, the edge servers have more Central Processing Unit (CPU) power to complete the computation tasks. In the upper level, given the CPU power of the coalitions of edge servers, an all-pay auction is designed to incentivize the edge servers to participate in the CDC tasks. In the all-pay auction, the bids of the edge servers are represented by the allocation of their CPU power to the CDC tasks. The all-pay auction is designed to maximize the utility of the cloud server by determining the allocation of rewards to the winners. Simulation results show that the edge servers are incentivized to allocate more CPU power when multiple rewards are offered, i.e., there are multiple winners, instead of rewarding only the edge server with the largest CPU power allocation. Besides, the utility of the cloud server is maximized when it offers multiple homogeneous rewards, instead of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:L8Ckcad2t8MC"}, {"title": "Towards parkinson’s disease prognosis using self-supervised learning and anomaly detection", "description": "Parkinson’s disease (PD) is a chronic disease with a high risk of incidence after the age of 60 and is a problem for many countries facing an aging population. Current works have mainly focused on supervised learning using data collected from various sensors to differentiate between PD and healthy subjects. However, such supervised methods are not ideal for prognosis where there are no labels (i.e., we do not know in advance which subjects will develop PD in the future). We propose to tackle the problem as a semi-supervised anomaly detection task, where we model the physiological patterns of healthy subjects instead. A self-supervised learning technique first learns a good representation of the sensor signals. The representations are then adapted to capture inter-class patterns for anomaly detection. Evaluation on a large-scale PD dataset shows that our approach can learn discriminative features.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:hC7cP41nSMkC"}, {"title": "Optimal stochastic coded computation offloading in unmanned aerial vehicles network", "description": "Today, modern unmanned aerial vehicles (UAVs) are equipped with increasingly advanced capabilities that can run applications enabled by machine learning techniques, which require computationally intensive operations such as matrix multiplications. Due to computation constraints, the UAVscan offload their computation tasks to edge servers. To mitigate stragglers, coded distributed computing (CDC) based offloading can be adopted. In this paper, we propose an Optimal Task Allocation Scheme (OTAS) based on Stochastic Integer Programming with the objective to minimize energy consumption during computation offloading. The simulation results show that amid uncertainty of task completion, the energy consumption in the UAV network is minimized.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:k_IJM867U9cC"}, {"title": "Collaborative Coded Computation Offloading: An All-pay Auction Approach", "description": "As the amount of data collected for crowdsensing applications increases rapidly due to improved sensing capabilities and the increasing number of Internet of Things (IoT) devices, the cloud server is no longer able to handle the large-scale datasets individually. Given the improved computational capabilities of the edge devices, coded distributed computing has become a promising approach given that it allows computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of devices are needed to reconstruct the final result. However, there is no incentive for the edge devices to complete the computation tasks. In this paper, we present an all-pay auction to incentivize the edge devices to participate in the coded computation tasks. In this auction, the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:4TOpqqG69KYC"}, {"title": "Deep-learning based auction resource allocation in coded computation offloading for Internet-of-Things", "description": "Edge computing has been a promising approach that allows resource-constrained Internet-of-Things (IoT) devices to offload their computation-intensive tasks to the edge of the networks. Instead of offloading the entire computation task to a single edge device, the IoT devices can leverage on the resources of multiple edge devices. In order to improve the performance of the distributed computation tasks, coded distributed computing is proposed to mitigate the straggler effects. However, the edge devices may not have sufficient bandwidth to transmit the computed results to the IoT devices reliably. Hence, we present a deep-learning based auction for the edge devices to buy and utilize bandwidth from the service providers. In particular, the edge devices compete for the bandwidth of the service providers and the service providers allocate bandwidth to the edge devices that value it most while maximizing their …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:RHpTSmoSYBkC"}, {"title": "AI-Empowered decision support for COVID-19 social distancing", "description": "The COVID-19 pandemic is one of the most severe challenges the world faces today. In order to contain the transmission of COVID-19, people around the world have been advised to practise social distancing. However, maintaining social distance is a challenging problem, as we often do not know beforehand how crowded the places we intend to visit are. In this paper, we demonstrate crowded. sg, an AI-empowered platform that leverages on Unmanned Aerial Vehicles (UAVs), crowdsourced images, and computer vision techniques to provide social distancing decision support.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:dhFuZR0502QC"}, {"title": "Predictive Analytics for COVID-19 Social Distancing", "description": "The COVID-19 pandemic has disrupted the lives of millions across the globe. In Singapore, promoting safe distancing by managing crowds in public areas have been the cornerstone of containing the community spread of the virus. One of the most important solutions to maintain social distancing is to monitor the crowdedness of indoor and outdoor points of interest. Using Nanyang Technological University (NTU) as a testbed, we develop and deploy a platform that provides live and predicted crowd counts for key locations on campus to help users plan their trips in an informed manner, so as to mitigate the risk of community transmission.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:j3f4tGmQtD8C"}, {"title": "A Hierarchical Incentive Mechanism for Coded Federated Learning", "description": "Federated Learning (FL) is a privacy-preserving collaborative learning approach that trains artificial intelligence (AI) models without revealing local datasets of the FL workers. One of the main challenges is the straggler effects where the significant computation delays are caused by the slow FL workers. As such, Coded Federated Learning (CFL), which leverages coding techniques to introduce redundant computations to the FL server, has been proposed to reduce the computation latency. In order to implement the coding schemes over the FL network, incentive mechanisms are important to allocate the resources of the FL workers and data owners efficiently in order to complete the CFL training tasks. In this paper, we consider a two-level incentive mechanism design problem. In the lower level, the data owners are allowed to support the FL training tasks of the FL workers by contributing their data. To model the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ldfaerwXgEUC"}, {"title": "Dynamic Edge Association in Hierarchical Federated Learning Networks", "description": "Federated Learning (FL) is a promising privacy-preserving distributed machine learning paradigm. However, communication inefficiency remains the key bottleneck that impedes its large-scale implementation. Recently, hierarchical FL (HFL) has been proposed in which data owners, i.e., workers, can first transmit their updated model parameters to edge servers for intermediate aggregation. This reduces the instances of global communication and straggling workers. To enable efficient HFL, it is important to address the issues of edge association in the context of non-cooperative players, i.e., workers, edge servers, and model owner. However, the existing studies merely focus on static approaches and do not consider the dynamic interactions and bounded rationalities of the players. In this paper, we propose the edge association strategies of the workers to be modelled using an evolutionary game. Then, we provide …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:RYcK_YlVTxYC"}, {"title": "An Incentive Mechanism for Resource Allocation in Coded Distributed Computing", "description": "Coded distributed computing (CDC) has emerged as a promising approach because it enables computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. However, incentive issues have not been studied systematically for the edge servers to complete the CDC tasks. In this paper, we propose a tractable two-level game-theoretic approach to incentivize the edge servers to complete the CDC tasks. Specifically, in the lower level, a hedonic coalition formation game is formulated where the edge servers share their resources within their coalitions. In the upper level, given the CPU power of the coalitions of edge servers, an all-pay auction is designed to incentivize the edge servers to participate in the CDC tasks. Simulation results show that the edge servers are incentivized to allocate more CPU power when multiple rewards …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:RGFaLdJalmkC"}, {"title": "A Game-theoretic Approach Towards Collaborative Coded Computation Offloading", "description": "Coded distributed computing (CDC) has emerged as a promising approach because it enables computation tasks to be carried out in a distributed manner while mitigating straggler effects, which often account for the long overall completion times. Specifically, by using polynomial codes, computed results from only a subset of edge servers can be used to reconstruct the final result. However, incentive issues have not been studied systematically for the edge servers to complete the CDC tasks. In this paper, we propose a tractable two-level game-theoretic approach to incentivize the edge servers to complete the CDC tasks. Specifically, in the lower level, a hedonic coalition formation game is formulated where the edge servers share their resources within their coalitions. By forming coalitions, the edge servers have more Central Processing Unit (CPU) power to complete the computation tasks. In the upper level, given …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:ZeXyd9-uunAC"}, {"title": "A Double Auction Mechanism for Coded Distributed Computing in Smart Vehicles.", "description": "The development of smart vehicles and rich cloud services have led to the emergence of vehicular edge computing. To perform the distributed computation tasks efficiently, Coded Distributed Computing (CDC) was proposed to reduce communication costs and mitigate the straggler effects through the use of coding techniques. In this paper, we propose a double auction mechanism to allocate the resources of the edge servers to the vehicles in order to complete the CDC tasks. Specifically, the vehicles use the PolyDot codes to manage the tradeoff between communication costs and recovery threshold. Given the requirements of various vehicles, the double auction mechanism matches the edge servers with the required resources to the vehicles. Besides, the double auction mechanism also determines the prices that the vehicles need to pay for the resources of the edge servers. The double auction mechanism satisfies the properties of individual rationality, incentive compatibility and budget-balance.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:iH-uZ7U-co4C"}], "2023": [{"title": "Towards green metaverse networking: Technologies, advancements and future directions", "description": "As the Metaverse is iteratively being defined, its potential to unleash the next wave of digital disruption and create real-life value becomes increasingly clear. With distinctive features of immersive experience, simultaneous interactivity, and user agency, the Metaverse has the capability to transform all walks of life. However, the enabling technologies of the Metaverse, i.e., digital twin, artificial intelligence, blockchain, and extended reality, are known to be energy-hungry, therefore raising concerns about the sustainability of its large-scale deployment and development. This article proposes Green Metaverse Networking for the first time to optimize energy efficiencies of all network components for Metaverse sustainable development. We first analyze energy consumption, efficiency, and sustainability of energy-intensive technologies in the Metaverse. Next, focusing on computation and networking, we present major …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:bFI3QPDXJZMC", "topics": "Blockchain, Artificial Intelligence, Extended Reality"}, {"title": "Economics of Semantic Communication System: An Auction Approach", "description": "Semantic communication technologies enable wireless edge devices to communicate effectively by transmitting semantic meanings of data. Edge components, such as vehicles in next-generation intelligent transport systems, use well-trained semantic models to encode and decode semantic information extracted from raw and sensor data. However, the limitation in computing resources makes it difficult to support the training process of accurate semantic models on edge devices. As such, edge devices can buy the pretrained semantic models from semantic model providers, which is called “semantic model trading”. Upon collecting semantic information with the semantic models, the edge devices can then sell the extracted semantic information, e.g., information about urban road conditions or traffic signs, to the interested buyers for profit, which is called “semantic information trading”. To facilitate both types of the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:SeFeTyx0c_EC", "topics": "Information Retrieval, Distributed Systems"}, {"title": "Cooperative resource management in quantum key distribution (QKD) networks for semantic communication", "description": "The increasing focus on privacy and security in 6G networks, which are intelligence-native, necessitates the use of quantum key distribution-secured semantic information communication (QKD-SIC) to protect confidential data. In QKD-SIC systems, edge devices connected via quantum channels can efficiently encrypt semantic information from the semantic source, and securely transmit the encrypted semantic information to the semantic destination. In this paper, we consider an efficient resource (i.e., QKD and KM wavelengths) sharing problem to support QKD-SIC systems under the uncertainty of semantic information generated by edge devices. In such a system, QKD service providers offer QKD services with different subscription options to the edge devices. The QKD services are envisioned to follow cloud computing that has the subscription in the reservation and on-demand options, i.e., for long and short …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:u_35RYKgDlwC", "topics": "Quantum Key Distribution, Semantic Communication, Resource Management"}, {"title": "Economics of Semantic Communication in Metaverse: An Auction Approach", "description": "Metaverse provides embodied artificial-reality experience to the users in the virtual spaces. Many innovative and creative services such as virtual conference and tourism have been realized in the digital twins maintained by the virtual service providers (VSP) in Metaverse. Digital twins are digital copies of the physical world constructed virtually by the VSPs using real-world data. For a realistic experience, VSPs need to collect data that is up-to-date and relevant to their services. In this paper, we propose an incentive design framework to support the data trading between VSPs and edge devices. In the auction model, we model the valuation of data by considering data relatedness and data freshness. In our model, the semantic communication model is used to filter the relevant data, and the age of information (AoI) metric is used to assess the data freshness. Results show that by considering the data freshness, our …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:xtRiw3GOFMkC", "topics": "Semantic Communication, Auction Approach"}, {"title": "Reputation-Aware Opportunistic Budget Optimization for Auction-based Federation Learning", "description": "As an emerging privacy-preserving collaborative machine learning paradigm, the success of federated learning (FL) relies heavily on effectively motivating data owners (a.k.a. FL clients) to contribute high-quality local data and computational resources towards FL model training. Rewarding clients with incentives has been identified as a useful approach towards this goal. It is often implemented in conjunction with auction-based federated learning (AFL). Nevertheless, this approach introduces new challenges for FL servers (a.k.a. federations) as they must work within a limited budget and make trade-off decisions between hiring FL clients, saving costs and achieving target model performance. The dynamic nature of AFL further complicates this problem as federations need to consider potential competition from other federations. To address this challenge, we propose the Reputation-aware Opportunistic Budget …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:1sJd4Hv_s6UC", "topics": "Federated Learning, Auction-based Federation Learning, Privacy-Preserving Collaborative Machine Learning"}, {"title": "Mechanism Design for Semantic Communication in UAV-Assisted Metaverse: A Combinatorial Auction Approach", "description": "Metaverse enables users to experience a virtual space that resembles the real world. In the Metaverse, virtual service providers (VSPs) maintain digital twins (DTs) of real-world entities to offer innovative services such as virtual conferences and tourism. However, to provide a realistic experience, VSPs need to collect up-to-date and relevant data, which is latency-sensitive and resource-intensive, from edge devices such as unmanned aerial vehicles (UAVs). To address this challenge, we propose a semantic communication framework that leverages extraction and trading of scene graphs to reduce communication costs and motivate data transfer for Metaverse services. In the framework, we propose a semantic communication system where data for building DTs is encoded as semantic information, such as scene graphs. VSPs can use these graphs to build or update their DTs. To facilitate data trading between VSPs …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:P5F9QuxV20EC", "topics": "Semantic Communication, UAV-Assisted Metaverse, Combinatorial Auction Approach"}, {"title": "Blockchain for Decentralized Know Your Customer (KYC) and Customer Due Diligence (CDD) Pipelines in the Metaverse", "description": "Transactions conducted in the Metaverse must be validated in an interoperable and decentralized manner in order to prevent money laundering risks. Some processes to ensure that transactions are legal include the Know Your Customer (KYC) and Customer Due Diligence (CDD) processes. However, there are many problems that currently exist with traditionalKYC and CDD pipelines that include lengthy and repetitive processes, as well as the bundling problem that compromises the privacy of customers’ information. As more transactions happen in the Metaverse domain, these problems can be exacerbated. In this paper, we present a system using permissioned blockchain technology, which makes use of public and private smart contracts to efficiently validate the legitimacy of transactions executed in the Metaverse.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:KxtntwgDAa4C", "topics": "Blockchain, Decentralized Systems, Smart Contracts"}, {"title": "Edge-enabled Consumer Digital Twins in Industrial Metaverse", "description": "Industrial Metaverse has recently attracted considerable attention from both academia and industry due to its real-world mirroring, decentralization, and interoperability for enabling next-generation Internet services such as virtual consumer banking and retail. Consumer digital twins, i.e., the digital replica of a consumer, can be important in the industrial Metaverse, since multiple sales strategies, consumer engagement interventions, and advertising campaigns can be tested on consumer DT before an actual intervention, significantly increasing business efficiency and profits. A consumer DT may involve multi-dimensional dynamic real-time data (e.g., location and behavioral data) which requires assistance via the IoT devices (such as wearables and mobile phones). However, some information regarding consumers is confidential and private. In this paper, we propose a edge-based privacy-preserving training …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:nb7KW1ujOQ8C", "topics": "Edge Computing, Internet of Things (IoT), Privacy-Preserving Training"}, {"title": "Sustainable AIGC Workload Scheduling of Geo-Distributed Data Centers: A Multi-Agent Reinforcement Learning Approach", "description": "Recent breakthroughs in generative artificial intelligence have triggered a surge in demand for machine learning training, which poses significant cost burdens and environmental challenges due to its substantial energy consumption. Scheduling training jobs among geographically distributed cloud data centers unveils the opportunity to optimize the usage of computing capacity powered by inexpensive and low-carbon energy and address the issue of workload imbalance. To tackle the challenge of multi-objective scheduling, i.e., maximizing GPU utilization while reducing operational costs, we propose an algorithm based on multi-agent reinforcement learning and actor-critic methods to learn the optimal collaborative scheduling strategy through interacting with a cloud system built with real-life workload patterns, energy prices, and carbon intensities. Compared with other algorithms, our proposed method improves the system utility by up to 28.6% attributable to higher GPU utilization, lower energy cost, and less carbon emission.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:CHSYGLWDkRkC", "topics": "Distributed Systems, Reinforcement Learning"}, {"title": "Resource Optimization for UAV-assisted Wireless Power Charging Enabled Hybrid Coded Edge Computing Network", "description": "With the ubiquitous sensing enabled by the Internet-of-Things (IoT), massive amount of data is generated every second, transforming the way we interact with the world. To manage big data and enable analytics at the edge of the network, large amount of computation power is required to perform the computation intensive tasks. However, the energy-constrained IoT devices are not able to perform the computation tasks without compromising the quality-of-service of the applications. In this paper, we propose a hybrid network in which users can fully offload their computation tasks to edge servers through coded edge offloading or perform local computation with the wireless power transfer derived from coalitions of unmanned aerial vehicles (UAVs) serving as mobile charging stations. To minimize the cost of the network, we consider a two-level optimization approach. At the lower level, an optimal UAV coalition that …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=K2CHjf0AAAAJ&cstart=20&pagesize=80&citation_for_view=K2CHjf0AAAAJ:abG-DnoFyZgC", "topics": "Edge Computing, Wireless Power Charging, UAV-assisted Network"}]}