{"2014": [{"title": "Human activity recognition: A review", "description": "Human Activity Recognition is one of the active research areas in computer vision for various contexts like security surveillance, healthcare and human computer interaction. In this paper, a total of thirty-two recent research papers on sensing technologies used in HAR are reviewed. The review covers three area of sensing technologies namely RGB cameras, depth sensors and wearable devices. It also discusses on the pros and cons of the mentioned sensing technologies. The findings showed that RGB cameras have lower popularity when compared to depth sensors and wearable devices in HAR research.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:Y0pCki6q_DkC"}, {"title": "NonInvasive Monitoring of People with Disabilities via Motion Detection", "description": "This research developed a prototype to recognize the activities of people with social interaction and communication impairments using two commercial grade infrared motion sensing input devices. The model uses skeletal joints in the form of (x, y, z) coordinates to perform computationally inexpensive and efficient real time indoor monitoring. The prototype works well for a room with the size of 15 ft. by 15 ft. where it can detect two human subjects simultaneously. The prototype promotes non-invasive monitoring, no wearable sensor is required on the person under monitoring and no identifiable face images are stored. The evaluation shows that it is able to recognize the accident-critical activities, self-injurious activities and inactivity with satisfactory recognition and false alarm rates.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:UeHWp8X0CEIC"}, {"title": "A facial expression mediated natural user interface communication model for children with motor impairments", "description": "This work was motivated by the limitations of the existing Assistive and Augmentative Communication tools to help children with Cerebral Palsy who have Motor Impairments (CP-MI). A novel model was designed, developed, and evaluated in order to help CP-MI children. The proposed model monitors and detects in real time the critical expressions on the CP-MI children’s faces. Subsequently, the critical expression is sent to the caretaker either by an audio alarm or as an SMS message through the mobile phone. Multiple pilot tests on the developed prototype were performed with normal human prior to the evaluation with the CP-MI children. Later, 21 CP-MI children from a special education school were being invited to participate in the evaluation. The evaluation results and findings showed that the idea of adopting the facial expression as an alternate communication medium is workable for the CP-MI children.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:zYLM7Y9cAGgC"}], "2011": [{"title": "Biometrics based assistive communication tool for children with special needs", "description": "Communication is very important in our daily lives. Unfortunately, there is a minority group of people who suffers from both speech and physical disability. For example, people with cerebral palsies (CP) suffer from speech and physical, and also mental disability in some cases. Alternative and Augmentative Communication (AAC) or Assistive Communication tools have been developed to help them to communicate. However, due to the limitations of these tools, it is less efficient and effective in helping them. This research proposed an enhanced assistive communication tools as enhancement to the existing AAC tools. Results have shown that our proposed tool has the potential to assist people with Cerebral Palsy to communicate through facial expressions.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:u-x6o8ySG0sC"}, {"title": "A face based real time communication for physically and speech disabled people", "description": "The main purpose of this research is to enhance the communication of the disabled community. The authors of this chapter propose an enhanced interpersonal-human interaction for people with special needs, especially those with physical and communication disabilities. The proposed model comprises of automated real time behaviour monitoring, designed and implemented with the ubiquitous and affordable concept in mind to suit the underprivileged. In this chapter, the authors present the prototype which encapsulates an automated facial expression recognition system for monitoring the disabled, equipped with a feature to send Short Messaging System (SMS) for notification purposes. The authors adapted the Viola-Jones face detection algorithm at the face detection stage and implemented template matching technique for the expression classification and recognition stage. They tested their model with a few …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:738O_yMBCRsC"}, {"title": "A study on the effectiveness of biometrics based alternative communication tool", "description": "People with Cerebral Palsy (CP) suffer from speech, physical and intellectual disabilities. Many augmentative and alternative communication tools (AAC) have been developed and recommended by speech pathologies to improve their communication ability. However, the existing recommended AAC tools seem to be less efficient as they focused on text-to-speech, speech-to-text or touch-screen. They required users to have physical coordination with the interfaces but the people with CP find them unmanageable. This paper discusses the investigation on the effectiveness of using biometrics information i.e. facial expressions as an alternative communication tool.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:u5HHmVD_uO8C"}], "2019": [{"title": "A study on satisfaction level among amateur web application developers towards pigeon-table as nano web development framework", "description": "Web applications are an important platform in today's society, which humans rely on to complete daily tasks. Most of the web applications were developed with sophisticated, well-known, and powerful web development frameworks. While these frameworks evolve and grow at exponential rate, it become very complex, challenging to learn and no longer intuitive for web application developers, especially those who are inexperience and amateur. There is a need for a simpler web development framework which is sufficient for contemporary web application development. Pigeon-table is a simple module developed under ngPigeon project with the aim to generate web content, ie table using data from MySQL database with a single html tag. Pigeon-table is intuitive and easy to learn as it was developed with the principle “web developer-centred design” in mind. A pilot test was conducted in this study to evaluate the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:08ZZubdj9fEC"}], "2020": [{"title": "Food traceability and prevention of location fraud using blockchain", "description": "Food traceability has gained widespread prominence in recent years due to the widely reported food fraud and safety issues and there is a need for a simple low-cost solution. Adopting the design science research methodology, we proposed a design-based set of practical criteria for food tracking system that includes the prevention of location data input fraud. The design was successfully implemented on a blockchain as food tracking system. Based on our evaluation, the design and prototype demonstrate a viable approach to food tracking and limiting food fraud.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:tS2w5q8j5-wC"}], "2017": [{"title": "Pigeon-table: A quick prototyping tool using twitter bootstraps and AngularJS for data-driven web application development", "description": "Data-driven web applications are now taking over the role of traditional desktop applications as it is more convenient to the end user. However, developing a web application is considered challenging especially for junior web developers due to development processes, e.g. selection of development frameworks, learning the framework with lengthy documentations as well as experiment, or integrating the framework during the development. In this paper we proposed and developed a quick prototyping tool, “pigeon-table”, for data-driven web application development specifically focusing on data retrieval from MySQL database and render the data into an interactive table in a web application. The aims of this project are, 1) to optimize web developers' productivity in web application development as the tool is straightforward and simple, and 2) to enhance end user browsing experience with an interactive table in the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:l7t_Zn2s7bgC"}], "2018": [{"title": "Pigeon-chart: A customized HTML element for data visualization in data-driven web application using angularjs, highcharts, underscorejs and PHP", "description": "Humans rely more and more on data-driven web application to make decision for business, finance, education, government, environment, industry, and even for personal purposes. These applications are commonly developed with open-source web development technologies (a.k.a. libraries / frameworks) in either JavaScript, PHP or both. For the past few years, these technologies evolved exponentially and offered simpler ways for web application development. However, not every web developer benefit from the evolution of these web development technologies especially the young and amateur. This is primarily due to its rapid changes, complicated documentations and the steep learning curve of these technologies. In this paper, we proposed a custom defined HTML element, pigeon-chart, as a middleware to accommodate challenges experienced by these young and amateur web developers. Pigeon-chart is …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:tOudhMTPpwUC"}], "2013": [{"title": "Real time injury and related activities monitoring with single rotatable infrared sensor", "description": "This paper proposed a system to perform injury recognition to assist people with multiple disabilities using single infrared sensor with rotatable capability. Our system will be installed in a room to monitor the disabled for fall, inactivity and help request to recognize injury of people with multiple disabilities. This system alerts the caregiver with alarm, short message (SMS) and a scene snapshot (email), the snapshot assists in verifying false alerts. The designed system is sustainable as it is computationally inexpensive and efficient. The system has the abilities to recognize common human activities. Besides, the system is nonintrusive as there is no wearable device required on the person under monitoring. The system is intuitive as the person or subject under monitoring does not have to press any button for informing and verifying a possible injury.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:9yKSN-GCB0IC"}, {"title": "Investigating the Potential of Depth Sensor for Monitoring People with Disabilities", "description": "This research proposed a model to recognize the common activities of people with special needs using soft computing and infrared depth sensor. We developed a rotatable single sensor which resolves the blind spots that are occluded by non-rotatable single depth sensor; it also saves on resources as one rotatable sensor can provide the view field of two sensors. The model provides computationally inexpensive and efficient algorithms to recognize the activities for real time indoor monitoring of people with disabilities. Besides, the model works in real time, non-intrusive and intuitive manner. There is no wearable device required on the person under monitoring and he or she does not have to coordinate any interface element. The prototype evaluation shows that the model is able to recognize the common activities and critical incidents effectively. It has the potential to be adapted and enhanced for monitoring people with disabilities.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:IjCSPb-OGe4C"}], "2012": [{"title": "Helping disabled people: the potentials of biometric information", "description": "The purpose of this paper is to investigate an idea of producing an assistive and augmentative communication (AAC) tool that uses natural human computer interfacing to accommodate the disabilities of children with cerebral palsy (CP) and assist them in their daily communication.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:2osOgNQ5qMEC"}, {"title": "An Assistive Communication Model for Children with Cerebral Palsy", "description": "Cerebral Palsy children with multiple disabilities have a combination of several disabilities that may include: speech, physical mobility, intellectual disability, visual, hearing and possibly others. Consequently, communication becomes a common difficulty of these children. Speech therapists and pathologies suggest the adoption of Augmentative and Alternative Communication (AAC) tool to help them in their communication. However, most of the suggested AAC tools like touch or text-to-speech based applications require good hand coordination skills. Thus, most of the AAC tools are not effective in improving their communication with others.This research proposes an assistive communication tool (ACApp) with natural human computer interface to improve their communication. The proposed prototype recognizes their facial expressions and responses either by alerting with an alarm or sending messages through Short Messaging System (SMS) to the guardians’ mobile phones. There were 21 children with Cerebral Palsy from a special education school being invited to participate in the prototype evaluation. These children were categorized as high and low functional groups according to their disabilities. The results showed that the proposed prototype recognize facial expressions and response with the accuracy of 82.30% for the high functional group and 81.89% for the low functional group respectively. The false positive detection was 5.65% and 18.22% for the high and low functional groups respectively. Evaluations were also conducted to investigate the effectiveness of the critical expression messages delivery to their guardians, 98.46% of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:Tiz5es2fbqcC"}], "2015": [{"title": "Multimedia animations and social skills: A preliminary study on social skills acquisition through animated social stories", "description": "Social skills are the common deficits to children with all kinds of Autism Spectrum Disorders (ASD), a group of complex disorders of brain development (National Institute of Mental Health [15]). In spite of the rise of ASD nowadays, no exact treatment is available to cure ASD. However, early intervention such as special education can help improve social and communication skills. Social story is an efficient method for social skills training in term of cost, time and technique. The formal effective way of delivering social story is reading to one student by a teacher at a time. In 2012, Mandasari [12] combined 2D animation and social stories and created 2D animated social stories presented using laptop. The positive results of her research proved that the approach was successful. Although the combination is effective, this study considers that this may not be equally effective for every ASD child. In other words, animated social stories which are meant for ASD children in general may not work equally well with every ASD child due to individual differences. This research studies the effectiveness of generalized animated social stories on ASD children individually.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:WbkHhVStYXYC"}, {"title": "Critical Behavior Monitoring for Children with Special Needs in Preventing Physical Injury Using Kinect", "description": "This research studies ways to prevent physical injury for children with special needs, or specifically children with Autism Spectrum Disorder (ASD). The prevention is achievable by monitoring child behavior in the classroom from time to time. A Critical Behavior Monitoring model was developed for this purpose. The model is integrated with a Kinect sensor (by Microsoft) to process the signal acquired for human activities recognition. Currently, the model manages to identify 17 different human activities and notify parents or teachers via SMS and/or email if any unusual or critical activities are detected (ie falling down or asking for help). This will ensure immediate action is taken to prevent injuries or the situation from getting worse.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:Tyk-4Ss8FVUC"}], "2022": [], "2014": [{"title": "Human activity recognition: A review", "description": "Human Activity Recognition is one of the active research areas in computer vision for various contexts like security surveillance, healthcare and human computer interaction. In this paper, a total of thirty-two recent research papers on sensing technologies used in HAR are reviewed. The review covers three area of sensing technologies namely RGB cameras, depth sensors and wearable devices. It also discusses on the pros and cons of the mentioned sensing technologies. The findings showed that RGB cameras have lower popularity when compared to depth sensors and wearable devices in HAR research.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:Y0pCki6q_DkC"}, {"title": "NonInvasive Monitoring of People with Disabilities via Motion Detection", "description": "This research developed a prototype to recognize the activities of people with social interaction and communication impairments using two commercial grade infrared motion sensing input devices. The model uses skeletal joints in the form of (x, y, z) coordinates to perform computationally inexpensive and efficient real time indoor monitoring. The prototype works well for a room with the size of 15 ft. by 15 ft. where it can detect two human subjects simultaneously. The prototype promotes non-invasive monitoring, no wearable sensor is required on the person under monitoring and no identifiable face images are stored. The evaluation shows that it is able to recognize the accident-critical activities, self-injurious activities and inactivity with satisfactory recognition and false alarm rates.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:UeHWp8X0CEIC"}, {"title": "A facial expression mediated natural user interface communication model for children with motor impairments", "description": "This work was motivated by the limitations of the existing Assistive and Augmentative Communication tools to help children with Cerebral Palsy who have Motor Impairments (CP-MI). A novel model was designed, developed, and evaluated in order to help CP-MI children. The proposed model monitors and detects in real time the critical expressions on the CP-MI children’s faces. Subsequently, the critical expression is sent to the caretaker either by an audio alarm or as an SMS message through the mobile phone. Multiple pilot tests on the developed prototype were performed with normal human prior to the evaluation with the CP-MI children. Later, 21 CP-MI children from a special education school were being invited to participate in the evaluation. The evaluation results and findings showed that the idea of adopting the facial expression as an alternate communication medium is workable for the CP-MI children.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:zYLM7Y9cAGgC"}], "2011": [{"title": "Biometrics based assistive communication tool for children with special needs", "description": "Communication is very important in our daily lives. Unfortunately, there is a minority group of people who suffers from both speech and physical disability. For example, people with cerebral palsies (CP) suffer from speech and physical, and also mental disability in some cases. Alternative and Augmentative Communication (AAC) or Assistive Communication tools have been developed to help them to communicate. However, due to the limitations of these tools, it is less efficient and effective in helping them. This research proposed an enhanced assistive communication tools as enhancement to the existing AAC tools. Results have shown that our proposed tool has the potential to assist people with Cerebral Palsy to communicate through facial expressions.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:u-x6o8ySG0sC"}, {"title": "A face based real time communication for physically and speech disabled people", "description": "The main purpose of this research is to enhance the communication of the disabled community. The authors of this chapter propose an enhanced interpersonal-human interaction for people with special needs, especially those with physical and communication disabilities. The proposed model comprises of automated real time behaviour monitoring, designed and implemented with the ubiquitous and affordable concept in mind to suit the underprivileged. In this chapter, the authors present the prototype which encapsulates an automated facial expression recognition system for monitoring the disabled, equipped with a feature to send Short Messaging System (SMS) for notification purposes. The authors adapted the Viola-Jones face detection algorithm at the face detection stage and implemented template matching technique for the expression classification and recognition stage. They tested their model with a few …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:738O_yMBCRsC"}, {"title": "A study on the effectiveness of biometrics based alternative communication tool", "description": "People with Cerebral Palsy (CP) suffer from speech, physical and intellectual disabilities. Many augmentative and alternative communication tools (AAC) have been developed and recommended by speech pathologies to improve their communication ability. However, the existing recommended AAC tools seem to be less efficient as they focused on text-to-speech, speech-to-text or touch-screen. They required users to have physical coordination with the interfaces but the people with CP find them unmanageable. This paper discusses the investigation on the effectiveness of using biometrics information i.e. facial expressions as an alternative communication tool.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:u5HHmVD_uO8C"}], "2019": [{"title": "A study on satisfaction level among amateur web application developers towards pigeon-table as nano web development framework", "description": "Web applications are an important platform in today's society, which humans rely on to complete daily tasks. Most of the web applications were developed with sophisticated, well-known, and powerful web development frameworks. While these frameworks evolve and grow at exponential rate, it become very complex, challenging to learn and no longer intuitive for web application developers, especially those who are inexperience and amateur. There is a need for a simpler web development framework which is sufficient for contemporary web application development. Pigeon-table is a simple module developed under ngPigeon project with the aim to generate web content, ie table using data from MySQL database with a single html tag. Pigeon-table is intuitive and easy to learn as it was developed with the principle “web developer-centred design” in mind. A pilot test was conducted in this study to evaluate the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:08ZZubdj9fEC"}], "2020": [{"title": "Food traceability and prevention of location fraud using blockchain", "description": "Food traceability has gained widespread prominence in recent years due to the widely reported food fraud and safety issues and there is a need for a simple low-cost solution. Adopting the design science research methodology, we proposed a design-based set of practical criteria for food tracking system that includes the prevention of location data input fraud. The design was successfully implemented on a blockchain as food tracking system. Based on our evaluation, the design and prototype demonstrate a viable approach to food tracking and limiting food fraud.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:tS2w5q8j5-wC"}], "2017": [{"title": "Pigeon-table: A quick prototyping tool using twitter bootstraps and AngularJS for data-driven web application development", "description": "Data-driven web applications are now taking over the role of traditional desktop applications as it is more convenient to the end user. However, developing a web application is considered challenging especially for junior web developers due to development processes, e.g. selection of development frameworks, learning the framework with lengthy documentations as well as experiment, or integrating the framework during the development. In this paper we proposed and developed a quick prototyping tool, “pigeon-table”, for data-driven web application development specifically focusing on data retrieval from MySQL database and render the data into an interactive table in a web application. The aims of this project are, 1) to optimize web developers' productivity in web application development as the tool is straightforward and simple, and 2) to enhance end user browsing experience with an interactive table in the …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:l7t_Zn2s7bgC"}], "2018": [{"title": "Pigeon-chart: A customized HTML element for data visualization in data-driven web application using angularjs, highcharts, underscorejs and PHP", "description": "Humans rely more and more on data-driven web application to make decision for business, finance, education, government, environment, industry, and even for personal purposes. These applications are commonly developed with open-source web development technologies (a.k.a. libraries / frameworks) in either JavaScript, PHP or both. For the past few years, these technologies evolved exponentially and offered simpler ways for web application development. However, not every web developer benefit from the evolution of these web development technologies especially the young and amateur. This is primarily due to its rapid changes, complicated documentations and the steep learning curve of these technologies. In this paper, we proposed a custom defined HTML element, pigeon-chart, as a middleware to accommodate challenges experienced by these young and amateur web developers. Pigeon-chart is …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:tOudhMTPpwUC"}], "2013": [{"title": "Real time injury and related activities monitoring with single rotatable infrared sensor", "description": "This paper proposed a system to perform injury recognition to assist people with multiple disabilities using single infrared sensor with rotatable capability. Our system will be installed in a room to monitor the disabled for fall, inactivity and help request to recognize injury of people with multiple disabilities. This system alerts the caregiver with alarm, short message (SMS) and a scene snapshot (email), the snapshot assists in verifying false alerts. The designed system is sustainable as it is computationally inexpensive and efficient. The system has the abilities to recognize common human activities. Besides, the system is nonintrusive as there is no wearable device required on the person under monitoring. The system is intuitive as the person or subject under monitoring does not have to press any button for informing and verifying a possible injury.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:9yKSN-GCB0IC"}, {"title": "Investigating the Potential of Depth Sensor for Monitoring People with Disabilities", "description": "This research proposed a model to recognize the common activities of people with special needs using soft computing and infrared depth sensor. We developed a rotatable single sensor which resolves the blind spots that are occluded by non-rotatable single depth sensor; it also saves on resources as one rotatable sensor can provide the view field of two sensors. The model provides computationally inexpensive and efficient algorithms to recognize the activities for real time indoor monitoring of people with disabilities. Besides, the model works in real time, non-intrusive and intuitive manner. There is no wearable device required on the person under monitoring and he or she does not have to coordinate any interface element. The prototype evaluation shows that the model is able to recognize the common activities and critical incidents effectively. It has the potential to be adapted and enhanced for monitoring people with disabilities.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:IjCSPb-OGe4C"}], "2012": [{"title": "Helping disabled people: the potentials of biometric information", "description": "The purpose of this paper is to investigate an idea of producing an assistive and augmentative communication (AAC) tool that uses natural human computer interfacing to accommodate the disabilities of children with cerebral palsy (CP) and assist them in their daily communication.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:2osOgNQ5qMEC"}, {"title": "An Assistive Communication Model for Children with Cerebral Palsy", "description": "Cerebral Palsy children with multiple disabilities have a combination of several disabilities that may include: speech, physical mobility, intellectual disability, visual, hearing and possibly others. Consequently, communication becomes a common difficulty of these children. Speech therapists and pathologies suggest the adoption of Augmentative and Alternative Communication (AAC) tool to help them in their communication. However, most of the suggested AAC tools like touch or text-to-speech based applications require good hand coordination skills. Thus, most of the AAC tools are not effective in improving their communication with others.This research proposes an assistive communication tool (ACApp) with natural human computer interface to improve their communication. The proposed prototype recognizes their facial expressions and responses either by alerting with an alarm or sending messages through Short Messaging System (SMS) to the guardians’ mobile phones. There were 21 children with Cerebral Palsy from a special education school being invited to participate in the prototype evaluation. These children were categorized as high and low functional groups according to their disabilities. The results showed that the proposed prototype recognize facial expressions and response with the accuracy of 82.30% for the high functional group and 81.89% for the low functional group respectively. The false positive detection was 5.65% and 18.22% for the high and low functional groups respectively. Evaluations were also conducted to investigate the effectiveness of the critical expression messages delivery to their guardians, 98.46% of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:Tiz5es2fbqcC"}], "2015": [{"title": "Multimedia animations and social skills: A preliminary study on social skills acquisition through animated social stories", "description": "Social skills are the common deficits to children with all kinds of Autism Spectrum Disorders (ASD), a group of complex disorders of brain development (National Institute of Mental Health [15]). In spite of the rise of ASD nowadays, no exact treatment is available to cure ASD. However, early intervention such as special education can help improve social and communication skills. Social story is an efficient method for social skills training in term of cost, time and technique. The formal effective way of delivering social story is reading to one student by a teacher at a time. In 2012, Mandasari [12] combined 2D animation and social stories and created 2D animated social stories presented using laptop. The positive results of her research proved that the approach was successful. Although the combination is effective, this study considers that this may not be equally effective for every ASD child. In other words, animated social stories which are meant for ASD children in general may not work equally well with every ASD child due to individual differences. This research studies the effectiveness of generalized animated social stories on ASD children individually.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:WbkHhVStYXYC"}, {"title": "Critical Behavior Monitoring for Children with Special Needs in Preventing Physical Injury Using Kinect", "description": "This research studies ways to prevent physical injury for children with special needs, or specifically children with Autism Spectrum Disorder (ASD). The prevention is achievable by monitoring child behavior in the classroom from time to time. A Critical Behavior Monitoring model was developed for this purpose. The model is integrated with a Kinect sensor (by Microsoft) to process the signal acquired for human activities recognition. Currently, the model manages to identify 17 different human activities and notify parents or teachers via SMS and/or email if any unusual or critical activities are detected (ie falling down or asking for help). This will ensure immediate action is taken to prevent injuries or the situation from getting worse.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=nonoFcsAAAAJ&citation_for_view=nonoFcsAAAAJ:Tyk-4Ss8FVUC"}], "2022": [], "2023": []}