{"2016": [{"title": "Recursive Neural Conditional Random Fields for Aspect-based Sentiment Analysis", "description": "In aspect-based sentiment analysis, extracting aspect terms along with the opinions being expressed from user-generated content is one of the most important subtasks. Previous studies have shown that exploiting connections between aspect and opinion terms is promising for this task. In this paper, we propose a novel joint model that integrates recursive neural networks and conditional random fields into a unified framework for explicit aspect and opinion terms co-extraction. The proposed model learns high-level discriminative features and double propagate information between aspect and opinion terms, simultaneously. Moreover, it is flexible to incorporate hand-crafted features into the proposed model to further boost its information extraction performance. Experimental results on the SemEval Challenge 2014 dataset show the superiority of our proposed model over several baseline methods as well as the winning systems of the challenge.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:8k81kl-MbHgC"}, {"title": "Coupled Multi-layer Attentions for Co-extraction of Aspect and Opinion Terms", "description": "The task of aspect and opinion terms co-extraction aims to explicitly extract aspect terms describing features of an entity and opinion terms expressing emotions from user-generated texts. To achieve this task, one effective approach is to exploit relations between aspect terms and opinion terms by parsing syntactic structure for each sentence. However, this approach requires expensive effort for parsing and highly depends on the quality of the parsing results. In this paper, we offer a novel deep learning model, named coupled multi-layer attentions. The proposed model provides an end-to-end solution and does not require any parsers or other linguistic resources for preprocessing. Specifically, the proposed model is a multi-layer attention network, where each layer consists of a couple of attentions with tensor operators. One attention is for extracting aspect terms, while the other is for extracting opinion terms. They are learned interactively to dually propagate information between aspect terms and opinion terms. Through multiple layers, the model can further exploit indirect relations between terms for more precise information extraction. Experimental results on three benchmark datasets in SemEval Challenge 2014 and 2015 show that our model achieves state-of-the-art performances compared with several baselines.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:MXK_kJrjxJIC"}], "2018": [{"title": "Recursive Neural Structural Correspondence Network for Cross-domain Aspect and Opinion Co-extraction", "description": "Fine-grained opinion analysis aims to extract aspect and opinion terms from each sentence for opinion summarization. Supervised learning methods have proven to be effective for this task. However, in many domains, the lack of labeled data hinders the learning of a precise extraction model. In this case, unsupervised domain adaptation methods are desired to transfer knowledge from the source domain to any unlabeled target domain. In this paper, we develop a novel recursive neural network that could reduce domain shift effectively in word level through syntactic relations. We treat these relations as invariant “pivot information” across domains to build structural correspondences and generate an auxiliary task to predict the relation between any two adjacent words in the dependency tree. In the end, we demonstrate state-of-the-art results on three benchmark datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:kNdYIx-mwKoC"}, {"title": "Transition-based Adversarial Network for Cross-lingual Aspect Extraction.", "description": "In fine-grained opinion mining, the task of aspect extraction involves the identification of explicit product features in customer reviews. This task has been widely studied in some major languages, eg, English, but was seldom addressed in other minor languages due to the lack of annotated corpus. To solve it, we develop a novel deep model to transfer knowledge from a source language with labeled training data to a target language without any annotations. Different from cross-lingual sentiment classification, aspect extraction across languages requires more fine-grained adaptation. To this end, we utilize transition-based mechanism that reads a word each time and forms a series of configurations that represent the status of the whole sentence. We represent each configuration as a continuous feature vector and align these representations from different languages into a shared space through an adversarial network. In addition, syntactic structures are also integrated into the deep model to achieve more syntactically-sensitive adaptations. The proposed method is end-to-end and achieves state-ofthe-art performance on English, French and Spanish restaurant review datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:ULOm3_A8WrAC"}, {"title": "Memory networks for fine-grained opinion mining", "description": "Fine-grained opinion mining has attracted increasing attention recently because of its benefits for providing richer information compared with coarse-grained sentiment analysis. Under this problem, there are several existing works focusing on aspect (or opinion) terms extraction which utilize the syntactic relations among the words given by a dependency parser. These approaches, however, require additional information and highly depend on the quality of the parsing results. As a result, they may perform poorly on user-generated texts, such as product reviews, tweets, etc., whose syntactic structure is not precise. In this work, we offer an end-to-end deep learning model without any preprocessing. The model consists of a memory network that automatically learns the complicated interactions among aspect words and opinion words. Moreover, we extend the network with a multi-task manner to solve a finer-grained …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:4DMP91E08xMC"}, {"title": "Deep interactive learning for fine-grained opinion mining: single-domain, cross-domain & cross-lingual", "description": "Opinion mining or sentiment analysis provides a way to analyze the attitude or emotion of an opinion holder towards an entity or feature of any product. The emergence of opinion mining techniques comes along with the excessive volume of text data from social media made available to the public, such as product reviews, blog posts, forum discussions and Twitter website for social network.   Sentiment analysis has been actively studied among the Natural Language Processing (NLP) community since 2000. At this early stage, the main focus of sentiment analysis dealt with the overall sentiment polarity towards a given sentence or document, which we call coarse-grained sentiment analysis. For example, given a review sentence: \"The sound is clean and clear\", the desired output should be positive, without knowing the exact object the reviewer is talking about. For this task, various machine learning classifiers and deep learning models were developed to learn opinion-bearing features for the whole sentence or document to make predictions. However, a mere sentiment score is far from enough to provide all the necessary information for decision making. That's the reason why fine-grained opinion mining becomes more popular in a later stage.   Fine-grained opinion mining, or aspect-based sentiment analysis, mainly focuses on finding the opinion targets (aspects) from a given sentence and the emotions expressed towards them. This is more related to information extraction. Take the previous example review sentence, the model should be able to extract sound as the aspect and clean and clear as the opinion. The extracted information can be …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&cstart=20&pagesize=80&citation_for_view=eOKISncAAAAJ:aqlVkmm33-oC"}], "2020": [{"title": "Integrating deep learning with logic fusion for information extraction", "description": "Information extraction (IE) aims to produce structured information from an input text, eg, Named Entity Recognition and Relation Extraction. Various attempts have been proposed for IE via feature engineering or deep learning. However, most of them fail to associate the complex relationships inherent in the task itself, which has proven to be especially crucial. For example, the relation between 2 entities is highly dependent on their entity types. These dependencies can be regarded as complex constraints that can be efficiently expressed as logical rules. To combine such logic reasoning capabilities with learning capabilities of deep neural networks, we propose to integrate logical knowledge in the form of first-order logic into a deep learning system, which can be trained jointly in an end-to-end manner. The integrated framework is able to enhance neural outputs with knowledge regularization via logic rules, and at the same time update the weights of logic rules to comply with the characteristics of the training data. We demonstrate the effectiveness and generalization of the proposed model on multiple IE tasks.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:Wp0gIr-vW9MC"}, {"title": "Syntactically meaningful and transferable recursive neural networks for aspect and opinion extraction", "description": "In fine-grained opinion mining, extracting aspect terms (a.k.a. opinion targets) and opinion terms (a.k.a. opinion expressions) from user-generated texts is the most fundamental task in order to generate structured opinion summarization. Existing studies have shown that the syntactic relations between aspect and opinion words play an important role for aspect and opinion terms extraction. However, most of the works either relied on predefined rules or separated relation mining with feature learning. Moreover, these works only focused on single-domain extraction, which failed to adapt well to other domains of interest where only unlabeled data are available. In real-world scenarios, annotated resources are extremely scarce for many domains, motivating knowledge transfer strategies from labeled source domain(s) to any unlabeled target domain. We observe that syntactic relations among target words to be …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:4TOpqqG69KYC"}, {"title": "Deep weighted MaxSAT for aspect-based opinion extraction", "description": "Though deep learning has achieved significant success in various NLP tasks, most deep learning models lack the capability of encoding explicit domain knowledge to model complex causal relationships among different types of variables. On the other hand, logic rules offer a compact expression to represent the causal relationships to guide the training process. Logic programs can be cast as a satisfiability problem which aims to find truth assignments to logic variables by maximizing the number of satisfiable clauses (MaxSAT). We adopt the MaxSAT semantics to model logic inference process and smoothly incorporate a weighted version of MaxSAT that connects deep neural networks and a graphical model in a joint framework. The joint model feeds deep learning outputs to a weighted MaxSAT layer to rectify the erroneous predictions and can be trained via end-to-end gradient descent. Our proposed model associates the benefits of high-level feature learning, knowledge reasoning, and structured learning with observable performance gain for the task of aspect-based opinion extraction.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:9ZlFYXVOiuMC"}], "2019": [{"title": "Metaquant: Learning to quantize by learning to penetrate non-differentiable quantization", "description": "Tremendous amount of parameters make deep neural networks impractical to be deployed for edge-device-based real-world applications due to the limit of computational power and storage space. Existing studies have made progress on learning quantized deep models to reduce model size and energy consumption, ie converting full-precision weights ('s) into discrete values ('s) in a supervised training manner. However, the training process for quantization is non-differentiable, which leads to either infinite or zero gradients () wrt . To address this problem, most training-based quantization methods use the gradient wrt () with clipping to approximate  by Straight-Through-Estimator (STE) or manually design their computation. However, these methods only heuristically make training-based quantization applicable, without further analysis on how the approximated gradients can assist training of a quantized network. In this paper, we propose to learn  by a neural network. Specifically, a meta network is trained using  and  as inputs, and outputs  for subsequent weight updates. The meta network is updated together with the original quantized network. Our proposed method alleviates the problem of non-differentiability, and can be trained in an end-to-end manner. Extensive experiments are conducted with CIFAR10/100 and ImageNet on various deep networks to demonstrate the advantage of our proposed method in terms of a faster convergence rate and better performance. Codes are released at:\\texttt {https://github. com/csyhhu/MetaQuant}", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:YOwf2qJgpHMC"}, {"title": "Deep neural network quantization via layer-wise optimization using limited training data", "description": "The advancement of deep models poses great challenges to real-world deployment because of the limited computational ability and storage space on edge devices. To solve this problem, existing works have made progress to prune or quantize deep models. However, most existing methods rely heavily on a supervised training process to achieve satisfactory performance, acquiring large amount of labeled training data, which may not be practical for real deployment. In this paper, we propose a novel layer-wise quantization method for deep neural networks, which only requires limited training data (1% of original dataset). Specifically, we formulate parameters quantization for each layer as a discrete optimization problem, and solve it using Alternative Direction Method of Multipliers (ADMM), which gives an efficient closed-form solution. We prove that the final performance drop after quantization is bounded by a linear combination of the reconstructed errors caused at each layer. Based on the proved theorem, we propose an algorithm to quantize a deep neural network layer by layer with an additional weights update step to minimize the final error. Extensive experiments on benchmark deep models are conducted to demonstrate the effectiveness of our proposed method using 1% of CIFAR10 and ImageNet datasets. Codes are available in: https://github. com/csyhhu/L-DNQ", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:_kc_bZDykSQC"}, {"title": "Transferable interactive memory network for domain adaptation in fine-grained opinion extraction", "description": "In fine-grained opinion mining, aspect and opinion terms extraction has become a fundamental task that provides key information for user-generated texts. Despite its importance, a lack of annotated resources in many domains impede the ability to train a precise model. Very few attempts have applied unsupervised domain adaptation methods to transfer fine-grained knowledge (in the word level) from some labeled source domain (s) to any unlabeled target domain. Existing methods depend on the construction of “pivot” knowledge, eg, common opinion terms or syntactic relations between aspect and opinion words. In this work, we propose an interactive memory network that consists of local and global memory units. The model could exploit both local and global memory interactions to capture intra-correlations among aspect words or opinion words themselves, as well as the interconnections between aspect and opinion words. The source space and the target space are aligned through these domaininvariant interactions by incorporating an auxiliary task and domain adversarial networks. The proposed model does not require any external resources and demonstrates promising results on 3 benchmark datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:M3ejUd6NZC8C"}, {"title": "Cooperative Pruning in Cross-Domain Deep Neural Network Compression.", "description": "The advancement of deep models poses great challenges to real-world deployment because of the limited computational ability and storage space on edge devices. To solve this problem, existing works have made progress to compress deep models by pruning or quantization. However, most existing methods rely on a large amount of training data and a pre-trained model in the same domain. When only limited in-domain training data is available, these methods fail to perform well. This prompts the idea of transferring knowledge from a resource-rich source domain to a target domain with limited data to perform model compression. In this paper, we propose a method to perform cross-domain pruning by cooperatively training in both domains: taking advantage of data and a pre-trained model from the source domain to assist pruning in the target domain. Specifically, source and target pruned models are trained simultaneously and interactively, with source information transferred through the construction of a cooperative pruning mask. Our method significantly improves pruning quality in the target domain, and shed light to model compression in the cross-domain setting. Codes are available at https://github. com/csyhhu/Co-Prune.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:qxL8FJ1GzNcC"}], "2017": [{"title": "Multi-task coupled attentions for category-specific aspect and opinion terms co-extraction", "description": "In aspect-based sentiment analysis, most existing methods either focus on aspect/opinion terms extraction or aspect terms categorization. However, each task by itself only provides partial information to end users. To generate more detailed and structured opinion analysis, we propose a finer-grained problem, which we call category-specific aspect and opinion terms extraction. This problem involves the identification of aspect and opinion terms within each sentence, as well as the categorization of the identified terms. To this end, we propose an end-to-end multitask attention model, where each task corresponds to aspect/opinion terms extraction for a specific category. Our model benefits from exploring the commonalities and relationships among different tasks to address the data sparsity issue. We demonstrate its state-of-the-art performance on three benchmark datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:3fE2CSJIrl8C"}], "2022": [{"title": "Domain confused contrastive learning for unsupervised domain adaptation", "description": "In this work, we study Unsupervised Domain Adaptation (UDA) in a challenging self-supervised approach. One of the difficulties is how to learn task discrimination in the absence of target labels. Unlike previous literature which directly aligns cross-domain distributions or leverages reverse gradient, we propose Domain Confused Contrastive Learning (DCCL) to bridge the source and the target domains via domain puzzles, and retain discriminative representations after adaptation. Technically, DCCL searches for a most domain-challenging direction and exquisitely crafts domain confused augmentations as positive pairs, then it contrastively encourages the model to pull representations towards the other domain, thus learning more stable and effective domain invariances. We also investigate whether contrastive learning necessarily helps with UDA when performing other data augmentations. Extensive experiments demonstrate that DCCL significantly outperforms baselines.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:HDshCWvjkbEC", "topics": "Unsupervised Domain Adaptation, Contrastive Learning"}, {"title": "Towards Multi-Modal Sarcasm Detection via Hierarchical Congruity Modeling with Knowledge Enhancement", "description": "Sarcasm is a linguistic phenomenon indicating a discrepancy between literal meanings and implied intentions. Due to its sophisticated nature, it is usually challenging to be detected from the text itself. As a result, multi-modal sarcasm detection has received more attention in both academia and industries. However, most existing techniques only modeled the atomic-level inconsistencies between the text input and its accompanying image, ignoring more complex compositions for both modalities. Moreover, they neglected the rich information contained in external knowledge, e.g., image captions. In this paper, we propose a novel hierarchical framework for sarcasm detection by exploring both the atomic-level congruity based on multi-head cross attention mechanism and the composition-level congruity based on graph neural networks, where a post with low congruity can be identified as sarcasm. In addition, we exploit the effect of various knowledge resources for sarcasm detection. Evaluation results on a public multi-modal sarcasm detection dataset based on Twitter demonstrate the superiority of our proposed model.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:TQgYirikUcIC", "topics": "Multi-Modal Sarcasm Detection, Hierarchical Congruity Modeling, Knowledge Enhancement"}, {"title": "Deep inductive logic reasoning for multi-hop reading comprehension", "description": "Multi-hop reading comprehension requires an ability to reason across multiple documents. On the one hand, deep learning approaches only implicitly encode query-related information into distributed embeddings which fail to uncover the discrete relational reasoning process to infer the correct answer. On the other hand, logic-based approaches provide interpretable rules to infer the target answer, but mostly work on structured data where entities and relations are well-defined. In this paper, we propose a deep-learning based inductive logic reasoning method that firstly extracts query-related (candidate-related) information, and then conducts logic reasoning among the filtered information by inducing feasible rules that entail the target relation. The reasoning process is accomplished via attentive memories with novel differentiable logic operators. To demonstrate the effectiveness of our model, we evaluate it on two reading comprehension datasets, namely WikiHop and MedHop.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:mB3voiENLucC", "topics": "Deep Learning, Inductive Logic Reasoning, Reading Comprehension"}, {"title": "Progressive Multigranularity Information Propagation for Coupled Aspect-Opinion Extraction", "description": "Coupled aspect-opinion extraction aims to identify aspect-opinion pairs in the form of (aspect term, opinion term) or triplets in the form of (aspect term, opinion term, sentiment polarity) from user-generated texts. Compared to the traditional aspect-based sentiment prediction or extraction tasks, coupled aspect-opinion extraction needs to associate aspects with their corresponding opinions and organize opinion-related information into structured outputs. The existing works either divide this task into subproblems (i.e., term extraction and relation prediction) or utilize a unified tagging scheme. However, these methods only focus on atomic word-level interactions and ignore the intensive information propagation among different granularities (e.g., words and word pairs). To address this limitation, we propose a progressive multigranularity information propagation network that progressively explores three types of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&cstart=20&pagesize=80&citation_for_view=eOKISncAAAAJ:e5wmG9Sq2KIC", "topics": "Information Extraction, Natural Language Processing"}], "2021": [{"title": "Weakly supervised domain adaptation for aspect extraction via multilevel interaction transfer", "description": "Fine-grained aspect term extraction is an essential subtask in aspect-based opinion analysis. It aims to identify the aspect terms (also known as opinion targets) of a product or service in each sentence. To learn a good aspect extraction model, an expensive annotation process is usually involved to acquire sufficient token-level labels for each domain, which is not realistic. To address this limitation, some previous works propose domain adaptation strategies to transfer knowledge from a sufficiently labeled source domain to unlabeled target domains. However, due to both the difficulty of fine-grained prediction problems and the large domain gap between different domains, the performance is still far from satisfactory. In this work, we conduct a pioneer study on leveraging sentence-level aspect category labels that can be usually available in commercial services, such as review sites or social media to promote token …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:mVmsd5A6BfQC"}, {"title": "Variational deep logic network for joint inference of entities and relations", "description": "Currently, deep learning models have been widely adopted and achieved promising results on various application domains. Despite their intriguing performance, most deep learning models function as black boxes, lacking explicit reasoning capabilities and explanations, which are usually essential for complex problems. Take joint inference in information extraction as an example. This task requires the identification of multiple structured knowledge from texts, which is inter-correlated, including entities, events, and the relationships between them. Various deep neural networks have been proposed to jointly perform entity extraction and relation prediction, which only propagate information implicitly via representation learning. However, they fail to encode the intensive correlations between entity types and relations to enforce their coexistence. On the other hand, some approaches adopt rules to explicitly …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:hFOr9nPyWt4C"}], "2023": [{"title": "Elaboration-generating commonsense question answering at scale", "description": "In question answering requiring common sense, language models (e.g., GPT-3) have been used to generate text expressing background knowledge that helps improve performance. Yet the cost of working with such models is very high; in this work, we finetune smaller language models to generate useful intermediate context, referred to here as elaborations. Our framework alternates between updating two language models -- an elaboration generator and an answer predictor -- allowing each to influence the other. Using less than 0.5% of the parameters of GPT-3, our model outperforms alternatives with similar sizes and closes the gap on GPT-3 on four commonsense question answering benchmarks. Human evaluations show that the quality of the generated elaborations is high.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:R3hNpaxXUhUC"}, {"title": "Vera: A General-Purpose Plausibility Estimation Model for Commonsense Statements", "description": "Despite the much discussed capabilities of today's language models, they are still prone to silly and unexpected commonsense failures. We consider a retrospective verification approach that reflects on the correctness of LM outputs, and introduce Vera, a general-purpose model that estimates the plausibility of declarative statements based on commonsense knowledge. Trained on ~7M commonsense statements created from 19 QA datasets and two large-scale knowledge bases, and with a combination of three training objectives, Vera is a versatile model that effectively separates correct from incorrect statements across diverse commonsense domains. When applied to solving commonsense problems in the verification format, Vera substantially outperforms existing models that can be repurposed for commonsense verification, and it further exhibits generalization capabilities to unseen tasks and provides well-calibrated outputs. We find that Vera excels at filtering LM-generated commonsense knowledge and is useful in detecting erroneous commonsense statements generated by models like ChatGPT in real-world settings.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:RHpTSmoSYBkC"}, {"title": "Interpretable Multimodal Misinformation Detection with Logic Reasoning", "description": "Multimodal misinformation on online social platforms is becoming a critical concern due to increasing credibility and easier dissemination brought by multimedia content, compared to traditional text-only information. While existing multimodal detection approaches have achieved high performance, the lack of interpretability hinders these systems' reliability and practical deployment. Inspired by NeuralSymbolic AI which combines the learning ability of neural networks with the explainability of symbolic learning, we propose a novel logic-based neural model for multimodal misinformation detection which integrates interpretable logic clauses to express the reasoning process of the target task. To make learning effective, we parameterize symbolic logical elements using neural representations, which facilitate the automatic generation and evaluation of meaningful logic clauses. Additionally, to make our framework generalizable across diverse misinformation sources, we introduce five meta-predicates that can be instantiated with different correlations. Results on three public datasets (Twitter, Weibo, and Sarcasm) demonstrate the feasibility and versatility of our model.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&cstart=20&pagesize=80&citation_for_view=eOKISncAAAAJ:_Qo2XoVZTnwC"}], "2016": [{"title": "Recursive Neural Conditional Random Fields for Aspect-based Sentiment Analysis", "description": "In aspect-based sentiment analysis, extracting aspect terms along with the opinions being expressed from user-generated content is one of the most important subtasks. Previous studies have shown that exploiting connections between aspect and opinion terms is promising for this task. In this paper, we propose a novel joint model that integrates recursive neural networks and conditional random fields into a unified framework for explicit aspect and opinion terms co-extraction. The proposed model learns high-level discriminative features and double propagate information between aspect and opinion terms, simultaneously. Moreover, it is flexible to incorporate hand-crafted features into the proposed model to further boost its information extraction performance. Experimental results on the SemEval Challenge 2014 dataset show the superiority of our proposed model over several baseline methods as well as the winning systems of the challenge.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:8k81kl-MbHgC"}, {"title": "Coupled Multi-layer Attentions for Co-extraction of Aspect and Opinion Terms", "description": "The task of aspect and opinion terms co-extraction aims to explicitly extract aspect terms describing features of an entity and opinion terms expressing emotions from user-generated texts. To achieve this task, one effective approach is to exploit relations between aspect terms and opinion terms by parsing syntactic structure for each sentence. However, this approach requires expensive effort for parsing and highly depends on the quality of the parsing results. In this paper, we offer a novel deep learning model, named coupled multi-layer attentions. The proposed model provides an end-to-end solution and does not require any parsers or other linguistic resources for preprocessing. Specifically, the proposed model is a multi-layer attention network, where each layer consists of a couple of attentions with tensor operators. One attention is for extracting aspect terms, while the other is for extracting opinion terms. They are learned interactively to dually propagate information between aspect terms and opinion terms. Through multiple layers, the model can further exploit indirect relations between terms for more precise information extraction. Experimental results on three benchmark datasets in SemEval Challenge 2014 and 2015 show that our model achieves state-of-the-art performances compared with several baselines.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:MXK_kJrjxJIC"}], "2018": [{"title": "Recursive Neural Structural Correspondence Network for Cross-domain Aspect and Opinion Co-extraction", "description": "Fine-grained opinion analysis aims to extract aspect and opinion terms from each sentence for opinion summarization. Supervised learning methods have proven to be effective for this task. However, in many domains, the lack of labeled data hinders the learning of a precise extraction model. In this case, unsupervised domain adaptation methods are desired to transfer knowledge from the source domain to any unlabeled target domain. In this paper, we develop a novel recursive neural network that could reduce domain shift effectively in word level through syntactic relations. We treat these relations as invariant “pivot information” across domains to build structural correspondences and generate an auxiliary task to predict the relation between any two adjacent words in the dependency tree. In the end, we demonstrate state-of-the-art results on three benchmark datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:kNdYIx-mwKoC"}, {"title": "Transition-based Adversarial Network for Cross-lingual Aspect Extraction.", "description": "In fine-grained opinion mining, the task of aspect extraction involves the identification of explicit product features in customer reviews. This task has been widely studied in some major languages, eg, English, but was seldom addressed in other minor languages due to the lack of annotated corpus. To solve it, we develop a novel deep model to transfer knowledge from a source language with labeled training data to a target language without any annotations. Different from cross-lingual sentiment classification, aspect extraction across languages requires more fine-grained adaptation. To this end, we utilize transition-based mechanism that reads a word each time and forms a series of configurations that represent the status of the whole sentence. We represent each configuration as a continuous feature vector and align these representations from different languages into a shared space through an adversarial network. In addition, syntactic structures are also integrated into the deep model to achieve more syntactically-sensitive adaptations. The proposed method is end-to-end and achieves state-ofthe-art performance on English, French and Spanish restaurant review datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:ULOm3_A8WrAC"}, {"title": "Memory networks for fine-grained opinion mining", "description": "Fine-grained opinion mining has attracted increasing attention recently because of its benefits for providing richer information compared with coarse-grained sentiment analysis. Under this problem, there are several existing works focusing on aspect (or opinion) terms extraction which utilize the syntactic relations among the words given by a dependency parser. These approaches, however, require additional information and highly depend on the quality of the parsing results. As a result, they may perform poorly on user-generated texts, such as product reviews, tweets, etc., whose syntactic structure is not precise. In this work, we offer an end-to-end deep learning model without any preprocessing. The model consists of a memory network that automatically learns the complicated interactions among aspect words and opinion words. Moreover, we extend the network with a multi-task manner to solve a finer-grained …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:4DMP91E08xMC"}, {"title": "Deep interactive learning for fine-grained opinion mining: single-domain, cross-domain & cross-lingual", "description": "Opinion mining or sentiment analysis provides a way to analyze the attitude or emotion of an opinion holder towards an entity or feature of any product. The emergence of opinion mining techniques comes along with the excessive volume of text data from social media made available to the public, such as product reviews, blog posts, forum discussions and Twitter website for social network.   Sentiment analysis has been actively studied among the Natural Language Processing (NLP) community since 2000. At this early stage, the main focus of sentiment analysis dealt with the overall sentiment polarity towards a given sentence or document, which we call coarse-grained sentiment analysis. For example, given a review sentence: \"The sound is clean and clear\", the desired output should be positive, without knowing the exact object the reviewer is talking about. For this task, various machine learning classifiers and deep learning models were developed to learn opinion-bearing features for the whole sentence or document to make predictions. However, a mere sentiment score is far from enough to provide all the necessary information for decision making. That's the reason why fine-grained opinion mining becomes more popular in a later stage.   Fine-grained opinion mining, or aspect-based sentiment analysis, mainly focuses on finding the opinion targets (aspects) from a given sentence and the emotions expressed towards them. This is more related to information extraction. Take the previous example review sentence, the model should be able to extract sound as the aspect and clean and clear as the opinion. The extracted information can be …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&cstart=20&pagesize=80&citation_for_view=eOKISncAAAAJ:aqlVkmm33-oC"}], "2020": [{"title": "Integrating deep learning with logic fusion for information extraction", "description": "Information extraction (IE) aims to produce structured information from an input text, eg, Named Entity Recognition and Relation Extraction. Various attempts have been proposed for IE via feature engineering or deep learning. However, most of them fail to associate the complex relationships inherent in the task itself, which has proven to be especially crucial. For example, the relation between 2 entities is highly dependent on their entity types. These dependencies can be regarded as complex constraints that can be efficiently expressed as logical rules. To combine such logic reasoning capabilities with learning capabilities of deep neural networks, we propose to integrate logical knowledge in the form of first-order logic into a deep learning system, which can be trained jointly in an end-to-end manner. The integrated framework is able to enhance neural outputs with knowledge regularization via logic rules, and at the same time update the weights of logic rules to comply with the characteristics of the training data. We demonstrate the effectiveness and generalization of the proposed model on multiple IE tasks.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:Wp0gIr-vW9MC"}, {"title": "Syntactically meaningful and transferable recursive neural networks for aspect and opinion extraction", "description": "In fine-grained opinion mining, extracting aspect terms (a.k.a. opinion targets) and opinion terms (a.k.a. opinion expressions) from user-generated texts is the most fundamental task in order to generate structured opinion summarization. Existing studies have shown that the syntactic relations between aspect and opinion words play an important role for aspect and opinion terms extraction. However, most of the works either relied on predefined rules or separated relation mining with feature learning. Moreover, these works only focused on single-domain extraction, which failed to adapt well to other domains of interest where only unlabeled data are available. In real-world scenarios, annotated resources are extremely scarce for many domains, motivating knowledge transfer strategies from labeled source domain(s) to any unlabeled target domain. We observe that syntactic relations among target words to be …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:4TOpqqG69KYC"}, {"title": "Deep weighted MaxSAT for aspect-based opinion extraction", "description": "Though deep learning has achieved significant success in various NLP tasks, most deep learning models lack the capability of encoding explicit domain knowledge to model complex causal relationships among different types of variables. On the other hand, logic rules offer a compact expression to represent the causal relationships to guide the training process. Logic programs can be cast as a satisfiability problem which aims to find truth assignments to logic variables by maximizing the number of satisfiable clauses (MaxSAT). We adopt the MaxSAT semantics to model logic inference process and smoothly incorporate a weighted version of MaxSAT that connects deep neural networks and a graphical model in a joint framework. The joint model feeds deep learning outputs to a weighted MaxSAT layer to rectify the erroneous predictions and can be trained via end-to-end gradient descent. Our proposed model associates the benefits of high-level feature learning, knowledge reasoning, and structured learning with observable performance gain for the task of aspect-based opinion extraction.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:9ZlFYXVOiuMC"}], "2019": [{"title": "Metaquant: Learning to quantize by learning to penetrate non-differentiable quantization", "description": "Tremendous amount of parameters make deep neural networks impractical to be deployed for edge-device-based real-world applications due to the limit of computational power and storage space. Existing studies have made progress on learning quantized deep models to reduce model size and energy consumption, ie converting full-precision weights ('s) into discrete values ('s) in a supervised training manner. However, the training process for quantization is non-differentiable, which leads to either infinite or zero gradients () wrt . To address this problem, most training-based quantization methods use the gradient wrt () with clipping to approximate  by Straight-Through-Estimator (STE) or manually design their computation. However, these methods only heuristically make training-based quantization applicable, without further analysis on how the approximated gradients can assist training of a quantized network. In this paper, we propose to learn  by a neural network. Specifically, a meta network is trained using  and  as inputs, and outputs  for subsequent weight updates. The meta network is updated together with the original quantized network. Our proposed method alleviates the problem of non-differentiability, and can be trained in an end-to-end manner. Extensive experiments are conducted with CIFAR10/100 and ImageNet on various deep networks to demonstrate the advantage of our proposed method in terms of a faster convergence rate and better performance. Codes are released at:\\texttt {https://github. com/csyhhu/MetaQuant}", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:YOwf2qJgpHMC"}, {"title": "Deep neural network quantization via layer-wise optimization using limited training data", "description": "The advancement of deep models poses great challenges to real-world deployment because of the limited computational ability and storage space on edge devices. To solve this problem, existing works have made progress to prune or quantize deep models. However, most existing methods rely heavily on a supervised training process to achieve satisfactory performance, acquiring large amount of labeled training data, which may not be practical for real deployment. In this paper, we propose a novel layer-wise quantization method for deep neural networks, which only requires limited training data (1% of original dataset). Specifically, we formulate parameters quantization for each layer as a discrete optimization problem, and solve it using Alternative Direction Method of Multipliers (ADMM), which gives an efficient closed-form solution. We prove that the final performance drop after quantization is bounded by a linear combination of the reconstructed errors caused at each layer. Based on the proved theorem, we propose an algorithm to quantize a deep neural network layer by layer with an additional weights update step to minimize the final error. Extensive experiments on benchmark deep models are conducted to demonstrate the effectiveness of our proposed method using 1% of CIFAR10 and ImageNet datasets. Codes are available in: https://github. com/csyhhu/L-DNQ", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:_kc_bZDykSQC"}, {"title": "Transferable interactive memory network for domain adaptation in fine-grained opinion extraction", "description": "In fine-grained opinion mining, aspect and opinion terms extraction has become a fundamental task that provides key information for user-generated texts. Despite its importance, a lack of annotated resources in many domains impede the ability to train a precise model. Very few attempts have applied unsupervised domain adaptation methods to transfer fine-grained knowledge (in the word level) from some labeled source domain (s) to any unlabeled target domain. Existing methods depend on the construction of “pivot” knowledge, eg, common opinion terms or syntactic relations between aspect and opinion words. In this work, we propose an interactive memory network that consists of local and global memory units. The model could exploit both local and global memory interactions to capture intra-correlations among aspect words or opinion words themselves, as well as the interconnections between aspect and opinion words. The source space and the target space are aligned through these domaininvariant interactions by incorporating an auxiliary task and domain adversarial networks. The proposed model does not require any external resources and demonstrates promising results on 3 benchmark datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:M3ejUd6NZC8C"}, {"title": "Cooperative Pruning in Cross-Domain Deep Neural Network Compression.", "description": "The advancement of deep models poses great challenges to real-world deployment because of the limited computational ability and storage space on edge devices. To solve this problem, existing works have made progress to compress deep models by pruning or quantization. However, most existing methods rely on a large amount of training data and a pre-trained model in the same domain. When only limited in-domain training data is available, these methods fail to perform well. This prompts the idea of transferring knowledge from a resource-rich source domain to a target domain with limited data to perform model compression. In this paper, we propose a method to perform cross-domain pruning by cooperatively training in both domains: taking advantage of data and a pre-trained model from the source domain to assist pruning in the target domain. Specifically, source and target pruned models are trained simultaneously and interactively, with source information transferred through the construction of a cooperative pruning mask. Our method significantly improves pruning quality in the target domain, and shed light to model compression in the cross-domain setting. Codes are available at https://github. com/csyhhu/Co-Prune.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:qxL8FJ1GzNcC"}], "2017": [{"title": "Multi-task coupled attentions for category-specific aspect and opinion terms co-extraction", "description": "In aspect-based sentiment analysis, most existing methods either focus on aspect/opinion terms extraction or aspect terms categorization. However, each task by itself only provides partial information to end users. To generate more detailed and structured opinion analysis, we propose a finer-grained problem, which we call category-specific aspect and opinion terms extraction. This problem involves the identification of aspect and opinion terms within each sentence, as well as the categorization of the identified terms. To this end, we propose an end-to-end multitask attention model, where each task corresponds to aspect/opinion terms extraction for a specific category. Our model benefits from exploring the commonalities and relationships among different tasks to address the data sparsity issue. We demonstrate its state-of-the-art performance on three benchmark datasets.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:3fE2CSJIrl8C"}], "2022": [{"title": "Domain confused contrastive learning for unsupervised domain adaptation", "description": "In this work, we study Unsupervised Domain Adaptation (UDA) in a challenging self-supervised approach. One of the difficulties is how to learn task discrimination in the absence of target labels. Unlike previous literature which directly aligns cross-domain distributions or leverages reverse gradient, we propose Domain Confused Contrastive Learning (DCCL) to bridge the source and the target domains via domain puzzles, and retain discriminative representations after adaptation. Technically, DCCL searches for a most domain-challenging direction and exquisitely crafts domain confused augmentations as positive pairs, then it contrastively encourages the model to pull representations towards the other domain, thus learning more stable and effective domain invariances. We also investigate whether contrastive learning necessarily helps with UDA when performing other data augmentations. Extensive experiments demonstrate that DCCL significantly outperforms baselines.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:HDshCWvjkbEC", "topics": "Unsupervised Domain Adaptation, Contrastive Learning"}, {"title": "Towards Multi-Modal Sarcasm Detection via Hierarchical Congruity Modeling with Knowledge Enhancement", "description": "Sarcasm is a linguistic phenomenon indicating a discrepancy between literal meanings and implied intentions. Due to its sophisticated nature, it is usually challenging to be detected from the text itself. As a result, multi-modal sarcasm detection has received more attention in both academia and industries. However, most existing techniques only modeled the atomic-level inconsistencies between the text input and its accompanying image, ignoring more complex compositions for both modalities. Moreover, they neglected the rich information contained in external knowledge, e.g., image captions. In this paper, we propose a novel hierarchical framework for sarcasm detection by exploring both the atomic-level congruity based on multi-head cross attention mechanism and the composition-level congruity based on graph neural networks, where a post with low congruity can be identified as sarcasm. In addition, we exploit the effect of various knowledge resources for sarcasm detection. Evaluation results on a public multi-modal sarcasm detection dataset based on Twitter demonstrate the superiority of our proposed model.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:TQgYirikUcIC", "topics": "Multi-Modal Sarcasm Detection, Hierarchical Congruity Modeling, Knowledge Enhancement"}, {"title": "Deep inductive logic reasoning for multi-hop reading comprehension", "description": "Multi-hop reading comprehension requires an ability to reason across multiple documents. On the one hand, deep learning approaches only implicitly encode query-related information into distributed embeddings which fail to uncover the discrete relational reasoning process to infer the correct answer. On the other hand, logic-based approaches provide interpretable rules to infer the target answer, but mostly work on structured data where entities and relations are well-defined. In this paper, we propose a deep-learning based inductive logic reasoning method that firstly extracts query-related (candidate-related) information, and then conducts logic reasoning among the filtered information by inducing feasible rules that entail the target relation. The reasoning process is accomplished via attentive memories with novel differentiable logic operators. To demonstrate the effectiveness of our model, we evaluate it on two reading comprehension datasets, namely WikiHop and MedHop.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:mB3voiENLucC", "topics": "Deep Learning, Inductive Logic Reasoning, Reading Comprehension"}, {"title": "Progressive Multigranularity Information Propagation for Coupled Aspect-Opinion Extraction", "description": "Coupled aspect-opinion extraction aims to identify aspect-opinion pairs in the form of (aspect term, opinion term) or triplets in the form of (aspect term, opinion term, sentiment polarity) from user-generated texts. Compared to the traditional aspect-based sentiment prediction or extraction tasks, coupled aspect-opinion extraction needs to associate aspects with their corresponding opinions and organize opinion-related information into structured outputs. The existing works either divide this task into subproblems (i.e., term extraction and relation prediction) or utilize a unified tagging scheme. However, these methods only focus on atomic word-level interactions and ignore the intensive information propagation among different granularities (e.g., words and word pairs). To address this limitation, we propose a progressive multigranularity information propagation network that progressively explores three types of …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&cstart=20&pagesize=80&citation_for_view=eOKISncAAAAJ:e5wmG9Sq2KIC", "topics": "Information Extraction, Natural Language Processing"}], "2021": [{"title": "Weakly supervised domain adaptation for aspect extraction via multilevel interaction transfer", "description": "Fine-grained aspect term extraction is an essential subtask in aspect-based opinion analysis. It aims to identify the aspect terms (also known as opinion targets) of a product or service in each sentence. To learn a good aspect extraction model, an expensive annotation process is usually involved to acquire sufficient token-level labels for each domain, which is not realistic. To address this limitation, some previous works propose domain adaptation strategies to transfer knowledge from a sufficiently labeled source domain to unlabeled target domains. However, due to both the difficulty of fine-grained prediction problems and the large domain gap between different domains, the performance is still far from satisfactory. In this work, we conduct a pioneer study on leveraging sentence-level aspect category labels that can be usually available in commercial services, such as review sites or social media to promote token …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:mVmsd5A6BfQC"}, {"title": "Variational deep logic network for joint inference of entities and relations", "description": "Currently, deep learning models have been widely adopted and achieved promising results on various application domains. Despite their intriguing performance, most deep learning models function as black boxes, lacking explicit reasoning capabilities and explanations, which are usually essential for complex problems. Take joint inference in information extraction as an example. This task requires the identification of multiple structured knowledge from texts, which is inter-correlated, including entities, events, and the relationships between them. Various deep neural networks have been proposed to jointly perform entity extraction and relation prediction, which only propagate information implicitly via representation learning. However, they fail to encode the intensive correlations between entity types and relations to enforce their coexistence. On the other hand, some approaches adopt rules to explicitly …", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:hFOr9nPyWt4C"}], "2023": [{"title": "Elaboration-generating commonsense question answering at scale", "description": "In question answering requiring common sense, language models (e.g., GPT-3) have been used to generate text expressing background knowledge that helps improve performance. Yet the cost of working with such models is very high; in this work, we finetune smaller language models to generate useful intermediate context, referred to here as elaborations. Our framework alternates between updating two language models -- an elaboration generator and an answer predictor -- allowing each to influence the other. Using less than 0.5% of the parameters of GPT-3, our model outperforms alternatives with similar sizes and closes the gap on GPT-3 on four commonsense question answering benchmarks. Human evaluations show that the quality of the generated elaborations is high.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:R3hNpaxXUhUC", "topics": "Natural Language Processing, Question Answering"}, {"title": "Vera: A General-Purpose Plausibility Estimation Model for Commonsense Statements", "description": "Despite the much discussed capabilities of today's language models, they are still prone to silly and unexpected commonsense failures. We consider a retrospective verification approach that reflects on the correctness of LM outputs, and introduce Vera, a general-purpose model that estimates the plausibility of declarative statements based on commonsense knowledge. Trained on ~7M commonsense statements created from 19 QA datasets and two large-scale knowledge bases, and with a combination of three training objectives, Vera is a versatile model that effectively separates correct from incorrect statements across diverse commonsense domains. When applied to solving commonsense problems in the verification format, Vera substantially outperforms existing models that can be repurposed for commonsense verification, and it further exhibits generalization capabilities to unseen tasks and provides well-calibrated outputs. We find that Vera excels at filtering LM-generated commonsense knowledge and is useful in detecting erroneous commonsense statements generated by models like ChatGPT in real-world settings.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&citation_for_view=eOKISncAAAAJ:RHpTSmoSYBkC", "topics": "Information Retrieval, Natural Language Processing"}, {"title": "Interpretable Multimodal Misinformation Detection with Logic Reasoning", "description": "Multimodal misinformation on online social platforms is becoming a critical concern due to increasing credibility and easier dissemination brought by multimedia content, compared to traditional text-only information. While existing multimodal detection approaches have achieved high performance, the lack of interpretability hinders these systems' reliability and practical deployment. Inspired by NeuralSymbolic AI which combines the learning ability of neural networks with the explainability of symbolic learning, we propose a novel logic-based neural model for multimodal misinformation detection which integrates interpretable logic clauses to express the reasoning process of the target task. To make learning effective, we parameterize symbolic logical elements using neural representations, which facilitate the automatic generation and evaluation of meaningful logic clauses. Additionally, to make our framework generalizable across diverse misinformation sources, we introduce five meta-predicates that can be instantiated with different correlations. Results on three public datasets (Twitter, Weibo, and Sarcasm) demonstrate the feasibility and versatility of our model.", "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=eOKISncAAAAJ&cstart=20&pagesize=80&citation_for_view=eOKISncAAAAJ:_Qo2XoVZTnwC", "topics": "Logic Reasoning, Neural Networks, Multimodal Misinformation Detection"}]}