{"full_name": "Yu Han", "designation": "Nanyang Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Yu Han", "email": "han.yu@ntu.edu.sg", "image_path": "./profile_img/yu_han.jpg", "keywords": ["Computational Intelligence", "Information Sciences and Systems", "Parallel and Distributed Computing", "Artificial and Augmented Intelligence", "Graphics and Interactive Computing"], "biography": "Dr Han Yu is a Nanyang Assistant Professor (NAP) in the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. He has been a Visiting Scholar at the Department of Computer Science and Engineering, Hong Kong University of Science and Technology (HKUST) from 2017 to 2018. Between 2015 and 2018, he held the prestigious Lee Kuan Yew Post-Doctoral Fellowship (LKY PDF) at the Joint NTU-UBC Research Centre of Excellence in Active Living for the Elderly (LILY). Before joining NTU, he worked as an Embedded Software Engineer at Hewlett-Packard (HP) Pte Ltd, Singapore. He obtained his PhD from the School of Computer Science and Engineering, NTU in 2014. During his PhD study, he held the prestigious Singapore Millennium Foundation (SMF) PhD Scholarship. His research focuses on online convex optimization, ethical AI, federated machine learning and their applications in complex collaborative systems such as crowdsourcing. He has published over 150 research papers in book chapters, leading international conferences and journals including AAAI, IJCAI, CVPR, SIGIR, ASE, ACM MM, CIKM, AAMAS, NAACL, ICME and ACM/IEEE Transactions. He co-authored the book \"Federated Learning\" - the first monograph on the topic of federated learning. His research work has been recognized with 25 awards from conferences and journals. He is an Associate Editor of IEEE TNNLS. He is a founding Co-PI of the Trustworthy Federated Ubiquitous Learning (TrustFUL) Research Lab (https://trustful.federated-learning.org/).", "interests": "Crowdsourcing and Human ComputationEthical Artificial Intelligence (AI)Federated LearningTrust and Reputation Management", "grants": "AI-Powered Crowd-computingNext-Generation Brain-Computer-Brain Platform – A Holistic Solution for the Restoration & Enhancement of Brain Functions (NOURISH)Towards Real-time, Seamless, and Ubiquitous Edge Intelligence-empowered MetaverseTrustFUL: Trustworthy Federated Ubiquitous LearningTrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)TrustFUL: Trustworthy Federated Ubiquitous Learning (WeBank)", "articles": ["Liu, R. W., Liang, M., Nie, J., Yuan, Y., Xiong, Z., Yu, H. & Guizani, N. STMGCN: Mobile edge computing-empowered vessel trajectory prediction using spatio-temporal multi-graph convolutional network. IEEE Transactions on Industrial Informatics, doi:10.1109/TII.2022.3165886, IEEE (2022).", "Tan, A. Z., Yu, H., Cui, L. & Yang, Q. Towards personalized federated learning. IEEE Transactions on Neural Networks and Learning Systems, doi:10.1109/TNNLS.2022.3160699, IEEE (2022).", "Chen, C., Lyu, L., Yu, H. & Chen, G. Practical attribute reconstruction attack against federated learning. IEEE Transactions on Big Data, doi:10.1109/TBDATA.2022.3159236, IEEE (2022).", "Liu, R. W., Guo, Y., Nie, J., Hu, Q., Xiong, Z., Yu, H. & Guizani, M. Intelligent edge-enabled efficient multi-source data fusion for autonomous surface vehicles in maritime Internet of Things. IEEE Transactions on Green Communications and Networking, doi:10.1109/TGCN.2022.3158004, IEEE (2022).", "Liu, Z., Chen, Y., Yu, H., Liu, Y. & Cui, L. GTG-Shapley: Efficient and accurate participant contribution evaluation in federated learning. ACM Transactions on Intelligent Systems and Technology, doi:10.1145/3501811, ACM (2022).", "Guo, X., Yu, H., Li, B., Wang, H., Xing, P., Feng, S., Nie, Z. & Miao, C. Federated learning for personalized humor recognition. ACM Transactions on Intelligent Systems and Technology 13(4), 68:1-68:18, ACM (2022).", "Zhang, Y., Wang, J., Chen, Y., Yu, H. & Qin, T. Adaptive memory networks with self-supervised learning for unsupervised anomaly detection. IEEE Transactions on Knowledge and Data Engineering, doi:10.1109/TKDE.2021.3139916, IEEE (2022).", "Hu, C., Chen, Y., Hu, L., Yu, H. & Lu, D. Disagreement-based class incremental random forest for sensor-based activity recognition. Knowledge-Based Systems 239, doi:10.1016/j.knosys.2021.108044, Elsevier (2022).", "Liu, Y., Huang, A., Luo, Y., Huang, H., Liu, Y., Chen, Y., Feng, L., Chen, T., Yu, H. & Yang, Q. Federated learning-powered visual object detection for safety monitoring. AI Magazine 42(2), 19-27, AAAI Press (2021).", "Zheng, Y., Yu, H., Shi, Y., Zhang, K., Zhen, S., Cui, L., Leung, C. & Miao, C. Optimizing smart grid operations from the demand side. AI Magazine 42(2), 28-37, AAAI Press (2021).", "Zeng, A., Yu, H., Da, Q., Zhan, Y., Yu, Y., Zhou, J. & Miao, C. Improving search engine efficiency through contextual factor selection. AI Magazine 42(2), 50-58, AAAI Press (2021).", "Guo, S., Zhang, T., Xu, G., Yu, H., Xiang, T. & Liu, Y. Byzantine-resilient decentralized stochastic gradient descent. IEEE Transactions on Circuits and Systems for Video Technology, doi:10.1109/TCSVT.2021.3116976, IEEE (2021).", "Liu, Y., Zou, X. & Yu, H. 3R Model: A post-purchase context-aware reputation model to mitigate unfair ratings in e-commerce. Knowledge-Based Systems 231, doi:10.1016/j.knosys.2021.107441, Elsevier (2021).", "Guo, S., Zhang, T., Xu, G., Yu, H., Xiang, T. & Liu, Y. Topology-aware differential privacy for decentralized image classification. IEEE Transactions on Circuits and Systems for Video Technology, doi:10.1109/TCSVT.2021.3105723, IEEE (2021).", "Huzhang, G., Pang, Z.-J., Gao, Y., Liu, Y., Shen, W., Zhou, W.-J., Lin, Q., Da, Q., Zeng, A.-X., Yu, H., Yu, Y. & Zhou, Z.-H. AliExpress Learning-To-Rank: Maximizing online model performance without going online. IEEE Transactions on Knowledge and Data Engineering, doi:10.1109/TKDE.2021.3098898, IEEE (2021).", "Kairouz, P., McMahan, H. B., Avent, B., Bellet, A., Bennis, M., Bhagoji, A. N., Bonawitz, K., Charles, Z., Cormode, G., Cummings, R., D'Oliveira, R. G. L., Rouayheb, S. E., Evans, D., Gardner, J., Garrett, Z., Gascon, A., Ghazi, B., Gibbons, P. B., Gruteser, M., Harchaoui, Z., He, C., He, L., Huo, Z., Hutchinson, B., Hsu, J., Jaggi, M., Javidi, T., Joshi, G., Khodak, M., Konecny, J., Korolova, A., Koushanfar, F., Koyejo, S., Lepoint, T., Liu, Y., Mittal, P., Mohri, M., Nock, R., Ozgur, A., Pagh, R., Raykova, M., Qi, H., Ramage, D., Raskar, R., Song, D., Song, W., Stich, S. U., Sun, Z., Suresh, A. T., Tramer, F., Vepakomma, P., Wang, J., Xiong, L., Xu, Z., Yang, Q., Yu, F. X., Yu, H. & Zhao, S. Advances and open problems in federated learning. Foundations and Trends in Machine Learning 14(1-2), 1-210, Now Publishers (2021).", "Yang, H., Wang, T., Tang, X., Yu, H., Liu, F. & Song, H. Dynamically optimizing display advertising profits under diverse budget settings. IEEE Transactions on Knowledge and Data Engineering, doi:10.1109/TKDE.2021.3077699, IEEE (2021).", "Lei, M., Li, J., Li, M., Zou, L. & Yu, H. An improved UNet++ model for congestive heart failure diagnosis using short-term RR intervals. Diagnostics 11(3), doi:10.3390/diagnostics11030534, MDPI (2021).", "Lei, M., Rao, Z., Wang, H., Chen, Y., Zou, L. & Yu, H. Maceral groups analysis of coal based on sematic segmentation of photomicrographs via the improved U-net. Fuel 294, doi:10.1016/j.fuel.2021.120475, Elsevier (2021).", "Zhou, Q., Lim, F. J., Yu, H., Xu, G., Ren, X., Liu, D., Wang, X., Mai, X. & Xu, H. A study on factors affecting service quality and loyalty intention in mobile banking. Journal of Retailing and Consumer Services 60, doi:10.1016/j.jretconser.2020.102424, Elsevier (2021).", "Yin, X., Huang, J., He, W., Guo, W., Yu, H. & Cui, L. Group task allocation approach for heterogeneous software crowdsourcing tasks. Peer-to-Peer Networking and Applications, doi:10.1007/s12083-020-01000-6, Springer (2020).", "Yi, C., Xu, Y., Yu, H., Yan, Y. & Liu, Y. Multi-component transfer metric learning for handling unrelated source domain samples. Knowledge-Based Systems 203, doi:10.1016/j.knosys.2020.106132, Elsevier (2020).", "Lyu, L., Yu, J., Nandakumar, K., Li, Y., Ma, X., Jin, J., Yu, H. & Ng, K. S. Towards fair and privacy-preserving federated deep models. IEEE Transactions on Parallel and Distributed Systems 31(11), 2524-2541, IEEE (2020).", "Zou, L., Yu, X., Li, M., Lei, M. & Yu, H. Nondestructive identification of coal and gangue via near-infrared spectroscopy based on improved broad learning. IEEE Transactions on Instrumentation and Measurement 69(10), 8043-8052, IEEE (2020).", "Yu, H., Liu, Z., Liu, Y., Chen, T., Cong, M., Weng, X., Niyato, D. & Yang, Q. A sustainable incentive scheme for federated learning. IEEE Intelligent Systems 35(4), 58-69, IEEE (2020).", "Feng, S., Yu, H. & Duarte, M. F. Autoencoder based sample selection for self-taught learning. Knowledge-Based Systems 192, doi:10.1016/j.knosys.2019.105343, Elsevier (2020).", "Wang, J., Chen, Y., Feng, W., Yu, H., Huang, M. & Yang, Q. Transfer learning with dynamic distribution adaptation. ACM Transactions on Intelligent Systems and Technology 11(1), 6:1-6:25, ACM (2020).", "Zheng, Y., Yu, H., Cui, L., Miao, C., Leung, C., Liu, Y. & Yang, Q. Addressing the challenges of government service provision with AI. AI Magazine 41(1), 33-43, AAAI Press (2020).", "Guo, X., Yu, H., Chen, Y. & Miao, C. Weakly supervised neural representation learning through exploiting expert knowledge. International Journal of Information Technology 25(1), 1-9, Singapore Computer Society (2019).", "Chen, Y., Wang, J., Huang, M. & Yu, H. Cross-position activity recognition with stratified transfer learning. Pervasive and Mobile Computing 57, 1-13, Elsevier (2019).", "Wang, T., Yang, H., Yu, H., Zhou, W., Liu, Y. & Song, H. A revenue-maximizing bidding strategy for demand-side platforms. IEEE Access 7(1), 68692-68706, IEEE (2019).", "Yu, H. Ethics and AI: Teaching our machines to tell right from wrong. The IT Society 1, 2-3, Singapore Computer Society (2019).", "Hu, C., Chen, Y., Peng, X., Yu, H., Gao, C. & Hu, L. A novel incremental feature learning method for sensor-based activity recognition. IEEE Transactions on Knowledge and Data Engineering 31(6), 1038-1050, IEEE (2019).", "Wang, W., Zheng, V. W., Yu, H. & Miao, C. A survey of zero-shot learning: Settings, methods and applications. ACM Transactions on Intelligent Systems and Technology 10(2), 13:1-13:19, ACM (2019).", "Jiang, S., Xu, Y., Wang, T., Yang, H., Qiu, S., Yu, H. & Song, H. Multi-label metric transfer learning jointly considering instance space and label space distribution divergence. IEEE Access 7(1), 10362-10373, IEEE (2019).", "Deng, Z., Zhang, J. & Yu, H. A survey of ethics in resource allocation and crowdsourcing. International Journal of Information Technology 24(2), 1-17, Singapore Computer Society (2018).", "Guo, X., Yu, H. & Chen, Y. Building a smart assistant for improving chronic pain management in primary care. International Journal of Information Technology 24(2), 1-16, Singapore Computer Society (2018).", "Miao, C., Zeng, Z., Wu, Q., Yu, H. & Leung, C. Humanized artificial intelligence: What, why and how. International Journal of Information Technology 24(2), 1-21, Singapore Computer Society (2018).", "Chen, Y., Hu, C., Hu, B., Hu, L., Yu, H. & Miao, C. Inferring cognitive abilities from motor patterns. IEEE Transactions on Knowledge and Data Engineering 30(12), 2340-2353, IEEE (2018).", "Lin, J., Yu, H., Pan Z., Shen, Z. & Cui, L. Towards data-driven software engineering skills assessment. International Journal of Crowd Science 2(2), 123-135, Emerald (2018).", "Shen, Z., Yu, H., Yu, L., Miao, C., Chen, Y. & Lesser, V. R. Dynamic generation of Internet of Things organizational structures through evolutionary computing. IEEE Internet of Things Journal 5(2), 943-954, IEEE (2018).", "Yu, H., Miao, C., Leung, C. & White, T. J. Towards AI-powered personalization in MOOC learning. npj Science of Learning 2(15), doi:10.1038/s41539-017-0016-3, Nature Publishing Group (2017).", "Yu, H., Miao, C., Chen, Y., Fauvel, S., Li, X. & Lesser, V. R. Algorithmic management for improving the collective productivity in crowdsourcing. Scientific Reports 7(12541), doi:10.1038/s41598-017-12757-x, Nature Publishing Group (2017).", "Cui, L., Zhao, X., Liu, L., Yu, H. & Miao, Y. Complex crowdsourcing task allocation strategies employing supervised and reinforcement learning. International Journal of Crowd Science 1(2), 146-160, Emerald (2017).", "Yu, H., Shen, Z., Miao, C., Leung, C., Chen, Y., Fauvel, S., Lin, J., Cui, L., Pan, Z. & Yang, Q. A dataset of human decision-making in teamwork management. Scientific Data 4(160127), doi:10.1038/sdata.2016.127, Nature Publishing Group (2017).", "Mei, J.-P., Yu, H., Shen, Z. & Miao, C. A social influence based trust model for recommender systems. Intelligent Data Analysis 22(2), IOS Press (2017).", "Yu, H., Miao, C., Leung, C., Chen, Y., Fauvel, S., Lesser, V. R. & Yang, Q. Mitigating herding in hierarchical crowdsourcing networks. Scientific Reports 6(4), doi:10.1038/s41598-016-0011-6, Nature Publishing Group (2016).", "Zhang, W., Shi, Y., Liu, L., Zhang, S., Zheng, Y., Cui, L. & Yu, H. CTP: A scheduling strategy to smooth response time fluctuations in multi-tier website system. Microprocessors and Microsystems 47(A), 198-208, Elsevier (2016).", "Shi, Y., Zhang, K., Cui, L., Liu, L., Zheng, Y., Zhang, S. & Yu, H. MapReduce short jobs optimization based on resource reuse. Microprocessors and Microsystems 47(A), 178-187, Elsevier (2016).", "Miao, C. Yu, H., Shen, Z. & Leung, C. Balancing quality and budget considerations in mobile crowdsourcing. Decision Support Systems 90, 56-64, Elsevier (2016).", "Lin, J., Yu, H. & Shen, Z. Using Goal Net to model user stories in agile software development. International Journal of Information Technology 21(2), 1-17, Singapore Computer Society (2015).", "Yu, H., Shen, Z., Miao, C., An, B. & Leung, C. Filtering trust opinions through reinforcement learning. Decision Support Systems 66, 102-113, Elsevier (2014).", "Yu, H., Shen, Z., Leung, C., Miao, C. & Lesser, V. R. A survey of multi-agent trust management systems. IEEE Access 1(1), 35-50, IEEE (2013).", "Yu, H., Shen, Z. & Miao, C. Towards health care service ecosystem management for the elderly. International Journal of Information Technology 19(2), 1-16, Singapore Computer Society (2013).", "Ji, J., Yu, H., Li, B., Shen, Z. & Miao, C. Learning Chinese characters with gestures. International Journal of Information Technology 19(1), 1-11, Singapore Computer Society (2013).", "Cheng, P., Yu, H., Shen, Z. & Liu, Z. An interactive 3D product design tool for mobile pre-commerce environments. International Journal of Information Technology 18(2), 1-9, Singapore Computer Society (2012).", "Leung, C., Miao, C., Yu, H. & Helander, M. Towards an ageless computing ecosystem. International Journal of Information Technology 18(1), 1-20, Singapore Computer Society (2012).", "Shen, Z., Yu, H., Miao, C. & Weng, J. Trust-based web-service selection in virtual communities. Web Intelligence and Agent Systems 9(3), 227-238, IOS Press (2011).", "Pan, L, Meng, M., Shen, Z. & Yu, H. A reputation-based trust aware web service interaction pattern for manufacturing grids. International Journal of Information Technology 17(1), 1-8, Singapore Computer Society (2011).", "Yu, H., Shen, Z., Miao, C., Leung, C. & Niyato, D. A survey of trust and reputation management systems in wireless communications. Proceedings of the IEEE 98(10), 1755-1772, IEEE (2010).", "Yu, H., Shen, Z. & Leung, C. Towards trust-aware health monitoring body area sensor networks. International Journal of Information Technology 16(2), 1-20, Singapore Computer Society (2010). (Best Student Paper Award)", "Qin, T., Yu, H., Leung, C., Shen, Z. & Miao, C. Towards a trust aware cognitive radio architecture. ACM SIGMOBILE Mobile Computing and Communications Review 13(2), 86-95, ACM (2009).", "Yu, H., Shen, Z. & Miao, C. A goal oriented development tool to automate the incorporation of intelligent agents into interactive digital media applications. ACM Computers in Entertainment 6(2), 24:1-24:15, ACM (2008)."], "books": ["杨强、刘洋、程勇、 康炎、陈天健、于涵 《联邦学习》 电子工业出版社，p. 208，2020.", "Yang, Q., Liu, Y., Cheng, Y., Kang, Y., Chen, T. & Yu, H. (2019). Federated Learning. Morgan & Claypool Publishers, San Rafael, CA, USA, p. 207."], "book_chapters": ["Chen, Y., Wang, X., Qin, X., Yu, H., Chen, B. & Shen, Z. (2020). Dealing with Label Quality Disparity in Federated Learning. In: Yang, Q., Fan, L. & Yu, H. (Eds.). Federated Learning: Privacy and Incentive, pp. 106-120. Springer International Publishing, Switzerland.", "Liu, Y., Ai, Z., Sun, S., Zhang, S., Liu, Z. & Yu, H. (2020). FedCoin: A Peer-to-Peer Payment System for Federated Learning. In: Yang, Q., Fan, L. & Yu, H. (Eds.). Federated Learning: Privacy and Incentive, pp. 121-134. Springer International Publishing, Switzerland.", "Chen, Z., Liu, Z., Ng, K. L., Yu, H., Liu, Y. & Yang, Q. (2020). A Gamified Research Tool for Incentive Mechanism Design in Federated Learning. In: Yang, Q., Fan, L. & Yu, H. (Eds.). Federated Learning: Privacy and Incentive, pp. 164-171. Springer International Publishing, Switzerland.", "Lyu, L., Xu, X., Wang, Q. & Yu, H. (2020). Collaborative Fairness in Federated Learning. In: Yang, Q., Fan, L. & Yu, H. (Eds.). Federated Learning: Privacy and Incentive, pp. 185-199. Springer International Publishing, Switzerland.", "Cong, M., Yu, H., Weng, X. & Yiu, S.-M. (2020). A Game-Theoretic Framework for Incentive Mechanism Design in Federated Learning. In: Yang, Q., Fan, L. & Yu, H. (Eds.). Federated Learning: Privacy and Incentive, pp. 200-217. Springer International Publishing, Switzerland.", "Yu, H., Weng, J., Ong, Y. S. & Cong, G. (2020). Data Management. In: Chellam, R. (Ed.). The AI Ethics & Governance Body of Knowledge (AI E&G BoK), Singapore Computer Society.", "Yu, H., Miao, C., An, B., Shen, Z. & Leung, C. (2018). Making Efficient Reputation-aware Decisions in Multi-agent Systems. In: Hao, J. & Leung, H.-F. (Eds.). Interactions in Multiagent Systems, pp. 43-64. World Scientific, Singapore.", "Tao, X., Shen, Z., Miao, C., Theng, Y. L., Miao, Y. & Yu, H. (2010). Automated Negotiation through a Cooperative-Competitive Model. In: Ito, T., Zhang, M., Robu, V., Fatima, S., Matsuo, T. & Yamaki, H. (Eds.). Innovations in Agent-Based Complex Automated Negotiations. Studies in Computational Intelligence, vol. 319, pp. 161-178. Springer, Berlin, Heidelberg."], "conferences": ["S. Zeng, Z. Li, H. Yu, Y. He, Z. Xu, D. Niyato & H. Yu, \"Heterogeneous Federated Learning via Grouped Sequential-to-Parallel Training,\" in Proceedings of the 27th International Conference on Database Systems for Advanced Applications (DASFAA-22), 2022.", "J. Zhang & H. Yu, \"A Methodological Framework for Facilitating Explainable AI Design,\" in Proceedings of the 14th International Conference on Social Computing and Social Media (SCSM'22), 2022.", "Y. Loh, Z. Chen, Y. Zhao & H. Yu, \"FLAS: A Platform for Studying Attacks on Federated Learning,\" in Proceedings of the 14th International Conference on Social Computing and Social Media (SCSM'22), 2022.", "Z. Liu, Y. Chen, Y. Zhao, H. Yu, Y. Liu, R. Bao, J. Jiang, Z. Nie, Q. Xu & Q. Yang, \"Contribution-Aware Federated Learning for Smart Healthcare,\" in Proceedings of the 34th Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-22), 2022. (Innovative Applications of AI Award)", "X. Guo, S. Wang, H. Zhao, S. Diao, J. Chen, Z. Ding, Z. He, Y. Xiao, B. Long, H. Yu & L. Wu, \"Intelligent Online Selling Point Extraction for E-Commerce Recommendation,\" in Proceedings of the 34th Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-22), 2022. (Innovative Applications of AI Award)", "X. Zhang, Y. Zou, H. Zhang, J. Zhou, S. Diao, J. Chen, Z. Ding, Z. He, X. He, Y. Xiao, B. Long, H. Yu & L. Wu, \"Automatic Product Copywriting for E-Commerce,\" in Proceedings of the 34th Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-22), 2022. (Innovative Applications of AI Award)", "H.-Y. Li, Y. Ni, A. Zeng, H. Yu & C. Miao, \"Prior-Guided Transfer Learning for Enhancing Item Representation in E-commerce,\" in Proceedings of the 34th Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-22), 2022. (Innovative Applications of AI Award)", "D. Feng, C. Helena, W. Y. B. Lim, J. S. Ng, H. Jiang, Z. Xiong, J. Kang, H. Yu, D. Niyato & C. Miao, \"CrowdFL: A Marketplace for Crowdsourced Federated Learning,\" in Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI-22), 2022.", "X. R. Z. Ho, W. Y. B. Lim, H. Jiang, J. S. Ng, H. Yu, Z. Xiong, D. Niyato & C. Miao, \"Dynamic Incentive Mechanism Design for COVID-19 Social Distancing,\" in Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI-22), 2022.", "H. Yang, T. Wang, X. Tang, Q. Li, Y. Shi, S. Jiang, H. Yu & H. Song, \"Multi-task Learning for Bias-Free Joint CTR Prediction and Market Price Modeling in Online Advertising,\" in Proceedings of the 30th ACM International Conference on Information and Knowledge Management (CIKM'21), pp. 2291-2300, 2021.", "H. Z. C. Teng, H. Jiang, X. R. Z. Ho, W. Y. B. Lim, J. S. Ng, H. Yu, Z. Xiong, D. Niyato & C. Miao, \"Predictive Analytics for COVID-19 Social Distancing,\" in Proceedings of the 30th International Joint Conference on Artificial Intelligence (IJCAI'21), pp. 5016-5019, 2021.", "P. S. Kyaw & H. Yu, \"Personalised Federated Learning: A Combinational Approach,\" in Proceedings of the 1st International Student Conference on Artificial Intelligence (STCAI'21), 2021. (Best Paper Award)", "Y. Shu, J. Zhang & H. Yu, \"Fairness in Design: A Tool for Guidance in Artificial Intelligence Design,\" in Proceedings of the 13th International Conference on Social Computing and Social Media (SCSM'21), pp. 500-510, 2021.", "J. Zhang, Y. Shu & H. Yu, \"Human-Machine Interaction for Autonomous Vehicles: A Review,\" in Proceedings of the 13th International Conference on Social Computing and Social Media (SCSM'21), pp. 190-201, 2021.", "X. Cao, Y. Shi, H. Yu, J. Wang, X. Wang, Z. Yan & Z. Chen, \"DEKR: Description Enhanced Knowledge Graph for Machine Learning Method Recommendation,\" in Proceedings of the 44th ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR'21), pp. 203-212, 2021.", "C. Liu, H. Yu, Z. Shen, I. Dixon, Y. Yu, Z. Gao, P. Wang, P. Ren, X. Xie, L. Cui & C. Miao, \"Enhancing Viewing Experience of Generated Visual Storylines for Promotional Videos,\" in Proceedings of the 2021 IEEE International Conference on Multimedia and Expo (ICME'21), doi:10.1109/ICME51207.2021.9428292, 2021.", "C. Liu, H. Yu, B. Li, Z. Shen, Z. Gao, P. Ren, X. Xie, L. Cui & C. Miao, \"Noise-resistant Deep Metric Learning with Ranking-based Instance Selection,\" in Proceedings of the 2021 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR'21), pp. 6811-6820, 2021. (PREMIA Best Student Paper Runners Up Award)", "X. Guo, B. Li, H. Yu & C. Miao, \"Latent-Optimized Adversarial Neural Transfer for Sarcasm Detection,\" in Proceedings of the 2021 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL-HLT'21), pp. 5394-5407, 2021. (PREMIA Best Presentation Award)", "Y. Chen, B. Li, H. Yu, P. Wu & C. Miao, \"HyDRA: Hypergradient Data Relevance Analysis for Interpreting Deep Neural Networks,\" in Proceedings of the 35th AAAI Conference on Artificial Intelligence (AAAI-21), pp. 7081-7089, 2021.", "H. Jiang, W. Y. B. Lim, J. S. Ng, H. Z. C. Teng, H. Yu, Z. Xiong, D. Niyato & C. Miao, \"AI-Empowered Decision Support for COVID-19 Social Distancing,\" in Proceedings of the 35th AAAI Conference on Artificial Intelligence (AAAI-21), pp. 16044-16047, 2021.", "A. Zeng, H. Yu, H. He, Y. Ni, Y. Li, J. Zhou & C. Miao, \"Enhancing E-commerce Recommender System Adaptability with Online Deep Controllable Learning-To-Rank,\" in Proceedings of the 33rd Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-21), pp. 15214-15222, 2021. (Innovative Applications of AI Award)", "Q. Meng, L. Cui, G. Yu, H. Yu, W. Guo & H. Li, \"CLUE: Personalized Hospital Readmission Prediction Against Data Insufficiency under Imbalanced-Data Environment,\" in Proceedings of the 2020 International Conference on Bioinformatics and Biomedicine (BIBM'20), pp. 469-472, 2020.", "K. L. Ng, Z. Chen, Z. Liu, H. Yu, Y. Liu & Q. Yang, \"A Multi-player Game for Studying Federated Learning Incentive Schemes,\" in Proceedings of the 29th International Joint Conference on Artificial Intelligence (IJCAI'20), pp. 5179-5281, 2020.", "H. J. Y. Wong, Z. Deng, H. Yu, J. Huang, C. Leung & C. Miao, \"A Testbed for Studying COVID-19 Spreading in Ride-Sharing Systems,\" in Proceedings of the 29th International Joint Conference on Artificial Intelligence (IJCAI'20), pp. 5294-5296, 2020.", "C. Liu, Z. Y. Lim, H. Yu, Z. Shen, I. Dixon, Z. Gao, P. Wang, P. Ren, X. Xie, L. Cui & C. Miao, \"An AI-empowered Visual Storyline Generator,\" in Proceedings of the 29th International Joint Conference on Artificial Intelligence (IJCAI'20), pp. 5267-5269, 2020.", "C. Liu, H. Yu, Y. Dong, Z. Shen, Y. Yu, I. Dixon, Z. Gao, P. Wang, P. Ren, X. Xie, L. Cui & C. Miao, \"Generating Engaging Promotional Videos for E-commerce Platforms,\" in Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI-20), pp. 13865-13866, 2020.", "Z. Deng, A. Tu, Z. Liu & H. Yu, \"Efficient Spatial-Temporal Rebalancing of Shareable Bikes,\" in Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI-20), pp. 13775-13776, 2020.", "A. Zeng, H. Yu, Q. Da, Y. Zhan & C. Miao, \"Accelerating Ranking in E-Commerce Search Engines through Contextual Factor Selection,\" in Proceedings of the 32nd Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-20), pp. 13212-13219, 2020. (Innovative Applications of AI Award)", "Y. Zheng, H. Yu, Y. Shi, K. Zhang, S. Zhen, L. Cui, C. Leung & C. Miao, \"PIDS: An Intelligent Electric Power Management Platform,\" in Proceedings of the 32nd Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-20), pp. 13220-13227, 2020. (Innovative Applications of AI Award)", "Y. Liu, A. Huang, Y. Luo, H. Huang, Y. Liu, Y. Chen, L. Feng, T. Chen, H. Yu & Q. Yang, \"FedVision: An Online Visual Object Detection Platform powered by Federated Learning,\" in Proceedings of the 32nd Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-20), pp. 13172-13179, 2020. (Innovative Applications of AI Award)", "H. Yu, Z. Liu, Y. Liu, T. Chen, M. Cong, X. Weng, D. Niyato & Q. Yang, \"A Fairness-aware Incentive Mechanism for Federated Learning,\" in Proceedings of the 3rd AAAI/ACM Conference on Artificial Intelligence, Ethics, and Society (AIES-20), pp. 393-399, 2020.", "D. Gao, Y. Liu, A. Huang, C. Jiu, H. Yu & Q. Yang, \"Privacy-preserving Heterogeneous Federated Transfer Learning,\" in Proceedings of the 2019 IEEE International Conference on Big Data (IEEE BigData'19), pp. 2552-2559, 2019.", "Y. Dong, C. Liu, Z. Shen, Z. Gao, P. Wang, C. Zhang, P. Ren, X. Xie, H. Yu & Q. Huang, \"Domain Specific and Idiom Adaptive Video Summarization,\" in Proceedings of the 1st ACM International Conference on Multimedia in Asia (MM Asia'19), pp. 49:1-49:6, 2019.", "C. Liu, Y. Dong, H. Yu, Z. Shen, Z. Gao, P. Wang, C. Zhang, P. Ren, X. Xie, L. Cui & C. Miao, \"Generating Persuasive Visual Storylines for Promotional Videos,\" in Proceedings of the 28th ACM International Conference on Information and Knowledge Management (CIKM'19), pp. 901-910, 2019.", "T. Wang, J. Zhao, H. Yu, J. Liu, X. Yang, X. Ren & S. Shi, \"Privacy-preserving Crowd-guided AI Decision-making in Ethical Dilemmas,\" in Proceedings of the 28th ACM International Conference on Information and Knowledge Management (CIKM'19), pp. 1311-1320, 2019.", "Y. Dong, C. Liu, Z. Shen, Z. Gao, P. Wang, C. Zhang, P. Ren, X. Xie & H. Yu, \"Personalized Video Summarization with Idiom Adaptation,\" in Proceedings of the 27th ACM Multimedia Conference (ACM MM'19), pp. 1041-1043, 2019.", "J. W. Kong, Y. Xu & H. Yu, \"Deep Transfer Learning for Abnormality Detection,\" in Proceedings of the 4th International Conference on Crowd Science and Engineering (ICCSE'19), 2019.", "H. Yu, Y. Liu, X. Wei, C. Zheng, T. Chen, Q. Yang & X. Peng, \"Fair and Explainable Dynamic Engagement of Crowd Workers,\" in Proceedings of the 28th International Joint Conference on Artificial Intelligence (IJCAI'19), pp. 6575-6577, 2019. (Innovation Award)", "X. Wei, Q. Li, Y. Liu, H. Yu, T. Chen & Q. Yang, \"Multi-Agent Visualization for Explaining Federated Learning,\" in Proceedings of the 28th International Joint Conference on Artificial Intelligence (IJCAI'19), pp. 6572-6574, 2019.", "A. Zeng, H. Yu, X. Gao, K. Ou, Z. Huang, P. Hou, M. Song, C. Miao & J. Zhang, \"An Online Intelligent Live Interaction System,\" in Proceedings of the 28th International Joint Conference on Artificial Intelligence (IJCAI'19), pp. 6578-6580, 2019.", "Y. Zheng, H. Yu, K. Zhang, Y. Shi, C. Leung & C. Miao, \"Intelligent Decision Support for Improving Power Management,\" in Proceedings of the 28th International Joint Conference on Artificial Intelligence (IJCAI'19), pp. 6587-6589, 2019.", "X. Guo, H. Yu, C. Miao & Y. Chen, \"Agent-based Decision Support for Pain Management in Primary Care Settings,\" in Proceedings of the 28th International Joint Conference on Artificial Intelligence (IJCAI'19), pp. 6521-6523, 2019.", "Q. Li, H. Lin, X. Wei, Y. Liu, R. Lin, H. Yu, T. Chen & Q. Yang, \"Learning Federated Learning,\" the 28th International Joint Conference on Artificial Intelligence (IJCAI'19), 2019. (Most Educational Video Award)", "J. Wang, Y. Chen, H. Yu, M. Huang & Q. Yang, \"Easy Transfer Learning by Exploiting Intra-domain Structures,\" in Proceedings of the 2019 IEEE International Conference on Multimedia and Expo (ICME'19), doi:10.1109/ICME.2019.00211, 2019.", "Z. Liu, H. Yu, L. Wang, L. Hu & Q. Yang, \"Social Mobilization to Reposition Indiscriminately Parked Shareable Bikes,\" in Proceedings of the 18th International Conference on Autonomous Agents and Multi-agent Systems (AAMAS'19), pp. 2099-2101, 2019.", "H. Yu, Z. Shen, L. Cui, Y. Zheng & V. R. Lesser, \"Ethically Aligned Sacrifice Coordination to Enhance Social Welfare in Multi-agent Systems,\" in Proceedings of the 18th International Conference on Autonomous Agents and Multi-agent Systems (AAMAS'19), pp. 2300-2302, 2019.", "Z. Liu, H. Yu, L. Wang, L. Hu & Q. Yang, \"Ethically Aligned Mobilization of Community Effort to Reposition Shared Bikes,\" in Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI-19), pp. 9983-9984, 2019.", "H. Yu, C. Miao, Y. Zheng, L. Cui, S. Fauvel & C. Leung, \"Ethically Aligned Opportunistic Scheduling for Productive Laziness,\" in Proceedings of the 2nd AAAI/ACM Conference on Artificial Intelligence, Ethics, and Society (AIES-19), pp. 45-51, 2019.", "J. Wang, W. Feng, Y. Chen, H. Yu, M. Huang & P. S. Yu, \"Visual Domain Adaptation with Manifold Embedded Distribution Alignment,\" in Proceedings of the 26th ACM Multimedia Conference (ACM MM'18), pp. 402-410, 2018.", "S. Fauvel, H. Yu, C. Miao, L. Cui, H. Song, L. Zhang, X. Li & C. Leung, \"Artificial Intelligence Powered MOOCs: A Brief Survey,\" in Proceedings of the 3rd IEEE International Conference on Agents (ICA'18), pp. 56-61, 2018.", "C. Miao, Z. Zeng, X. Yu, H. Zhang, H. Yu, Q. Wu, A. H. Tan, D. Wang, B. T. H. Tan, D. W. Q. Ng, C. Leung, Q. Yang & Z. Shen, \"Persuasive AI Companions for Active Independent Ageing,\" the 27th International Joint Conference on Artificial Intelligence (IJCAI'18), 2018. (Most Societally Beneficial Video Award)", "H. Yu, Z. Shen, C. Miao, C. Leung, V. R. Lesser & Q. Yang, \"Building Ethics into Artificial Intelligence,\" in Proceedings of the 27th International Joint Conference on Artificial Intelligence (IJCAI'18), pp. 5527-5533, 2018.", "H. Yu, C. Miao, L. Cui, Y. Chen, S. Fauvel & Q. Yang, \"Opportunistic Work-Rest Scheduling for Productive Aging,\" in Proceedings of the 10th International Conference on Social Computing and Social Media (SCSM'18), pp. 413-428, 2018.", "Y. Dong, H. Hu, Y. Wen, H. Yu & C. Miao, \"Personalized Emotion-aware Video Streaming for the Elderly,\" in Proceedings of the 20th International Conference on Human-Computer Interaction (HCI'18), pp. 372-382, 2018.", "Y. Zheng, H. Yu, L. Cui, C. Miao, C. Leung & Q. Yang, \"SmartHS: An AI Platform for Improving Government Service Provision,\" in Proceedings of the 30th Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-18), pp. 7704-7711, 2018. (Innovative Applications of AI Award)", "H. Zhang, C. Miao & H. Yu, \"Fuzzy Logic based Assessment on the Adaptive Level of Rehabilitation Exergames for the Elderly,\" in Proceedings of the 5th IEEE Global Conference on Signal and Information Processing (GlobalSIP'17), pp. 423-427, 2017.", "H. Yu, Z. Shen, S. Fauvel, L. Cui & C. Miao, \"Efficient Scheduling in Crowdsourcing based on Workers' Mood,\" in Proceedings of the 2nd IEEE International Conference on Agents (ICA'17), pp. 121-126, 2017.", "Y. Dong, H. Hu, H. Yu & L. Zhang, \"Towards Emotion Adaption in Multimedia Caring Services for the Elderly,\" in Proceedings of the 5th International Conference on Ageless Aging (ICAA'17), 2017.", "W. Wang, H. Yu & C. Miao, \"Deep Model for Dropout Prediction in MOOCs,\" in Proceedings of the 2nd International Conference on Crowd Science and Engineering (ICCSE'17), pp. 26-32, 2017.", "L. Cui, X. Zhao, L. Liu, H. Yu & C. Miao, \"Learning Complex Crowdsourcing Task Allocation Strategies from Humans,\" in Proceedings of the 2nd International Conference on Crowd Science and Engineering (ICCSE'17), pp. 33-37, 2017.", "X. Min, Y. Shi, L. Cui, H. Yu & Y. Miao, \"Efficient Crowd-Powered Active Learning for Reliable Review Evaluation,\" in Proceedings of the 2nd International Conference on Crowd Science and Engineering (ICCSE'17), pp. 136-143, 2017. (Best Poster Award)", "H. Zhang, C. Miao, H. Yu & C. Leung, \"A Computational Assessment Model for the Adaptive Level of Rehabilitation Exergames for the Elderly,\" in Proceedings of the 31st AAAI Conference on Artificial Intelligence (AAAI-17), pp. 5021-5022, 2017.", "Z. Pan, H. Yu, C. Miao & C. Leung, \"Crowdsensing Air Quality with Image Analytics and Deep Learning,\" in Proceedings of the 29th AAAI Conference on Innovative Applications of Artificial Intelligence (IAAI-17), pp. 4728-4733, 2017.", "H. Yu, Z. Pan, C. Miao & C. Leung, \"Crowd Computing for Population Aging Challenges,\" in Proceedings of the 1st International Conference on Crowd Science and Engineering (ICCSE'16), 2016.", "J. Lin, H. Yu, Z. Pan, Z. Shen & L. Cui, \"Towards Data-driven Software Engineering Skills Assessment,\" in Proceedings of the 1st International Conference on Crowd Science and Engineering (ICCSE'16), 2016. (Best Paper Award)", "H. Lin, H. Yu, C. Miao & L. Qiu, \"Towards Emotionally Intelligent Machines: Taking Social Context into Account,\" in Proceedings of 8th International Conference on Social Computing and Social Media (SCSM'16), pp. 12-24, 2016. (Best Paper Award)", "H. Yu, \"Algorithmic Crowdsourcing for Productive Aging,\" in Proceedings of the 9th World Congress on Active Ageing (WCAA'16), pp. 11-12, 2016.", "C. Miao, C. Leung, Y. Chen & H. Yu, \"Interactive Games for Active Ageing,\" in Proceedings of the 9th World Congress on Active Ageing (WCAA'16), pp. 11, 2016.", "S. Liu, Z. Shen, H. Yu, H. Lin, Z. Guo, Z. Pan, C. Miao & C. Leung, \"A Kinect-based Interactive Game for Improving the Cognitive Inhibition of the Elderly,\" in Proceedings of the 15th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'16), pp. 1479-1481, 2016.", "C. Sun, Y. Shi, Q. Li, L. Cui, H. Yu & C. Miao, \"A Hybrid Approach for Detecting Fraudulent Medical Insurance Claims,\" in Proceedings of the 15th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'16), pp. 1287-1288, 2016.", "H. Yu, C. Miao, Z. Shen, J. Lin & C. Leung, \"Infusing Human Factors into Algorithmic Crowdsourcing,\" in Proceedings of the 28th AAAI Conference on Innovative Applications of Artificial Intelligence (IAAI-16), pp. 4062-4063, 2016.", "Z. Pan, H. Yu, C. Miao & C. Leung, \"Efficient Collaborative Crowdsourcing,\" in Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI-16), pp. 4248-4249, 2016. (Best Student Poster Award)", "H. Yu, S. Liu, Z. Pan, N. S. B. Khalid, Z. Shen, C. Miao & C. Leung, \"Productive Aging through Intelligent Personalized Crowdsourcing,\" in Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI-16), pp. 4405-4406, 2016.", "Z. Shen, H. Yu, S. Li & C. Miao, \"Multi-Agent System Development MADE Easy,\" in Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI-16), pp. 4391-4392, 2016.", "Y. Shi, C. Sun, Q. Li, L. Cui, H. Yu & C. Miao, \"A Fraud Resilient Medical Insurance Claim System,\" in Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI-16), pp. 4393-4394, 2016.", "Z. Pan, H. Yu, C. Miao, C. Leung, Q. Yang, Z. Shen, Y. Chen, L. Cui, B. Huang, Y. Zhang, D. W. Q. Ng & K. K. Ong, \"Artificial Intelligence for Liveable Cities,\" the 30th AAAI Conference on Artificial Intelligence (AAAI-16), 2016. (Best Video - People's Choice Award)", "S. Liu, C. Miao, Y. Liu, H. Yu, J. Zhang & C. Leung, \"An Incentive Mechanism to Elicit Truthful Opinions for Crowdsourced Multiple Choice Consensus Tasks,\" in Proceedings of the 2015 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'15), pp. 96-103, 2015.", "Z. Pan, C. Miao, B. T. H. Tan, H. Yu & C. Leung, \"Agent Augmented Inter-generational Crowdsourcing,\" in Proceedings of the 2015 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'15), pp. 237-238, 2015. (Best Demo Award)", "Z. Pan, C. Miao, H. Yu, C. Leung & J. J. Chin, \"The Effects of Familiarity in Design on the Adoption of Wellness Games by the Elderly,\" in Proceedings of the 2015 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'15), pp. 387-390, 2015.", "B. Li, H. Yu, Z. Shen, L. Cui & V. R. Lesser, \"An Evolutionary Optimization based Multi-Agent Organization Framework,\" in Proceedings of the 2015 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'15), pp. 35-38, 2015.", "H. Lin, J. Hou, H. Yu, Z. Shen & C. Miao, \"An Agent-based Game Platform for Exercising People's Prospective Memory,\" in Proceedings of the 2015 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'15), pp. 235-236, 2015.", "A. Borjigin, C. Miao, Z. Shen, H. Yu, S. F. Lim, T. H. Tan, Z. Zeng, Y. Guo, S. Fauvel, Y. Qiu, K. H. Pang & J. Ji, \"Goal Oriented Teachable Agent in Virtual Learning Environment,\" the 24th International Joint Conference in Artificial Intelligence (IJCAI'15), 2015. (Best Application Video Award)", "S. Liu, C. Miao, Y. Liu, H. Fang, H. Yu, J. Zhang & C. Leung, \"A Reputation Revision Mechanism for Mitigating the Negative Effect of Misreported Reputation Ratings,\" in Proceedings of the 17th International Conference on Electronic Commerce (ICEC'15), pp. 7:1-7:8, 2015.", "C. Leung, Z. Shen, H. Zhang, Q. Wu, J. C. Leung, K. H. Pang, H. Yu & C. Miao, \"Aging in-Place: From Unobtrusive Sensing to Graceful Aging,\" in Proceedings of the 24th Annual John K. Friesen Conference \"Harnessing Technology for Aging-in-Place\", 2015.", "J. Lin, H. Yu, C. Miao & Z. Shen, \"An Affective Agent for Studying Composite Emotions,\" in Proceedings of the 14th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'15), pp. 1947-1948, 2015.", "H. Yu, C. Miao, Z. Shen & C. Leung, \"Quality and Budget aware Task Allocation for Spatial Crowdsourcing,\" in Proceedings of the 14th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'15), pp. 1689-1690, 2015.", "H. Yu, H. Lin, S. F. Lim, J. Lin, Z. Shen & C. Miao, \"Empirical Analysis of Reputation-aware Task Delegation by Humans from a Multi-Agent Game,\" in Proceedings of the 14th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'15), pp. 1687-1688, 2015.", "H. Yu, C. Miao, Z. Shen, C. Leung, Y. Chen & Q. Yang, \"Efficient Task Sub-delegation for Crowdsourcing,\" in Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI-15), pp. 1305-1311, 2015.", "J.-P. Mei, H. Yu, Y. Liu, Z. Shen & C. Miao, \"A Social Trust Model Considering Trustees' Influence,\" in Proceedings of the 17th International Conference on Principles and Practice of Multi-Agent Systems (PRIMA'14), pp. 357-364, 2014.", "J. Lin, H. Yu, Z. Shen & C. Miao, \"Studying Task Allocation Decisions of Novice Agile Teams with Data from Agile Project Management Tools,\" in Proceedings of the 29th IEEE/ACM International Conference on Automated Software Engineering (ASE'14), pp. 689-694, 2014.", "Y. Liu, S. Liu, H. Fang, J. Zhang, H. Yu & C. Miao, \"RepRev: Mitigating the Negative Effects of Misreported Ratings,\" in Proceedings of the 28th AAAI Conference on Artificial Intelligence (AAAI-14), pp. 3124-3125, 2014.", "Y. Liu, J. Zhang, H. Yu & C. Miao, \"Reputation-aware Continuous Double Auction,\" in Proceedings of the 28th AAAI Conference on Artificial Intelligence (AAAI-14), pp. 3126-3127, 2014.", "J. Lin, H. Yu, Z. Shen & C. Miao, \"Using Goal Net to Model User Stories in Agile Software Development,\" in Proceedings of the 15th IEEE/ACIS International Conference on Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing (SNPD'14), pp. 1-6, 2014.", "Y. Cai, Z. Shen, S. Liu, H. Yu, J. Ji, M. McKeown, C. Leung & C. Miao, \"An Agent-based Game for the Predictive Diagnosis of Parkinson's Disease,\" in Proceedings of the 13th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'14), pp. 1663-1664, 2014.", "H. Yu, X. Yu, S.F. Lim, J. Lin, Z. Shen & C. Miao, \"A Multi-Agent Game for Studying Human Decision-making,\" in Proceedings of the 13th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'14), pp. 1661-1662, 2014.", "H. Yu, C. Miao, B. An, Z. Shen & C. Leung, \"Reputation-aware Task Allocation for Human Trustees,\" in Proceedings of the 13th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'14), pp. 357-364, 2014.", "H. Yu, Z. Shen & C. Leung, \"Bringing Reputation-awareness into Crowdsourcing,\" in Proceedings of the 9th International Conference on Information, Communications and Signal Processing (ICICS'13), pp. 1-5, 2013.", "H. Yu, Z. Shen & C. Leung, \"From Internet of Things to Internet of Agents,\" in Proceedings of the 2013 IEEE International Conference on Internet of Things (iThings'13), pp.1054-1057, 2013.", "H. Yu, C. Miao, B. An, C. Leung & V. R. Lesser, \"A Reputation Management Approach for Resource Constrained Trustee Agents,\" in Proceedings of the 23rd International Joint Conference on Artificial Intelligence (IJCAI'13), pp. 418-424, 2013.", "S. Liu, H. Yu, C. Miao & A. C. Kot, \"A Fuzzy Logic based Reputation Model against Unfair Ratings,\" in Proceedings of the 12th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'13), pp. 821-828, 2013.", "H. Yu, Z. Shen, C. Miao & B. An, \"A Reputation-aware Decision-making Approach for Improving the Efficiency of Crowdsourcing Systems,\" in Proceedings of the 12th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'13), pp. 1315-1316, 2013.", "Q. Wu, X. Han, H. Yu, Z. Shen & C. Miao, \"The Innovative Applications of Learning Companions in Chronicles of Singapura,\" in Proceedings of the 12th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'13), pp. 1171-1172, 2013.", "H. Yu, Z. Shen, C. Miao & B. An, \"Challenges and Opportunities for Trust Management in Crowdsourcing,\" in Proceeding of the IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'12), pp. 486-493, 2012.", "H. Yu, Z. Shen & B. An, \"An Adaptive Witness Selection Method for Reputation-based Trust Models,\" in Proceedings of the 15th International Conference on Principles and Practice of Multi-Agent Systems (PRIMA'12), pp. 184-198, 2012.", "H. Yu, C. Leung & C. Miao, \"A Simple, General and Robust Trust Agent to Help the Elderly Select online Services,\" in Proceedings of the 2nd Southeast Asian Network of Ergonomics Societies Conference (SEANES'12), pp. 1-5, 2012.", "H. Song, Z. Shen, H. Yu & Y. Chen, \"Probabilistic-based Scheduling for Runtime Goal Sequence of Agents,\" in Proceedings of the2012 International Conference on Computer Science and Automation Engineering (CSAE'12), pp. 490-494, 2012.", "H. Yu, S. Liu, A.C. Kot, C. Miao & C. Leung, \"Dynamic Witness Selection for Trustworthy Distributed Cooperative Sensing in Cognitive Radio Networks,\" in Proceedings of the 13th IEEE International Conference on Communication Technology (ICCT'11), pp. 1-6, 2011. (Best Paper Award)", "H. Yu, Z. Shen, C. Miao & A.-H. Tan, \"A Simple Curious Agent to Help People be Curious,\" in Proceedings of the 10th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'11), pp. 1159-1160, 2011.", "J. Lin, C. Miao & H. Yu, \"A Cloud & Agent Based Architecture Design for an Educational Mobile SNS Game,\" in Proceedings of the 6th International Conference on E-learning and Games (Edutainment'11), pp. 212-219, 2011.", "Z. Shen, C. Miao, L. Zhang, H. Yu & M. J. Chavez, \"An Emotion Aware Agent Platform for Interactive Storytelling and Gaming,\" in Proceedings of the International Academic Conference on the Future of Game Design and Technology (Futureplay'10), pp. 257-258, 2010.", "H. Yu, Y. Cai, Z. Shen, X. Tao & C. Miao, \"Agents as Intelligent User Interfaces for the Net Generation,\" in Proceedings of the 15th International Conference on Intelligent User Interfaces (IUI'10), pp. 429-430, 2010.", "H. Yu, Z. Shen & C. Miao, \"A Trustworthy Beacon-based Location Tracking Model for Body Area Sensor Networks in m-Health,\" in Proceedings of the 7th International Conference on Information, Communications and Signal Processing (ICICS'09), doi:10.1109/ICICS.2009.5397622, 2009.", "L. Pan, X. Meng, Z. Shen & H. Yu, \"A Reputation Pattern for Service Oriented Computing,\" in Proceedings of the 7th International Conference on Information, Communications and Signal Processing (ICICS'09), doi:10.1109/ICICS.2009.5397618, 2009.", "H. Yu, C. Miao, X. Tao, Z. Shen, Y. Cai, B. Li & Y. Miao, \"Teachable Agents in Virtual Learning Environments: a Case Study,\" in Proceedings of World Conference on E-Learning in Corporate, Government, Healthcare and Higher Education (E-LEARN'09), pp. 1088-1096, 2009.", "B. Li, H. Yu, Z. Shen & C. Miao, \"Evolutionary Organizational Search,\" in Proceedings of the 8th Joint International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'09), pp. 1329-1330, 2009.", "H. Yu, Z. Shen, C.P. Low & C. Miao, \"Transforming Learning through Agent Augmented Virtual World,\" in Proceedings of the 8th IEEE International Conference on Advanced Learning Technologies (ICALT'08), pp. 933-937, 2008.", "H. Yu, Z. Shen & C. Miao, \"Intelligent Software Agent Design Tool Using Goal Net Methodology,\" in Proceedings of the IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'07), pp. 43-46, 2007.", "H. Yu, Z. Shen & C. Miao, \"A Service Based Multi-Agent System Design Tool for Modeling Integrated Manufacturing and Service Systems,\" in Proceedings of the 12th IEEE Conference on Emerging Technologies and Factory Automation (ETFA'07), pp. 149-154, 2007.", "Y. L. Theng, K. L. Tan, E. P. Lim, J. Zhang, D. H. L. Goh, K. Chatterjea, H. C. Chew, A. X. Sun, H. Yu, N. Dang, Y. Li & M. C. Vo, \"Mobile G-Portal Supporting Collaborative Sharing and Learning in Geography Fieldwork: An Empirical Study,\" in Proceedings of the 7th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL'07), pp. 462-471, 2007.", "H. Yu, L. Ding, X. Lu & B. Xie, \"A Virtual Agent Based Mobile 3D Game with Mascot Capsule Micro3D API,\" in Proceedings of the 3rd IEE International Conference on Mobile Technology, Application and Systems (Mobility'06), pp. 36:1-36:6, 2006.", "H. Yu, \"Developing Mobile 3D Game Using MIDP 2.0 Game API and JSR-184 M3G API,\" in Proceedings of the SIGRAD 2005 Conference, pp. 69-73, 2005."], "bibliometrics": {"google_scholar": "https://scholar.google.com.sg/citations?user=eXgoTXMAAAAJ&hl=en", "web_of_science": "https://www.webofscience.com/wos/author/record/1174765", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55753004000"}, "google_scholar": "https://scholar.google.com.sg/citations?user=eXgoTXMAAAAJ&hl=en", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55753004000", "web_of_science": "https://www.webofscience.com/wos/author/record/1174765", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00334", "other_websites": ["http://hanyu.sg"]}