{"full_name": "Dusit Niyato", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Dusit Niyato", "email": "dniyato@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Computer Networks and Communications"], "biography": "Prof Dusit Niyato is currently in the School of Computer Engineering since July 2008. He received his Bachelor degree in Computer Engineering from King Mongkut's Institute of Technology Ladkrabang, Thailand, Master and Ph.D. degrees from the University of Manitoba in 2005 and 2008, respectively.  His research interests include Wireless Communications, and Networking. He has done significant research work his research areas and published over 60 top quality international conference and journal papers.", "interests": "- Wireless communications and networking, specifically, dynamic spectrum access and spectrum trading in cognitive radio.- Mobile computing, parallel and distributed systems, specifically, resource management in heterogeneous wireless network and wireless intelligent transportation system.- Queueing theory and Markov chain with an application in performance evaluation of communication systems.- Evolutionary theory with an application in mobile communication and computing.", "grants": "Algorand Centre of Excellence at NTU (ACE@NTU) [under NTU Centre in Computational Technologies for Finance]Algorithm Design Of Mobile Decentralized Computing SystemsFusion Science for Clean EnergyPresident's Chair in Computer Science and EngineeringReputation-driven Optimized Worker Selection for Collaborative Distributed LearningTechnical challenges, linguistic obstacles, and cultural barriers in bringing knowledge societies into the metaverse. With a metaverse showcase of how the peoples of Afro-Eurasia saw each other transitioning into modernityTowards Real-time, Seamless, and Ubiquitous Edge Intelligence-empowered MetaverseTrustFUL: Trustworthy Federated Ubiquitous LearningTrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)", "articles": ["Lu, X., Wang, P., Niyato, D., Kim, D. I., & Han, Z. (2014). Wireless networks with RF energy harvesting: A contemporary survey. IEEE Communications Surveys and Tutorials, 17(2), 757-789.", "Dinh, H. T., Lee, C., Niyato, D., & Wang, P. (2013). A survey of mobile cloud computing: architecture, applications, and approaches. Wireless Communications and Mobile Computing, 13(18), 1587-1611.", "Lu, X., Wang, P., Niyato, D., Kim, D. I., & Han, Z. (2015). Wireless charging technologies: Fundamentals, standards, and network applications. IEEE Communications Surveys and Tutorials, 18(2), 1413-1452.", "Alsheikh, M. A., Lin, S., Niyato, D., & Tan, H. P. (2014). Machine learning in wireless sensor networks: Algorithms, strategies, and applications. IEEE Communications Surveys and Tutorials, 16(4), 1996-2018.", "Chaisiri, S., Lee, B. S., & Niyato, D. (2011). Optimization of resource provisioning cost in cloud computing. IEEE Transactions on Services Computing, 5(2), 164-177.", "Niyato, D., & Hossain, E. (2008). Competitive pricing for spectrum sharing in cognitive radio networks: Dynamic game, inefficiency of nash equilibrium, and collusion. IEEE Journal on Selected Areas in Communications, 26(1), 192-202.", "Hasan, M., Hossain, E., & Niyato, D. (2013). Random access for machine-to-machine communication in LTE-advanced networks: Issues and approaches. IEEE Communications Magazine, 51(6), 86-93.", "Lim, W. Y. B., Luong, N. C., Hoang, D. T., Jiao, Y., Liang, Y. C., Yang, Q., ... & Miao, C. (2020). Federated learning in mobile edge networks: A comprehensive survey. IEEE Communications Surveys and Tutorials, 22(3), 2031-2063.", "Huang, D., Wang, P., & Niyato, D. (2012). A dynamic offloading algorithm for mobile computing. IEEE Transactions on Wireless Communications, 11(6), 1991-1995.", "Niyato, D., & Hossain, E. (2008). Dynamics of network selection in heterogeneous wireless networks: An evolutionary game approach. IEEE Transactions on Vehicular Technology, 58(4), 2008-2017.", "Click  here for more publications.", "Yang, H., Lam, K. Y., Xiao, L., Xiong, Z., Hu, H., Niyato, D., & Vincent Poor, H. (2022). Lead federated neuromorphic learning for wireless edge artificial intelligence. Nature Communications, 13(1), 4269.", "Ng, J. S., Lim, W. Y. B., Xiong, Z., Cao, X., Jin, J., Niyato, D., ... & Miao, C. (2022). Reputation-aware hedonic coalition formation for efficient serverless hierarchical federated learning. IEEE Transactions on Parallel and Distributed Systems, 33(11), 2675-2686.", "Anh, T. T., Luong, N. C., Xiong, Z., Niyato, D., & Kim, D. I. (2022). Joint time scheduling and transaction fee selection in blockchain-based RF-powered backscatter cognitive radio network. Computer Networks, 214, 109135.", "Wang, Y., Chen, M., Luo, T., Saad, W., Niyato, D., Poor, H. V., & Cui, S. (2022). Performance Optimization for Semantic Communications: An Attention-based Reinforcement Learning Approach. IEEE Journal on Selected Areas in Communications, 40(9), 2598-2613.", "Ong, K. S. H., Wang, W., Hieu, N. Q., Niyato, D., & Friedrichs, T. (2022). Predictive Maintenance Model for IIoT-based Manufacturing: A Transferable Deep Reinforcement Learning Approach. IEEE Internet of Things Journal, 9(17), 15725-15741.", "Z. Han, D. Niyato, W. Saad, T. Basar, and A. Hjørungnes. (2011). Game Theory in Wireless and Communication Networks: Theory, Models, and Applications. Cambridge University Press."], "books": [], "book_chapters": [], "conferences": ["S. Guruacharya, D. Niyato, E. Hossain, and D. I. Kim. (2010). IEEE Global Communications Conference (GLOBECOM): Hierarchical competition in femtocell-based cellular networks.Miami, FL, USA: IEEE.", "D. Niyato, P. Wang, E. Hossain, and Y. Li. (2010). Optimal content transmission policy in publish-subscribe mobile social networks. IEEE Global Communications Conference (GLOBECOM).", "Z. Kun, D. Niyato, and P. Wang. (2010). Optimal bandwidth allocation with dynamic service selection in heterogeneous wireless networks. IEEE Global Communications Conference (GLOBECOM)."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=T8sVhLMAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8919714700"}, "google_scholar": "https://scholar.google.com/citations?user=T8sVhLMAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-7442-7416", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8919714700", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01008", "other_websites": ["http://www3.ntu.edu.sg/home/dniyato"]}