{"full_name": "Yeo Chai Kiat", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Yeo Chai Kiat", "email": "asckyeo@ntu.edu.sg", "keywords": ["Electrical and Electronic Engineering", "Info-Communication Technology", "Interactive Digital Media", "Computer Science and Engineering", "Internet & Communications", "Computer Networks and Communications"], "biography": "Associate Professor Yeo Chai Kiat is currently in the School of Computer Science and Engineering (SCSE). She received her Ph.D. in electrical and electronic engineering from the Nanyang Technological University and her MSc and B.Eng. (1st class honours) in electrical and electronic engineering from National University of Singapore. She has spent six years with Singapore Electronic and Engineering Limited (SEEL), a company now subsumed under Singapore Technologies Engineering, first as an engineer and later held the concurrent position of Assistant Principal Engineer and Deputy Program Manager.A/P Yeo is currently the Deputy Director and Programme Director of Singtel Cognitive land Artificial Intelligence Lab for Enterprises@NTU (SCALE@NTU). She is also the Assistant Chair (Faculty) of SCSE. She was the Associate Chair (Academic) of SCSE from Dec 2007 to May 2017 and the Sub Dean of School of Applied Science (predecessor of SCSE)  from Jun 1996 to May 1999. She has been a Visiting Professor with Osaka University, Graduate School of Information Science and Technology. She was Deputy Director of Centre for Multimedia and Network Technology (CeMNet) from Jul 2006 until Jun 2008.A/P Yeo has published over 280 research papers in international journals and conference proceedings in the areas of anomaly detection, predictive analytics, machine learning, AI, mobile networks, internet technologies, overlay networks and speech processing. She has also directed a number of funded projects in these areas.", "interests": "Her research focus is on Anomaly Detection, Data Analytics, Predictive Analytics, Neural Networks, Machine Learning, Artificial Intelligence, Mobile and Ad Hoc Networks.", "grants": "Data Mining and Machine Learning for Semiconductor Product EngineeringMachine Learning Framework for Predictive Maintenance & Anomaly Detection with Backend Manufacturing Final Test DataResearch Theme 3 - Condition-Based MaintenanceSingtel-NTU Congnitive & Artifical Intelligence Joint Lab, Common Activities Account", "articles": ["Tang, M., Lee, B. S., Tang, X., & Yeo, C. K. (2006). The impact of data replication on job scheduling performance in the data grid. Future Generation Computer Systems, 22(3), 254-268.", "Soon, Y., Koh, S. N., & Yeo, C. K. (1998). Noisy speech enhancement using discrete cosine transform. Speech Communication, 24(3), 249-257.", "Yang, S., Yeo, C. K., & Lee, B. S. (2011). Toward reliable data delivery for highly dynamic mobile ad hoc networks. IEEE Transactions on Mobile Computing, 11(1), 111-124.", "Soon, Y., Koh, S. N., & Yeo, C. K. (1999). Improved noise suppression filter using self-adaptive estimator of probability of speech absence. Signal Processing, 75(2), 151-159.", "Zhang, D., & Yeo, C. K. (2012). Enabling efficient wifi-based vehicular content distribution. IEEE Transactions on Parallel and Distributed Systems, 24(3), 479-492.", "Chen, W., Zhang, Y., Yeo, C. K., Lau, C. T., & Lee, B. S. (2018). Unsupervised rumor detection based on users’ behaviors using neural networks. Pattern Recognition Letters, 105, 226-233.", "Ding, H., Soon, Y., Koh, S. N., & Yeo, C. K. (2009). A spectral filtering method based on hybrid wiener filters for speech enhancement. Speech Communication, 51(3), 259-267.", "Chen, W., Yeo, C. K., Lau, C. T., & Lee, B. S. (2018). Leveraging social media news to predict stock index movement using RNN-boost. Data & Knowledge Engineering, 118, 14-24.", "Pham, T. N. D., & Yeo, C. K. (2015). Detecting colluding blackhole and greyhole attacks in delay tolerant networks. IEEE Transactions on Mobile Computing, 15(5), 1116-1129.", "Banerjee, A., Agarwal, R., Gauthier, V., Yeo, C. K., Afifi, H., & Lee, F. B. S. (2012). A self-organization framework for wireless ad hoc networks as small worlds. IEEE Transactions on Vehicular Technology, 61(6), 2659-2673.", "Chen, Y., Hu, Y., Li, K., Yeo, C. K., & Li, K. (2022). Approximate personalized propagation for unsupervised embedding in heterogeneous graphs. Information Sciences, 600, 287-300.", "Huang, X., Gong, S., Yang, J., Zhang, W., Yang, L., & Yeo, C. K. (2022). Hybrid market-based resources allocation in Mobile Edge Computing systems under stochastic information. Future Generation Computer Systems, 127, 80-91.", "Luo, Y., Ma, J., & Yeo, C. K. (2022). Identification of rumour stances by considering network topology and social media comments. Journal of Information Science, 48(1), 118-130.", "Chen, C., Guo, R., Zhang, W., Yang, J., & Yeo, C. K. (2022). Optimal sequential relay-remote selection and computation offloading in mobile edge computing. The Journal of Supercomputing, 78(1), 1093-1116.", "Chen, Y., Ashizawa, N., Yeo, C. K., Yanai, N., & Yean, S. (2021). Multi-scale self-organizing map assisted deep autoencoding Gaussian mixture model for unsupervised intrusion detection. Knowledge-Based Systems, 224, 107086.", "Weiling Chen, Chai Kiat Yeo, Chiew Tong Lau, Bu Sung Lee. (2018). Leveraging social media news to predict stock index movement using RNN-Boost. Data & Knowledge Engineering, vol. 118, pp. 14-24.", "Zhaomin Chen,Chai Kiat Yeo, Bu Sung Lee , Chiew Tong Lau, Yaochu Jin. (2018). Evolutionary Multi-Objective Optimization based Ensemble Autoencoders for Image Outlier Detection. Neurocomputing, vol. 309, pp. 192-200.", "Zhaomin Chen, Chai Kiat Yeo, Bu Sung Lee, Chiew Tong Lau. (2018). Power Spectrum Entropy based Detection and Mitigation of Low-Rate DoS Attacks. Computer Networks, vol. 136, pp. 80-94.", "Weiling Chen\u0003\u0003, Yan Zhang, Chai Kiat Yeo, Chiew Tong Lau, Bu Sung Lee. (2018). Unsupervised Rumor Detection based on Users’ Behaviors using Neural Networks. Pattern Recognition Letters, vol. 105, pp. 226-233.", "Weiling Chen, Chai Kiat Yeo, Chiew Tong Lau, Bu Sung Lee. (2017). A study on real-time low-quality content detection on Twitter from the users' perspective. PLoS ONE, vol. 12(8)."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=jWi-5AYAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7102545548"}, "google_scholar": "https://scholar.google.com/citations?user=jWi-5AYAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-7618-1472", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7102545548", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00963", "other_websites": ["https://personal.ntu.edu.sg/asckyeo/"]}