{"full_name": "Ke Yiping, Kelly", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Ke Yiping, Kelly", "email": "ypke@ntu.edu.sg", "keywords": ["Computer Science and Engineering"], "biography": "Dr. Yiping Ke is an Associate Professor with the School of Computer Science and Engineering, Nanyang Technological University. She obtained her Ph.D. degree in Computer Science from the Hong Kong University of Science and Technology in 2008 and B.Sc. degree in Computer Science from Fudan University in 2003. Before joining NTU, she was a scientist with the Institute of High Performance Computing, A*STAR and a Research Assistant Professor at the Chinese University of Hong Kong. Her experience has spanned over both academia and industry. She has published over 60 research papers in prestigious journals/conferences, receiving over 3,000 citations. She has served as program committee members and journal reviewers for ICML, NIPS, ICLR, UAI, IJCAI, AAAI, KDD, VLDB, ICDM, SDM, CIKM, ACM TKDD, IEEE TNNLS, IEEE TKDE, VLDBJ, Machine Learning Journal, etc. She has filed 6 US/UK patents with industrial partners. She has secured and managed 9 research grants and industrial funds, and successfully rolled out developed technologies to a variety of domains including engineering design, neuroscience, education, etc.", "interests": "• Data Mining and Artificial Intelligence: graph learning, graph analytics, graph mining, transfer learning, machine learning for physics modelling• Applications: engineering design, brain analysis, biology, education, environmental sustainability", "grants": "Advanced Graph Analytics for Human Brain ConnectivityProvenance-Based Graph Analytics and Transfer Learning for Intrusion DetectionSoutheast Asian Climate Change Communication Checker (SEA4Cs Lab)", "articles": ["Pengfei Wei, Ramon Sagarna, Yiping Ke, Chi Keong Goh, Ong Yew Soon. (2017). Source-Target Similarity Modelings for Multi-Source Transfer Gaussian Process Regression. Thirty-fourth International Conference on Machine Learning (ICML 2017).", "Zhiqiang Xu, Yiping Ke, and Xin Gao. (2017). A Fast Stochastic Riemannian Eigensolver. Proceedings of the Conference on Uncertainty in Artificial Intelligence (UAI).", "Zhiqiang Xu, Yiping Ke, Yi Wang, Hong Cheng, James Cheng. (2014). GBAGC: A General Bayesian Framework for Attributed Graph Clustering. ACM Transactions on Knowledge Discovery from Data, 9(1).", "Y. Ke, J. Cheng, W. Ng. (2008). Efficient Correlation Search from Graph Databases. IEEE Transactions on Knowledge and Data Engineering, 20(12), 1601-1615."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": "https://orcid.org/0000-0001-9473-3202", "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00908", "other_websites": ["https://personal.ntu.edu.sg/ypke"]}