{"full_name": "Lin Shang-Wei", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Lin Shang-Wei", "email": "shang-wei.lin@ntu.edu.sg", "image_path": "./profile_img/lin_shang-wei.jpg", "keywords": ["Computer Science and Engineering", "Cyber Security and Forensics"], "biography": "Dr. LIN Shang-Wei received his B.S. degree in Information Management from National Chung Cheng University in 2003 and received his Ph.D. degree in Computer Science and Information Engineering from the National Chung Cheng University in 2010.In 2011, he was a postdoctoral research fellow in School of Computing, National University of Singapore. From 2012 to 2014, he was a research scientist at Temasek Laboratories in National University of Singapore. From December 2014 to April 2015, he was a postdoctoral research fellow in Singapore University of Technology and Design. He joined School of Computer Engineering in Nanyang Technological University as Assistant Professor in May 2015.", "interests": "Dr. LIN’s research interests can be classified into two main categories: theoretical and practical computer science. In the theoretical part, he focuses on formal methods including model checking and theorem proving. Currently, he is working on automatic compositional verification techniques to alleviate the state explosion problem with respect to model checking. In the practical part, he focuses on embedded system design, multi-core embedded software development, and application framework design on cyber physical systems.", "grants": "A security policy verification and validation platform for smart contracts", "articles": ["Y. Zhou, H. Hu, Y. Liu, S.W. Lin, Z. Ding. (2019). A Real-Time and Fully Distributed Approach to Motion Planning for Multirobot Systems. IEEE Transactions on Systems, Man, and Cybernetics: Systems, 49(12), 2636-2650.", "Haijun Wang, Yi Li, Shang-Wei Lin, Lei Ma, Yang Liu. (2019). VULTRON: Catching Vulnerable Smart Contracts Once and for All. 41st ACM/IEEE International Conference on Software Engineering.", "Zhou Y, Hu H, Liu Y, Lin SW, Ding Z. (2018). A distributed approach to robust control of multi-robot systems. Automatica, 98, 1-13.", "Y. Zhou, H. Hu, Y. Liu, S.W. Lin. (2018). Distributed approaches to motion control of multiple robots via discrete event systems. Journal of Control Theory and Applications, 35(1), 110-120."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00861", "other_websites": ["https://personal.ntu.edu.sg/shang-wei.lin/"]}