{"full_name": "Alexei Sourin", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Alexei Sourin", "email": "assourin@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Interactive Digital Media", "Graphics and Interactive Computing", "Smart Cities"], "biography": "Dr. Alexei Sourin was born in Moscow and received his M.Eng. and Ph.D. degrees in computer graphics from the Moscow Engineering Physics Institute, Russia (MEPhI) in 1983 and 1988, respectively. From 1983 to 1993 he was a researcher at MEPhI where he worked on different scientific visualization and computer animation projects. Since 1993 he held faculty positions at Nanyang Technological University (NTU) in Singapore, except a period from 1999 to 2000 when he was Associate Professor at Moscow Institute of Physics and Technology (MIPT). Currently he is a tenured Associate Professor with the School of Computer Science and Engineering at NTU. His research interests are in shape modeling, multi-modal interaction, music visualization, and automated visual inspection in manufacturing. Dr. Sourin published over 230 referred research papers and was invited to give talks to many scientific events. Dr. Sourin is also one of the pioneers of electronic education in Singapore. From 2012 to 2018, he was a Chair of the IFIP WG5.10 Computer Graphics and Virtual Worlds. Dr. Sourin is a Senior Member of IEEE and a member of ACM SIGGRAPH. He is an associate editor of several international journals including The Visual Computer (Springer) and Transactions on Computational Science (Springer). He was on the program committees of over 120 international conferences. He is a coordinator of the International Conferences on Cyberworlds for which he was also General and Program Chair in many years.", "interests": "Shape modeling, multi-modal interaction, new user interfaces, music visualization, automated visual inspection in manufacturing.", "grants": "Feasibility Study on Automatic Detection of Anomalies in Captured Images with Limited Training Data", "articles": ["Pasko, A., Adzhiev, V., Sourin, A., & Savchenko, V. (1995). Function representation in geometric modeling : concepts, implementation and applications. The Visual Computer, 11(8), 429-446.", "Kulish, V., Sourin, A., & Sourina, O. (2006). Human electroencephalograms seen as fractal time series : mathematical analysis and visualization. Computers in Biology and Medicine, 36(3), 291-302. doi: 10.1016/J.COMPBIOMED.2004.12.003", "Pasko, A., Savchenko, V., & Sourin, A. (2001). Synthetic carving using implicit surface primitives. Computer-Aided Design, 33(5), 379-388. doi: 10.1016/S0010-4485(00)00129-9", "Sourin, A., Sourina, O., & Prasolova-Førland, E. (2006). Cyber-learning in cyberworlds.  Journal of Cases on Information Technology (JCIT), 8(4), 55-70. doi: 10.4018/JCIT.2006100105", "Prasolova-Førland, E., Sourin, A., & Sourina, O. (2006). Cybercampuses : design issues and future directions. The Visual Computer, 22(12), 1015-1028. doi: 10.1007/S00371-006-0042-2", "Kulish, V., Sourin, A., & Sourina, O. (2006). Analysis and visualization of human electroencephalograms seen as fractal time series. Journal of Mechanics in Medicine and Biology, 6(02), 175-188. doi: 10.1142/S021951940600187X", "Sourin, A. (2001). Functionally based virtual embossing. The Visual Computer, 17(4), 258-271. doi: 10.1007/S003710100109", "Wei, L., Sourin, A., & Sourina, O. (2008). Function-based visualization and haptic rendering in shared virtual spaces. The Visual Computer, 24(10), 871-880. doi: 10.1007/S00371-008-0285-1", "Liu, Q., & Sourin, A. (2006). Function-based shape modelling extension of the Virtual Reality Modelling Language. Computers & Graphics, 30(4), 629-645. doi: 10.1016/J.CAG.2006.03.006", "Liu, Q., & Sourin, A. (2006). Function-defined shape metamorphoses in visual cyberworlds. The Visual Computer, 22(12), 977-990. doi: 10.1007/S00371-006-0044-0", "Click  here for more publications.", "Dai, W., Erdt, M., & Sourin, A. (2022). Self-supervised pairing image clustering for automated quality control. The Visual Computer, 38(4), 1181-1194. doi: 10.1007/s00371-021-02137-y", "Volkau, I., Mujeeb, A., Dai, W., Erdt, M., & Sourin, A. (2021). The impact of a number of samples on unsupervised feature extraction, based on deep learning for detection defects in printed circuit boards. Future Internet, 14(1), 8. doi: 10.3390/fi14010008", "Dai, W., Erdt, M., & Sourin, A. (2021). Detection and segmentation of image anomalies based on unsupervised defect reparation. The Visual Computer, 37(12), 3093-3102. doi: 10.1007/s00371-021-02257-5", "Chegini, M., Bernard, J., Cui, J., Chegini, F., Sourin, A., Andrews, K., & Schreck, T. (2020). Interactive visual labelling versus active learning : an experimental comparison. Frontiers of Information Technology & Electronic Engineering, 21(4), 524-535. doi: 10.1631/FITEE.1900549", "Dai, W., Mujeeb, A., Erdt, M., & Sourin, A. (2020). Soldering defect detection in automatic optical inspection. Advanced Engineering Informatics, 43, 101004. doi: 10.1016/j.aei.2019.101004", "Mujeeb A., Dai W., Erdt M., Sourin A. One Class Based Feature Learning Approach for Defect Detection Using Deep Autoencoders. Advanced Engineering Information, Elsevier, 42: 100933, 2019.", "Cui J., Sourin A., Mid-air Interaction with Optical Tracking for 3D Modeling, Computers & Graphics, Elsevier, 74:1-11, 2018."], "books": ["Alexei Sourin. Computer Graphics: From a Small Formula to Cyberworlds. 3rd edition, Prentice Hall, Singapore, 2012."], "book_chapters": [], "conferences": ["How RTK and Sourin A. Generation of Music with Dynamics using Deep Learning. The 2021 International Conference on Cyberworlds, Caen France, 28-30 Sept 2021, IEEE CPS, 137-140, 2021.", "Kan Z.J., Sourin A. Generation of Irregular Music Patterns with Deep Learning. The 2020 International Conference on Cyberworlds, Online event, 29 Sept-1 Oct 2020, 188-195, IEEE CPS, 2020.", "Sourin A., Music in the Air with Leap Motion Controller, The 2019 International Conference on cyberworlds, Kyoto, 2-4 October 2019, 57-60, IEEE CPS."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=8A7kHCYAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/1371388", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8366154100"}, "google_scholar": "https://scholar.google.com/citations?user=8A7kHCYAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0003-4051-2927", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8366154100", "web_of_science": "https://www.webofscience.com/wos/author/record/1371388", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00274", "other_websites": ["http://www3.ntu.edu.sg/home/assourin/"]}