{"full_name": "Lin Weisi", "designation": "Associate Chair (Research), School of Computer Science and Engineering", "name_card": "Prof Lin Weisi", "email": "wslin@ntu.edu.sg", "image_path": "./profile_img/lin_weisi.jpg", "keywords": ["Artificial and Augmented Intelligence", "Computer Science and Engineering", "Electrical and Electronic Engineering"], "biography": "Weisi Lin graduated from Sun Yat-Sen (Zhongshan) University, China with B.Sc in Electronics and M.Sc in Digital Signal Processing, respectively, and from King’s College, London University, UK with Ph.D in Computer Vision. He taught and researched in Sun Yat-Sen University, Shantou University (China), Bath University (UK), National University of Singapore, Institute of Microelectronics (Singapore), and Institute for Infocomm Research (Singapore). He has been the project leader of 10+ successfully delivered projects in digital multimedia technology development. He also served as the Lab Head, Visual Processing, and then the Acting Department Manager, Media Processing, in Institute for Infocomm Research.  He holds 16 patents, wrote 9 book chapters, edited 3 books,  authored 2 books, published over 400 refereed papers in international journals and conferences, and made more than ten contributions to international standardization. He believes that good theory is practical so has kept a balance of academic research and industrial deployment throughout his working life.", "interests": "perception-inspired signal modeling, visual quality evaluation, video compression, image processing & analysis, multimedia systems", "grants": "Artificial Intelligence Programme in ChinaDeep learning and 3D technologies for scene understanding and modellingFull Multimedia Perception and Understanding [COE Research Award 2023]LiDAR Depth Map (LDM) Quality Assessment & ImprovementOverheads M4 AccountScent Digitalization and Computation (SDC)WP4: Scent Digitalization and Computation (SDC)- PI: Guan CuntaiWP4: Scent Digitalization and Computation (SDC)- PI: Lin Weisi", "articles": ["Lin, W., & Kuo, C. C. J. (2011). Perceptual visual quality metrics: A survey. Journal of Visual Communication and Image Representation, 22(4), 297-312.", "Liu, A., Lin, W., & Narwaria, M. (2011). Image quality assessment based on gradient similarity. IEEE Transactions on Image Processing, 21(4), 1500-1512.", "Gu, K., Zhai, G., Lin, W., & Liu, M. (2015). The analysis of image contrast: From quality assessment to automatic enhancement. IEEE Transactions on Cybernetics, 46(1), 284-297.", "Fang, Y., Chen, Z., Lin, W., & Lin, C. W. (2012). Saliency detection in the compressed domain for adaptive image retargeting. IEEE Transactions on Image Processing, 21(9), 3888-3901.", "Yang, X. K., Ling, W. S., Lu, Z. K., Ong, E. P., & Yao, S. S. (2005). Just noticeable distortion model and its applications in video coding. Signal Processing: Image Communication, 20(7), 662-680.", "Fang, Y., Ma, K., Wang, Z., Lin, W., Fang, Z., & Zhai, G. (2014). No-reference quality assessment of contrast-distorted images based on natural scene statistics. IEEE Signal Processing Letters, 22(7), 838-842.", "Gu, K., Tao, D., Qiao, J. F., & Lin, W. (2017). Learning a no-reference quality assessment model of enhanced images with big data. IEEE Transactions on Neural Networks and Learning Systems, 29(4), 1301-1313.", "Gu, K., Zhai, G., Lin, W., Yang, X., & Zhang, W. (2015). No-reference image sharpness assessment in autoregressive parameter space. IEEE Transactions on Image Processing, 24(10), 3218-3231.", "Wu, J., Lin, W., Shi, G., & Liu, A. (2012). Perceptual quality metric with internal generative mechanism. IEEE Transactions on Image Processing, 22(1), 43-54.", "Gu, K., Wang, S., Yang, H., Lin, W., Zhai, G., Yang, X., & Zhang, W. (2016). Saliency-guided quality assessment of screen content images. IEEE Transactions on Multimedia, 18(6), 1098-1110.", "Click  here for more publications.", "Zhang, H., Zhang, Y., Zhu, L., & Lin, W. (2022). Deep Learning-Based Perceptual Video Quality Enhancement for 3D Synthesized View. IEEE Transactions on Circuits and Systems for Video Technology, 32(8), 5080–5094.", "Peng, Z., Jiang, Q., Shao, F., Gao, W., & Lin, W. (2021). LGGD+: Image retargeting quality assessment by measuring local and global geometric distortions. IEEE Transactions on Circuits and Systems for Video Technology, 32(6), 3422–3437.", "Jin, J., Zhang, X., Fu, X., Zhang, H., Lin, W., Lou, J., & Zhao, Y. (2021). Just Noticeable Difference for Deep Machine Vision. IEEE Transactions on Circuits and Systems for Video Technology, 32(6), 3452–3461.", "Zhang, X., Lin, W., & Huang, Q. (2021). Fine-grained image quality assessment: A revisit and further thinking. IEEE Transactions on Circuits and Systems for Video Technology, 32(5), 2746-2759.", "Gao, W., Liao, G., Ma, S., Li, G., Liang, Y., & Lin, W. (2021). Unified information fusion network for multi-modal rgb-d and rgb-t salient object detection. IEEE Transactions on Circuits and Systems for Video Technology, 32(4), 2091-2106.", "S. Wu, W Lin，and S. Xie. (2008). Skin Heat Transfer Model of Facial Thermograms and Its Application in Face Recognition. Pattern Recognition, 41(8), 2718–2729.", "Lin Weisi, L. Dong. (2006). Adaptive Down-sampling to Improve Image Compression at Low Bit Rates. IEEE Transactions on Image Processing, 15(9), 2513-2521.", "Z. Lu, Lin Weisi, X. Yang, E. Ong, S. Yao. (2005). Modeling Visual Attention's Modulatory Aftereffects on Visual Sensitivity and Quality Evaluation. IEEE Transactions on Image Processing, 14(11), 1928-1942."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=D_S41X4AAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8574872000"}, "google_scholar": "https://scholar.google.com/citations?user=D_S41X4AAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0001-9866-1947", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8574872000", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00683", "other_websites": ["https://personal.ntu.edu.sg/wslin"]}