{"full_name": "Arvind Easwaran", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Arvind Easwaran", "email": "arvinde@ntu.edu.sg", "image_path": "./profile_img/arvind_easwaran.jpg", "keywords": ["Computer Science and Engineering", "Computing Hardware and Architecture"], "biography": "Arvind Easwaran is an Associate Professor in the School of Computer Science and Engineering at Nanyang Technological University (NTU), Singapore. He received a PhD degree in Computer and Information Science from the University of Pennsylvania, USA, in 2008. Prior to joining NTU in 2013, he has been an Invited Research Scientist at the Polytechnic Institute of Porto, Portugal, between 2009 and 2010, and a Research & Development Scientist at Honeywell Aerospace, USA, between 2010 and 2012. In NTU, he is leading (has led) several research projects including real-time scheduling theory for mixed-criticality systems, model-in-the-loop intelligent framework for smart manufacturing, real-time optimisation for building energy systems, and assured safety architectures for learning-enabled cyber-physical systems. He was a ACM Distinguished Speaker between 2018-2020, a Cluster Director in the Future Mobility Solutions research programme at the Energy Research Institute @ NTU, and a recipient of the Nanyang Education Award (School) in 2020.", "interests": "Cyber-Physical Systems (CPS) encompass systems in which the cyber world of computation and communication closely interacts with the physical world of sensors and actuators. These are highly networked and deeply embedded systems such as those found in modern day aircrafts, automotives, factories, medical devices, smart phones, electric grids, etc. From driver-less cars and air traffic management using sense and avoid, to plug-and-play operating rooms and smart electric grids that integrate traditional and renewable energy sources, intelligent automation of an enormous scale is finding its way into many of these systems.Primary interests of the CPS Research Group @SCSE,NTU are in the design and analysis of safety-critical and time-critical CPS, with a particular focus on cyber-resource management and safety assurance. The current research themes can be broadly classified as follows:Resource Management in IoT and EdgeSafety Assurance in Learning Enabled ComponentsModel-driven Operational Optimization", "grants": "Assured-Safety Architecture for Machine Learning based CPSHolistic Allocation of Edge and Wireless Resources for Time-Sensitive IoT ApplicationsIntelligent Modelling for Decision-making in Critical Urban Systems (DESCARTES)Intelligent Modelling for Decision-making in Critical Urban Systems (DESCARTES): Main Account SCSE (Sub-project 1)Trust to Train and Train to Trust: Agent Training Programs for Safety-Critical Environments (SCSE)", "articles": ["Chwa, H. S., Lee, J., Lee, J., Phan, K. M., Easwaran, A., & Shin, I. (2016). Global EDF schedulability analysis for parallel tasks on multi-core platforms. IEEE Transactions on Parallel and Distributed Systems, 28(5), 1331-1345.", "Lee, J., Easwaran, A., Shin, I., & Lee, I. (2011). Zero-laxity based real-time multiprocessor scheduling. Journal of Systems and Software, 84(12), 2324-2333.", "Chiam, Z., Easwaran, A., Mouquet, D., Fazlollahi, S., & Millás, J. V. (2019). A hierarchical framework for holistic optimization of the operations of district cooling systems. Applied Energy, 239, 23-40.", "Xue, B., Easwaran, A., Cho, N. J., & Fränzle, M. (2016). Reach-avoid verification for nonlinear systems based on boundary analysis. IEEE Transactions on Automatic Control, 62(7), 3518-3523.", "Lee, J., Shin, K. G., Shin, I., & Easwaran, A. (2014). Composition of schedulability analyses for real-time multiprocessor systems. IEEE Transactions on Computers, 64(4), 941-954.", "Andersson, B., & Easwaran, A. (2010). Provably good multiprocessor scheduling with resource sharing. Real-Time Systems, 46(2), 153-159.", "Easwaran, A., Kannan, S., & Sokolsky, O. (2006). Steering of discrete event systems: Control theory approach. Electronic Notes in Theoretical Computer Science, 144(4), 21-39.", "Xue, B., She, Z., & Easwaran, A. (2017). Underapproximating backward reachable sets by semialgebraic sets. IEEE Transactions on Automatic Control, 62(10), 5185-5197.", "Lee, J., Easwaran, A., & Shin, I. (2012). Laxity dynamics and LLF schedulability analysis on multiprocessor platforms. Real-Time Systems, 48(6), 716-749.", "Bhattacharjee, A., Easwaran, A., Leow, M. K. S., & Cho, N. (2018). Evaluation of an artificial pancreas in in silico patients with online-tuned internal model control. Biomedical Signal Processing and Control, 41, 198-209.", "Click  here for more publications.", "Chiam, Z., Papas, I., Easwaran, A., Alonso, C., & Estibals, B. (2022). Holistic optimization of the operation of a GCHP system: A case study on the ADREAM building in Toulouse, France. Applied Energy, 321, 119377.", "Ramakrishna, S., Rahiminasab, Z., Karsai, G., Easwaran, A., & Dubey, A. (2022). Efficient Out-of-Distribution Detection Using Latent Space of β-VAE for Cyber-Physical Systems. ACM Transactions on Cyber-Physical Systems (TCPS), 6(2), 1-34.", "Sundar, V. K., Ramanathan, S., & Easwaran, A. (2022). Design and analyses of functional mode changes for mixed-criticality systems. Real-Time Systems, 1-53.", "Park, H., Easwaran, A., & Borde, E. (2021). Online cycle detection for models with mode-dependent input and output dependencies. Journal of Systems Architecture, 115, 102017.", "Dan, M., Srinivasan, S., Sundaram, S., Easwaran, A., & Glielmo, L. (2020). A scenario-based branch-and-bound approach for MES scheduling in urban buildings. IEEE Transactions on Industrial Informatics, 16(12), 7510-7520.", "Ankita Samaddar, Arvind Easwaran and Rui Tan, \"A Schedule Randomization Policy to Mitigate Timing Attacks in WirelessHART Networks\", Springer Real-Time Systems, Volume 56, Pages 452-489, October 2020.", "Saravanan Ramanathan, Nitin Shivaraman, Seima Suryasekaran, Arvind Easwaran, Etienne Borde and Sebastian Steinhorst, \"A Survey on Time-Sensitive Resource Allocation in the Cloud Continuum\", De Gruyter Methods and Applications of Informatics and Information Technology, Volume 62, Issue 5-6, Pages 241-255, 2020."], "books": [], "book_chapters": [], "conferences": ["Chuanchao Gao, Heejong Park and Arvind Easwaran, \"An Anomaly Detection Framework for Digital Twin Driven Cyber-Physical Systems\", IEEE/ACM International Conference on Cyber-Physical Systems (ICCPS), 2021.", "Bai Xue, Miaomiao Zhang, Arvind Easwaran and Qin Li, \"PAC Model Checking of Black-Box Continuous-Time Dynamical Systems\", ACM & IEEE International Conference on Embedded Software (EMSOFT), 2020 (published in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), Volume 39, Issue 11, Pages 3944-3955, November 2020)."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=B_ouhTgAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=13409980100"}, "google_scholar": "https://scholar.google.com/citations?user=B_ouhTgAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-9628-3847", "github": "https://cps-research-group.github.io/", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=13409980100", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00687", "other_websites": []}