{"full_name": "Cong Gao", "designation": "Co-Director, Singtel Cognitive and Artificial Intelligence Lab for Enterprises@NTU", "name_card": "Prof Cong Gao", "email": "gaocong@ntu.edu.sg", "image_path": "./profile_img/cong_gao.jpg", "keywords": ["Artificial and Augmented Intelligence", "Computer Science and Engineering", "Smart Cities", "Sociology"], "biography": "Gao Cong is currently a Professor with School of Computer Science and Engineering in Nanyang Technological University (NTU), and a co-director for Singtel Cognitive and Artificial Intelligence Lab for Enterprises@NTU (SCALE@NTU). Before joining NTU, he was an Assistant Professor in Aalborg University, Denmark. Before that, he worked as a researcher at Microsoft Research Asia. From 2004 to 2006, he worked as a postdoc in University of Edinburgh. He received his Ph.D. in Computer Science from National University of Singapore in 2004. His general research interests are in Data Science. In particular, his research focuses on geospatial data management, spatio-temporal data mining, recommendation, and mining social media data. He has published in prestigious journals (e.g., VLDB Journal, TODS, TKDE) and conferences (e.g., VLDB, SIGMOD, ICDE, KDD, WSDM, SIGIR, WWW). His citation in Google Scholar was over 14000 with H-index 61. He served as a PC co-chair for ICDE’2022, an associate chair of KDD’21, a PC co-chair for E&A track of VLDB 2014, and a PC vice-Chair for ICDE’18. He is an associate editor for ACM Transactions on Database Systems (TODS) and the vice Chair of ACM KDD Singapore chapter.", "interests": "Geospatial, Textual, and Mobility Data ManagementData Mining, Large Scale Data AnalyticsMining Social Networks and Social MediaUser Preference Modeling and RecommendationUrban Informatics", "grants": "Build a question answer knowledge base for health care workers and patientsCollaborative AI “Spatio-temporal Network Learning for Smart Cities, Knowledge Representation with Graph Neural Networks”Data Driven Human Preference Analytics For Urban ComputingDeep Trajectory Representation meets Big Trajectory Querying and MiningMachine Learning Driven Query Optimizers for Big Database Systems\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNovel context-aware multivariate time series modelling for underground transportation infrastructure monitoring and managementPreserving Individual Privacy In Urban InformaticsRefining Seismic Hazard Estimation for Singapore through Deep-Learning Aided Earthquake DetectionSingtel-NTU Cognitive & Artificial Intelligence Joint Lab (Overhead)Singtel-NTU Congnitive & Artifical Intelligence Joint Lab, Common Activities AccountTowards Semantic-Aware Multimodal and Multilingual Deep Learning Systems for E-Commerce ApplicationsTradeMaster: Reinforcement Learning-based Quantitative Trading ToolkitTradeMaster: Reinforcement Learning-based Quantitative Trading Toolkit (SMU)", "articles": ["Cong, G., Jensen, C. S., & Wu, D. (2009). Efficient retrieval of the top-k most relevant spatial web objects. Proceedings of the VLDB Endowment, 2(1), 337-348.", "Cao, X., Cong, G., & Jensen, C. S. (2010). Mining significant semantic locations from GPS data. Proceedings of the VLDB Endowment, 3(1-2), 1009-1020.", "Chen, L., Cong, G., Jensen, C. S., & Wu, D. (2013). Spatial keyword query processing : an experimental evaluation. Proceedings of the VLDB Endowment, 6(3), 217-228.", "Ma, Z., Sun, A., & Cong, G. (2013). On predicting the popularity of newly emerging hashtags in twitter. Journal of the American Society for Information Science and Technology, 64(7), 1399-1410.", "Cao, X., Cong, G., & Jensen, C. S. (2010). Retrieving top-k prestige-based relevant spatial web objects. Proceedings of the VLDB Endowment, 3(1-2), 373-384.", "Wu, D., Yiu, M. L., Cong, G., & Jensen, C. S. (2011). Joint top-k spatial keyword query processing. IEEE Transactions on Knowledge and Data Engineering, 24(10), 1889-1903.", "Cao, X., Chen, L., Cong, G., & Xiao, X. (2012l). Keyword-aware optimal route search. Proceedings of the VLDB Endowment, 5(11), 1136-1147.", "Wu, L., Xiao, X., Deng, D., Cong, G., Zhu, A. D., & Zhou, S. (2012). Shortest path and distance queries on road networks : an experimental evaluation. Proceedings of the VLDB Endowment, 5(5), 406-417.", "Wu, D., Cong, G., & Jensen, C. S. (2012). A framework for efficient spatial web object retrieval. The VLDB Journal, 21(6), 797-822.", "Liu, B., Cong, G., Zeng, Y., Xu, D., & Chee, Y. M. (2013). Influence spreading path and its application to the time constrained social influence maximization problem and beyond. IEEE Transactions on Knowledge and Data Engineering, 26(8), 1904-1917.", "Click  here for more publications.", "Wang, G., Cong, G., Zhang, Y., Hai, Z., & Ye, J. (2021). A synopsis based approach for itemset frequency estimation over massive multi-transaction stream. ACM Transactions on Knowledge Discovery from Data (TKDD), 16(2), 1-30.", "Luo, H., Bao, Z., Cong, G., Culpepper, J. S., & Khoa, N. L. D. (2021). Let trajectories speak out the traffic bottlenecks. ACM Transactions on Intelligent Systems and Technology (TIST), 13(1), 1-21.", "Tedjopurnomo, D. A., Li, X., Bao, Z., Cong, G., Choudhury, F., & Qin, A. K. (2021). Similar trajectory search with spatiooral deep representation learning. ACM Transactions on Intelligent Systems and Technology, 12(6), 1–26.", "Rugeles, D., Hai, Z., Dash, M., & Cong, G. (2020). Deterministic inference of topic models via maximal latent state replication. IEEE Transactions on Knowledge and Data Engineering, 34(4), 1684–1695.", "Zhao, K., Cong, G., & Li, X. (2020). PGeoTopic : a distributed solution for mining geographical topic models. IEEE Transactions on Knowledge and Data Engineering, 34(2), 881–893.", "Zhen Hai, Gao Cong, Kuiyu Chang, Peng Cheng, Chunyan Miao. (2017). Analyzing sentiments in One Go: A Supervised joint topic modeling approach. IEEE Transactions on Knowledge and Data Engineering, 29(6), 1172-1185.", "Zhen Hai, Kuiyu Chang, Gao Cong, Christopher C. Yang. (2014). An Association-based Unified Framework for Mining Features and Opinion Words. ACM Transactions on Intelligent Systems and Technology, ."], "books": [], "book_chapters": [], "conferences": ["Zhen Hai, Gao Cong, Kuiyu Chang, Wenting Liu, Peng Cheng. (2014). Coarse-to-Fine Review Selection via Supervised Joint Aspect and Sentiment Model. The 37th Annual ACM SIGIR CONFERENCE (SIGIR 2014).", "Xin Cao, Gao Cong, Christian S. Jensen, Man Lung Yiu. (2014). Retrieving Regions of Interest for User Exploration. 40th International Conference on Very Large Data Bases."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=WFFamJkAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/949347", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8987190900"}, "google_scholar": "https://scholar.google.com/citations?user=WFFamJkAAAAJ&hl=en&oi=ao", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8987190900", "web_of_science": "https://www.webofscience.com/wos/author/record/949347", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00744", "other_websites": ["https://personal.ntu.edu.sg/gaocong/"]}