{"full_name": "Wai Kin Adams Kong", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Wai Kin Adams Kong", "email": "adamskong@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Smart Cities"], "biography": "Since attaining his Ph.D. from the University of Waterloo, Canada in 2007, Asst Prof Adams Kong has gone on to publish 12 journal and over 20 conference papers. He has developed three patents, of which, one has been approved while two others have been filed. During his course of study, he has also gone to win the Scholastic Award from the Hong Kong Baptist University - an award presented only to the top student in his department. As a finalist of the 4th Young Inventor Awards 2002-2003, organized by Hewlett Packard and Far Eastern Economic Review, this capable inventor has received resounding media coverage for his “Palm Print Identification Algorithms for Real-Time Personal Identification”.    This palmprint identification system has earned several international and national awards.  It has aslo been applied to several real applications, including the control of access to a laboratory and a hotel. He has recently been listed as one of the “Who’s Who” in the World.", "interests": "His major research interests include pattern recognition, image processing and biometric security.", "grants": "Development of Electric Vertical Take-Off and Landing (eVTOL) Aircraft in SingaporeDigital Trust Centre (a.k.a. The National Centre for Research in Digital Trust (NCDT))Multi-Modal Deception Detection in VideosStrategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)Transferable Adversarial Example Generation and Selection", "articles": ["Adams Wai Kin Kong, D. Zhang*, M. Kamel*. (2006). An analysis of brute-force break-ins of a palmprint authentication system. IEEE Transactions on Systems, Man and Cybernetics, Part B, 36(5), 1201-1205.", "Adams Wai Kin Kong, D. Zhang*, G. Lu*. (2006). A study of identical twins' palmprint for personal verification. Pattern Recognition, 39(11), 2149-2156.", "Adams Wai Kin Kong, D. Zhang, M. Kamel. (2006). An anatomy of IrisCode for precise phase representation. (pp. 429-432).", "Adams Wai Kin Kong, K.H. Cheung, D.Zhang, M.Kamel, J.You. (2006). An analysis of Biohashing and its variants. Pattern Recognition, 39(7), 1359-1368."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=2GfXvbUAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00834", "other_websites": []}