{"full_name": "Zhang Tianwei", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Zhang Tianwei", "email": "tianwei.zhang@ntu.edu.sg", "keywords": ["Computer Science and Engineering"], "biography": "Dr. Tianwei Zhang received his Bachelor’s degree in physics at Peking University, in 2011, and the Ph.D degree in Electrical Engineering at Princeton University in 2017. He worked at Amazon as a software engineer from 2017 to 2019. He joined Nanyang Technological University as an assistant professor in 2019. He has published papers in top-tier architecture and security conferences and journals. He has served on the Program Committee of many conferences, and reviewers of journals.", "interests": "Dr. Zhang's research focuses on computer system and architecture security. Specifically,* Distributed system security: he is interested in building secure and flexible frameworks for attesting and protecting distributed systems, including cloud computing, IoT, robotic platforms, etc.* Machine learning security: he is interested in exploring security threats in deep learning platforms, and defense solutions.* Attacks and defenses: he is interested in designing system-level attacks, and methodologies of defeating sophisticated attacks.* Security analysis: he is interested in designing novel methodologies of measuring and quantifying system and architecture security.", "grants": "A Framework for Intellectual Property Protection of Deep Learning ApplicationsA Systematic Study about the Integrity Threats and Protection of Sensory Data in Autonomous VehiclesBuilding Security Tools for Investigating and Introspecting Applications in Trusted Execution EnvironmentDesign and Evaluation of Cyber Attacks against AI ChipsDetecting and Preventing Robotic AttacksHuman mesh reconstruction, Learning from small datasets, Self-supervised learningSecuring Face Recognition: An Imaging Polarimetry Approach to Face Anti-spoofingSmart Safe and Robust Motion Control for Multi-Robot SystemsTowards Building Unified Autonomous Vehicle Scene Representation for Physical AV Adversarial Attacks and Visual Robustness EnhancementTRUSTWORTHY AI CENTRE NTU (TAICeN)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NTU)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NUS)TRUSTWORTHY AI CENTRE NTU (TAICeN) (SMU)Trustworthy and Explainable AI “Safe, Fair and Robust AI System Development, Transparent or Explainable AI System Development, Explainability and Trust (Safe, Fair, Robust) Assessment”", "articles": ["Qiu, H., Dong, T., Zhang, T., Lu, J., Memmi, G., & Qiu, M. (2020). Adversarial attacks against network intrusion detection in IoT systems. IEEE Internet of Things Journal, 8(13), 10327-10335.", "Zhang, T., & Lee, R. B. (2016). Monitoring and attestation of virtual machine security health in cloud computing. IEEE Micro, 36(5), 28-37.", "He, Z., Zhang, T., & Lee, R. B. (2020). Attacking and protecting data privacy in edge–cloud collaborative inference systems. IEEE Internet of Things Journal, 8(12), 9706-9716.", "Zhang, T., & Lee, R. B. (2017). Design, implementation and verification of cloud architecture for monitoring a virtual machine's security health. IEEE Transactions on Computers, 67(6), 799-815.", "Qiu, H., Zheng, Q., Zhang, T., Qiu, M., Memmi, G., & Lu, J. (2020). Toward secure and efficient deep learning inference in dependable IoT systems. IEEE Internet of Things Journal, 8(5), 3180-3188.", "Xu, Y., Deng, G., Zhang, T., Qiu, H., & Bao, Y. (2021). Novel denial-of-service attacks against cloud-based multi-robot systems. Information Sciences, 576, 329-344.", "Qiu, H., Zeng, Y., Zheng, Q., Guo, S., Zhang, T., & Li, H. (2021). An efficient preprocessing-based approach to mitigate advanced adversarial attacks. IEEE Transactions on Computers.", "Guo, S., Zhang, T., Yu, H., Xie, X., Ma, L., Xiang, T., & Liu, Y. (2021). Byzantine-resilient decentralized stochastic gradient descent. IEEE Transactions on Circuits and Systems for Video Technology, 32(6), 4096-4106.", "Ye, Z., Sun, P., Gao, W., Zhang, T., Wang, X., Yan, S., & Luo, Y. (2022). ASTRAEA: A Fair Deep Learning Scheduler for Multi-tenant GPU Clusters. IEEE Transactions on Parallel and Distributed Systems, 33(11), 2781-2793.", "Sun, J., Xu, G., Zhang, T., Cheng, X., Han, X., & Tang, M. (2022). Secure Data Sharing With Flexible Cross-Domain Authorization in Autonomous Vehicle Systems. IEEE Transactions on Intelligent Transportation Systems.", "Click  here for more publications.", "Ye, Z., Sun, P., Gao, W., Zhang, T., Wang, X., Yan, S., & Luo, Y. (2022). ASTRAEA: A Fair Deep Learning Scheduler for Multi-tenant GPU Clusters. IEEE Transactions on Parallel and Distributed Systems, 33(11), 2781-2793.", "Luo, Y., Zhou, Y., Zhao, H., Jin, Z., Zhang, T., Liu, Y., ... & Yu, Y. (2022). Online adaptation for autonomous unmanned systems driven by requirements satisfaction model. Software and Systems Modeling, 21(4), 1295–1319.", "Guo, S., Zhang, T., Yu, H., Xie, X., Ma, L., Xiang, T., & Liu, Y. (2022). Byzantine-resilient decentralized stochastic gradient descent. IEEE Transactions on Circuits and Systems for Video Technology, 32(6), 4096-4106.", "Guo, S., Zhang, T., Xu, G., Yu, H., Xiang, T., & Liu, Y. (2022). Topology-aware differential privacy for decentralized image classification. IEEE Transactions on Circuits and Systems for Video Technology, 32(6), 4016-4027.", "Sun, X., Meng, Y., Ao, X., Wu, F., Zhang, T., Li, J., & Fan, C. (2022). Sentence Similarity Based on Contexts. Transactions of the Association for Computational Linguistics, 10, 573-588."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=9vpiYDIAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55635885400"}, "google_scholar": "https://scholar.google.com/citations?user=9vpiYDIAAAAJ&hl=en&oi=ao", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55635885400", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00562", "other_websites": ["https://personal.ntu.edu.sg/tianwei.zhang/"]}