{"full_name": "Lee Bu Sung", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Lee Bu Sung", "email": "ebslee@ntu.edu.sg", "keywords": ["Info-Communication Technology", "Internet & Communications", "Computer Science and Engineering", "Computer Networks and Communications", "Parallel and Distributed Computing"], "biography": "Bu Sung Lee received his B.Sc. (Hons) and PhD from the Electrical and Electronics Department, Loughborough University of Technology, UK in 1982 and 1987 respectively. He has held various senior administrative positions(Head of Division, Associate Chair for Research) in the School of Computing Engineering, Nanyang Technological University over the period from 2003-2010. He is currently an Associate Professor with the School of Computer Engineering, Nanyang technological University. He is currently involved in the Joint NTU-UBC Research Center of Excellence in Active Living for the Elderly (LILY) as its  Silver Cloud Programme Director. The later deals with developing deploying services to extend the active living of elderly community.  In addition, to the academic activities he also holds a Joint appointment as Director, Service Platform Lab, HP Labs. Singapore since July 2010 – June 2012.  He currently holds a position as Director, International Networks at National SuperComputing Center, Singapore.  He has been actively involved with the Asia-Pacific research and education network since the formation of Singapore Advance Research and Education Network(SingAREN). He is the founding president of SingAREN society, 2003-2007, and is currently the President of SingAREN(2011-2015).  Since 2004, he is a member of the technical management team of Trans-Eurasia Information Network (TEIN-2); the first large scale is the first large-scale research and education network for the Asia-Pacific. It connects ten countries in the region, and provides direct connectivity to Europe’s GÉANT2 network.  His involvements continue into the new phase of the project TEIN-3 and TEIN-4. He was elected the founding Chair of the governors of the Trans-Eurasia Information Network Cooperation Center(TEIN*CC), in May 2012,  which manages the TEIN-4 project.  Bu-Sung Lee has published over 300 peer preview conference papers, and 100 journal papers. His research areas cover both Grid/Cloud Computing and network. Lately he has carried out research in the area of application of Data Analytics and Big Data.  He has received a number of research grants. He is the co-author of a number of papers that has won Best Paper awards and demonstration award.  He has given numerous Invited/Keynote address in conferences and played an active role in the academic community in organizing conferences.Bu-Sung Lee, has been awarded numerous grants over the years. In early 2014, he successfully completed the A*STAR thematic grants “User and Domain Driven Data Analytics as a Service framework”.  The project developed a data analytics platform using Cloud resources and applied it to energy efficiency in building.", "interests": "Grid/Cloud Computing especially in the area of scheduling and scalability in data intensive application. Computer Network especially in the area of SDN, wireless ad hoc network, Quality of service.  Research Awards:Chonho Lee, Liu Yi, Li-Hau Tan, Weihan Goh, Bu-Sung Lee, Chai-Kiat Yeo, “A wavelet entropy-based change point detection on Network traffic”, 1st International workshop on Enterprise Security 2014. Held in conjunction with IEEE Cloudcom 2014. Singapore(3rd Prize in Best Paper award). Shanjiang Tang, Bu-Sung Lee, Bingsheng He “DynamicMR: A Dynamic Slot Allocation Optimization Framework for MapReduce Clusters”  . IEEE Transactions on Cloud Computing. 2014Abhishek Gupta, Laxmikant Kale, Filippo Gioachin, Verdi March, Chun Hui Suen, Bu-Sung Lee, Paolo Faraboschi, Richard Kaufmann and Dejan Milojicic, “The Who, What, Why and How of High Performance Computing in the Cloud”, 5th International conference on IEEE Cloud Computing Technology and Science, Dec 2013, Bristol, UK.(Best Paper Award)Henry Kasim, Terence Hung, Erika Fille Tupas Legara, Kee Khoon Lee, Xiaorong Li, Bu-Sung Lee,  Vicknesh Selvam, Sifei Lu, Long Wang, Christopher Monterola, and Vasundhara Jayaraman, “Scalable Complex System Modeling for Sustainable City”,  6th IEEE International Scalable Computing Challenge (SCALE 2013) held in conjunction with the 13th IEEE International symposium on Cluster, Cloud and Grid Computing(ccGrid 2013) at Delft, Netherland. 13-16 May 2013. (1st prize winner of the Scalable Computing challenge)Markus Kirchberg, Ryan K L Ko, Bu-Sung Lee, 2011 “From Linked Data to Relevant Data -- Time is the Essence” 1st International Workshop on Usage Analysis and the Web of Data (USEWOD) held in conjunction with the 20th International World Wide Web Conference (WWW), 2011, Hyderabad, India. (Best Paper Award)Dang Duc Nguyen, Teck Meng Lim, Chai-Kiat Yeo, Bu-Sung Lee, 2010 “Seamless Handoff in Heterogenous Network for VoIP application,” The Second International Conference on Advances in Future Internet(AFIN2010), July 18-25, 2010. Venice, Italy (Best Paper Award)", "grants": "Bridging the Gap Between Remote Sensing and Tree Modelling with Data ScienceMachine Learning Applications and Solutions for Semiconductor Product Engineering", "articles": ["Chaisiri, S., Lee, B. S., & Niyato, D. (2011). Optimization of resource provisioning cost in cloud computing. IEEE Transactions on Services Computing, 5(2), 164-177.", "Lim, D., Ong, Y. S., Jin, Y., Sendhoff, B., & Lee, B. S. (2007). Efficient hierarchical parallel genetic algorithms using grid computing. Future Generation Computer Systems, 23(4), 658-670.", "Fang, Y., Lin, W., Lee, B. S., Lau, C. T., Chen, Z., & Lin, C. W. (2011). Bottom-up saliency detection model based on human visual sensitivity and amplitude spectrum. IEEE Transactions on Multimedia, 14(1), 187-198.", "Tang, M., Lee, B. S., Tang, X., & Yeo, C. K. (2006). The impact of data replication on job scheduling performance in the data grid. Future Generation Computer Systems, 22(3), 254-268.", "Zhou, Z., Ong, Y. S., Lim, M. H., & Lee, B. S. (2007). Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Computing, 11(10), 957-971.", "Zhou, S., Cai, W., Lee, B. S., & Turner, S. J. (2004). Time-space consistency in large-scale distributed virtual environments. ACM Transactions on Modeling and Computer Simulation (TOMACS), 14(1), 31-47.", "Deng, C., Lin, W., Lee, B. S., & Lau, C. T. (2011). Robust image coding based upon compressive sensing. IEEE Transactions on Multimedia, 14(2), 278-290.", "Yang, S., Yeo, C. K., & Lee, B. S. (2011). Toward reliable data delivery for highly dynamic mobile ad hoc networks. IEEE Transactions on Mobile Computing, 11(1), 111-124.", "Tang, S., Lee, B. S., & He, B. (2014). DynamicMR: A dynamic slot allocation optimization framework for mapreduce clusters. IEEE Transactions on Cloud Computing, 2(3), 333-347.", "Foh, C. H., Liu, G., Lee, B. S., Seet, B. C., Wong, K. J., & Fu, C. P. (2005). Network connectivity of one-dimensional MANETs with random waypoint movement. IEEE Communications Letters, 9(1), 31-33.", "Click  here  for more publications.", "Borhani, A. H., Hung, T., Lee, B. S., & Qin, Z. (2019). Power-network aware VM migration heuristics for multi-tier web applications. Cluster Computing, 22(3), 757-782.", "Liu, Y., Lee, B. S., Rajan, D., Sluzek, A., & McKeown, M. J. (2019). CamType: assistive text entry using gaze with an off-the-shelf webcam. Machine Vision and Applications, 30(3), 407-421.", "Steentoft, A. A., Poorthuis, A., Lee, B. S., & Schläpfer, M. (2018). The canary in the city: indicator groups as predictors of local rent increases. EPJ Data Science, 7, 1-15.", "Chen, W., Yeo, C. K., Lau, C. T., & Lee, B. S. (2018). Leveraging social media news to predict stock index movement using RNN-boost. Data & Knowledge Engineering, 118, 14-24.", "Chen, Z., Yeo, C. K., Lee, B. S., Lau, C. T., & Jin, Y. (2018). Evolutionary multi-objective optimization based ensemble autoencoders for image outlier detection. Neurocomputing, 309, 192-200.", "Shengbo Yang, Chai Kiat Yeo, Bu Sung Lee. (2013). Cooperative Duty Cycling For Energy-Efficient Contact Discovery In Packet Switched Networks. IEEE Transactions on Vehicular Technology, vol. 62(4), pp. 1815-1826.", "Ahbik Banerjee; Vincent Gauthier;Chai Kiat Yeo; Hossam Afifi; Bu Sung Lee. (2012). A Self-Organization Framework for Wireless Ad Hoc Networks as Small Worlds. IEEE Transactions on Vehicular Technology, vol. 61(6), pp. 2659-2673."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"scopus": "https://www.scopus.com/authid/detail.uri?authorId=7405441352"}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=TyytTfQAAAAJ", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7405441352", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00531", "other_websites": []}