{"full_name": "Douglas Leslie Maskell", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Douglas Leslie Maskell", "email": "asdouglas@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Energy", "Computing Hardware and Architecture", "Hardware and Embedded Systems"], "biography": "Associate Professor Douglas Maskell is currently in the School of Computer Engineering since 2001. He received his Bachelor degree in Electrical and Electronics Engineering from James Cook University, Australia. He obtained the M.Eng.Sc. and and Ph.D. degrees from James Cook University, Australia. His research interests include reconfigurable computing and renewable energy systems.", "interests": "Associate Professor Douglas Maskell conducts research in the areas of reconfigurable computing systems, algorithm acceleration, embedded applications & architectures and renewable energy. He is an active member of both the Energy Research Institute @ NTU (ERI@N) and the Centre for High Performance Embedded Systems (CHiPES).His principle research focus is in the area of reconfigurable computing. In particular, he examines research problems that aim to overcome the emerging challenges introduced by the trend to incorporate reconfigurable fabrics into embedded and performance computers so as to significantly improve the overall performance of the computing system. This effort involves the development of tools, algorithms & architectures and system level modelling, simulation & design to improve the performance & management of the computing resources.  Research areas include: efficient utilisation of FPGA hardware & architecture resources for rapid and near routeless placement & fast configuration; system resource management & inter-module communications for run-time hardware systems and involves investigations at the tools, algorithms and architecture levels.He also applies his modelling and simulation expertise to projects in the renewable energy field. This initiative examines PV module and systems efficiency in tropical climates. Specifically, this work investigates: novel algorithms and architectures for maximum power point tracking, including hybrid architectures, operating under partial shading conditions and sudden irradiance changes; inverter architectures; and  concentrated PV (CPV) systems.", "grants": "AI-based parameter selection for enabling fast and safe Li-ion battery chargingREAM: a REdundancy strategy involving Approximate function Modules for resource constrained electronic design operating in radiation environments", "articles": ["Y. Chen, B. Schmidt and D.L. Maskell. (2013). A hybrid short read mapping accelerator. BMC Bioinformatics, 14(67), 1-14.", "D. Nayanasiri, D M Vilathgamuwa and D L Maskell. (2013). Half-Wave Cycloconverter Based Photovoltaic Microinverter Topology with Phase Shift Power Modulation. IEEE Transactions on Power Electronics, 28(6), 2700-2710.", "L.L. Jiang, D. L. Maskell and J. C. Patra. (2013). A Novel Ant Colony Optimization-based Maximum Power Point Tracking for Photovoltaic Systems under Partially Shaded Conditions. Energy and Buildings, 58, 227–236.", "Y. Liu, B. Schmidt, DL. Maskell. (2012). CUSHAW: a CUDA compatible short read aligner to large genomes based on the Burrows-Wheeler transform. Bioinformatics, 28(14), 1830-1837."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01059", "other_websites": ["http://www3.ntu.edu.sg/home/asdouglas/"]}