{"full_name": "Jagath Chandana Rajapakse", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Jagath Chandana Rajapakse", "email": "asjagath@ntu.edu.sg", "image_path": "./profile_img/jagath_chandana_rajapakse.jpg", "keywords": ["Biomedical Engineering", "Computational Intelligence", "Information Sciences and Systems", "Healthy Brain Ageing", "Mental Health", "Neuroscience", "Artificial and Augmented Intelligence", "Biomedical Informatics and Data Science"], "biography": "Jagath Rajapakse is Professor of Computer Science and Engineering at the Nanyang Technological University (NTU), Singapore. He has BSc degree in Electronics and Telecommunication Engineering from University of Moratuwa (UM), Sri Lanka, and MS and PhD degrees in Electrical and Computer Engineering from University at Buffalo (UB), USA. He was Visiting Scientist to the Max-Planck Institute of Cognitive and Brain Sciences, Germany, and the National Institute of Mental Health, USA. He was Visiting Professor to the Department of Biological Engineering at Massachusetts Institute of Technology (MIT).He serves as Editor for Engineering Applications in Artificial Intelligence journal (IF = 7.802) and served as Associate Editor for IEEE Transactions on medical imaging, IEEE Transaction on neural networks and learning systems, and IEEE Transactions on computational biology and bioinformatics. He was a Fulbright Scholar and appointed IEEE Fellow in 2012 in recognition of his contributions to brain image analysis.", "interests": "Professor Rajapakse’s research works are in the areas of data science, machine learning, brain imaging, and computational and systems biology. He has published over 300 peer-reviewed research articles in high-impact journals and conferences. His research articles have been cited over 14,000 times on Google Scholar. He was recently ranked among the top 2% scientists globally by Stanford Study. His current research focus on developing techniques and tools for diagnosis and treatment of brain diseases. He develops tools to detect and segment brain structures, lesions, and tumours from CT and MRI scans with deep learning technologies. He investigates the connectome from functional MRI and DTI scans for disease identification and biomarker discovery. He is also looking into how neuroimaging data can be integrated with multi-omics (genomics, proteomics, transcriptomics, and epigenomics) data for investigating neurological and psychiatric diseases.", "grants": "Decoding the connectome by deep encoding on graphsDeep generative approach for de novo cancer drug discovery with desired mechanism of actionDeveloping Unsupervised Machine Learning Techniques for Discovering Novel Ocular and Brain Imaging Biomarkers of Alzheimer’s DiseaseMachine learning for Demand ForecastingNovel methods of network modelling and personalised machine learning to understand and predict individual dementia using heterogeneous multi-omics dataNovel MRI Toolbox to Classify and Predict Asian Mild Cognitive ImpairmentSoftware Application for Thermal imaging analytics", "articles": ["2.    P. Hiort, J. Hugo, J. Zeinert, N. Muller, S. Kashyap, J. C. Rajapakse, F. Azhuaje, B. Y. Renard, and K. Baum, “DrDimont: explainable drug response prediction from differential analysis of multi-omics networks,” Bioinformatics , Vol. 38, Supplement 2, September 2022, Pages ii113-ii119, IF = 6.931 DOI:10.1093/bioinformatics/btac477", "3.  Y. H. Chan, C. Wang, W. K. Soh, and J. C. Rajapakse, “Combining neuroimaging and omics datasets for disease classification using graph neural networks,” Frontiers of Neuroscience, IF = 4.677, 23 May 2022, DOI: https://doi.org/10.3389/fnins.2022.866666", "4.    Y. H. Chan, W. C. Yew, J. C. Rajapakse, (2022). Semi-supervised Learning with Data Harmonisation for Biomarker Discovery from Resting State fMRI. In: Wang, L., Dou, Q., Fletcher, P.T., Speidel, S., Li, S. (eds) Medical Image Computing and Computer Assisted Intervention – MICCAI 2022. Lecture Notes in Computer Science, vol 13431: 441-451, September 2022, Springer, DOI: 10.1007/978-3-031-16431-6_42", "5.    S. Gupta, M. Lim, and J. C. Rajapakse, “Decoding task-specific and task-general architectures of the brain,” Human Brain Mapping , 43: 2801 - 2816, IF = 4.554, February 2022, DOI: onlinelibrary.wiley.com/doi/epdf/10.1002/hbm.25817", "6.    C. Wang, X. Lye, R. Kaalia, P. Kumar, and J. C. Rajapakse, “Deep learning and multi-omics approach to predict drug responses in cancer,” BMC Bioinformatics, 22:632, IF = 3.169, 10.1186/s12859-022-04964-9 , May 2021", "7.    S. Gupta, Y. H. Chan, and J. C. Rajapakse, “Obtaining leaner deep neural networks for decoding brain functional connectome in a single shot,” Neurocomputing, January, 2021, DOI: 10.1016/j.neucom.2020.04.152, IF = 4.438", "8.    X. Zhong and J. C. Rajapakse, “Graph embeddings on gene ontology annotations for protein-protein interaction prediction,” BMC Bioinformatics, 21, 516, December 2020, DOI: 10.1186/s12859-020-03816-8", "9.    S. Gupta and J. C. Rajapakse, “Iterative consensus spectral clustering improves detection of subject and group level brain functional modules,” Scientific Reports, 10: 7590, May 2020, DOI:/10.1038/s41598-020-63552-0, IF = 4.011", "10.    S. Gupta, J. C. Rajapakse, and R. E. Welsch, “Ambivert degree identifies crucial brain functional hubs and improves detection of Alzheimer’s disease and autism spectrum disorder,” NeuroImage: Clinical , Volume 25, 102186, Jan 2020, DOI: /10.1016/j.nicl.2020.102186 , IF = 3.943", "11.  L.-C. Tranchevent, F. Azuaje, and J. C. Rajapakse, “A deep neural network approach to predicting clinical outcomes of neuroblastoma patients,” BMC Medical Genomics, 12, 178, Dec 2019, DOI: 10.1186/s12920-019-0628-y , IF = 3.317", "12.  R. Kaalia and J.C. Rajapakse, “Refining modules to determine functionally significant clusters in molecular networks,” BMC Genomics, 20: 901, Dec 2019, DOI: 10.1186/s12864-019-6294-9 , IF = 3.730", "13.  X. Zhong, R. Kaalia, and J. C. Rajapakse, “GO2Vec: transforming GO terms and proteins to vector representations using graph embeddings” BMC Genomics, 20: 918, Dec 2019, DOI: 10.1186/s12864-019-6272-2, IF = 3.730", "14.  S. Gupta, Y. H. Chen, and J. C. Rajapakse “Decoding brain functional connectivity implicated in AD and MCI,” Medical Image Computing and Computer Assisted Intervention – MICCAI 2019. Lecture Notes in Computer Science, LNCS 11766, pp. 781–789, 2019, DOI: 10.1007/978-3-030-32248-9_87", "15.  K. Baum, J. C. Rajapakse, and F. Azuaje, “Analysis of correlation-based molecular networks from different omics data by fitting stochastic block models,” F1000Research, 8: 465, Aug 2019, DOI: 10.12688/f1000research.18705.2", "16. W. Liu and J. C. Rajapakse, “Fusing gene expressions and transitive protein interactions for inference of gene regulatory networks,” BMC Systems Biology, 13(Suppl 2): 37, April 2019, DOI: 10.1186/s12918-019-0695-x , IF = 2.05", "17. A. N. Barrett, C. Y. Fong, A. Subramanian, W. Liu, Y. Feng, M. Choolani, A. Biswas, J. C. Rajapakse, and A. Bongso, “Human Wharton’s jelly mesenchymal stem cells show unique expressions compared with bone marrow mesenchymal stem cells using single-cell RNA sequencing,” Stem Cells and Development, 28(3), Feb 2019, DOI: 10.1089/scd.2018.0132, IF = 3.315", "18. R. Kaalia and J. C. Rajapakse, “Functional homogeneity and specificity of topological modules in human proteome,” BMC Bioinformatics , 19: 553, Feb 2019, DOI: 10.1186/s12859-018-2549-8, IF = 2.511", "19.  X. Sui and J. C. Rajapakse, “Profiling heterogeneity of Alzheimer’s disease using white matter impairment factors,” Neuroimage: Clinical , 20, pp. 1222 – 1232, Oct 2018, DOI: 10.1016/j.nicl.2018.10.026 , IF = 4.348", "20.  W. Liu, J. Liu, and J. C. Rajapakse, “Gene ontology enrichment improves performances of functional similarity of genes,” Scientific Reports , 8: 12100, Aug 2018, DOI: 10.1038/s41598-018-30455-0 ,IF = 4.122", "21. D. N. Wadduwage, J. Kay, V. R. Singh, O. Kiraly, M. R. Sukup-Jackson, J. C. Rajapakse, B. P. Engelward, and P. T. C. So, “Automated fluorescence intensity and gradient analysis enables detection of rare fluorescent mutant cells deep within the tissue of RaDR mice,” Scientific Reports , 8:12108, Aug 2018, DOI: 10.1038/s41598-018-30557-9, IF = 4.122,", "22.  L.-C. Tranchevent, P. V. Nazarov, T. Kaoma, G. P. Schmartz, A. Muller, S.-Y. Kim, J. C. Rajapakse, and F. Azuaje, “Predicting clinical outcome of neuroblastoma patients using an integrative network-based approach,” Biology Direct , 13:12, June 2018, DOI: 10.1186/s13062-018-0214-9 , IF = 2.649"], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=9WPWHiEAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/1707614", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7003412852"}, "google_scholar": "https://scholar.google.com/citations?user=9WPWHiEAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0001-7944-1658", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7003412852", "web_of_science": "https://www.webofscience.com/wos/author/record/1707614", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00169", "other_websites": ["https://personal.ntu.edu.sg/asjagath"]}