{"full_name": "Vun Chan Hua, Nicholas", "designation": "Associate Dean (Continuing Education), College of Engineering", "name_card": "Assoc Prof Vun Chan Hua, Nicholas", "email": "aschvun@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Info-Communication Technology", "Internet & Communications", "Computing Hardware and Architecture"], "biography": "Assoc Prof Nicholas Vun has been with the School of Applied Science and School of Computer Engineering since 1991. He received his B.Eng (1st class Honours) and M.Eng.Sci. degrees in Electrical & Computer System Engineering from Electrical Department of Monash University, Australia, and PhD from School of Computer Engineering of NTU. His main research interests include Embedded signal conversion and processing, as well as Embedded System’s design and applications. He has more than 50 publications in conference proceedings and journals. He was awarded NTU's 'Teacher of the Year' award in 1994.Prior to joining NTU, he worked with Ausmode Power Systems and Exicom Power Systems in Australia as Senior Electronics Design Engineer, specializing in the design of microprocessor based high power and high frequency switch mode power supply and embedded control systems for telecommunication equipment. While teaching in NTU, he has continue to provide consultation services and conduct professional courses for the industry in areas of power supply design, embedded control system design and computer system technologies related topics to companies in Malaysia, Singapore, India and Australia. Nicholas Vun is a registered 'Professional Engineer' with Singapore's Professional Engineers Board, and a Senior Member of IEEE. He is the founding chairman of the IEEE Consumer Electronics Society of Singapore, and served as the General Chairman of the 2011 as well as 1997 IEEE International Symposium on Consumer Electronics Conference, and most recently, the Technical Program Chair of the 2016 IEEE International Conference on Consumer Electronics at Las Vegas. He has continue to involve in the various ISCE conferences’ technical committee, and has also held positions as Vice Chair, Treasurer and committee members of the IEEE  CE Chapter in Singapore over the years. He has also served as the Associate Editor of IEEE Consumer Electronics Magazine and the Quality Chair for IEEE CES.", "interests": "Prof Nicholas Vun's  areas of expertise are embedded system design, switch mode power supply, and embedded data acquisition system.  His current research works focus on developing embedded signal conversion and signal processing techniques based on compressive sensing and number theory approach.", "grants": "Cyber Research Programme Office (CRPO)", "articles": ["Chen, H. & Vun, C.H. (2018). A Feature-Based Compressive Spectrum Sensing Technique for Cognitive Radio Operation. Circuits Systems and Signal Processing, 37(3), 1287-1314.", "Warrier, R., Zhang, W. & Vun, C.H. (2017). Pipeline Reconfigurable DSP for Dynamically Reconfigurable Architecture. Circuits Systems and Signal Processing, 36(9), 3799-3824.", "Warrier, R., Shreejith, S., Zhang, W., Vun, C.H., Fahmy, S.A. (2017). Fracturable DSP Block for Multi-context Reconfigurable Architectures. Circuits Systems and Signal Processing, 36(7), 3020-3033.", "Chen, H.; Vun, C. H. (2016). An Efficient Compressive Spectrum Sensing Technique for Cognitive Radio System. IEEE TENCONSingapore: IEEE."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00839", "other_websites": []}