{"full_name": "Lu Shijian", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Lu Shijian", "email": "shijian.lu@ntu.edu.sg", "image_path": "./profile_img/lu_shijian.jpg", "keywords": ["Computer Vision and Sensing", "Neuroscience", "Graphics and Interactive Computing", "Economics", "Smart Cities"], "biography": "Shijian received his PhD in electrical and computer engineering from the National University of Singapore. He is currently an Associate Professor with the School of Computer Science and Engineering, Nanyang Technological University (NTU), Singapore. His major research interests include image and video analytics, visual intelligence, and machine learning. He has published more than 100 international refereed journal and conference papers and co-authored up to10 patents in these research areas. Before joining in NTU, he took a number of leadership roles in the Institute for Infocomm Research (I2R), under the Agency for Science, Technology, and Research (A*SATR) in Singapore, including Head of Visual Attention Lab, Deputy Head of Satellite Department, Co-Chair of the Image and Pervasive Access Laboratory. He is currently an Associate Editor for the journal Pattern Recognition (PR) and Neurocomputing. He has also served in the program committee of a number of conferences such as the Senior Program Committee of the International Joint Conferences on Artificial Intelligence and Association for the Advancement of Artificial Intelligence.", "interests": "Computer Vision and SensingImage and Video AnalyticsVisual IntelligenceDeep Learning", "grants": "Automated Synthesis of High-Fidelity Images for Deep Network TrainingLADIS: Learnable Augmentation for Data-Limited Image SynthesisSimple and Efficient 3D Modelling with Neural Radiance Fields", "articles": ["Jiaxing Huang, Dayan Guan, Aoran Xiao, Shijian Lu. (2022). Multi-Level Adversarial Network for Domain Adaptive Semantic Segmentation.  Pattern Recognition.", "Zhenguang Liu, Shuang Wu, Shuyuan Jin, Qi Liu, Shouling Ji, Shijian Lu, Li Cheng. (2022). Investigating Pose Representations and Motion Contexts Modeling for 3D Motion Prediction. IEEE Transactions on Pattern Analysis and Machine Intelligence.", "Dayan Guan, Jiaxing Huang, Aoran Xiao, Shijian Lu, Yanpeng Cao. (2022). Uncertainty-aware unsupervised domain adaptation in object detection. IEEE Transaction on Multimedia."], "books": [], "book_chapters": [], "conferences": ["Fangneng Zhan, Jiahui Zhang, Yingchen Yu, Rongliang Wu, Shijian Lu. (2022). Modulated Contrast for Versatile Image Synthesis.  2022 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR).", "Gongjie Zhang, Zhipeng Luo, Yingchen Yu, Kaiwen Cui, Shijian Lu. (2022). Accelerating DETR Convergence via Semantic-Aligned Matching. IEEE International Conference on Computer Vison and Pattern Recognition (CVPR).", "Aoran Xiao, Jiaxing Huang, Dayan Guan, Fangneng Zhan, Shijian Lu. (2022). SynLiDAR: Learning From Synthetic LiDAR Sequential Point Cloud for Semantic Segmentation. AAAI Conference on Artificial Intelligence (AAAI).", "Kaiwen Cui, Jiaxing Huang, Zhipeng Luo, Gongjie Zhang, Fangneng Zhan, Shijian Lu. (2022). GenCo: Generative Co-training on Data-Limited Image Generation. AAAI Conference on Artificial Intelligence (AAAI)."], "bibliometrics": {"google_scholar": "https://scholar.google.com.sg/citations?view_op=list_works&hl=en&hl=en&user=uYmK-A0AAAAJ&sortby=pubdate", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8439329200"}, "google_scholar": "https://scholar.google.com.sg/citations?view_op=list_works&hl=en&hl=en&user=uYmK-A0AAAAJ&sortby=pubdate", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8439329200", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01128", "other_websites": ["https://personal.ntu.edu.sg/shijian.lu/index.htm"]}