{"full_name": "Liu Yang", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Liu Yang", "email": "yangliu@ntu.edu.sg", "image_path": "./profile_img/liu_yang.jpg", "keywords": ["Computer Science and Engineering", "Cyber Security and Forensics"], "biography": "Dr. Yang Liu obtained his bachelor and ph.d degree in the National University of Singapore in 2005 and 2010, respectively. In 2012, he joined Nanyang Technological University as a Nanyang Assistant Professor. He is currently a full professor, director of the cybersecurity lab, Program Director of HP-NTU Corporate Lab and Deputy Director of the National Satellite of Excellence of Singapore. In 2019, he received the University Leadership Forum Chair professorship at NTU.Dr. Liu specializes in software verification, security and software engineering. His research has bridged the gap between the theory and practical usage of formal methods and program analysis to evaluate the design and implementation of software for high assurance and security. By now, he has more than 270 publications in top tier conferences and journals. He has received a number of prestigious awards including MSRA Fellowship, TRF Fellowship, Nanyang Assistant Professor, Tan Chin Tuan Fellowship, Nanyang Research Award (Young Investigator) 2018, NRF Investigatorship 2020 and 10 best paper awards and one most influence system award in top software engineering conferences like ASE, FSE and ICSE.", "interests": "For cybersecurity, we are working at malware modeling, detection, classification and generation with the focus on Javascript malware, desktop malware and Android malware. We are developing tools for vulnerability modeling and detection using machine learning and (both static and dynamic) program analysis on binary code. In our Securify research project (2015 - 2020), we are performing formal verification on security system from hardware, hypervisor, programs to security protocol using different verification approaches. Recently, we embark on the research on Automotive Security and autonomous vehicle Security in their security design, runtime security monitoring and response, and also the security testing and certification.For software engineering, we are working on the topics related to program specification learning and model learning, performance analysis, Android energy analysis, reliability analysis, code clone analysis, program debugging, program testing, automatic loop analysis, testing and validating deep learning algorithms using techniques like model checking, symbolic execution and machine learning. We are building tools related to these aspects. For Android system, we have been working on security analysis on App malware detection & classification, generation and data analytic, App vulnerability analysis, App testing, Android OS testing and fuzzing, and Automatic UI generation.For multi-agent systems, we are working on the topics related to formal modeling of various multi-agent systems, particularly trust management systems and their analysis in correctness, security and robustness.For big data, we are promoting the concept called event analytic based on behavior learning and analysis, and their applications in sports and finance systems.", "grants": "2019 University Leadership Forum Chair in Computer Science and EngineeringA Framework for Intellectual Property Protection of Deep Learning ApplicationsBuilding Security Tools for Investigating and Introspecting Applications in Trusted Execution EnvironmentCLOUDSEC: SECURITY ANALYSIS OF CLOUD INFRASTRUCTURESCyber Research Programme Office (CRPO)Emulation Based Fuzzing TechniqueEnhancing the Robustness of Object Detection against Natural Corruption-aware Adversarial AttacksMAASS: Malware Authorship Attribution based on Source Code and Static AnalysisSimulation-based SOTIF (Safety of the Intended Functionality) Testing for Autonomous Driving SystemsSmart Safe and Robust Motion Control for Multi-Robot SystemsThe Science of Certified AI SystemsThrust B: Artificial Intelligence and Software Engineering (IAF-ICP)Thrust B: Artificial Intelligence and Software Engineering (RCA)Towards Building Trustworthy and Robust Intelligent Systems and Its Application on Human BrainTowards Building Unified Autonomous Vehicle Scene Representation for Physical AV Adversarial Attacks and Visual Robustness EnhancementTowards Semantic-Aware Multimodal and Multilingual Deep Learning Systems for E-Commerce ApplicationsTrustFUL: Trustworthy Federated Ubiquitous LearningTrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)TRUSTWORTHY AI CENTRE NTU (TAICeN)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NTU)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NUS)TRUSTWORTHY AI CENTRE NTU (TAICeN) (SMU)Trustworthy and Explainable AI", "articles": ["K. Cheng, Y. Bai, Y.Zhou, Y. Tang, D. Sanan, Y. Liu. (2020). CANeleon: Protecting CAN Bus with Frame ID Chameleon. IEEE Transactions on Vehicular Technology , .", "Jianwen Sun, Tianwei Zhang, Xiaofei Xie, Lei Ma, Yan Zheng, Kangjie Chen, Yang Liu. (2020). Stealthy and Efficient Adversarial Attacks against Deep Reinforcement Learning. Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI 2020).", "Y Zhou, H Hu, Y Liu, S-W Lin, and Z Ding. (2020). A distributed method to avoid higher-order deadlocks in multi-robot systems. Automatica, 112.", "Jianwen Sun, Yan Zheng, Jianye Hao, Zhaopeng Meng, Yang Liu. (2020). Continuous Multiagent Control using Collective Behavior Entropy for Large-Scale Home Energy Management. Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI 2020)."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00564", "other_websites": ["https://personal.ntu.edu.sg/yangliu"]}