{"full_name": "A S Madhukumar", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof A S Madhukumar", "email": "asmadhukumar@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Info-Communication Technology", "Interactive Digital Media", "Internet & Communications", "Computer Networks and Communications"], "biography": "AS Madhukumar’s expertise lies in the areas of multi-tier cellular architecture, cooperative and cognitive radio systems, interference management, coding and modulation, new multiple access schemes, hybrid radio systems and other advanced signal processing algorithms for future communication systems. He is involved in a number of funded research projects, organizing international conferences, and a permanent reviewer for many internationally reputed journals and conferences. He has published over 300 referred international conference and journal papers. He is a recipient of Nanyang Award for Teaching Excellence in 2007 and obtained best paper awards in IEEE 35th Digital Avionics Conference in 2016 and in IEEE Integrated Communications, Navigations and Surveillance Conference in 2016 and in 2017. A S Madhukumar received his B Tech degree from College of Engineering, Trivandrum, India, M Tech from Cochin University of Science and Technology, India and Ph D from Department of Computer Science and Engineering, Indian Institute of Technology, Madras, India. He is currently an Associate Professor in the School of Computer Engineering, Nanyang Technological University, Singapore. Before joining NTU, he was involved in communications and signal processing research at Centre for Development of Advanced Computing (Electronics R&D Centre), Govt. of India and Institute for Infocomm Research (Centre for Wireless Communications), Singapore. Dr. Madhukumar is a senior member of IEEE.", "interests": "Artificial intelligence and machine learning algorithms for communication systemsResource allocation and Interference management in communication systemsMulti-tier cellular architecture for future broadband systemsCognitive radio systems: algorithms and architecturesCooperative Radio Systems for Mobile multi-hop networksModulation and multiple access schemes for future broadband systemsAdvanced signal processing algorithms for future wireless communication systems", "grants": "High Altitude Platform based Relays for Hybrid FSO/RF Communication for Satellite Communication SystemsHybrid TeraHertz/Free Space Optics (THz/FSO) for 6G Communication Networks", "articles": ["Ho, W. S., Madhukumar, A. S., & Chin, F. (2003). Peak-to-average power reduction using partial transmit sequences : a suboptimal approach based on dual layered phase sequencing. IEEE Transactions on Broadcasting, 49(2), 225-231. doi: 10.1109/TBC.2003.813440", "Jacob, P., Sirigina, R. P., Madhukumar, A. S., & Prasad, V. A. (2016). Cognitive radio for aeronautical communications : a survey. IEEE Access, 4, 3417-3443. doi: 10.1109/ACCESS.2016.2570802", "Hari, V. N., Anand, G. V., Premkumar, A. B., & Madhukumar, A. S. (2012). Design and performance analysis of a signal detector based on suprathreshold stochastic resonance. Signal Processing, 92(7), 1745-1757. doi: 10.1016/j.sigpro.2012.01.013", "Zhong, X., Premkumar, A. B., & Madhukumar, A. S. (2012). Particle filtering for acoustic source tracking in impulsive noise with alpha-stable process. IEEE Sensors Journal, 13(2), 589-600. doi: 10.1109/JSEN.2012.2223209", "Duong, N. D., Madhukumar, A. S., & Niyato, D. (2015). Stackelberg Bayesian game for power allocation in two-tier networks. IEEE Transactions on Vehicular Technology, 65(4), 2341-2354. doi: 10.1109/TVT.2015.2418297", "Swaminathan, R., & Madhukumar, A. S. (2017). Classification of error correcting codes and estimation of interleaver parameters in a noisy transmission environment. IEEE Transactions on Broadcasting, 63(3), 463-478. doi: 10.1109/TBC.2017.2704436", "Zhong, X., Premkumar, A. B., & Madhukumar, A. S. (2011). Particle filtering and posterior Cramér-Rao bound for 2-D direction of arrival tracking using an acoustic vector sensor. IEEE Sensors Journal, 12(2), 363-377. doi: 10.1109/JSEN.2011.2168204", "Sharma, N., & Madhukumar, A. S. (2015). Genetic algorithm aided proportional fair resource allocation in multicast OFDM systems. IEEE Transactions on Broadcasting, 61(1), 16-29. doi: 10.1109/TBC.2015.2389692", "Alen, T. C. H., Madhukumar, A. S., & Chin, F. (2003). Capacity enhancement of a multi-user OFDM system using dynamic frequency allocation. IEEE transactions on broadcasting, 49(4), 344-353. doi: 10.1109/TBC.2003.819525", "Madhukumar, A. S., & Chin, F. (2004). Enhanced architecture for residue number system-based CDMA for high-rate data transmission. IEEE Transactions on Wireless Communications, 3(5), 1363-1368. doi: 10.1109/TWC.2004.833509", "Click  here for more publications.", "S Shubha, AS Madhukumar, R Swaminathan, 2021, MIMO hybrid FSO/RF system over generalized fading channels, IEEE Transactions on Vehicular Technology, IEEE, USA, Vol 70, No 11, pp 11565-11581, Nov 2021.", "Agrawal, N., Ambede, A., Darak, S. J., Vinod, A. P., & Madhukumar, A. S. (2021). Design and implementation of low complexity reconfigurable filtered-OFDM-based LDACS. IEEE Transactions on Circuits and Systems II: Express Briefs, 68(7), 2399-2403. doi: 10.1109/TCSII.2021.3053367", "TZH Ernest, AS Madhukumar, RP Sirigina and AK Krishna, 2021, NOMA-aided multi-UAV communications in full-duplex heterogeneous networks, IEEE Systems Journal, IEEE, USA, Vol 15, No 2, pp 2755-2766, Jun 2021.", "Swaminathan, R., Sharma, S., Vishwakarma, N., & Madhukumar, A. S. (2021). HAPS-based relaying for integrated space–air–ground networks with hybrid FSO/RF communication : a performance analysis. IEEE Transactions on Aerospace and Electronic Systems, 57(3), 1581-1599. doi: 10.1109/TAES.2021.3050663", "Shah, S., Siddharth, M., Vishwakarma, N., Swaminathan, R., & Madhukumar, A. S. (2021). Adaptive-combining-based hybrid FSO/RF satellite communication with and without HAPS. IEEE Access, 9, 81492-81511. doi: 10.1109/ACCESS.2021.3086024", "Sharma, S., Madhukumar, A. S., & Ramabadran, S. (2020). Performance optimisation for dual-hop hybrid FSO/RF system with selection combining. IET Optoelectronics, 14(6), 422-433. doi: 10.1049/iet-opt.2020.0059", "Mathew, L. K., Shanker, S., Vinod, A. P., & Madhukumar, A. S. (2020). A power-efficient spectrum-sensing scheme using 1-Bit quantizer and modified filter banks. IEEE Transactions on Very Large Scale Integration (VLSI) Systems, 28(9), 2074-2078. doi: 10.1109/TVLSI.2020.3009430", "TZH Ernest, AS Madhukumar, RP Sirigina and AK Krishna, 2020, NOMA-Aided UAV communications over correlated Rician shadowed fading channels, IEEE Transactions on Signal Processing, IEEE, USA, Vol 68, pp 3103-3116, May 2020.", "R Swaminathan, AS Madhukumar and W Guohua, 2020, Blind estimation of code parameters for product codes over noisy channel conditions, 2020, IEEE Transactions on Aerospace and Electronic Systems, IEEE, USA, Vol 56, No 2, pp 1460-1473, Apr 2020.", "SR Yepuri, AS Madhukumar and RP Sirigina, 2020, Wireless Energy Harvesting Based Relaying: A Finite-SNR  Diversity-Multiplexing Tradeoff Perspective, IEEE Transactions on Green Communications and Networking, IEEE, USA, Vol 4, No 1, pp 277-288. Mar 2020.", "TZH Ernest, AS Madhukumar, RP Sirigina and AK Krishna, 2019, Outage analysis and finite SNR diversity-multiplexing tradeoff of hybrid-duplex Systems for aeronautical communications, IEEE Transactions on Wireless Communications, IEEE, USA, Vol 18, No 4, pp 2299-2313, Apr 2019.", "TZH Ernest, AS Madhukumar, RP Sirigina and AK Krishna, 2019, A hybrid-duplex system with joint detection for interference-limited UAV communications, IEEE Transactions on Vehicular Technology, Vol 68, No 1, pp 335-348, IEEE, USA, Jan 2019."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=7_AzrLwAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/990763", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7003877769"}, "google_scholar": "https://scholar.google.com/citations?user=7_AzrLwAAAAJ&hl=en&oi=ao", "orcid": "https://orcid.org/0000-0002-8740-634X", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7003877769", "web_of_science": "https://www.webofscience.com/wos/author/record/990763", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00083", "other_websites": ["http://www3.ntu.edu.sg/home/asmadhukumar/"]}