{"full_name": "Vidya Sudarshan", "designation": "Lecturer, School of Computer Science and Engineering", "name_card": "Dr Vidya Sudarshan", "email": "vidya.sudarshan@ntu.edu.sg", "image_path": "./profile_img/vidya_sudarshan.jpg", "keywords": [], "biography": "Vidya Sudarshan is a Lecturer at School of Computer Science and Engineering (SCSE) in Nanyang Technological University (NTU). She received her PhD from Nanyang Technological University (NTU), Singapore and has more than 15+ years of research and teaching experience. Her main research expertise is in medical data mining, time series prediction, image and bio-signal processing, deep learning, Intelligent systems and AI applications. She has published more than 40 research papers in high impact factor journals.", "interests": null, "grants": "Assessing the effectiveness of interdisciplinary teams on learning and  assessment for STEM versus non-STEM students", "articles": ["Yu Na Wu, Vidya K Sudarshan, Shi Chao Zhu, Sung Joon Kim, Yin Hua Zhang. Functional interactions between complex I and nNOS in regulating cardiac mitochondrial activity in sham and hypertensive rat hearts. Pflugers Archiv – European Journal of Physiology, 2020; 472: 1743-1755.", "Vidya K Sudarshan, U Rajendra Acharya, Oh Shu Lih, Muhammad Adam, Tan Jen Hong, Chua Kuang Chua, Chua Kok Poo, Tan Ru San. Automated diagnosis of congestive heart failure using dual tree complex wavelet transform and statistical features extracted from 2 seconds of ECG signals. Computers in Biology and Medicine, 2017; 83: 48-58.", "U Rajendra Acharya, Vidya K Sudarshan, Dhanjoo N Ghista, Lim Wei Jie Eugene, Filippo Molinari, Meena Sankaranarayanan. Computer-Aided Diagnosis of diabetic subjects by HRV signals using discrete wavelet transform method. Knowledge-Based Systems, 2015; 81: 56-64.", "Vidya KS, Acharya UR, Ng EYK, Chou Siaw Meng, Tan RS, Ghista DN, “Automatic identification of myocardial infarction tissue characterization using ultrasound images: A Review”, IEEE Reviews in Biomedical Engineering, 2014; 8: 86-97"], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01361", "other_websites": []}