{"full_name": "Chee Wei Tan", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Chee Wei Tan", "email": "cheewei.tan@ntu.edu.sg", "keywords": [], "biography": "Dr. Tan received the M.A and Ph.D. degrees in Electrical Engineering from Princeton University. His research interests are networks, cloud computing, distributed machine learning, Artificial Intelligence (AI), blockchains and AI for Health-Tech. Dr. Tan is serving as the Editor for BMC Archives of Public Health,  IEEE Transactions on Cognitive Communications and Networking, IEEE/ACM Transactions on Networking, IEEE Transactions on Communications and in TPC of IEEE INFOCOM, ACM SIGMETRICS, ACM MobiHoc, IJCAI. He is serving as IEEE Distinguished Lecturer and received the Princeton University Wu Prize for Excellence, Google Faculty Award, teaching excellence awards, and was selected twice for the U.S. National Academy of Engineering China-America Frontiers of Engineering Symposium.", "interests": "Networks, cloud computing, distributed machine learning, Artificial Intelligence (AI), blockchains and AI for Health-Tech and Ed-Tech", "grants": "Blended Classroom Flipping with AI-driven Peer InstructionsRobust Blockchain-based Decentralized Social Networks against Online Abuse and MisinformationViral Crypto Tweets: Understanding Viral Spreading in Blockchain Social Networks", "articles": ["P.-D. Yu, C. W. Tan and H. Fu, Epidemic Source Detection in Contact Tracing Networks: Epidemic Centrality in Graphs and Message-Passing Algorithms, IEEE Journal of Selected Topics in Signal Processing, Vol. 16, No. 2, pp. 234-249, 2022.", "S. W. Ho, L. Ling, C. W. Tan and R. W. Yeung, Proving and Disproving Information Inequalities: Theory and Scalable Algorithms, IEEE Transactions on Information Theory, Vol. 66, No. 9, pp. 5522-5536, 2020.", "S. Liu, C. Joe-Wong, J. Chen, C. Brinton, C. W. Tan and L. Zheng, Economic Viability of a Virtual ISP, IEEE/ACM Transactions on Networking, Vol. 28, No. 2, pp. 902-916, 2020.", "P.-D. Yu, C. W. Tan and H. Fu, Averting Cascading Failures in Networked Infrastructures: Poset-constrained Graph Algorithms, IEEE Journal of Selected Topics in Signal Processing, Vol. 12, No. 4, pp.733-748, 2018.", "C. Li, X. Guang, C. W. Tan and R. W. Yeung, Fundamental Limits on a Class of Secure Asymmetric Multilevel Diversity Coding Systems, IEEE Journal on Selected Areas in Communication, Vol. 36, No. 4, pp. 737-747, 2018.", "D. Li, X. Guang, Z. Zhou, C. Li and C. W. Tan, Hierarchical Performance Analysis on Random Linear Network Coding, IEEE Transactions on Communications, Vol. 66, No. 5, pp.2009-2021, 2018.", "L. Zheng, D. Cai and C. W. Tan, Max-min Fairness Rate Control in Wireless Networks: Optimality and Algorithms by Perron-Frobenius Theory, IEEE Transactions on Mobile Computing, Vol. 17, No. 1, pp.127-140, 2018.", "L. Zheng, C. Joe-Wong, C. W. Tan, S. Ha and M. Chiang, Customized Data Plans for Mobile Users: Feasibility and Benefits of Data Trading, IEEE Journal on Selected Areas in Communication, Vol. 35, No. 4, pp. 949-963, 2017.", "F. M. F. Wong, C. W. Tan, S. Sen and M. Chiang, Quantifying Political Leaning from Tweets, Retweets and Retweeters, IEEE Transactions on Knowledge and Data Engineering, Vol. 28, No. 8, pp. 2158-2172, 2016.", "L. Zheng, C. Joe-Wong, C. W. Tan, M. Chiang and X. Wang, How to Bid the Cloud?, ACM SIGCOMM Computer Communication Review, Vol. 45, No. 5, pp. 71-84, 2015.", "C. W. Tan, Optimal Power Control in Rayleigh-fading Heterogeneous Wireless Networks, IEEE/ACM Transactions on Networking, Vol. 24, No. 2, pp. 940-953, 2016.", "L. Zheng, Y. W. Hong, C. W. Tan, C. L. Hsieh and C. H. Lee, Wireless Max-min Utility Fairness with General Monotonic Constraints by Perron-Frobenius Theory, IEEE Transactions on Information Theory, Vol. 62, No. 12, pp. 7283-7298, 2016.", "Y. Gao, C. W. Tan, Y. Huang, Z. Zeng and P. R. Kumar, Characterization and Optimization of Delay Guarantees for Real-time Multimedia Traffic Flows in IEEE802.11 WLANs, IEEE Transactions on Mobile Computing, Vol. 15, No. 5, pp. 1090-1104, 2016.", "Z. Wang, W. Dong, W. Zhang and C. W. Tan, Rooting out Rumor Sources in Online Social Networks: The Value of Diversity from Multiple Observations, IEEE Journal of Selected Topics in Signal Processing, special issue on signal processing for big data, Vol. 9, No. 4, pp. 663-677, 2015.", "I.-W. Lai, L. Zheng, C.-H. Lee and C. W. Tan, Beamforming Duality and Algorithms for Weighted Sum Rate Maximization in Cognitive Radio Networks, IEEE Journal on Selected Areas in Communications, Vol. 33, No. 5, pp. 832-847, 2015.", "C. W. Tan, D. W. H. Cai and Lou, Resistive Network Optimal Power Flow: Uniqueness and Algorithms, IEEE Transactions on Power Systems, Vol. 30, No. 1, pp. 263-273, 2015.", "N. Chen, C. W. Tan and T. Quek, Electric Vehicle Charging in Smart Grid: Optimality and Valley-Filling Algorithms, IEEE Journal of Selected Topics in Signal Processing, Vol. 8, No. 6, pp. 1073-1083, 2014.", "Lou and C. W. Tan, Optimization Decomposition of Resistive Power Networks with Energy Storage, IEEE Journal on Selected Areas in Communications, Vol. 32, No. 7, pp. 1371-1385, 2014.", "Lou, H. Yao, C. W. Tan and J. Wang, VANDER: Efficient Cooperative Watchdog Monitoring for Lossy Wireless Network Coding, IEEE Transactions on Vehicular Technology, Vol. 64, No. 2, pp. 702-713, 2014.", "X. Zhai, L. Zheng and C. W. Tan, Energy-Infeasibility Tradeoff in Cognitive Radio Networks: Price-Driven Spectrum Access Algorithms, IEEE Journal on Selected Areas in Communications, Vol. 32, No. 3, pp. 528-538, 2014.", "L. Zheng and C. W. Tan, Maximizing Sum Rates in Cognitive Radio Networks: Convex Relaxation and Global Optimization Algorithms, IEEE Journal on Selected Areas in Communications, Vol. 32, No. 3, pp. 667-680, 2014.", "L. Zheng and C. W. Tan, Optimal Algorithms in Wireless Utility Maximization: Proportional Fairness Decomposition and Nonlinear Perron-Frobenius Theory Framework, IEEE Transactions on Wireless Communications, Vol. 13, No. 4, pp. 2086-2095, 2014.", "L. Zheng and C. W. Tan, Egalitarian Fairness Framework for Joint Rate and Power Optimization in Wireless Networks, ACM SIGMETRICS Performance Evaluation Review, Vol. 42, No. 2, pp. 58-60, 2014.", "L. Zheng and C. W. Tan, Cognitive Radio Network Duality and Algorithms for Utility Maximization, IEEE Journal on Selected Areas in Communications, Vol. 31, No. 3, pp. 500-513, 2013.", "C. W. Tan, M. Chiang and R. Srikant, Fast Algorithms and Performance Bounds for Sum Rate Maximization in Wireless Networks, IEEE/ACM Transactions on Networking, Vol. 21, No. 3, pp. 706-719, 2013.", "Y. Huang, C. W. Tan and B. D. Rao, Joint Beamforming and Power Control in Coordinated Multicell: Max-min Duality, Effective Network and Large System Transition, IEEE Transactions on Wireless Communications, Vol. 12, No. 6, pp. 2730-2742, 2013.", "L. Yang, H. Kim, J. Zhang, M. Chiang and C. W. Tan, Pricing-based Decentralized Spectrum Access Control in Cognitive Radio Networks, IEEE/ACM Transactions on Networking, Vol. 21, No. 2, pp. 522-535, 2013.", "S. Sorooshyari, C. W. Tan and M. Chiang, Power Control for Cognitive Radio Networks: Axioms, Algorithms, and Analysis, IEEE/ACM Transactions on Networking, Vol. 20, No. 3, pp. 878-891, 2012.", "D. W. H. Cai, T. Quek, C. W. Tan and S. H. Low, Max-Min SINR Coordinated Multipoint Downlink Transmission - Duality and Algorithms, IEEE Transactions on Signal Processing, Vol. 60, No. 10, pp. 5384-5396, 2012.", "Y. Zhao, C. W. Tan, A. S. Avestimehr, S. N. Diggavi and G. J. Pottie, On the Maximum Achievable Sum-rate with Successive Decoding in Interference Channels, IEEE Transactions on Information Theory, Vol. 58, No. 6, pp. 3798-3820, 2012.", "C. W. Tan, S. Friedland and S. H. Low, Nonnegative Matrix Inequalities and Their Application to Nonconvex Power Control Optimization, SIAM Journal on Matrix Analysis and Applications, Vol. 32, No. 3, pp. 1030-1055, 2011.", "C. W. Tan, M. Chiang and R. Srikant, Maximizing Sum Rate and Minimizing MSE on Multiuser Downlink: Optimality, Fast Algorithms, and Equivalence via Max-min SINR, IEEE Transactions on Signal Processing, Vol. 59, No. 12, pp. 6127-6143, 2011.", "M. Wang, C. W. Tan, W. Xu and A. Tang, Cost of Not Splitting in Routing: Characterization and Estimation, IEEE/ACM Transactions on Networking, Vol. 19, No. 6, pp. 1849-1859, 2011.", "D. W. H. Cai, T. Quek and C. W. Tan, A Unified Analysis of Max-Min Weighted SINR for MIMO Downlink System, IEEE Transactions on Signal Processing, Vol. 59, No. 8, pp. 3850-3862, 2011.", "C. W. Tan, S. Friedland and S. H. Low, Spectrum Management in Multiuser Cognitive Wireless Networks: Optimality and Algorithm, IEEE Journal on Selected Areas in Communications, Vol. 29, No. 2, pp. 421-430, 2011.", "S. Sorooshyari, C. W. Tan and H. V. Poor, On Maximum-Likelihood SINR Estimation of MPSK in a Multiuser Fading Channel, IEEE Transactions on Vehicular Technology, Vol. 59, No. 8, pp. 4175-4181, 2010.", "C. W. Tan and A. R. Calderbank, Multiuser Detection of Alamouti Signals, IEEE Transactions on Communications, Vol. 57, No. 7, pp. 2080-2089, 2009.", "C. W. Tan, D. P. Palomar and M. Chiang, Energy-Robustness Tradeoff in Cellular Network Power Control, IEEE/ACM Transactions on Networking, Vol. 17, No. 3, pp. 912-925, 2009.", "M. Chiang, C. W. Tan, D. P. Palomar, D. O'Neill and D. Julian, Power Control by Geometric Programming, IEEE Transactions on Wireless Communications, Vol. 6, No. 7, pp. 2640-2651, 2007.", "C. W. Tan, D. M. Chiu, John C. S. Lui and K. Yau, A Distributed Throttling Approach for Handling High Bandwidth Aggregates, IEEE Transactions on Parallel and Distributed Systems, Vol. 18, No. 7, pp. 983-995, 2007.", "C. W. Tan, G. Mohan and John C. S. Lui, Achieving Multi-Class Service Differentiation in WDM Optical Burst Switching Networks: A Probabilistic Preemptive Burst Segmentation Scheme, IEEE Journal on Selected Areas in Communications, Vol. 24, No. 12, pp. 106-119, 2006."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=G2CBtcAAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02029", "other_websites": []}