{"full_name": "Tan Rui", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Tan Rui", "email": "tanrui@ntu.edu.sg", "image_path": "./profile_img/tan_rui.jpg", "keywords": ["Computer Science and Engineering", "Info-Communication Technology", "Energy", "Internet & Communications", "Computer Networks and Communications"], "biography": "Rui Tan received B.S.(2004) and M.S.(2007) in automation from Shanghai Jiao Tong University, and Ph.D.(2010) in computer science from City University of Hong Kong, respectively. From 2010 to 2012, he worked as a postdoctoral Research Associate at Michigan State University. From 2012 to 2015, he worked as a Research Scientist and then a Senior Research Scientist at Advanced Digital Sciences Center, a Singapore-based research center of the University of Illinois at Urbana-Champaign. He joined the School of Computer Science and Engineering (SCSE) of Nanyang Technological University (NTU) in 2016. He is currently an Associate Professor with SCSE, NTU.He has received multiple research awards including Best Paper Award from ACM/IEEE IPSN 2017, CPSR-SG 2017, Distinguished TPC Member of INFOCOM 2017, Best Paper Award Runner-Ups from ACM/IEEE IPSN 2014 and IEEE PerCom 2013, IPSN'21 Best Artifact Award Runner-Up, as well as Outstanding Academic Performance Award from City University of Hong Kong in 2009. He is now an IEEE Senior Member.", "interests": "I am interested in understanding how the physical ambients affect the cyber systems (e.g., sensor networks, wearables, data centers, etc) and exploiting certain properties of the physical ambients to improve the performance and resilience of the cyber systems. My ongoing research topics include:- AIoT (AI + IoT)- Sensing for resilient system functions (e.g., timing, synchronization, location, etc)- Thermal and energy management in data centers- Secure sensing and control in smart grids", "grants": "Build CSI based wireless sensing platforms with commodity WiFiData-driven Traffic Analytics and Simulation for Incident Impact Analysis and ManagementFood Supply Chain Management built with Blockchain and Internet-of-Things (IoT)Holistic Moving Target Defence for Autonomous Driving PerceptionIntelligent Data Aggregation Framework for Workflow Optimisation in Smart Facility Management SolutionsPhysics-Guided Generalization of AIoT SensingSustainable Tropical Data Centre Test bedSustainable Tropical Data Centre Test bed (WP1)Towards Zero-Carbon Autonomous Driving AI", "articles": ["Yang Li, Rui Tan, David Yau. (2019). The 16th ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN): Natural Timestamping Using Powerline Electromagnetic Radiation. IPSNPittsburgh, PA, USA.", "Song, Qun and Gu, Chaojie and Tan, Rui. (2018). Deep Room Recognition Using Inaudible Echos. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 2(3).", "Zhenyu Yan, Yang Li, Rui Tan, Jun Huang. (2017). The 15th ACM Conference on Embedded Networked Sensor Systems (SenSys): Application-Layer Clock Synchronization for Wearables Using Skin Electric Potentials Induced by Powerline Radiation.Delft, The Netherlands.", "Sreejaya Viswanathan, Rui Tan, David Yau. (2016). The 37th IEEE Real-Time Systems Symposium (RTSS): Exploiting Power Grid for Accurate and Secure Clock Synchronization in Industrial IoT.Porto Portugal.", "Rui Tan, Guoliang Xing, Benyuan Liu, Jianping Wang, Xiaohua Jia. (2012). IEEE/ACM Transactions on Networking (TON): Exploiting Data Fusion to Improve the Coverage of Wireless Sensor Networks."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00504", "other_websites": ["https://personal.ntu.edu.sg/tanrui/", "https://researchdata.ntu.edu.sg/dataverse/tanrui", "https://ntuiot.xyz/"]}