{"full_name": "Zhang Jie", "designation": "Professor, School of Computer Science and Engineering", "name_card": "Prof Zhang Jie", "email": "zhangj@ntu.edu.sg", "image_path": "./profile_img/zhang_jie.jpg", "keywords": ["Computational Intelligence", "Artificial and Augmented Intelligence"], "biography": "Jie Zhang is a Professor of the School of Computer Science and Engineering at NTU Singapore, leading the Computational Intelligence Group. He obtained Ph.D. in Cheriton School of Computer Science from University of Waterloo and was the recipient of Alumni Gold Medal in 2009. Then he joined NTU as an Assistant Professor and was promoted to Associate Professor in 2015. From 2017-2018, he was appointed as Tan Chin Tuan Exchange Fellowship, New York University. He was also an Adjunct Fellow, Singapore Institute of Manufacturing Technology (SIMTech), A*STAR, from 2020-2021. His papers have been published by top journals and conferences and won several best paper awards. Jie Zhang is also active in serving research communities.", "interests": "Jie Zhang's research work is in the area of User Modeling, one of the important subareas of Artificial Intelligence. It has been focused on providing personalized recommendations to users on which others to interact with (e.g., do business with or acquire information from), by modeling: 1) the trust (i.e., reliability, capability and honesty) of the others; and 2) the preferences of the users. Dr. Zhang has made significant contributions to both trust modeling and preference modeling. More interestingly, for accurately modeling trust, he has specifically taken good care of user preference (subjectivity); for accurately modeling preference, he has well leveraged the trust relationships between users.+ Artificial Intelligence+ Machine Learning+ User Modeling+ Trust and Preference", "grants": "A Simulation and Policy Evaluation Toolset for Smart Urban  Mobility Systems with Emerging TechnologiesArtificial Intelligence for Quantitative TradingDesign of advance machine learning and deep learning algorithm for pattern recognitionDistributed Smart Value Chain (DSVC)Never-Ending Deep Learning Agent for Non-stationary Data StreamsParking Supply Planning In Future Mobility System With Autonomous VehiclesVirality Modelling and Analysis of Firm-specific Information on Social Media", "articles": ["Qidong Liu, Yunyun Liu, Cheng Long, Mingliang Xu, Pei Lv and Jie Zhang. (2020, January). TriGAN: Tripartite Adversarial Learning for Graph Embeddings. Paper presented at The 26th ACM SIGKDD Conference on Knowledge Discovery and Data Mining.", "Liu Qidong, Zhou Xin, Long Cheng, Zhang Jie, Xu Mingliang. (2020). Learning network representations with different order structural information. IEEE Transactions on Computational Social Systems, .", "Shuo Chen, Ewa Andrejczuk, Athirai A. Irissappane, and Jie Zhang. (2019). ATSIS: Achieving the Ad hoc Teamwork by Sub-task Inference and Selection. International Joint Conferences on Artificial Intelligence.", "Xiaoming Li, Hui Fang, Jie Zhang. (2019, February). Supervised User Ranking in Signed Social Networks. Paper presented at The Thirty-Third AAAI Conference on Artificial Intelligence (AAAI-19), Honolulu,Hawaii."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00759", "other_websites": ["https://personal.ntu.edu.sg/zhangj/"]}