{"full_name": "Li Yi", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Li Yi", "email": "yi_li@ntu.edu.sg", "keywords": ["Computer Science and Engineering"], "biography": "Dr. Li Yi is an assistant professor at the School of Computer Science and Engineering of the Nanyang Technological University. He received both his PhD and MSc degrees in Computer Science from the University of Toronto, and his BComp degree from the National University of Singapore.Dr. Li's recent works have won three ACM SIGSOFT Distinguished Paper Awards at ISSTA'22 and ASE'15, and two Best Artifact Awards at FSE'21 and ICSME'20, respectively. Dr. Li served as the PC Co-Chair of ICECCS'20, SEAIS'22, and ICFEM'19 Doctoral Symposium. He also served as the Diversity, Inclusion and Hybridization Co-Chair of FSE'22, Web Chair of ISSTA'20, and Program Committee member of major software engineering, formal methods, and distributed computing conferences including ICSE, FSE, ASE, FM, FASE, ICFEM, and ICDCS.", "interests": "Dr. Li's research mainly focuses on program analysis and automated reasoning techniques with applications in software engineering and software security. These include software model checking, bug finding, security testing, software evolution and maintenance.", "grants": "Algorand Centre of Excellence at NTU (ACE@NTU) [under NTU Centre in Computational Technologies for Finance]Security and Privacy Engineering for AI-Assisted Programming ModelsSparse Design and Decentralized Deployment in Transportation Service for Aging Society", "articles": ["Haijun Wang, Ye Liu, Yi Li, Shang-Wei Lin, Cyrille Artho, Lei Ma, and Yang Liu", "IEEE Transactions on Dependable and Secure Computing, 2022.", "Yao Zhang, Xiaofei Xie, Yi Li, Yun Lin, Sen Chen, Yang Liu, and Xiaohong Li", "IEEE Transactions on Software Engineering, 2022.", "Palina Tolmach, Yi Li, Shang-Wei Lin, Yang Liu, and Zengxiang Li", "ACM Computing Surveys, 2021.", "Yi Li, Chenguang Zhu, Milos Gligoric, Julia Rubin, and Marsha Chechik", "Automated Software Engineering, 2019.", "Yi Li, Chenguang Zhu, Julia Rubin, and Marsha Chechik", "IEEE Transactions on Software Engineering, 2018.", "Yi Li, Jin Song Dong, Jing Sun, Yang Liu, and Jun Sun", "Formal Methods in System Design, 2014."], "books": [], "book_chapters": ["Yi Li, Julia Rubin, and Marsha Chechik", "In Handbook of Re-Engineering Software Intensive Systems into Software Product Lines, 2022."], "conferences": ["Ye Liu, Yi Li, Shang-Wei Lin, and Cyrille Artho", "In Proceedings of the 31st ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2022.", "Zhiming Li, Xiaofei Xie, Haoliang Li, Zhengzi Xu, Yi Li, and Yang Liu", "In Proceedings of the 31st ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2022.", "Xiuheng Wu, Chenguang Zhu, and Yi Li", "In Proceedings of the 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE), 2021.", "Chenguang Zhu, Yi Li, Julia Rubin, and Marsha Chechik", "In Proceedings of the 36th IEEE International Conference on Software Maintenance and Evolution (ICSME), 2020.", "Xiaoning Du, Xiaofei Xie, Yi Li, Lei Ma, Yang Liu, and Jianjun Zhao", "In Proceedings of the 27th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE), 2019.", "Yi Li, Julia Rubin, and Marsha Chechik", "In Proceedings of the 30th IEEE/ACM International Conference on Automated Software Engineering (ASE), 2015."], "bibliometrics": {"google_scholar": "https://scholar.google.ca/citations?user=B61QIUIAAAAJ&hl=en"}, "google_scholar": "https://scholar.google.ca/citations?user=B61QIUIAAAAJ&hl=en", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00572", "other_websites": ["https://personal.ntu.edu.sg/yi_li/"]}