{"full_name": "Kwoh Chee Keong", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Kwoh Chee Keong", "email": "asckkwoh@ntu.edu.sg", "keywords": ["Biomedical Sciences & Life Sciences", "Computer Science and Engineering", "Interface of Biology & Engineering (Engineering in Biology)", "Mathematics", "Systems and Engineering Management"], "biography": "Dr.  Kwoh Chee Keong is currently in the School of Computer Engineering since 1993. He received his Bachelor degree in Electrical Engineering (1st Class) and Master in Industrial System Engineering from the National University of Singapore in 1987 and 1991 respectively. He received his Ph.D. degrees from the Imperial College, University of London in 1995. His research interests include Data Mining and Soft Computing and Graph-Based inference; applications areas include Bioinformatics and Biomedical Engineering. He has done significant research work his research areas and published over 90 quality international conferences and over 30 journal papers. He has been often invited as a organizing member or referee and reviewer for a number of premier conferences and journals, including GIW, IEEE BIBM, RECOMB, PRIB etc. Dr. Kwoh is a member of The Institution of Engineers Singapore, Association for Medical and Bio-Informatics, Imperial College Alumni Association of Singapore (ICAAS).  He has provided many service to professional bodies, and the Singapore and was conferred the Public Service Medal, the President of Singapore in 2008.", "interests": "Development of a Computer Prediction System For Rational Design Of HLA-Based Peptide Vaccine;Data Mining and Analysis on Infectious DiseaseHeterogeneous Multi-Core Systems For BioinformaticsConstrained Optimzation for BioinformaticsProtein Interaction Network Analysis Using Graph Mining Approaches", "grants": "Hodge Laplacian based deep learning models for drug designHost-pathogen protein-protein interaction approaches for predicting virulenceInvestigating the regulation of 3D genome organization using machine learningPredict the solubility of proteins using machine learningPredicting large scale chromatin interaction datasets from small scale Hi-C datasets with artificial intelligenceStructural analysis and characterization of protein complexesTargeted protein design via constrained denoising diffusion probabilistic modelsTowards direct and rapid mapping of RNA modifications with nanopore sequencingUntangling cancer re-wiring: Pan-Cancer mapping of transcription factor driven dysregulatory hotspots using AlphaFold2 and integrative machine learning", "articles": ["Min Wu", "Xiaoli Li", "Chee-Keong Kwoh", "See-Kiong Ng. (2008). Semantic labeling to identify reliable interactions in the protein interaction network. The 2nd International Conference on Bioinformatics and Biomedical Engineering (iCBBE 2008).", "D Zhou*, Y.L.He, C.K.Kwoh. (2008). Extracting Protein-Protein Interactions from MEDLINE using the Hidden Vector State model. International Journal of Bioinformatics Research and Applications, .", "G. L. Zhang", "A. M. Khan", "K. N. Srinivasan", "A. T. Heiny", "K. X. Lee …. (2008). Hotspot Hunter: a computational system for large-scale screening and selection of candidate immunological hotspots in pathogen proteomes. BMC Bioinformatics, .", "D Zhou*, Y.L.He, C.K.Kwoh. (2007). Semi-supervised learning of the hidden vector state model for Extracting Protein-Protein Interactions. Artificial Intelligence in Medicine, ."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=jVn0wDMAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00799", "other_websites": ["https://personal.ntu.edu.sg/asckkwoh"]}