{"full_name": "Luo Siqiang", "designation": "Nanyang Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Luo Siqiang", "email": "siqiang.luo@ntu.edu.sg", "image_path": "./profile_img/luo_siqiang.jpg", "keywords": ["Computer Science and Engineering"], "biography": "Siqiang Luo is an assistant professor at the School of Computer Science and Engineering, Nanyang Technological University. He received his B.S. and M.S. degrees in computer science from Fudan University, in 2010 and 2013 respectively. He received a Ph.D. degree in computer science from the University of Hong Kong in 2019. He was a postdoc fellow at Harvard University from 2019 to 2020. His work was published in premier database, data mining and machine learning conferences, such as ACM SIGMOD, VLDB, ICDE, ICML, WWW and ACM CIKM.", "interests": "Data management, data mining, machine learning", "grants": "Design and Implement Autonomous Key-Value StoresMachine-Learning Enhanced Graph Systems for Multi-ProcessingQuality-of-Service Optimization for Personalized Ranking in Dynamic Social NetworksScaling up Graph Neural Networks – Theory and AlgorithmsSingapore Academies South-East Asia Fellowship Programme (FY21) - Yow Kai SiongWorkload-Aware Optimization for Improving the Performance of Graph-based Applications", "articles": ["Siqiang Luo, Xiaokui Xiao, Wenqing Lin, Ben Kao. Baton: Batch One-Hop Personalized PageRanks with Efficiency and Effectiveness. TKDE 2020", "Siqiang Luo, Reynold Cheng, Ben Kao, Xiaokui Xiao, Shuigeng Zhou, Jiafeng Hu. ROAM: A Fundamental Routing Query on Road Networks with Efficiency. TKDE 2020", "Siqiang Luo, Improved Communication Cost for Distributed PageRank Computation -- A Theorectical Study. ICML 2020.", "Siqiang Luo, Ben Kao, Xiaowei Wu, Reynold Cheng. MPR - A Partitioning-Replication Framework for Multi-Processing kNN Search on Road Networks. ICDE 2019.", "Siqiang Luo, Ben Kao, Guoliang Li, Jiafeng Hu, Reynold Cheng, Yudian Zheng. TOAIN: A Throughput Optimizing Adaptive Index for Answering Dynamic kNN Queries on Road Networks. VLDB 2018"], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": null, "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01311", "other_websites": ["https://siqiangluo.com/"]}