{"full_name": "Ong Yew Soon", "designation": "Co-Director,  Singtel Cognitive and Artificial Intelligence Lab (SCALE@NTU)", "name_card": "Prof Ong Yew Soon", "email": "asysong@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Smart Cities"], "biography": "Yew-Soon Ong is currently a President's Chair Professor of Computer Science at the School of Computer Science and Engineering and Professor (Cross Appointment) of the School of Physical and Mathematical Science at Nanyang Technological University (NTU), Singapore. At the same time, he is Chief Artificial Intelligence (CAS) Scientist of the Singapore's Agency for Science, Technology and Research (A*STAR). At NTU, he serves as co-Director of the Singtel-NTU Cognitive & Artificial Intelligence Joint Lab (SCALE@NTU). He was Chair of the School of Computer Science and Engineering, Nanyang Technological University from 2016-2018, Director of the Centre for Computational Intelligence/Computational Intelligence Laboratory from 2008-2015 and Programme Principal Investigator of the Data Analytics & Complex System Programme in the Rolls-Royce@NTU Corporate Lab from 2013-2017. He received his Bachelors and Masters degrees in Electrical and Electronics Engineering (Specializing in Computing) from Nanyang Technological University and subsequently his PhD (Thesis Title: Artificial Intelligence in Complex Engineering Design) from the University of Southampton, United Kingdom. He is a Fellow of IEEE and founding Editor-In-Chief of the IEEE Transactions on Emerging Topics in Computational Intelligence, founding Technical Editor-In-Chief of Memetic Computing Journal (Springer), Associate Editor of IEEE Transactions on Evolutionary Computation, IEEE Transactions on Neural Network & Learning Systems, IEEE Transactions on Cybernetics, IEEE Transactions on Artificial Intelligence, IEEE Transactions on Big Data (2015 - 2018), IEEE Computational Intelligence Magazine (2010 - 2016), and chief co-editor of Book Series on Studies in Adaptation, Learning, and Optimization.", "interests": "His current research interests include Artificial & Computational Intelligence spanning across Memetic Computation, Machine Learning, Evolutionary & Transfer Optimization and Complex Engineering Design. His research grants comprises of external funding from both national and international partners that include Boeing Research & Development (USA), Rolls-Royce (UK) and Honda Research Institute Europe (Germany), the National Research Foundation of Singapore, National Grid Office, A*STAR, MDA-GAMBIT, AISG, NRF, Singapore Technologies, Singtel, NCS and other. His research on Memetic Computation was first featured by Thomson Scientific's Essential Science Indicators as one of the most cited emerging area of research in 2007. He was subsequently listed as a Thomson Reuters Highly Cited Researcher and among the World's Most Influential Scientific Minds. He received the 2012 IEEE Transactions on Evolutionary Computation Outstanding Paper Award, the 2015 IEEE Computational Intelligence Magazine Outstanding Paper Award and more recently the 2019 IEEE Transactions on Evolutionary Computation Outstanding Paper Award for his works in Memetic Computation.", "grants": "Accelerating traditional workflows in animation and gaming through creative AI solutionsDistributed Smart Value Chain (DSVC)Fusion Science for Clean EnergyMemetic Computation for Human-Like Problem-SolvingPresident's Chair in Computer ScienceResearch Theme 1 - Anticipatory Analytics And ServicesSingtel-NTU Congnitive & Artifical Intelligence Joint Lab, Common Activities AccountTransformative mobile learning in a first-year interdisciplinary writing class", "articles": ["“Online Deep Clustering for Unsupervised Representation Learning”, IEEE Conference on Computer Vision and Pattern Recognition (CVPR-2020), 16-18 June, 2020, Seattle, Washington.", "“Jacobian adversarially regularized networks for robustness”, The International Conference on Learning Representations (ICLR-2020), 26-30 April, 2020, Millennium Hall, Addis Ababa Ethiopia.", "“When Gaussian Process Meets Big Data: A Review of Scalable GPs”, IEEE Transactions on Neural Networks and Learning Systems, Vol. 31, No. 11, 2020.", "Y. S. Ong and A. Gupta, “AIR5: Five Pillars of Artificial Intelligence Research”, IEEE Transactions on Emerging Topics in Computational Intelligence, Vol. 3, No. 5, pps. 411 - 415, 2019.", "“Curbing Negative Influences Online for Seamless Transfer Evolutionary Optimization”, IEEE Transactions on Cybernetics, Vol. 49, No. 12, pps. 4365-4378, 2019.", "\"Multifactorial Evolution: Towards Evolutionary Multitasking\", IEEE Transactions on Evolutionary Computation, vol. 20, no. 3, pp. 343 - 357, 2016."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=h9oWOsEAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00092", "other_websites": ["http://www3.ntu.edu.sg/home/asysong/"]}