{"full_name": "Dmitrii Ustiugov", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Dmitrii Ustiugov", "email": "dmitrii.ustiugov@ntu.edu.sg", "image_path": "./profile_img/dmitrii_ustiugov.jpg", "keywords": ["Computing Hardware and Architecture", "Parallel and Distributed Computing"], "biography": "Dr. Dmitrii Ustiugov is an Assistant Professor in School of Computer Science and Engineering. He received a Ph.D. degree in Computer Science from the University of Edinburgh where was co-advised by Profs. Boris Grot and Edouard Bugnion (EPFL). Previously, he was a Postdoctoral Researcher at ETH Zurich with Prof. Ana Klimovic. Dr. Ustiugov received M.Sc. and B.Sc. degrees from Moscow Institute of Physics and Technology (MIPT).He is leading the vHive open-source ecosystem for serverless experimentation and innovation across the deep distributed HW/SW stack, which is in used by 30+ academic and industry organisations.", "interests": "Dr. Ustiugov's work spans the domains of computer systems and architecture with a focus on designing high performance, scalable, and resource-efficient computing. His research is currently focused on cloud and serverless computing architecture as well as systems for machine learning.", "grants": "Fast and resource-efficient serverless cloud computing", "articles": [], "books": [], "book_chapters": [], "conferences": ["Analyzing Tail Latency in Serverless Clouds with STeLLAR. D.Ustiugov, T.Amariucai, B.Grot. IISWC'21", "Benchmarking, Analysis, and Optimization of Serverless Function Snapshots. D.Ustiugov, P.Petrov, M.Kogias, E.Bugnion, B.Grot. ASPLOS'21, Distinguished Artifact Award", "PTEMagnet: Fine-Grained Physical Memory Reservation for Faster Page Walks in Public Clouds. A.Margaritov, D.Ustiugov, A.Shahab, B.Grot. ASPLOS'21", "Prefetched Address Translation. A.Margaritov, D.Ustiugov, E.Bugnion, B.Grot. MICRO'19"], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=cZ9jA9oAAAAJ&hl=en"}, "google_scholar": "https://scholar.google.com/citations?user=cZ9jA9oAAAAJ&hl=en", "orcid": null, "github": "https://ustiugov.github.io", "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02117", "other_websites": []}