{"full_name": "Smitha K G", "designation": "Senior Lecturer, School of Computer Science and Engineering", "name_card": "Dr Smitha K G", "email": "smitha@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Machines & Systems", "Microelectronics & Applications", "Brain Machine Interface"], "biography": "Dr. Smitha, is a Senior Lecturer at School of Computer Science and Engineering (SCSE) in Nanyang Technological University (NTU).Her main research interests are in the areas of low complexity and high speed DSP circuits computer arithmetic, cognitive radio and signal processing for brain-computer interface.", "interests": "VLSI designDigital Signal Processing,Biomedical Signal ProcessingBrain-machine Interface-algorithms and applications,Low Power Reconfigurable signal processing circuits for Cognitive RadioComputer Arithmetic", "grants": "Ask Narelle – Your Friendly & Personalized 24-7 Teaching Assistant", "articles": ["Arish Sateesan, Sharad Sinha, KG Smitha, AP Vinod (2021). A Survey of Algorithmic and Hardware Optimization Techniques for Vision Convolutional Neural Networks on FPGAs. Neural Processing Letters, Vol 53, No. 3, pp:2331-2377.", "Sumedh Dhabu, Abhishek Ambede, Niharika Agrawal, Smitha K. G. , Sumit Darak & Vinod A. P. (2020). Variable Cutoff Frequency FIR Filters: A Survey. SN Applied Sciences, Springer, Vol 2, No. 3.  pp: 343.", "Guo Jun. and Smitha K. G. (2016) “EEG based Stress Level Identification,”  IEEE International Conference on Systems, Man and Cybernetics (SMC 2016), pp: 3270 - 3274, Budapest, Hungary.", "Smitha K. G. and A. P. Vinod. (2015). Facial emotion recognition system for autistic children: a feasible study based on FPGA implementation. Medical & Biological Engineering & Computing, vol. 53, no:11(no :11), pp: 1221-1229.", "Ambede A., Smitha K. G., A. P. Vinod. (2015). Flexible low complexity uniform and non-uniform digital filter banks with high frequency resolution for multi-standard radios. IEEE Transactions on Very Large Scale Integration (VLSI) Systems, 23(4), pp: 631-641."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=9mD7MHgAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00612", "other_websites": ["https://personal.ntu.edu.sg/smitha/"]}