{"full_name": "Siyuan Liu", "designation": "Lecturer, School of Computer Science and Engineering", "name_card": "Dr Siyuan Liu", "email": "syliu@ntu.edu.sg", "keywords": ["Computational Intelligence", "Cyber Security and Forensics", "Internet of Things", "Ageing"], "biography": "Dr Liu Siyuan is a lecturer in SCSE. She obtained her BSc, MSc degrees from Peking University in China and her PhD degree from Nanyang Technological University. Before joining SCSE, Dr Liu worked in SingTel, Joint NTU-UBC Research Centre of Excellence in Active Living for the Elderly (LILY) NTU, and Swansea University in the UK. Her current research interest is in trustworthy AI. Dr Liu has a strong track record in trust and reputation management. Dr Liu has been working on exploring the concept of trust, investigating the factors that will impact trust, and identifying the important aspects to build trustworthy AI systems.  Dr Liu allow works on serious games for health and education.  Dr Liu has published over 40 referred papers at AI conferences and journals including AAMAS, AAAI, and ECAI, and received 4 Best Paper Awards.", "interests": "Explainable AITrust and reputation managementSerious games", "grants": "A Trustworthy Feedback Agent for Secondary School Chinese Language LearningUnleashing the Power of Collaboration and Cutting-Edge Technologies: Building a Sustainable Future through Digital Analytics", "articles": ["Qiong Wu, Siyuan Liu, Chunyan Miao, “Recommend Interesting Items: How can Social Curiosity Help?”, Web Intelligence 17(4), pp. 297-311. IOS Press. 2019.", "Siyuan Liu, Jie Zhang, Chunyan Miao, Yin-Leng Theng, and Alex C. Kot, “An Integrated Clustering-Based Approach to Filtering Unfair Multi-Nominal Testimonies”, Computational Intelligence 30(2), 316-341, 2014.", "Yuhong Liu, Yan Sun, Siyuan Liu, and Alex C. Kot, “Securing Online Reputation Systems through Trust Modeling and Temporal Analysis”, IEEE Transactions on Information Forensics and Security 8(6), 936-948, 2013."], "books": [], "book_chapters": [], "conferences": ["Siyuan Liu, Qing Wu, Chunyan Miao, “Personalized Recommendation Considering Secondary Implicit Feedback”, in Proceedings of International Conference on Agents, 2018 (Best Paper Award).", "Xiuyi Fan, Huiguo Zhang, Siyuan Liu, Cyril Leung, and Chunyan Miao, “Computational Assumption-based Argumentation: An Activity Recognition Case Study”, in Proceedings of the 16th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2017.", "Qiong Wu, Siyuan Liu, Yuan Liu, and Chunyan Miao, “A Social Curiosity Inspired Recommendation Model to Improve Precision, Coverage and Diversity”, in Proceedings of 2016 IEEE/WIC/ACM International Conference on Web Intelligence, 2016 (Best Paper Award).", "Siyuan Liu, Xiuyi Fan, and Chunyan Miao, “Identifying and Rewarding Subcrowds in Crowdsourcing”, in European Conference on Artificial Intelligence (ECAI), 2016.", "Xiuyi Fan, Siyuan Liu, Huiguo Zhang, Cyril Leung, and Chunyan Miao, “Explained Activity Recognition with Computational Assumption-based Argumentation”, in European Conference on Artificial Intelligence (ECAI), 2016.", "Siyuan Liu, Zhiqi Shen, Han Yu, Han Lin, Zhengjin Guo, Zhengxiang Pan, Chunyan Miao, Cyril Leung, “A Kinect-based Interactive Game to Improve the Cognitive Inhibition of the Elderly”, in Proceedings of 15th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2016.", "Han Yu, Chunyan Miao, Siyuan Liu, Zhengxiang Pan, Cyril Leung, “Productive Aging through Intelligent Personalized Crowdsourcing”, in Proceedings of the 30th AAAI Conference on Artificial Intelligence, 2016.", "Siyuan Liu, Chunyan Miao, Yuan Liu, Han Yu, Jie Zhang and Cyril Leung, \"An Incentive Mechanism to Elicit Truthful Opinions for Crowdsourced Multiple Choice Consensus Tasks,\" in Proceedings of the 2015 IEEE/WIC/ACM International Joint Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT'15), 2015.", "Siyuan Liu, Zhiqi Shen, Martin J. McKewon, Chunyan Miao, “A Fuzzy Logic Based Parkinson’s Disease Risk Predictor”, in Proceedings of 2014 IEEE International Conference on Fuzzy Systems.", "Yundong Cai, Zhiqi Shen, Siyuan Liu, Han Yu, Xiaogang Han, Jun Ji, Martin J. McKewon, Chunyan Miao, “An Agent-based Game for the Predictive Diagnosis of Parkinson's Disease”, in Proceedings of 13th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2014.", "Siyuan Liu, Han Yu, Chunyan Miao, Alex C. Kot, “A Fuzzy-Logic Based Reputation Model against Unfair Ratings”, in Proceedings of 12th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2013.", "Siyuan Liu, Alex C. Kot, Chunyan Miao, Yin-Leng Theng, “A Dempster-Shafer Theory Based Witness Trustworthiness Model to Cope with Unfair Ratings in E-Marketplace”, in Proceedings of the 14th Annual International Conference on Electronic Commerce, 2012 (Best Paper Award).", "Siyuan Liu, Alex C. Kot, Chunyan Miao, Yin-Leng Theng, “A Dempster-Shafer Theory Based Witnesses Trustworthiness Model”, in Proceedings of 11th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2012.", "Siyuan Liu, Jie Zhang, Chunyan Miao, Yin-Leng Theng, Alex C. Kot, “iCLUB: An Integrated Clustering-Based Approach to Improve the Robustness of Reputation Systems”, in Proceedings of 10th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2011.", "Han Yu, Siyuan Liu, Alex C. Kot, Chunyan Miao, Cyril Leung, “Dynamic Witness Selection for Trustworthy Distributed Cooperative Sensing in Cognitive Radio Networks”, in Proceedings of 13th International Conference on Communication Technology, 2011 (Best Paper Award).", "Siyuan Liu, Chunyan Miao, Yin-Leng Theng, Alex C. Kot, ” A Clustering Approach to Filtering Unfair Testimonies for Reputation Systems”, in Proceedings of 9th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2010."], "bibliometrics": {"google_scholar": "https://scholar.google.com.sg/citations?user=N2O4KmIAAAAJ&hl=en", "scopus": "https://www.scopus.com.remotexs.ntu.edu.sg/authid/detail.uri?authorId=55277926900"}, "google_scholar": "https://scholar.google.com.sg/citations?user=N2O4KmIAAAAJ&hl=en", "orcid": null, "github": null, "scopus": "https://www.scopus.com.remotexs.ntu.edu.sg/authid/detail.uri?authorId=55277926900", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01753", "other_websites": []}