{"full_name": "Luo Jun", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Luo Jun", "email": "junluo@ntu.edu.sg", "image_path": "./profile_img/luo_jun.jpg", "keywords": ["Computer Networks and Communications", "Computer Vision and Sensing", "Hardware and Embedded Systems", "Internet of Things"], "biography": "Dr. Jun Luo has been working on wireless sensing, deep learning, and computing system integration for more than two decades and has established a solid foundation on all these topics. Building upon this foundation, his research team has made contributions on mobile/ pervasive computing and smart sensing technologies, by leading several national research projects and corporate labs, aiming to transfer the research outcomes to practical applications. In the meantime, Dr. Luo and his team have kept publishing at relevant venues such as IEEE and ACM top conferences and journals, including MobiCom, CVPR, SenSys, INFOCOM, UbiComp, ToN, and TMC. With only 130+ publications, he has earned over 8300 Google Scholar citations, with two top-cited papers both bearing more than 1,000 of them.", "interests": "- Mobile and Pervasive Computing- Machine Learning and Computer Vision - Applied Operations Research - Computer Networks", "grants": "DeepWiSe: Deep-Interpreted Wireless Sensing for AllHolistic Moving Target Defence for Autonomous Driving PerceptionIntegrating Sensing with Data Traffic for Future Communications over Ubiquitous IoT Devices", "articles": [], "books": [], "book_chapters": [], "conferences": ["Jun Luo. (2010). Practical Algorithm for Minimum Delay Peer-to-Peer Media Streaming. IEEE International Conference on Multimedia & Expo.", "Jun Luo, Liu Xiang, and Catherine Rosenberg. (2010). Does Compressed Sensing Improve the Throughput of Wireless Sensor Networks?. IEEE International Conference on Communications."], "bibliometrics": {"google_scholar": "https://scholar.google.com.sg/citations?user=qXLjz30AAAAJ&hl=en", "web_of_science": "https://www.webofscience.com/wos/author/record/288009?state=%7B%7D", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=57226467449"}, "google_scholar": "https://scholar.google.com.sg/citations?user=qXLjz30AAAAJ&hl=en", "orcid": null, "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=57226467449", "web_of_science": "https://www.webofscience.com/wos/author/record/288009?state=%7B%7D", "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01107", "other_websites": ["https://personal.ntu.edu.sg/junluo/"]}