{"full_name": "Luu Anh Tuan", "designation": "Assistant Professor, School of Computer Science and Engineering", "name_card": "Asst Prof Luu Anh Tuan", "email": "anhtuan.luu@ntu.edu.sg", "image_path": "./profile_img/luu_anh_tuan.jpg", "keywords": ["Computer Science and Engineering"], "biography": "Luu Anh Tuan is an \bAssistant Professor in the School of Computer Science and Engineering (SCSE) at Nanyang Technological University, Singapore. He received his MSc degree from National University of Singapore in 2011 and Ph.D. degree from Nanyang Technological University in 2017. He was a Post-doctoral Research Fellow at Massachusetts Institute of Technology (MIT) from 2018 to 2020 under the supervision of Professor Regina Bazillay. Prior to that, he was a Research Scientist at Institute for Infocomm Research (I2R), A*STAR from 2016 to 2018.Tuan's research interests lie in the intersection of Artificial Intelligence, Deep Learning, and Natural Language Processing. He has published over 40 papers on top-tier conferences and journals including NeurIPS, ICLR, ACL, EMNLP, KDD, WWW, TACL, AAAI, etc. Tuan also served as the Senior Area Chair of EMNLP 2020, Area Chair of ACL 2021, Senior Program Committee of IJCAI 2020-2021, and Program Committee member of NeuIPS, ICLR, ICML, AAAI, etc. and standing reviewer of Transaction of ACL (TACL), Computational Linguistics (CL), Transactions on Knowledge and Data Engineering (TKDE), ACM Computing Surveys. He is a recipient of the Ministry of Trade and Industry (MTI) Singapore Innovation Award in 2013.", "interests": "Artificial Intelligence, Deep Learning, Natural Language Processing", "grants": "AI-Supported Collaborative Activity DesignPreparing for the Era of AI-powered Synthetic Advertising: Theoretical Development, Practical and Policy RecommendationsProject STORYSemi Supervised Learning for Knowledge Graph ConstructionTowards Robustness of Neural Networks Against Natural Language AttacksTowards Semantic-Aware Multimodal and Multilingual Deep Learning Systems for E-Commerce ApplicationsTRUSTWORTHY AI CENTRE NTU (TAICeN)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NTU)TRUSTWORTHY AI CENTRE NTU (TAICeN) (NUS)TRUSTWORTHY AI CENTRE NTU (TAICeN) (SMU)", "articles": ["2. Luu Anh Tuan, Darsh J Shah, Regina Barzilay. Capturing Greater Context for Question Generation. Proceedings of AAAI Conference on Artificial Intelligence (AAAI), 2020", "3. Kathryn Arbour*, Luu Anh Tuan*, Jia Luo*, Hira Rizvi, Andrew J. Plodkowski, Mustafa Sakhi, Kevin B. Huang, Subba R. Digumarthy, Michelle S. Ginsberg, Jeffrey Girshman, Mark G. Kris, Gregory J. Riely, Adam Yala, Justin F. Gainor, Regina Barzilay, and Matthew D. Hellmann. Deep learning to estimate RECIST in patients with NSCLC treated with PD-1 blockade. Cancer Discovery, 2020 (Impact factor: 29.5)", "4. Yi Tay, Luu Anh Tuan, Aston Zhang, Shuohang Wang, Siu Cheung Hui. Compositional De-Attention Networks. Proceedings of Advances in Neural Information Processing Systems (NeurIPS), 2019", "5. Yi Tay, Luu Anh Tuan, Siu Cheung Hui, Jian Su. Densely Connected Attention Propagation for Reading Comprehension. Proceedings of Advances in Neural Information Processing Systems (NeurIPS), 2018"], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?user=d6ixOGYAAAAJ&hl=en&oi=ao"}, "google_scholar": "https://scholar.google.com/citations?user=d6ixOGYAAAAJ&hl=en&oi=ao", "orcid": null, "github": "https://tuanluu.github.io/", "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01296", "other_websites": []}