{"full_name": "Hui Siu Cheung", "designation": "Associate Professor, School of Computer Science and Engineering", "name_card": "Assoc Prof Hui Siu Cheung", "email": "asschui@ntu.edu.sg", "keywords": ["Computer Science and Engineering", "Info-Communication Technology", "Interactive Digital Media", "Internet & Communications", "Mathematics"], "biography": "Assoc Prof Hui Siu Cheung is currently in the Division of Information Systems, School of Computer Engineering since 1990. He received his B.Sc. degree in Mathematics in 1983 and D. Phil in 1987 from the University of Sussex, UK. He worked in IBM China/Hong Kong Corporation as a system engineer from 1987 to 1990. His current research interests include data mining, Web mining, information retrieval, natural language processing, mathematical data mining, intelligent tutoring systems and Semantic Web. He has published over 100 international journal papers and 80 conference papers.", "interests": "Assoc Prof Hui Siu Cheung's areas of expertise are data mining, Web mining, information retrieval, natural language processing, mathematical data mining, intelligent tutoring systems and Semantic Web. His current research works focus on information retrieval, text mining, natural query processing and Semantic Web.", "grants": "Predictive Food Safety Monitoring to Inform Assessment and Prioritization (A Proof-of-Concept Study)", "articles": ["T.T.Quan, S.C.Hui, C.M.Fong, T.H.Cao. (2006). Automatic fuzzy ontology generation for semantic web. IEEE Transactions on Knowledge and Data Engineering, 18(6), 842-856.", "T.T. Quan*, S.C.Hui, C.M.Fong. (2006). Automatic Fuzzy Ontology Generation for Semantic Help-Desk Support. IEEE Transactions on Industrial Informatics, 2(3), 155-164.", "P.Y. Lee*, S.C.Hui, C.M.Fong. (2005). An intelligent categorization engine for bilingual web content filtering. IEEE Transactions on Multimedia, .", "Y. Gao, M.K.H.Leung, S.C.Hui, M.W. Tananda*. (2003). Facial Expression Recognition from Line-based Caricatures. IEEE Transactions on Systems, Man and Cybernetics, 33(3), 407-412."], "books": [], "book_chapters": [], "conferences": [], "bibliometrics": {}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=d4ZYx6gAAAAJ", "orcid": null, "github": null, "scopus": null, "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00700", "other_websites": ["http://www3.ntu.edu.sg/home/asschui/"]}