{"full_name": "Sun Aixin", "designation": "Associate Chair (Academic), School of Computer Science and Engineering", "name_card": "Assoc Prof Sun Aixin", "email": "axsun@ntu.edu.sg", "image_path": "./profile_img/sun_aixin.jpg", "keywords": ["Computational Intelligence", "Information Sciences and Systems"], "biography": "Dr. Sun Aixin is an Associate Professor and Assistant Chair (Academic) at the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. He has been a faculty member of SCSE since 2005 and was the Assistant Chair (Admissions and Outreach) from 2016 to 2020. He is a member of Singapore Data Science Consortium (SDSC) Technical Committee, and SDSC institution representative of NTU. His current research interests include information retrieval, text mining, social computing, and digital libraries.Dr. Sun received B.A.Sc (1st class honours) and Ph.D. both in Computer Engineering from NTU in 2001 and 2004 respectively. He has published about 200 papers in major international journals and conferences. According to Google Scholar, his papers have received more than 13,000 citations, with h-index above 50.Dr. Sun is an associate editor of Neurocomputing, editorial board member of Journal of the Association for Information Science and Technology (JASIST), and editorial board member of Information Retrieval Journal. He has served as the demonstration track co-chair for SIGIR2020, ICDM2018, CIKM2017, PC co-chair for AIRS2019, and general chair for ADMA2017. He was a member of the best paper committee for SIGIR2020. He has also served as Area Chair, Senior PC member or PC member for many conferences including SIGIR, WWW, WSDM, EMNLP, AAAI, and IJCAI.", "interests": "Information Retrieval; Text/Web Mining; Social Computing; Multimedia", "grants": "Geography of Fake News: Misinformation Spreading and Implication for Capital MarketsTrustworthy and Explainable AI: Text Data Augmentation Multi-Lingual NLP Generation", "articles": ["Sun, A., Lim, E. P., & Liu, Y. (2009). On strategies for imbalanced text classification using SVM: A comparative study. Decision Support Systems, 48(1), 191-201.", "Liu, Y., Loh, H. T., & Sun, A. (2009). Imbalanced text classification: A term weighting approach. Expert Systems with Applications, 36(1), 690-701.", "Ma, Z., Sun, A., & Cong, G. (2013). On predicting the popularity of newly emerging hashtags in Twitter. Journal of the American Society for Information Science and Technology, 64(7), 1399-1410.", "Li, J., Sun, A., Han, J., & Li, C. (2020). A survey on deep learning for named entity recognition. IEEE Transactions on Knowledge and Data Engineering, 34(1), 50-70.", "Zheng, X., Han, J., & Sun, A. (2018). A survey of location prediction on Twitter. IEEE Transactions on Knowledge and Data Engineering, 30(9), 1652-1671.", "Li, C., Duan, Y., Wang, H., Zhang, Z., Sun, A., & Ma, Z. (2017). Enhancing topic modeling for short texts with auxiliary word embeddings. ACM Transactions on Information Systems (TOIS), 36(2), 11.", "Sedhai, S., & Sun, A. (2017). Semi-supervised spam detection in Twitter stream. IEEE Transactions on Computational Social Systems, 5(1), 169-175.", "Yuan, Q., Cong, G., Zhao, K., Ma, Z., & Sun, A. (2015). Who, where, when, and what: A nonparametric Bayesian approach to context-aware recommendation and search for twitter users. ACM Transactions on Information Systems (TOIS), 33(1), 1-33.", "Li, C., Sun, A., Weng, J., & He, Q. (2014). Tweet segmentation and its application to named entity recognition. IEEE Transactions on Knowledge and Data Engineering, 27(2), 558-570.", "Yao, Y. Y., Tang, X. X., Lim, E. P. E. P., & Sun, A. A. (2006). An energy-efficient and access latency optimized indexing scheme for wireless data broadcast. IEEE Transactions on Knowledge and Data Engineering, 18(8), 1111-1124.", "Click here for more publications.", "Chen, X., Yao, L., Wang, X., Sun, A., & Sheng, Q. Z. (2022). Generative adversarial reward learning for generalized behavior tendency inference. IEEE Transactions on Knowledge and Data Engineering, article in press.", "Zhang, H., Sun, A., Jing, W., Zhen, L., Zhou, J. T., & Goh, R. S. M. (2021). Natural language video localization: A revisit in span-based question answering framework. IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(8), 4252-4266.", "Lee, G. E., & Sun, A. (2021). Understanding the stability of medical concept embeddings. Journal of the Association for Information Science and Technology, 72(3), 346-356.", "Li, J., Sun, A., Han, J., & Li, C. (2020). A survey on deep learning for named entity recognition. IEEE Transactions on Knowledge and Data Engineering, 34(1), 50-70.", "Li, J., Sun, A., & Ma, Y. (2020). Neural named entity boundary detection. IEEE Transactions on Knowledge and Data Engineering, 33(4), 1790-1795.", "Zongyang Ma, Aixin Sun, Gao Cong. (2013). On Predicting Popularity of Newly Emerging Hashtags in Twitter. American Society for Information Science and Technology Journal.", "Aixin Sun, Sourav S. Bhowmick. (2010). Quantifying Tag Representativeness of Visual Content of Social Images. ACM Multimedia.", "Aixin Sun, Ee-Peng Lim, Ying Liu. (2009). On Strategies for Imbalanced Text Classification Using SVM: A Comparative Study. Decision Support Systems, 48(1), 191-201."], "books": [], "book_chapters": [], "conferences": ["Longke Hu, Aixin Sun, Yong Liu. (2014). Your Neighbors Affect Your Ratings: On Geographical Neighborhood Influence to Rating Prediction. 37th Annual ACM SIGIR Conference."], "bibliometrics": {"google_scholar": "https://scholar.google.com/citations?hl=en&user=wyKGVKUAAAAJ&view_op=list_works", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7202552214"}, "google_scholar": "https://scholar.google.com/citations?hl=en&user=wyKGVKUAAAAJ&view_op=list_works", "orcid": "https://orcid.org/0000-0003-0764-4258", "github": null, "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7202552214", "web_of_science": null, "dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00552", "other_websites": ["https://personal.ntu.edu.sg/axsun"]}