{"https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:u5HHmVD_uO8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1498454/", "authors": ["Jun Luo", "J-P Hubaux"], "publication_date": "2005/3/13", "conference": "Proceedings IEEE 24th Annual Joint Conference of the IEEE Computer and Communications Societies.", "volume": "3", "pages": "1735-1746", "publisher": "IEEE", "description": "Although many energy efficient/conserving routing protocols have been proposed for wireless sensor networks, the concentration of data traffic towards a small number of base stations remains a major threat to the network lifetime. The main reason is that the sensor nodes located near a base station have to relay data for a large part of the network and thus deplete their batteries very quickly. The solution we propose in this paper suggests that the base station be mobile; in this way, the nodes located close to it change over time. Data collection protocols can then be optimized by taking both base station mobility and multi-hop routing into account. We first study the former, and conclude that the best mobility strategy consists in following the periphery of the network (we assume that the sensors are deployed within a circle). We then consider jointly mobility and routing algorithms in this case, and show that a better …", "total_citations": {"2005": 17, "2006": 39, "2007": 64, "2008": 85, "2009": 96, "2010": 125, "2011": 114, "2012": 107, "2013": 92, "2014": 114, "2015": 102, "2016": 62, "2017": 59, "2018": 44, "2019": 35, "2020": 31, "2021": 13, "2022": 9, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:R3hNpaxXUhUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1306972/", "authors": ["Jean-Pierre Hubaux", "Srdjan Capkun", "Jun Luo"], "publication_date": "2004/5", "journal": "Security & Privacy, IEEE", "volume": "2", "issue": "3", "pages": "49-55", "publisher": "IEEE", "description": "Road safety, traffic management, and driver convenience continue to improve, in large part thanks to appropriate usage of information technology. But this evolution has deep implications for security and privacy, which the research community has overlooked so far.", "total_citations": {"2004": 5, "2005": 19, "2006": 29, "2007": 57, "2008": 55, "2009": 70, "2010": 66, "2011": 65, "2012": 64, "2013": 53, "2014": 76, "2015": 76, "2016": 58, "2017": 48, "2018": 80, "2019": 55, "2020": 63, "2021": 48, "2022": 33, "2023": 16}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:D_tqNUsBuKoC": {"external_link": "https://link.springer.com/chapter/10.1007/3-540-28428-1_7", "authors": ["Jun Luo", "Jean-Pierre Hubaux"], "publication_date": "2006", "book": "Embedded Security in Cars", "pages": "111-122", "publisher": "Springer, Berlin, Heidelberg", "description": "As a component of the intelligent transportation system (ITS) and one of the concrete applications of mobile ad hoc networks, inter-vehicle communication (IVC) has attracted research attention from both academia and industry of, notably, US, EU, and Japan. The most important feature of IVC is its ability to extend the horizon of drivers and on-board devices (e.g., radar or sensors) and, thus, to improve road traffic safety and efficiency. This chapter surveys IVC with respect to key enabling technologies ranging from physical radio frequency to group communication primitives and security issues. The mobility models used to evaluate the feasibility of these technologies are also briefly described. We focus on the discussion of various MAC protocols that seem to be indispensable components in the network protocol stack of IVC. By analyzing the application requirements and the protocols built upon the MAC layer …", "total_citations": {"2004": 3, "2005": 8, "2006": 23, "2007": 30, "2008": 56, "2009": 55, "2010": 55, "2011": 37, "2012": 35, "2013": 40, "2014": 30, "2015": 20, "2016": 24, "2017": 10, "2018": 14, "2019": 11, "2020": 8, "2021": 8, "2022": 7, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:QIV2ME_5wuYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5984932/", "authors": ["Liu Xiang", "Jun Luo"], "publication_date": "2011/6/27", "conference": "2011 8th annual IEEE communications society conference on sensor, mesh and ad hoc communications and networks", "pages": "46-54", "publisher": "IEEE", "description": "As a burgeoning technique for signal processing, compressed sensing (CS) is being increasingly applied to wireless communications. However, little work is done to apply CS to multihop networking scenarios. In this paper, we investigate the application of CS to data collection in wireless sensor networks, and we aim at minimizing the network energy consumption through joint routing and compressed aggregation. We first characterize the optimal solution to this optimization problem, then we prove its NP-completeness. We further propose a mixed-integer programming formulation along with a greedy heuristic, from which both the optimal (for small scale problems) and the near-optimal (for large scale problems) aggregation trees are obtained. Our results validate the efficacy of the greedy heuristics, as well as the great improvement in energy efficiency through our joint routing and aggregation scheme.", "total_citations": {"2011": 4, "2012": 17, "2013": 28, "2014": 55, "2015": 83, "2016": 80, "2017": 48, "2018": 39, "2019": 23, "2020": 18, "2021": 29, "2022": 11, "2023": 9}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:2osOgNQ5qMEC": {"external_link": "https://link.springer.com/chapter/10.1007/11776178_29", "authors": ["Jun Luo", "Jacques Panchard", "Michał Piórkowski", "Matthias Grossglauser", "Jean-Pierre Hubaux"], "publication_date": "2006/6/18", "conference": "International Conference on Distributed Computing in Sensor Systems", "pages": "480-497", "publisher": "Springer, Berlin, Heidelberg", "description": "Improving network lifetime is a fundamental challenge of wireless sensor networks. One possible solution consists in making use of mobile sinks. Whereas theoretical analysis shows that this approach does indeed benefit network lifetime, practical routing protocols that support sink mobility are still missing. In this paper, in line with our previous efforts, we investigate the approach that makes use of a mobile sink for balancing the traffic load and in turn improving network lifetime. We engineer a routing protocol, MobiRoute, that effectively supports sink mobility. Through intensive simulations in TOSSIM with a mobile sink and an implementation of MobiRoute, we prove the feasibility of the mobile sink approach by demonstrating the improved network lifetime in several deployment scenarios.", "total_citations": {"2006": 5, "2007": 16, "2008": 32, "2009": 34, "2010": 50, "2011": 28, "2012": 42, "2013": 50, "2014": 34, "2015": 32, "2016": 18, "2017": 14, "2018": 23, "2019": 11, "2020": 11, "2021": 2, "2022": 5, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:9yKSN-GCB0IC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1209243/", "authors": ["Jun Luo", "Patrick Th Eugster", "J-P Hubaux"], "publication_date": "2003/3/30", "conference": "IEEE INFOCOM 2003. Twenty-second Annual Joint Conference of the IEEE Computer and Communications Societies (IEEE Cat. No. 03CH37428)", "volume": "3", "pages": "2229-2239", "publisher": "IEEE", "description": "Traditionally, reliable multicast protocols are deterministic in nature. It is precisely this determinism that tends to become their limiting factor when aiming at reliability and scalability, particularly in highly dynamic networks, e.g., ad hoc networks. As probabilistic protocols, gossip-based multicast protocols, recently (re-)discovered in wired networks, appear to be a viable means to \"fight fire with fire\" by exploiting the nondeterministic nature of ad hoc networks. We present a protocol that is designed to meet a more practical specification of probabilistic reliability; this gossip-based multicast protocol, called route driven gossip (RDG), can be deployed on any basic on-demand routing protocol. RDG is custom-tailored to ad hoc networks, achieving a high level of reliability without relying on any inherent multicast primitive. We illustrate our RDG protocol by layering it on top of the \"bare\" DSR protocol. We prove the reliability …", "total_citations": {"2002": 3, "2003": 15, "2004": 29, "2005": 38, "2006": 26, "2007": 40, "2008": 45, "2009": 29, "2010": 21, "2011": 9, "2012": 16, "2013": 12, "2014": 11, "2015": 4, "2016": 3, "2017": 6, "2018": 1, "2019": 1, "2020": 0, "2021": 2, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:mVmsd5A6BfQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5308259/", "authors": ["Jun Luo", "Jean-Pierre Hubaux"], "publication_date": "2010/6/1", "journal": "IEEE/ACM Transactions on Networking (TON)", "volume": "18", "issue": "3", "pages": "871-884", "publisher": "IEEE Press", "description": "The longevity of wireless sensor networks (WSNs) is a major issue that impacts the application of such networks. While communication protocols are striving to save energy by acting on sensor nodes, recent results show that network lifetime can be prolonged by further involving sink mobility. As most proposals give their evidence of lifetime improvement through either (small-scale) field tests or numerical simulations on rather arbitrary cases, a theoretical understanding of the reason for this improvement and the tractability of the joint optimization problem is still missing. In this paper, we build a framework for investigating the joint sink mobility and routing problem by constraining the sink to a finite number of locations. We formally prove the NP-hardness of the problem. We also investigate the induced subproblems. In particular, we develop an efficient primal-dual algorithm to solve the subproblem involving a single …", "total_citations": {"2007": 1, "2008": 1, "2009": 0, "2010": 3, "2011": 12, "2012": 21, "2013": 30, "2014": 41, "2015": 34, "2016": 28, "2017": 22, "2018": 24, "2019": 17, "2020": 8, "2021": 10, "2022": 7, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:KlAtU1dfN6UC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5502565/", "authors": ["Jun Luo", "Liu Xiang", "Catherine Rosenberg"], "publication_date": "2010/5/23", "conference": "2010 IEEE International Conference on Communications", "pages": "1-6", "publisher": "IEEE", "description": "Although compressed sensing (CS) has been envisioned as a useful technique to improve the performance of wireless sensor networks (WSNs), it is still not very clear how exactly it will be applied and how big the improvements will be. In this paper, we propose two different ways (plain-CS and hybrid-CS) of applying CS to WSNs at the networking layer, in the form of a particular data aggregation mechanism. We formulate three flow-based optimization problems to compute the throughput of the non-CS, plain-CS, and hybrid-CS schemes. We provide the exact solution to the first problem corresponding to the non-CS case and lower bounds for the cases with CS. Our preliminary numerical results are only for a low-power regime. They illustrate two crucial insights: first, applying CS naively may not bring any improvement, and secondly, our hybrid-CS can achieve significant improvement in throughput.", "total_citations": {"2010": 1, "2011": 14, "2012": 16, "2013": 22, "2014": 25, "2015": 26, "2016": 35, "2017": 19, "2018": 27, "2019": 15, "2020": 13, "2021": 11, "2022": 7, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:PELIpwtuRlgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6553686/", "authors": ["Kai Han", "Jun Luo", "Yang Liu", "Athanasios V Vasilakos"], "publication_date": "2013/7", "journal": "IEEE Communications Magazine", "volume": "51", "issue": "7", "pages": "107-113", "publisher": "IEEE", "description": "Although duty-cycling has long been a critical mechanism for energy conservation in wireless sensor networks, it is only recently that research efforts have been put to design data communication protocols that perform efficiently in duty-cycled wireless sensor networks (DC-WSNs). In this article, we survey these research problems, aiming at revealing insights into the following three key questions: what are the meaningful (algorithm design) problems for DC-WSNs, which problems have been studied and which have not, and what are the essential techniques behind the existing solutions? All these insights may serve as motivations and inspirations for further developments in this field.", "total_citations": {"2013": 3, "2014": 16, "2015": 43, "2016": 46, "2017": 41, "2018": 22, "2019": 18, "2020": 24, "2021": 9, "2022": 3, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:tkaPQYYpVKoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6384860/", "authors": ["Liu Xiang", "Jun Luo", "Catherine Rosenberg"], "publication_date": "2013", "journal": "IEEE/ACM Transactions on Networking (TON)", "volume": "21", "issue": "6", "pages": "1722-1735", "publisher": "IEEE Press", "description": "We focus on wireless sensor networks (WSNs) that perform data collection with the objective of obtaining the whole dataset at the sink (as opposed to a function of the dataset). In this case, energy-efficient data collection requires the use of data aggregation. Whereas many data aggregation schemes have been investigated, they either compromise the fidelity of the recovered data or require complicated in-network compressions. In this paper, we propose a novel data aggregation scheme that exploits compressed sensing (CS) to achieve both recovery fidelity and energy efficiency in WSNs with arbitrary topology. We make use of diffusion wavelets to find a sparse basis that characterizes the spatial (and temporal) correlations well on arbitrary WSNs, which enables straightforward CS-based data aggregation as well as high-fidelity data recovery at the sink. Based on this scheme, we investigate the minimum-energy …", "total_citations": {"2011": 1, "2012": 0, "2013": 2, "2014": 18, "2015": 22, "2016": 42, "2017": 23, "2018": 22, "2019": 25, "2020": 19, "2021": 13, "2022": 7, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:WF5omc3nYNoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5418856/", "authors": ["Jun Luo", "Catherine Rosenberg", "André Girard"], "publication_date": "2010/2/22", "journal": "IEEE/ACM Transactions on Networking", "volume": "18", "issue": "5", "pages": "1387-1400", "publisher": "IEEE", "description": "We present a number of significant engineering insights on what makes a good configuration for medium- to large-size wireless mesh networks (WMNs) when the objective function is to maximize the minimum throughput among all flows. For this, we first develop efficient and exact computational tools using column generation with greedy pricing that allow us to compute exact solutions for networks significantly larger than what has been possible so far. We also develop very fast approximations that compute nearly optimal solutions for even larger cases. Finally, we adapt our tools to the case of proportional fairness and show that the engineering insights are very similar.", "total_citations": {"2009": 1, "2010": 10, "2011": 19, "2012": 28, "2013": 23, "2014": 24, "2015": 17, "2016": 7, "2017": 9, "2018": 10, "2019": 4, "2020": 7, "2021": 4, "2022": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:qjMakFHDy7sC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/778415.778417", "authors": ["Jun Luo", "Jean-Pierre Hubaux", "Patrick Th Eugster"], "publication_date": "2003/6/1", "book": "Proceedings of the 4th ACM international symposium on Mobile ad hoc networking & computing", "pages": "1-12", "description": "Reliable storage of data with concurrent read/write accesses (or query/update) is an ever recurring issue in distributed settings. In mobile ad hoc networks, the problem becomes even more challenging due to highly dynamic and unpredictable topology changes. It is precisely this unpredictability that makes probabilistic protocols very appealing for such environments. Inspired by the principles of probabilistic quorum systems, we present a Probabilistic quorum system for ad hoc networks Pan), a collection of protocols for the reliable storage of data in mobile ad hoc networks. Our system behaves in a predictable way due to the gossip-based diffusion mechanism applied for quorum accesses, and the protocol overhead is reduced by adopting an asymmetric quorum construction. We present an analysis of our Pan system, in terms of both reliability and overhead, which can be used to fine tune protocol parameters to …", "total_citations": {"2003": 3, "2004": 10, "2005": 20, "2006": 19, "2007": 11, "2008": 10, "2009": 15, "2010": 14, "2011": 9, "2012": 6, "2013": 8, "2014": 2, "2015": 7, "2016": 2, "2017": 5, "2018": 0, "2019": 1, "2020": 0, "2021": 5, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:WJVC3Jt7v1AC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8577032/", "authors": ["Jiangtian Nie", "Jun Luo", "Zehui Xiong", "Dusit Niyato", "Ping Wang"], "publication_date": "2019/1/18", "journal": "IEEE Transactions on Wireless Communications", "volume": "18", "issue": "1", "pages": "724-738", "publisher": "IEEE", "description": "Mobile crowdsensing has shown great potential in addressing large-scale data sensing problems by allocating sensing tasks to pervasive mobile users. The mobile users will participate in a crowdsensing platform if they can receive a satisfactory reward. In this paper, to effectively and efficiently recruit a sufficient number of mobile users, i.e., participants, we investigate an optimal incentive mechanism of a crowdsensing service provider. We apply a two-stage Stackelberg game to analyze the participation level of the mobile users and the optimal incentive mechanism of the crowdsensing service provider using backward induction. In order to motivate the participants, the incentive mechanism is designed by taking into account the social network effects from the underlying mobile social domain. We derive the analytical expressions for the discriminatory incentive as well as the uniform incentive mechanisms. To fit into …", "total_citations": {"2018": 1, "2019": 17, "2020": 30, "2021": 28, "2022": 37, "2023": 36}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:EYYDruWGBe4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6805205/", "authors": ["Chi Zhang", "K Subbu", "Jun Luo", "Jianxin Wu"], "publication_date": "2015/2", "journal": "IEEE Transactions on Mobile Computing", "volume": "14", "issue": "2", "pages": "387--400", "publisher": "IEEE Press", "description": "Although a large number of WiFi fingerprinting based indoor localization systems have been proposed, our field experience with Google Maps Indoor (GMI), the only system available for public testing, shows that it is far from mature for indoor navigation. In this paper, we first report our field studies with GMI, as well as experiment results aiming to explain our unsatisfactory GMI experience. Then motivated by the obtained insights, we propose GROPING as a self-contained indoor navigation system independent of any infrastructural support. GROPING relies on geomagnetic fingerprints that are far more stable than WiFi fingerprints, and it exploits crowdsensing to construct floor maps rather than expecting individual venues to supply digitized maps. Based on our experiments with 20 participants in various floors of a big shopping mall, GROPING is able to deliver a sufficient accuracy for localization and thus provides …", "total_citations": {"2014": 3, "2015": 8, "2016": 18, "2017": 16, "2018": 25, "2019": 25, "2020": 14, "2021": 9, "2022": 14, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:D03iK_w7-QYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6051464/", "authors": ["Zhijie Shen", "Jun Luo", "Roger Zimmermann", "Athanasios V Vasilakos"], "publication_date": "2011/12", "journal": "Proceedings of the IEEE", "volume": "12", "issue": "99", "pages": "2089-2109", "publisher": "IEEE", "description": "Internet media content delivery started to emerge roughly a decade ago, and it has subsequently had a major impact on network traffic and usage. Although traditional client-server systems were used initially for delivering media content, researchers and practitioners soon realized that peer-to-peer (P2P) systems, due to their self-scaling properties, had the potential to improve scalability compared with traditional client-server architectures. Consequently, various P2P media streaming systems have been deployed successfully, and corresponding theoretical investigations have been performed on such systems. The rapid developments in this field raise the need for up-to-date literature surveys to summarize them. In recent years, numerous technological discoveries have been achieved. The focus of this report is to survey and discuss these new findings, which include new technological developments, as well as …", "total_citations": {"2012": 6, "2013": 17, "2014": 18, "2015": 27, "2016": 25, "2017": 9, "2018": 4, "2019": 3, "2020": 3, "2021": 5, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:URolC5Kub84C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6846148/", "authors": ["Chi Zhang", "Jun Luo", "Jianxin Wu"], "publication_date": "2014/5", "conference": "IEEE International Conference on  Distributed Computing in Sensor Systems (DCOSS)", "pages": "75 - 82", "publisher": "IEEE Press", "description": "We present MaWi - a smart phone based scalable indoor localization system. Central to MaWi is a novel framework combining two self-contained but complementary localization techniques: Wi-Fi and Ambient Magnetic Field. Combining the two techniques, MaWi not only achieves a high localization accuracy, but also effectively reduces human labor in building fingerprint databases: to avoid war-driving, MaWi is designed to work with low quality fingerprint databases that can be efficiently built by only one person. Our experiments demonstrate that MaWi, with a fingerprint database as scarce as one data sample at each spot, outperforms the state-of-the-art proposals working on a richer fingerprint database.", "total_citations": {"2014": 1, "2015": 8, "2016": 1, "2017": 8, "2018": 5, "2019": 11, "2020": 5, "2021": 11, "2022": 32, "2023": 20}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:zYLM7Y9cAGgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1542053/", "authors": ["Jun Luo", "J-P Hubaux", "Patrick Th Eugster"], "publication_date": "2005/11/21", "journal": "IEEE Transactions on Dependable and Secure Computing", "volume": "2", "issue": "4", "pages": "311-323", "publisher": "IEEE", "description": "Securing ad hoc networks is notoriously challenging, notably due to the lack of an online infrastructure. In particular, key management is a problem that has been addressed by many researchers but with limited results. In this paper, we consider the case where an ad hoc network is under the responsibility of a mother certification authority (mCA). Since the nodes can frequently be collectively isolated from the mCA (e.g., for a remote mission) but still need the access to a certification authority, the mCA preassigns a special role to several nodes (called servers) that constitute a distributed certification authority (dCA) during the isolated period. We propose a solution, called DICTATE (DIstributed CerTification Authority with probabilisTic frEshness), to manage the dCA. This solution ensures that the dCA always processes a certificate update (or query) request in a finite amount of time and that an adversary cannot forge a …", "total_citations": {"2005": 1, "2006": 4, "2007": 10, "2008": 6, "2009": 13, "2010": 9, "2011": 12, "2012": 10, "2013": 8, "2014": 6, "2015": 4, "2016": 4, "2017": 2, "2018": 0, "2019": 2, "2020": 0, "2021": 4, "2022": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:Ri6SYOTghG4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7902149/", "authors": ["Yanbing Yang", "Jie Hao", "Jun Luo"], "publication_date": "2017/4/17", "journal": "IEEE Transactions on Mobile Computing", "volume": "16", "issue": "12", "pages": "3308-3319", "publisher": "IEEE", "description": "Although Visible Light Communication (VLC) is gaining increasing attention in research, developing a practical VLC system to harness its immediate benefits using Commercial Off-The-Shelf (COTS) devices is still an open issue. To this end, we develop and deploy CeilingTalk as a lightweight wireless broadcast system using COTS LED luminaries as transmitters and smartphone cameras as receivers so that it can be fully hosted in a smartphone and is feasible for all possible indoor environments. CeilingTalk innovates in both encoding and decoding to achieve an adequate throughput for realistic applications. On one hand, it employs Raptor coding to allow multiple LED luminaries to transmit collaboratively so as to benefit both throughput and reliability. On the other hand, it involves a lightweight decoding scheme to handle the asynchrony (both spatial and temporal) in transmissions. Moreover, we analyze the …", "total_citations": {"2017": 4, "2018": 14, "2019": 20, "2020": 17, "2021": 19, "2022": 11, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:N5tVd3kTz84C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7079475/", "authors": ["Kai Han", "Chi Zhang", "Jun Luo", "Menglan Hu", "Bharadwaj Veeravalli"], "publication_date": "2015/4/3", "journal": "IEEE Transactions on Computers", "volume": "65", "issue": "1", "pages": "294-307", "publisher": "IEEE", "description": "Mobile crowdsensing leverages mobile devices (e.g., smart phones) and human mobility for pervasive information exploration and collection; it has been deemed as a promising paradigm that will revolutionize various research and application domains. Unfortunately, the practicality of mobile crowdsensing can be crippled due to the lack of incentive mechanisms that stimulate human participation. In this paper, we study incentive mechanisms for a novel Mobile Crowdsensing Scheduling (MCS) problem, where a mobile crowdsensing application owner announces a set of sensing tasks, then human users (carrying mobile devices) compete for the tasks based on their respective sensing costs and available time periods, and finally the owner schedules as well as pays the users to maximize its own sensing revenue under a certain budget. We prove that the MCS problem is NP-hard and propose polynomial-time …", "total_citations": {"2014": 1, "2015": 6, "2016": 7, "2017": 14, "2018": 18, "2019": 10, "2020": 16, "2021": 7, "2022": 6, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&citation_for_view=qXLjz30AAAAJ:i2xiXl-TujoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7524469/", "authors": ["Zhiming Hu", "Baochun Li", "Jun Luo"], "publication_date": "2016/4", "conference": "IEEE INFOCOM 2016", "description": "Typically called big data processing, processing large volumes of data from geographically distributed regions with machine learning algorithms has emerged as an important analytical tool for governments and multinational corporations. The traditional wisdom calls for the collection of all the data across the world to a central datacenter location, to be processed using data-parallel applications. This is neither efficient nor practical as the volume of data grows exponentially. Rather than transferring data, we believe that computation tasks should be scheduled where the data is, while data should be processed with a minimum amount of transfers across datacenters. In this paper, we design and implement Flutter, a new task scheduling algorithm that improves the completion times of big data processing jobs across geographically distributed datacenters. To cater to the specific characteristics of data-parallel …", "total_citations": {"2015": 1, "2016": 1, "2017": 8, "2018": 19, "2019": 19, "2020": 13, "2021": 14, "2022": 7, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:GFxP56DSvIMC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3384419.3430735", "authors": ["Shuya Ding", "Zhe Chen", "Tianyue Zheng", "Jun Luo"], "publication_date": "2020/11/16", "conference": "Proceedings of the 18th ACM Conference on Embedded Networked Sensor Systems (SenSys'20)", "pages": "517-530", "description": "Radio-Frequency (RF) based device-free Human Activity Recognition (HAR) rises as a promising solution for many applications. However, device-free (or contactless) sensing is often more sensitive to environment changes than device-based (or wearable) sensing. Also, RF datasets strictly require on-line labeling during collection, starkly different from image and text data collections where human interpretations can be leveraged to perform off-line labeling. Therefore, existing solutions to RF-HAR entail a laborious data collection process for adapting to new environments. To this end, we propose RF-Net as a meta-learning based approach to one-shot RF-HAR; it reduces the labeling efforts for environment adaptation to the minimum level. In particular, we first examine three representative RF sensing techniques and two major meta-learning approaches. The results motivate us to innovate in two designs: i) a dual …", "total_citations": {"2020": 2, "2021": 15, "2022": 33, "2023": 32}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:IjCSPb-OGe4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1316054/", "authors": ["Jun Luo", "Patrick Th Eugster", "J-P Hubaux"], "publication_date": "2004/7/19", "journal": "IEEE transactions on mobile computing", "volume": "3", "issue": "2", "pages": "164-179", "publisher": "IEEE", "description": "Providing reliable group communication is an ever recurring topic in distributed settings. In mobile ad hoc networks, this problem is even more significant since all nodes act as peers, while it becomes more challenging due to highly dynamic and unpredictable topology changes. In order to overcome these difficulties, we deviate from the conventional point of view, i.e., we \"fight fire with fire,\" by exploiting the nondeterministic nature of ad hoc networks. Inspired by the principles of gossip mechanisms and probabilistic quorum systems, we present in this paper PILOT (probabilistic lightweight group communication system) for ad hoc networks, a two-layer system consisting of a set of protocols for reliable multicasting and data sharing in mobile ad hoc networks. The performance of PILOT is predictable and controllable in terms of both reliability (fault tolerance) and efficiency (overhead). We present an analysis of PILOT's …", "total_citations": {"2003": 1, "2004": 4, "2005": 8, "2006": 17, "2007": 12, "2008": 9, "2009": 6, "2010": 3, "2011": 5, "2012": 4, "2013": 3, "2014": 0, "2015": 1, "2016": 3, "2017": 1, "2018": 0, "2019": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:xtoqd-5pKcoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7093207/", "authors": ["Kai Han", "Chi Zhang", "Jun Luo"], "publication_date": "2016/6/1", "journal": "IEEE/ACM Transactions on Networking (TON)", "volume": "24", "issue": "3", "pages": "1462-1475", "publisher": "IEEE Press", "description": "Mobile crowdsensing has been intensively explored recently due to its flexible and pervasive sensing ability. Although many crowdsensing platforms have been built for various applications, the general issue of how to manage such systems intelligently remains largely open. While recent investigations mostly focus on incentivizing crowdsensing, the robustness of crowdsensing toward uncontrollable sensing quality, another important issue, has been widely neglected. Due to the non-professional personnel and devices, the quality of crowdsensing data cannot be fully guaranteed, hence the revenue gained from mobile crowdsensing is generally uncertain. Moreover, the need for compensating the sensing costs under a limited budget has exacerbated the situation: one does not enjoy an infinite horizon to learn the sensing ability of the crowd and hence to make decisions based on sufficient statistics. In this paper …", "total_citations": {"2015": 1, "2016": 2, "2017": 11, "2018": 14, "2019": 12, "2020": 13, "2021": 11, "2022": 10, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:VaXvl8Fpj5cC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6882302/", "authors": ["Kalyan P Subbu", "Chi Zhang", "Jun Luo", "Athanasios V Vasilakos"], "publication_date": "2014/8", "journal": "IEEE Wireless Communications", "volume": "21", "issue": "4", "pages": "106-112", "publisher": "IEEE Press", "description": "Over the past decade, indoor localization has been a topic of interest for both the academic and industrial communities. The need for location estimation, fueled mainly by inaccuracies of GPS indoors, has been addressed by specifically designed systems achieving a high localization accuracy but with a high deployment cost. Lately, dedicated systems are being replaced by smartphones through intelligent use of the built-in sensors. For instance, an accelerometer that can detect user activity can be combined with a wireless radio that captures wireless signal strength information to locate a user. With the advent of such technology, a myriad of systems have been proposed in the literature presenting an indefinite picture to a reader as to which systems actually work and which do not given practical considerations. This article takes up the goal of surveying state-of-the-art smartphone based indoor localization systems …", "total_citations": {"2014": 1, "2015": 8, "2016": 23, "2017": 10, "2018": 15, "2019": 7, "2020": 6, "2021": 3, "2022": 3, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:KbBQZpvPDL4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7917871/", "authors": ["Yanbing Yang", "Jie Hao", "Jun Luo", "Sinno Jialin Pan"], "publication_date": "2017/3/13", "conference": "2017 IEEE International Conference on Pervasive Computing and Communications (PerCom)", "pages": "247-256", "publisher": "IEEE", "description": "As a key component of building management and security, occupancy inference through smart sensing has attracted a lot of research attentions for nearly two decades. Nevertheless, existing solutions mostly rely on either pre-deployed infrastructures or user device participation, thus hampering their wide adoption. This paper presents CeilingSee, a dedicated occupancy inference system free of heavy infrastructure deployments and user involvements. Building upon existing LED lighting systems, CeilingSee converts part of the ceiling-mounted LED luminaires to act as sensors, sensing the variances in diffuse reflection caused by occupants. In realizing CeilingSee, we first re-design the LED driver to leverage LED's photoelectric effect so as to transform a light emitter to a light sensor. In order to produce accurate occupancy inference, we then engineer efficient learning algorithms to fuse sensing information …", "total_citations": {"2017": 4, "2018": 19, "2019": 17, "2020": 17, "2021": 11, "2022": 5, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:ldfaerwXgEUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6280608/", "authors": ["Kai Han", "Yang Liu", "Jun Luo"], "publication_date": "2013", "journal": "IEEE/ACM Transactions on Networking (TON)", "volume": "21", "issue": "3", "pages": "910-923", "publisher": "IEEE", "description": "In duty-cycled wireless sensor networks, the nodes switch between active and dormant states, and each node may determine its active/dormant schedule independently. This complicates the Minimum-Energy Multicasting (MEM) problem, which was primarily studied in always-active wireless ad hoc networks. In this paper, we study the duty-cycle-aware MEM problem in wireless sensor networks both for one-to-many multicasting and for all-to-all multicasting. In the case of one-to-many multicasting, we present a formalization of the Minimum-Energy Multicast Tree Construction and Scheduling (MEMTCS) problem. We prove that the MEMTCS problem is NP-hard, and it is unlikely to have an approximation algorithm with a performance ratio of (1 - 0(1)) ln Δ, where Δ is the maximum node degree in a network. We propose a polynomial-time approximation algorithm for the MEMTCS problem with a performance ratio of O …", "total_citations": {"2012": 1, "2013": 8, "2014": 12, "2015": 12, "2016": 9, "2017": 8, "2018": 12, "2019": 9, "2020": 4, "2021": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:_B80troHkn4C": {"external_link": "https://www.sciencedirect.com/science/article/pii/S0010448512002199", "authors": ["Min Meng", "Jiazhi Xia", "Jun Luo", "Ying He"], "publication_date": "2013/2/1", "journal": "Computer-Aided Design", "volume": "45", "issue": "2", "pages": "312-320", "publisher": "Elsevier", "description": "This paper presents an unsupervised algorithm for co-segmentation of a set of 3D shapes of the same family. Taking the over-segmentation results as input, our approach clusters the primitive patches to generate an initial guess. Then, it iteratively builds a statistical model to describe each cluster of parts from the previous estimation, and employs the multi-label optimization to improve the co-segmentation results. In contrast to the existing “one-shot” algorithms, our method is superior in that it can improve the co-segmentation results automatically. The experimental results on the Princeton Segmentation Benchmark demonstrate that our approach is able to co-segment 3D shapes with significant variability and achieves comparable performance to the existing supervised algorithms and better performance than the unsupervised ones.", "total_citations": {"2012": 2, "2013": 7, "2014": 7, "2015": 11, "2016": 8, "2017": 5, "2018": 16, "2019": 9, "2020": 5, "2021": 3, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:WqliGbK-hY8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2517351.2517365", "authors": ["Tianyu Xiang", "Zicheng Chi", "Feng Li", "Jun Luo", "Lihua Tang", "Liya Zhao", "Yaowen Yang"], "publication_date": "2013/11", "conference": "Proc. of the 11th ACM Conference on Embedded Networked Sensor Systems (SenSys'13)", "pages": "6:1-14", "publisher": "ACM", "description": "Whereas a lot of efforts have been put on energy conservation in wireless sensor networks, the limited lifetime of these systems still hampers their practical deployments. This situation is further exacerbated indoors, as conventional energy harvesting (e.g., solar) ceases to work. To enable long-lived indoor sensing, we report in this paper a self-sustaining sensing system that draws energy from indoor environments, adapts its duty-cycle to the harvested energy, and pays back the environment by enhancing the awareness of the indoor microclimate through an \"energy-free\" sensing. First of all, given the pervasive operation of heating, ventilation and air conditioning (HVAC) systems indoors, our system harvests energy from airflow introduced by the HVAC systems to power each sensor node. Secondly, as the harvested power is tiny (only of hundreds of μW), an extremely low but synchronous duty-cycle has to be …", "total_citations": {"2014": 4, "2015": 3, "2016": 6, "2017": 10, "2018": 11, "2019": 5, "2020": 13, "2021": 5, "2022": 5, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:a3BOlSfXSfwC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3397321", "authors": ["Tianyue Zheng", "Zhe Chen", "Chao Cai", "Jun Luo", "Xu Zhang"], "publication_date": "2020/6/15", "journal": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies", "volume": "4", "issue": "2", "pages": "1-27", "publisher": "ACM", "description": "Given the significant amount of time people spend in vehicles, health issues under driving condition have become a major concern. Such issues may vary from fatigue, asthma, stroke, to even heart attack, yet they can be adequately indicated by vital signs and abnormal activities. Therefore, in-vehicle vital sign monitoring can help us predict and hence prevent these issues. Whereas existing sensor-based (including camera) methods could be used to detect these indicators, privacy concern and system complexity both call for a convenient yet effective and robust alternative. This paper aims to develop V2iFi, an intelligent system performing monitoring tasks using a COTS impulse radio mounted on the windshield. V2iFi is capable of reliably detecting driver's vital signs under driving condition and with the presence of passengers, thus allowing for potentially inferring corresponding health issues. Compared with prior …", "total_citations": {"2020": 3, "2021": 13, "2022": 24, "2023": 25}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:LI9QrySNdTsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6823162/", "authors": ["Menglan Hu", "Jun Luo", "Yang Wang", "Martin Lucasiewycz", "Zeng Zeng"], "publication_date": "2014", "journal": "IEEE Transactions on Industrial Infomatics", "volume": "10", "issue": "3", "pages": "1817 - 1828", "publisher": "IEEE Press", "description": "As time-triggered communication protocols [e.g., time-triggered controller area network (TTCAN), time-triggered protocol (TTP), and FlexRay] are widely used on vehicles, the scheduling of tasks and messages on in-vehicle networks becomes a critical issue for offering quality-of-service (QoS) guarantees to time-critical applications on vehicles. This paper studies a holistic scheduling problem for handling real-time applications in time-triggered in-vehicle networks where practical aspects in system design and integration are captured. The contributions of this paper are multifold. First, it designs a novel scheduling algorithm, referred to as  Unfixed Start Time  (UST) algorithm, which schedules tasks and messages in a flexible way to enhance schedulability. In addition, to tolerate assignment conflicts and further improve schedulability, it proposes two rescheduling and backtracking methods, namely,  Rescheduling with …", "total_citations": {"2014": 1, "2015": 3, "2016": 10, "2017": 10, "2018": 9, "2019": 11, "2020": 11, "2021": 3, "2022": 4, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:otzGkya1bYkC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3447993.3483251", "authors": ["Zhe Chen", "Tianyue Zheng", "Chao Cai", "Jun Luo"], "publication_date": "2021/10/25", "conference": "Proceedings of the 27th Annual International Conference on Mobile Computing and Networking", "pages": "392-405", "description": "Vital signs are crucial indicators for human health, and researchers are studying contact-free alternatives to existing wearable vital signs sensors. Unfortunately, most of these designs demand a subject human body to be relatively static, rendering them very inconvenient to adopt in practice where body movements occur frequently. In particular, radio-frequency (RF) based contact-free sensing can be severely affected by body movements that overwhelm vital signs. To this end, we introduce MoVi-Fi as a motion-robust vital signs monitoring system, capable of recovering fine-grained vital signs waveform in a contact-free manner. Being a pure software system, MoVi-Fi can be built on top of virtually any commercial-grade radars. What inspires our design is that RF reflections caused by vital signs, albeit weak, do not totally disappear but are composited with other motion-incurred reflections in a nonlinear manner. As …", "total_citations": {"2021": 4, "2022": 24, "2023": 36}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:ZuybSZzF8UAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6662346/", "authors": ["Menglan Hu", "Jun Luo", "Wang Yang", "Bharadwaj Veeravalli"], "publication_date": "2013/11/21", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "25", "issue": "8", "pages": "2169 - 2179", "publisher": "IEEE Press", "description": "Content distribution networks (CDNs) built on clouds have recently started to emerge. Compared to conventional CDNs, cloud-based CDNs have the benefit of cost efficient hosting services without owning infrastructure. However, resource provisioning and replica placement in cloud CDNs involve a number of challenging issues, mainly due to the dynamic nature of demand patterns. To deal with this dynamic nature, this paper proposes a set of novel algorithms to solve the joint problem of resource provisioning and caching (i.e., replica placement) for cloud-based CDNs with an emphasis on handling the dynamic demand patterns. Firstly, we propose a provisioning and caching algorithm framework called Differential Provisioning and Caching (DPC) algorithm, which aims to rent cloud resources to build CDNs and whereby to cache contents so that the total rental cost can be minimized while all demands are served …", "total_citations": {"2014": 1, "2015": 3, "2016": 9, "2017": 8, "2018": 7, "2019": 17, "2020": 6, "2021": 6, "2022": 4, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:Y0pCki6q_DkC": {"external_link": "https://infoscience.epfl.ch/record/58341", "authors": ["Jun Luo", "Hersh V Shukla", "Jean-Pierre Hubaux"], "publication_date": "2006/4/23", "conference": "INFOCOM 2006, The 25th Conference on Computer Communications", "pages": "1-12", "description": "Location-awareness is crucial to many applications of sensor networks. Existing location surveying approaches either rely on an inflexible infrastructure or suffer from high computation and communication load. In this paper, we present Non-intEractive lOcation Surveying (NEOS) to address certain deficiencies in the existing approaches. The key contribution of NEOS is twofold:(i) it employs a mobile beacon to introduce mobilitydifferentiated time-of-arrival (MDToA) observations, a special form of time difference of arrival (TDoA), at the node side and (ii) it involves simple computations and entails no node-to-node communication. MDToA enables us to devise flexible and robust positioning algorithms; the resulting computational load fully obeys the processing constraints of sensor nodes. Furthermore, the non-interactive feature of NEOS allows of a substantial reduction on the nodes’ energy consumption. We have implemented a preliminary prototype of NEOS using CricketMotes. Our experiments with this prototype demonstrate a location accuracy within 2cm in a 16m2 area.", "total_citations": {"2005": 1, "2006": 1, "2007": 1, "2008": 4, "2009": 4, "2010": 9, "2011": 7, "2012": 4, "2013": 6, "2014": 5, "2015": 6, "2016": 4, "2017": 1, "2018": 5, "2019": 3, "2020": 0, "2021": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:yFnVuubrUp4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8886433/", "authors": ["Zhe Chen", "Guorong Zhu", "Sulei Wang", "Yuedong Xu", "Jie Xiong", "Jin Zhao", "Jun Luo", "Xin Wang"], "publication_date": "2019/10/30", "journal": "IEEE Transactions on Mobile Computing", "volume": "20", "issue": "2", "pages": "588-602", "publisher": "IEEE", "description": "Owing to the ubiquitous penetration of Wi-Fi in our daily lives, Wi-Fi indoor localization has attracted intensive attentions in the last decade or so. Despite some significant progresses, the high accuracy of existing systems is still achieved at the cost of dense access point (AP) deployment. The more practical single AP localization is largely left as an open problem because the hardware-induced time delay “contaminates” the measurement of signal propagation time in the air. In this article, we design and implement M 3  to tackle this challenge with commodity Wi-Fi cards. M 3  exploits a multipath-assisted approach that turns the harmful multipath from foe to friend to enable single AP localization: a device can be pinpointed through the combination of azimuths and the relative time of flight (ToF) of Line-of-Sight (LoS) signal and reflection signals, eliminating the need for multiple APs along with their absolute ToF …", "total_citations": {"2020": 3, "2021": 15, "2022": 28, "2023": 17}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:S16KYo8Pm5AC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7524511/", "authors": ["Jie Hao", "Yanbing Yang", "Jun Luo"], "publication_date": "2016/4/10", "conference": "IEEE INFOCOM 2016-The 35th Annual IEEE International Conference on Computer Communications", "pages": "1-9", "publisher": "IEEE", "description": "Although Visible Light Communication (VLC) is gaining increasing attentions in research, developing a practical VLC system to harness its immediate benefits using Commercial Off-The-Shelf (COTS) devices is still an open issue. To this end, we develop and deploy CeilingCast as a location-bound wireless broadcast system using COTS LEDs as transmitters and smartphone cameras as receivers. CeilingCast innovates in its effective coding and efficient decoding schemes, so that it can be fully hosted in a smartphone and is feasible for all possible indoor environments. Moreover, we analyze the impact of various parameters on the performance of CeilingCast, in order to derive a model for such VLC systems enabled by COTS devices and hence provide general guidance for future VLC deployments in larger scales. Finally, we conduct extensive field experiments to validate the effectiveness of our LED-camera …", "total_citations": {"2016": 2, "2017": 10, "2018": 7, "2019": 11, "2020": 15, "2021": 10, "2022": 3, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:Ug5p-4gJ2f0C": {"external_link": "https://www.sciencedirect.com/science/article/pii/S1389128616302493", "authors": ["Feng Li", "Jun Luo", "Shiqing Xin", "Ying He"], "publication_date": "2016/10/24", "journal": "Computer Networks", "volume": "108", "pages": "120-132", "publisher": "Elsevier", "description": "Sensor deployment is an important aspect of network architecture for Wireless Sensor Networks (WSNs). Although many solutions to mobile sensors deployment have been proposed, controlling mobile sensors with directional sensing ability towards optimal coverage remains to be an open problem. In this paper, we take the initiative to handle the Coverage Maximizing Mobile Sensor Deployment Problem (CMMSDP) with directional and arbitrarily oriented sensors. Our proposal consists of two algorithms. The first one, Concurrent Rotation and Motion Control (CRMC), is a localized iterative algorithm derived from optimality conditions, so it aims at reaching local maximum. The second algorithm, Staged Rotation and Motion Control (SRMC), decouples rotation and motion controls in order to reduce the computation complexity with slight sacrifice in optimality. We derive optimality and complexity results for both …", "total_citations": {"2012": 1, "2013": 2, "2014": 3, "2015": 2, "2016": 4, "2017": 6, "2018": 9, "2019": 11, "2020": 10, "2021": 5, "2022": 6, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:HbR8gkJAVGIC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2942358.2942385", "authors": ["Kai Han", "He Huang", "Jun Luo"], "publication_date": "2016/7/5", "conference": "Proceedings of the 17th ACM International Symposium on Mobile Ad Hoc Networking and Computing", "pages": "261-270", "description": "Mobile crowdsensing has been considered as a promising approach for large scale urban data collection, but has also posed new challenging problems such as incentivization and quality control. Among the other incentivization approaches, posted pricing has been widely adopted by commercial systems due to the reason that it naturally achieves truthfulness and fairness and is easy to be implemented. However, the fundamental problem of how to set a right posted price in crowdsensing systems remains largely open. In this paper, we study a quality-aware Bayesian pricing problem for mobile crowdsensing where the users' sensing costs and qualities for participating in crowdsensing are drawn from known distributions learned from historical information, and our goal is to choose an appropriate posted price to recruit a group of participants with reasonable sensing qualities for robust crowdsensing, while the total …", "total_citations": {"2016": 1, "2017": 9, "2018": 18, "2019": 13, "2020": 5, "2021": 8, "2022": 3, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:ClCfbGk0d_YC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7479551/", "authors": ["Feng Li", "Jun Luo", "Gaotao Shi", "Ying He"], "publication_date": "2016/5/26", "journal": "IEEE Transactions on Mobile Computing", "volume": "16", "issue": "3", "pages": "662-674", "publisher": "IEEE", "description": "Recent large-scale deployments of wireless sensor networks have posed a high demand on network throughput, forcing all (discrete) orthogonal ZigBee channels to be exploited to enhance transmission parallelism. However, the interference from widely deployed WiFi networks has severely jeopardized the usability of these discrete ZigBee channels, while the existing CSMA-based ZigBee MAC is too conservative to utilize each channel temporally. In this paper, we propose ART (Adaptive fRequency-Temporal co-existing) as a framework consisting of two components: FAVOR (FrequencyAllocation for Versatile Occupancy of spectRum) and P-CSMA (Probabilistic CSMA), to improve the co-existence between ZigBee and WiFi in both frequency and temporal perspectives. On one hand, FAVOR allocates continuous (center) frequencies to nodes/links in a near-optimal manner, by innovatively converting the problem …", "total_citations": {"2013": 1, "2014": 1, "2015": 2, "2016": 5, "2017": 6, "2018": 15, "2019": 3, "2020": 12, "2021": 6, "2022": 5, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:6ZxmRoH8BuwC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8391735/", "authors": ["Kai Han", "He Huang", "Jun Luo"], "publication_date": "2018/6/21", "journal": "IEEE/ACM Transactions on Networking", "volume": "26", "issue": "4", "pages": "1728-1741", "publisher": "IEEE", "description": "Mobile crowdsensing has been considered as a promising approach for large scale urban data collection, but has also posed new challenging problems, such as incentivization and quality control. Among the other incentivization approaches, posted pricing has been widely adopted by commercial systems due to the reason that it naturally achieves truthfulness and fairness and is easy to be implemented. However, the fundamental problem of how to set the “right” posted prices in crowdsensing systems remains largely open. In this paper, we study a quality-aware pricing problem for mobile crowdsensing, and our goal is to choose an appropriate posted price to recruit a group of participants with reasonable sensing qualities for robust crowdsensing, while the total expected payment is minimized. We show that our problem is NP-hard and has close ties with the well-known Poisson binomial distributions (PBDs). To …", "total_citations": {"2018": 2, "2019": 10, "2020": 12, "2021": 15, "2022": 12, "2023": 9}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:738O_yMBCRsC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2248371.2248386", "authors": ["Kai Han", "Liu Xiang", "Jun Luo", "Yang Liu"], "publication_date": "2012/6/11", "conference": "Proceedings of the thirteenth ACM international symposium on Mobile Ad Hoc Networking and Computing", "pages": "85-94", "description": "Wireless Sensor Networks (WSNs) have acquired new features recently, i.e., both the sensor and the antenna of a node can be directional. This brings new challenges to the Connected Coverage (CoCo) problem, where a finite set of targets needs to be monitored by some active sensor nodes, and the connectivity of these active nodes with the sink must be retained at the same time. In this paper, we study the Minimum-Energy Connected Coverage (MeCoCo) problem in WSNs with Omni-directional (O) and Directional (D) features, aiming at minimizing the total energy cost of both sensing and connectivity. Considering different combinations of O and D features, we study the MeCoCo problem under four cases, namely: O-Antenna and O-Sensor (OAOS), O-Antenna and D-Sensor (OADS), D-Antenna and D-Sensor (DADS), as well as D-Antenna and O-Sensor (DAOS). We prove that the MeCoCo problem is NP-hard …", "total_citations": {"2011": 1, "2012": 4, "2013": 7, "2014": 9, "2015": 6, "2016": 5, "2017": 9, "2018": 2, "2019": 7, "2020": 3, "2021": 5, "2022": 0, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:k8Z6L05lTy4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6862026/", "authors": ["Feng Li", "Jun Luo", "Wenping Wang", "Ying He"], "publication_date": "2014", "journal": "IEEE Transactions on Wireless Communications", "publisher": "IEEE Press", "description": "Although the problem of k-area coverage has been intensively investigated for dense wireless sensor networks (WSNs), how to arrive at a k-coverage sensor deployment that optimizes certain objectives in relatively sparse WSNs still faces both theoretical and practical difficulties. Moreover, only a handful of centralized algorithms have been proposed to elevate 2-D area coverage to 3-D surface coverage. In this paper, we present a practical algorithm, i.e., the Autonomous dePlOyment for Load baLancing k-surface cOverage (APOLLO), to move sensor nodes toward k-surface coverage, aiming at minimizing the maximum sensing range required by the nodes. APOLLO enables purely autonomous node deployment as it only entails localized computations. We prove the termination of the algorithm and the (local) optimality of the output. We also show that our optimization objective is closely related to other frequently …", "total_citations": {"2015": 5, "2016": 5, "2017": 8, "2018": 7, "2019": 10, "2020": 14, "2021": 4, "2022": 3, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:GtLg2Ama23sC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8107572/", "authors": ["Zhiming Hu", "Baochun Li", "Jun Luo"], "publication_date": "2017/11/14", "journal": "IEEE Transactions on Parallel and Distributed Systems", "volume": "29", "issue": "3", "pages": "705-718", "publisher": "IEEE", "description": "Typically called big data processing, analyzing large volumes of data from geographically distributed regions with machine learning algorithms has emerged as an important analytical tool for governments and multinational corporations. The traditional wisdom calls for the collection of all the data across the world to a central data center location, to be processed using data-parallel applications. This is neither efficient nor practical as the volume of data grows exponentially. Rather than transferring data, we believe that computation tasks should be scheduled near the data, while data should be processed with a minimum amount of transfers across data centers. In this paper, we design and implement Flutter, a new task scheduling algorithm that reduces both the completion times and the network costs of big data processing jobs across geographically distributed data centers. To cater to the specific characteristics of …", "total_citations": {"2018": 7, "2019": 10, "2020": 8, "2021": 11, "2022": 16, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:XoXfffV-tXoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7517783/", "authors": ["Jim Cherian", "Jun Luo", "Hongliang Guo", "Shen-Shyang Ho", "Richard Wisbrun"], "publication_date": "2016/6/13", "conference": "2016 17th IEEE International Conference on Mobile Data Management (MDM)", "volume": "1", "pages": "92-101", "publisher": "IEEE", "description": "Finding available parking spaces in dense urban areas is a globally recognized issue in urban mobility. Whereas prior studies have focused on outdoor/street parking due to a common belief that parking garages are capable of delivering real-time occupancy information, we specifically target at (indoor) parking garages as this belief is far from true. This problem is very challenging as all the infrastructure supports (e.g., GPS and Wi-Fi) assumed by existing proposals are not available to parking garages, so counting how many vehicles are using a parking garage by crowd sensing can be extremely difficult. To this end, we present Park Gauge, a method to gauge the occupancy of parking garages, along with a reference system prototype for performance evaluation, it infers parking occupancy from crowd sensed parking characteristics instead of counting the parked vehicles. Park Gauge adopts low-power sensors (e …", "total_citations": {"2016": 3, "2017": 4, "2018": 10, "2019": 15, "2020": 8, "2021": 5, "2022": 10, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:4vMrXwiscB8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9210753/", "authors": ["Xuequan Lu", "Scott Schaefer", "Jun Luo", "Lizhuang Ma", "Ying He"], "publication_date": "2020/10/1", "journal": "IEEE Transactions on Visualization and Computer Graphics", "publisher": "IEEE", "description": "We propose a robust normal estimation method for both point clouds and meshes using a low rank matrix approximation algorithm. First, we compute a local isotropic structure for each point and find its similar, non-local structures that we organize into a matrix. We then show that a low rank matrix approximation algorithm can robustly estimate normals for both point clouds and meshes. Furthermore, we provide a new filtering method for point cloud data to smooth the position data to fit the estimated normals. We show the applications of our method to point cloud filtering, point set upsampling, surface reconstruction, mesh denoising, and geometric texture removal. Our experiments show that our method generally achieves better results than existing methods.", "total_citations": {"2019": 5, "2020": 4, "2021": 7, "2022": 20, "2023": 20}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:YohjEiUPhakC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8057096/", "authors": ["Jin Wang", "Nicholas Tan", "Jun Luo", "Sinno Jialin Pan"], "publication_date": "2017/5/1", "conference": "IEEE INFOCOM 2017-IEEE Conference on Computer Communications", "pages": "1-9", "publisher": "IEEE", "description": "Given the ever-expanding scale of WiFi deployments in metropolitan areas, we have reached the point where accurate GPS-free outdoor localization becomes possible by relying solely on the WiFi infrastructure. Nevertheless, the existing industrial practices do not seem to have the right implementation to achieve an adequate accuracy, while the academic researches that are mostly attracted by indoor localization have largely neglected this outdoor aspect. In this paper, we propose WOLoc (WiFi-only Outdoor Localization) as a solution that offers meter-level accuracy, by holistically treating the large number of WiFi hotspot labels gather by crowdsensing. On one hand, we do not take these labels as fingerprints as it is almost impossible to extend indoor localization mechanisms by fingerprinting metropolitan areas. On the other hand, we avoid the over-simplified local synthesis methods (e.g., centroid) that …", "total_citations": {"2017": 6, "2018": 9, "2019": 12, "2020": 7, "2021": 8, "2022": 9, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:M7yex6snE4oC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7218407/", "authors": ["Kai Han", "Zhiming Hu", "Jun Luo", "Liu Xiang"], "publication_date": "2015/4/26", "conference": "2015 IEEE conference on computer communications (INFOCOM)", "pages": "415-423", "publisher": "IEEE", "description": "The recent development of 60GHz technology has made hybrid Data Center Networks (hybrid DCNs) possible, i.e., augmenting wired DCNs with highly directional 60GHz wireless links to provide flexible network connectivity. Although a few recent proposals have demonstrated the feasibility of this hybrid design, it still remains an open problem how to route DCN traffics with guaranteed performance under a hybrid DCN environment. In this paper, we make the first attempt to tackle this challenge, and propose the RUSH framework to minimize the network congestion in hybrid DCNs, by jointly routing flows and scheduling wireless (directional) antennas. Though the problem is shown to be NP-hard, the RUSH algorithms offer guaranteed performance bounds. Our algorithms are able to handle both batched arrivals and sequential arrivals of flow demands, and the theoretical analysis shows that they achieve …", "total_citations": {"2015": 2, "2016": 8, "2017": 6, "2018": 11, "2019": 8, "2020": 7, "2021": 8, "2022": 3, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:kz9GbA2Ns4gC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2668332.2668345", "authors": ["Chi Zhang", "Feng Li", "Jun Luo", "Ying He"], "publication_date": "2014/11/3", "conference": "Proceedings of the 12th ACM Conference on Embedded Networked Sensor Systems (SenSys'14)", "pages": "91-104", "description": "Whereas a few physical layer techniques have been proposed to locate a signal source indoors, they all deem multipath a \"curse\" and hence take great efforts to cope with it. Consequently, each sensor only obtains the information about the direct path; this necessitates a networked sensing system (hence higher system complexity and deployment cost) with at least three sensors to actually locate a source. In this paper, we deem multipath a \"bless\" and thus innovatively exploit the power of it. Essentially, with minor knowledge of the geometry of an indoor space, each signal path may potentially contribute a new piece of information to the location of its source. As a result, it is possible to locate the source with only one hand-held device. At the same time, the extra information provided by multipath can help to at least partially reconstruct the geometry of the indoor space, which enables a floor plan generation process …", "total_citations": {"2015": 3, "2016": 4, "2017": 8, "2018": 5, "2019": 9, "2020": 1, "2021": 6, "2022": 12, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:oNZyr7d5Mn4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7218383/", "authors": ["Zhiming Hu", "Jun Luo"], "publication_date": "2015", "journal": "Proc. of IEEE INFOCOM", "volume": "2015", "description": "The outputs of network monitoring such as traffic matrix and elephant flow identification are essential inputs to many network operations and system designs in DCNs, but most solutions for network monitoring adopt direct measurements or inference alone, which may suffer from either high network overhead or low precision. Different from those approaches, we combine the direct measurements offered by software defined network (SDN) and inference techniques based on network tomography to derive a hybrid network monitoring scheme in this paper; it can strike a balance between measurement overhead and accuracy. Essentially, we use SDN to make the severely low determined network tomography (TM estimation) problem in DCNs to be a more determined one. Thus many classic network tomography algorithms in ISP networks become feasible for DCNs. By combining SDN with network tomography, we …", "total_citations": {"2015": 5, "2016": 5, "2017": 10, "2018": 8, "2019": 15, "2020": 4, "2021": 3, "2022": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:Tiz5es2fbqcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6142266/", "authors": ["Ruitao Xu", "Gaotao Shi", "Jun Luo", "Zenghua Zhao", "Yantai Shu"], "publication_date": "2011/10/19", "conference": "2011 International Conference on Internet of Things and 4th International Conference on Cyber, Physical and Social Computing", "pages": "323-329", "publisher": "IEEE", "description": "In Cyber-Physical system (CPS), different wireless technologies are used, which results in cross-technology communication interference. Specifically, ZigBee networks share the 2.4GHz ISM band with WiFi but have much lower transmission power. Thus, the ZigBee networks inevitably suffer the interference from WiFi Networks. This paper focuses on the locality of WiFi interference and proposes an interference avoiding approach based on multi-channel for ZigBee networks called MuZi. MuZi has three basic mechanisms: interference assessment, channel switch and connectivity maintenance. The proposed interference assessing approach jointly considers the degree of intensity and density and achieves a much actual relationship between WiFi interference and link quality. Based on this finding, the better working channel for each node is determined. A connectivity maintenance approach is also proposed to …", "total_citations": {"2012": 2, "2013": 4, "2014": 10, "2015": 5, "2016": 6, "2017": 4, "2018": 6, "2019": 4, "2020": 4, "2021": 3, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:QD3KBmkZPeQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9693416/", "authors": ["Chao Cai", "Rong Zheng", "Jun Luo"], "publication_date": "2022/1/18", "journal": "IEEE Communications Surveys & Tutorials", "volume": "24", "issue": "1", "pages": "432 - 454", "publisher": "IEEE", "description": "With the proliferation of Internet-of-Things (IoT) devices, acoustic sensing attracts significant attention in recent years. It exploits acoustic transceivers such as microphones and speakers beyond their primary functions, namely recording and playing, to enable novel applications and new user experiences. In this paper, we present the first systematic survey on recent advances in ubiquitous acoustic sensing using commodity IoT hardware with a frequency range below 24 kHz. We propose a general framework that categorizes main building blocks of acoustic sensing systems. This framework encompasses three layers, i.e.,  device ,  core technique , and  application . The device layer includes basic hardware components, acoustic platforms, as well as the air-borne and structure-borne channel characteristics. The core technique layer encompasses key mechanisms to generate acoustic signals (waveforms) and to …", "total_citations": {"2019": 5, "2020": 5, "2021": 5, "2022": 12, "2023": 19}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:9pM33mqn1YgC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3117811.3117836", "authors": ["Yanbing Yang", "Jiangtian Nie", "Jun Luo"], "publication_date": "2017", "conference": "Proc. of the 23rd ACM Annual International Conference on Mobile Computing and Networking", "description": "As a popular approach to implementing Visible Light Communication (VLC) on commercial-off-the-shelf devices, LED-Camera VLC has attracted substantial attention recently. While such systems initially used reflected light as the communication media, direct light becomes the dominant media for the purpose of combating interference. Nonetheless, the data rate achievable by direct light LED-Camera VLC systems has hit its bottleneck: the dimension of the transmitters. In order to further improve the performance, we revisit the reflected light approach and we innovate in converting the potentially destructive interferences into collaborative transmissions. Essentially, our ReflexCode system codes information by superposing light emissions from multiple transmitters. It combines traditional amplitude demodulation with slope detection to \"decode\" the grayscale modulated signal, and it tunes decoding thresholds …", "total_citations": {"2017": 3, "2018": 7, "2019": 8, "2020": 8, "2021": 6, "2022": 8, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:PoWvk5oyLR8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2856400.2856411", "authors": ["Hui Liang", "Jin Wang", "Qian Sun", "Yong-Jin Liu", "Junsong Yuan", "Jun Luo", "Ying He"], "publication_date": "2016/2/27", "conference": "Proceedings of the 20th ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games", "pages": "87-94", "description": "This paper presents an efficient data-driven approach to track fingertip and detect finger tapping for virtual piano using an RGB-D camera. We collect 7200 depth images covering the most common finger articulation for playing piano, and train a random regression forest using depth context features of randomly sampled pixels in training images. In the online tracking stage, we firstly segment the hand from the plane in contact by fusing the information from both color and depth images. Then we use the trained random forest to estimate the 3D position of fingertips and wrist in each frame, and predict finger tapping based on the estimated fingertip motion. Finally, we build a kinematic chain and recover the articulation parameters for each finger. In contrast to the existing hand tracking algorithms that often require hands are in the air and cannot interact with physical objects, our method is designed for hand interaction …", "total_citations": {"2016": 2, "2017": 9, "2018": 5, "2019": 5, "2020": 3, "2021": 4, "2022": 5, "2023": 7}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:48xauSegjOkC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3485730.3485932", "authors": ["Tianyue Zheng", "Zhe Chen", "Shujie Zhang", "Chao Cai", "Jun Luo"], "publication_date": "2021/11/15", "conference": "Proceedings of the 19th ACM Conference on Embedded Networked Sensor Systems", "pages": "111-124", "description": "Crucial for healthcare and biomedical applications, respiration monitoring often employs wearable sensors in practice, causing inconvenience due to their direct contact with human bodies. Therefore, researchers have been constantly searching for contact-free alternatives. Nonetheless, existing contact-free designs mostly require human subjects to remain static, largely confining their adoptions in everyday environments where body movements are inevitable. Fortunately, radio-frequency (RF) enabled contact-free sensing, though suffering motion interference inseparable by conventional filtering, may offer a potential to distill respiratory waveform with the help of deep learning. To realize this potential, we introduce MoRe-Fi to conduct fine-grained respiration monitoring under body movements. MoRe-Fi leverages an IR-UWB radar to achieve contact-free sensing, and it fully exploits the complex radar signal for …", "total_citations": {"2022": 15, "2023": 24}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:cWzG1nlazyYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8703469/", "authors": ["Jiangtian Nie", "Jun Luo", "Zehui Xiong", "Dusit Niyato", "Ping Wang", "Mohsen Guizani"], "publication_date": "2019/5/6", "journal": "IEEE Communications Magazine", "volume": "57", "issue": "4", "pages": "74-80", "publisher": "IEEE", "description": "Traditional crowdsensing platforms rely on sensory information collected from a group of independent users or sensors. Recently, socially aware crowdsensing services have been introduced as the integration of social networks and crowdsensing platforms. For example, in health-related crowdsensing applications, a user benefits from information regarding food, exercise, medicine, and medical treatment collected and shared by his/her socially connected friends and family members. In this article, we first introduce basic concepts of socially aware crowdsensing services and highlight the importance of \"social network effects\" in the services. Typically adopted in social networks, network effects are used to quantify the influence of an action or preference of one user on other users with social ties. With this focus, we then discuss important aspects of socially aware crowdsensing services with network effects and some …", "total_citations": {"2020": 14, "2021": 7, "2022": 10, "2023": 9}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:_xSYboBqXhAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5582099/", "authors": ["Jun Luo", "Aravind Iyer", "Catherine Rosenberg"], "publication_date": "2010/9/23", "journal": "IEEE Transactions on Mobile Computing", "volume": "10", "issue": "3", "pages": "419-433", "publisher": "IEEE", "description": "High throughput and lifetime are both crucial design objectives for a number of multihop wireless network applications. As these two objectives are often in conflict with each other, it naturally becomes important to identify the trade-offs between them. Several works in the literature have focused on improving one or the other, but investigating the trade-off between throughput and lifetime has received relatively less attention. We study this trade-off between the network throughput and lifetime for the case of fixed wireless networks, where link transmissions are coordinated to be conflict-free. We employ a realistic interference model based on the Signal-to-Interference-and-Noise Ratio (SINR), which is usually considered statistically sufficient to infer success or failure of wireless transmissions. Our analytical and numerical results provide several insights into the interplay between throughput, lifetime, and transmit power …", "total_citations": {"2008": 1, "2009": 2, "2010": 0, "2011": 1, "2012": 1, "2013": 6, "2014": 7, "2015": 6, "2016": 4, "2017": 2, "2018": 0, "2019": 3, "2020": 2, "2021": 3, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:9Nmd_mFXekcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6990395/", "authors": ["Kai Han", "Chi Zhang", "Jun Luo"], "publication_date": "2014/6/28", "conference": "IEEE SECON", "pages": "555 - 563", "publisher": "IEEE Press", "description": "Mobile crowdsensing has been intensively explored recently due to its flexible and pervasive sensing ability. Although many crowdsensing platforms have been built for various applications, the general issue of how to manage such systems intelligently remains largely open. While recent investigations mostly focus on incentivizing crowdsensing, the robustness of crowdsensing toward uncontrollable sensing quality, another important issue, has been widely neglected. Due to the nonprofessional personnel and devices, the quality of crowdsensing data cannot be fully guaranteed, hence the revenue gained from mobile crowdsensing is generally uncertain. Moreover, the need for compensating the sensing costs under a limited budget has exacerbated the situation: one does not enjoy an infinite horizon to learn the sensing ability of the crowd and hence to make decisions based on sufficient statistics. In this paper …", "total_citations": {"2015": 3, "2016": 4, "2017": 8, "2018": 8, "2019": 3, "2020": 6, "2021": 5, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:umqufdRvDiIC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8392372/", "authors": ["Jin Wang", "Jun Luo", "Sinno Jialin Pan", "Aixin Sun"], "publication_date": "2018/6/21", "journal": "IEEE Transactions on Mobile Computing", "volume": "18", "issue": "4", "pages": "896-909", "publisher": "IEEE", "description": "The ever-expanding scale of WiFi deployments in metropolitan areas has made accurate GPS-free outdoor localization possible by relying solely on the WiFi infrastructure. Nevertheless, neither academic researches nor existing industrial practices seem to provide a satisfactory solution or implementation. In this paper, we propose WOLoc (WiFi-only Outdoor Localization) as a learning-based outdoor localization solution using only WiFi hotspots labeled by crowdsensing. On one hand, we do not take these labels as fingerprints as it is almost impossible to extend indoor localization mechanisms by fingerprinting metropolitan areas. On the other hand, we avoid the over-simplified local synthesis methods (e.g., centroid) that significantly lose the information contained in the labels. Instead, WOLoc adopts a semi-supervised manifold learning approach that accommodates all the labeled and unlabeled data for a given …", "total_citations": {"2018": 1, "2019": 11, "2020": 6, "2021": 6, "2022": 4, "2023": 10}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:u-coK7KVo8oC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9247464/", "authors": ["Jiangtian Nie", "Jun Luo", "Zehui Xiong", "Dusit Niyato", "Ping Wang", "H Vincent Poor"], "publication_date": "2020/11/3", "journal": "IEEE Transactions on Wireless Communications", "volume": "20", "issue": "3", "pages": "1457-1471", "publisher": "IEEE", "description": "The mobile crowdsensing paradigm facilitates a broad range of emerging sensing applications by leveraging ubiquitous mobile users to cooperatively perform certain sensing tasks with their smart devices. As this paradigm involves data collection from users, the issue of designing rewards to incentivize users is fundamentally important to ensure participation in crowdsensing. In this paper, we revisit this issue in the context of socially-aware crowdsensing which integrates crowdsensing into social networks. For example, in healthcare-based crowdsensing services, the fun of tracking daily nutrition information for a certain user can be promoted by comparing her nutritional information with that contributed and shared by her socially-connected friends. To be more general and practical, we study the incentive mechanisms in presence of multiple crowdsensing service providers and multiple users. Understanding the …", "total_citations": {"2021": 5, "2022": 14, "2023": 18}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:1yQoGdGgb4wC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6506559/", "authors": ["Menglan Hu", "Jun Luo", "Bharadwaj Veeravalli"], "publication_date": "2012/12/12", "conference": "2012 18th IEEE International Conference on Networks (ICON)", "pages": "204-209", "publisher": "IEEE", "description": "Cloud computing offers customers an efficient way to flexibly allocate resources to meet demands. Cloud service vendors can offer consumers three purchasing plans, i.e., on-demand, spot, and reserved instances for resource provisioning. Since price of resources in reservation plan is generally cheaper than that in on-demand plan, in this study we attempt to make use of the cheap reserved instances to reduce monetary costs. We consider processing a large divisible load onto on-demand and reserved instances in clouds. Divisible loads, also called embarrassingly parallel workloads, can be partitioned into an arbitrarily large number of independent load fractions and be distributed across multiple processing nodes. We investigate the time-cost optimization problems for provisioning resources and scheduling divisible loads with reserved instances in clouds. The objectives are two-fold: First, given a total …", "total_citations": {"2013": 2, "2014": 4, "2015": 2, "2016": 0, "2017": 6, "2018": 6, "2019": 1, "2020": 5, "2021": 5, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:ZzlSgRqYykMC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3384419.3430772", "authors": ["Ziqi Wang", "Zhe Chen", "Akash Deep Singh", "Luis Garcia", "Jun Luo", "Mani B Srivastava"], "publication_date": "2020/11/16", "conference": "Proceedings of the 18th Conference on Embedded Networked Sensor Systems", "pages": "1-14", "description": "An ability to detect, classify, and locate complex acoustic events can be a powerful tool to help smart systems build context-awareness, e.g., to make rich inferences about human behaviors in physical spaces. Conventional methods to measure acoustic signals employ microphones as sensors. As signals from multiple acoustic sources are blended during propagation to a sensor, such methods impose a dual challenge of separating the signal for an acoustic event from background noise and from other acoustic events of interest. Recent research has proposed using radio-frequency (RF) signals, e.g., Wi-Fi and millimeter-wave (mmWave), to sense sound directly from source vibrations. Whereas these works allow separating an acoustic event from background noise, they cannot monitor multiple sound sources simultaneously. In this paper, we present UWHear, a system that simultaneously recovers and separates …", "total_citations": {"2020": 2, "2021": 6, "2022": 18, "2023": 8}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:l7t_Zn2s7bgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6275775/", "authors": ["Liu Xiang", "Jun Luo", "Chenwei Deng", "Athanasios V Vasilakos", "Weisi Lin"], "publication_date": "2012/6/18", "conference": "Sensor, Mesh and Ad Hoc Communications and Networks (SECON), 2012 9th Annual IEEE Communications Society Conference on", "volume": "13", "publisher": "IEEE", "description": "Although wireless sensor networks (WSNs) are powerful in monitoring physical events, the data collected from a WSN are almost always incomplete if the surveyed physical event spreads over a wide area. The reason for this incompleteness is twofold: i) insufficient network coverage and ii) data aggregation for energy saving. Whereas the existing recovery schemes only tackle the second aspect, we develop Dual-lEvel Compressed Aggregation (DECA) as a novel framework to address both aspects. Specifically, DECA allows a high fidelity recovery of a widespread event, under the situations that the WSN only sparsely covers the event area and that an in-network data aggregation is applied for traffic reduction. Exploiting both the low-rank nature of real-world events and the redundancy in sensory data, DECA combines matrix completion with a fine-tuned compressed sensing technique to conduct a dual-level …", "total_citations": {"2012": 2, "2013": 5, "2014": 7, "2015": 3, "2016": 3, "2017": 3, "2018": 3, "2019": 2, "2020": 2, "2021": 0, "2022": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:6yz0xqPARnAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9408395/", "authors": ["Zhe Chen", "Chao Cai", "Tianyue Zheng", "Jun Luo", "Jie Xiong", "Xin Wang"], "publication_date": "2021/4/19", "journal": "IEEE Transactions on Mobile Computing", "publisher": "IEEE", "description": "Human activity recognition (HAR) plays a critical role in a wide range of real-world applications, and it is traditionally achieved via wearable sensing. Recently, to avoid the burden and discomfort caused by wearable devices, device-free approaches exploiting radio-frequency (RF) signals arise as a promising alternative for HAR. Most of the latest device-free approaches require training a large deep neural network model in either time or frequency domain, entailing extensive storage to contain the model and intensive computations to infer human activities. Consequently, even with some major advances on device-free HAR, current device-free approaches are still far from practical in real-world scenarios where the computation and storage resources possessed by, for example, edge devices, are limited. To overcome these weaknesses, we introduce HAR-SAnet which is a novel RF-based HAR framework. It adopts …", "total_citations": {"2021": 4, "2022": 12, "2023": 17}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:_FM0Bhl9EiAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8647726/", "authors": ["Jiangtian Nie", "Zehui Xiong", "Dusit Niyato", "Ping Wang", "Jun Luo"], "publication_date": "2018/12/9", "conference": "2018 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-7", "publisher": "IEEE", "description": "Mobile Crowdsensing has shown a great potential to address large-scale problems by allocating sensing tasks to pervasive Mobile Users (MUs). The MUs will participate in a Crowdsensing platform if they can receive satisfactory reward. In this paper, in order to effectively and efficiently recruit sufficient MUs, i.e., participants, we investigate an optimal reward mechanism of the monopoly Crowdsensing Service Provider (CSP). We model the rewarding and participating as a two-stage game, and analyze the MUs' participation level and the CSP's optimal reward mechanism using backward induction. At the same time, the reward is designed taking the underlying social network effects amid the mobile social network into account, for motivating the participants. Namely, one MU will obtain additional benefits from information contributed or shared by local neighbours in social networks. We derive the analytical …", "total_citations": {"2018": 3, "2019": 6, "2020": 10, "2021": 4, "2022": 5, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:SpbeaW3--B0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7272869/", "authors": ["Menglan Hu", "Jun Luo", "Yang Wang", "Bharadwaj Veeravalli"], "publication_date": "2015/9/28", "journal": "IEEE Transactions on Aerospace and Electronic Systems", "volume": "51", "issue": "3", "pages": "2294-2304", "publisher": "IEEE", "description": "Time-triggered communication protocols, such as time-triggered protocol (TTP) and FlexRay, have the potential to solve many system integration and concurrent engineering issues in the aerospace industry. This paper investigates the scheduling of periodic applications on time-triggered systems. A novel scheduling problem is formulated to capture a unique feature commonly existing in the safety-critical time-triggered systems, i.e., in task graphs running in such systems, some nodes (i.e., tasks and messages) are strictly periodic while others are not. To address the problem, a novel scheduling algorithm called synchronized highest level first (SHLF) algorithm is presented. Moreover, to further improve schedulability, this paper also proposes two rescheduling and backtracking approaches, namely release time deferment (RTD) procedure and backtracking and priority promotion (BPP) procedure. Performance …", "total_citations": {"2016": 4, "2017": 5, "2018": 3, "2019": 7, "2020": 5, "2021": 2, "2022": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:W7OEmFMy1HYC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S1570870503000556", "authors": ["Jun Luo", "Patrick Th Eugster", "Jean-Pierre Hubaux"], "publication_date": "2004/10/1", "journal": "Ad Hoc Networks", "volume": "2", "issue": "4", "pages": "369-386", "publisher": "Elsevier", "description": "When striving for reliability, multicast protocols are most commonly designed as deterministic solutions. Such an approach seems to make the reasoning about reliability guarantees (traditionally, binary, “all-or-nothing”-like) in the face of packet losses and/or node crashes. It is however precisely this determinism that tends to become a limiting factor when aiming at both reliability and scalability, particularly in highly dynamic networks, e.g., ad hoc networks. Gossip-based multicast protocols appear to be a viable path towards providing multicast reliability guarantees. Such protocols embrace the non-deterministic nature of ad hoc networks, providing analytically predictable probabilistic reliability guarantees at a reasonable overhead. This paper presents the Route Driven Gossip (RDG) protocol, a gossip-based multicast protocol designed precisely to meet a more practical specification of probabilistic reliability in ad …", "total_citations": {"2005": 1, "2006": 6, "2007": 5, "2008": 2, "2009": 5, "2010": 0, "2011": 0, "2012": 2, "2013": 3, "2014": 2, "2015": 1, "2016": 0, "2017": 1, "2018": 0, "2019": 1, "2020": 0, "2021": 0, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:_axFR9aDTf0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7480845/", "authors": ["Menglan Hu", "Jun Luo", "Yang Wang", "Bharadwaj Veeravalli"], "publication_date": "2016/5/30", "journal": "IEEE Transactions on Computers", "volume": "66", "issue": "1", "pages": "17-23", "publisher": "IEEE", "description": "This paper studies a scheduling problem of task graphs on a nondedicated networked computing platform. The networked platform is characterized by a set of fully connected processors such as a multiprocessor system that can be shared by multiple tasks. Therefore, the computation and communication capacities of the computing platform dynamically fluctuate. To deal with this fluctuations for high performance task graph computing, we propose an online dynamic resilience scheduling algorithm called Adaptive Scheduling Algorithm (ASA) that bears certain distinct features compared to existing algorithms. First, the proposed algorithm deliberately assigns tasks to idle processors in multiple rounds to prevent any unfavorable decisions and also to avoid inefficient assignments of certain key tasks to slow processors. Second, the algorithm adopts task duplication as an attempt to minimize serious increase of …", "total_citations": {"2017": 2, "2018": 6, "2019": 9, "2020": 6, "2021": 2, "2022": 3, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:lSLTfruPkqcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4509669/", "authors": ["Kexin Ma", "Ravi Mazumdar", "Jun Luo"], "publication_date": "2008/4/13", "conference": "INFOCOM 2008. The 27th Conference on Computer Communications. IEEE", "pages": "326-330", "publisher": "IEEE", "description": "Stability and fairness are two design objectives of congestion control mechanisms; they have traditionally been analyzed for long-lived flows (or elephants). It is only recently that short-lived flows (or mice) have received attention. Whereas stability has been established for the existing primal-dual based control mechanisms, the performance issue has been largely overlooked. We study utility maximization problems for networks with dynamic flows. In particular, we consider the case where sessions of each class results in flows that arrive according to a Poisson process and have a length given by a general distribution. The goal is to maximize the long-term expected system utility that is a function of the number of flows and the rate (identical within a given class) allocated to each flow. Our results show that, as long as the average amount of work brought by the flows is strictly within the network stability region, the rate …", "total_citations": {"2007": 1, "2008": 2, "2009": 5, "2010": 3, "2011": 2, "2012": 3, "2013": 4, "2014": 5, "2015": 1, "2016": 1, "2017": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:XD-gHx7UXLsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6786441/", "authors": ["Kai Han", "Jun Luo", "Liu Xiang", "Mingjun Xiao", "Liusheng Huang"], "publication_date": "2014/4/10", "journal": "IEEE/ACM Transactions on Networking", "volume": "23", "issue": "4", "pages": "1041-1052", "publisher": "IEEE", "description": "Because data dissemination is crucial to wireless sensor networks (WSNs), its energy efficiency and reliability are of paramount importance. While achieving these two goals together is highly nontrivial, the situation is exacerbated if WSN nodes are duty-cycled (DC) and their transmission power is adjustable. In this paper, we study the problem of minimizing the expected total transmission power for reliable data dissemination (multicast/broadcast) in DC-WSNs. Due to the NP-hardness of the problem, we design efficient approximation algorithms with provable performance bounds for it. To facilitate our algorithm design, we propose the novel concept of Time-Reliability-Power (TRP) space as a general data structure for designing data dissemination algorithms in WSNs, and the performance ratios of our algorithms based on the TRP space are proven to be    for both multicast and broadcast, where    is the …", "total_citations": {"2015": 1, "2016": 3, "2017": 6, "2018": 7, "2019": 6, "2020": 1, "2021": 2, "2022": 2, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:PVgj2kMGcgYC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3463510", "authors": ["Chao Cai", "Henglin Pu", "Peng Wang", "Zhe Chen", "Jun Luo"], "publication_date": "2021", "journal": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies", "volume": "5", "issue": "2", "pages": "55:1-24", "publisher": "ACM", "description": "Indoor localization is crucial to enable context-aware applications, but existing solutions mostly require a user to carry a device, so as to actively sense location-discriminating signals. However, many applications do not prefer user involvement due to, e.g., the cumbersome of carrying a device. Therefore, solutions that track user locations passively can be desirable, yet lack of active user involvement has made passive indoor localization very challenging even for a single person. To this end, we propose Passive Acoustic loCalization of multiple walking pErsons (PACE) as a solution for small-scale indoor scenarios: it passively locates users by pinpointing the positions of their footsteps. In particular, PACE leverages both structure-borne and air-borne footstep impact sounds (FIS); it uses structure-borne FIS for range estimations exploiting their acoustic dispersion nature, and it employs air-borne FIS for Angle-of …", "total_citations": {"2021": 2, "2022": 12, "2023": 14}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:Aul-kAQHnToC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3384419.3430714", "authors": ["Chao Cai", "Zhe Chen", "Henglin Pu", "Liyuan Ye", "Menglan Hu", "Jun Luo"], "publication_date": "2020/11/16", "conference": "Proceedings of the 18th Conference on Embedded Networked Sensor Systems", "pages": "28-41", "description": "Though measuring ambient temperature is often deemed as an easy job, collecting large-scale temperature readings in real-time is still a formidable task. The recent boom of network-ready (mobile) devices and the subsequent mobile crowdsourcing applications do offer an opportunity to accomplish this task, yet equipping commodity devices with ambient temperature sensing capability is highly non-trivial and hence has never been achieved. In this paper, we propose Acoustic Thermometer (AcuTe) as the first ambient temperature sensor empowered by a single commodity smartphone. AcuTe utilizes on-board dual microphones to estimate air-borne sound propagation speed, thereby deriving ambient temperature. To accurately estimate sound propagation speed, we leverage the phase of chirp signals to circumvent the low sample rate on commodity hardware. In addition, we propose to use both structure-borne …", "total_citations": {"2020": 2, "2021": 9, "2022": 13, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:e_rmSamDkqQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7274712/", "authors": ["Zhiming Hu", "Yan Qiao", "Jun Luo"], "publication_date": "2015/9/23", "journal": "IEEE Transactions on Cloud Computing", "volume": "6", "issue": "1", "pages": "60-73", "publisher": "IEEE", "description": "Understanding the pattern of end-to-end traffic flows in datacenter networks (DCNs) is essential to many DCN designs and operations (e.g., traffic engineering and load balancing). However, little research work has been done to obtain traffic information efficiently and yet accurately. Researchers often assume the availability of traffic tracing tools (e.g., OpenFlow) when their proposals require traffic information as input, but these tools may have high monitoring overhead and consume significant switch resources even if they are available in a DCN. Although estimating the traffic matrix (TM) between origin-destination pairs using only basic switch SNMP counters is a mature practice in IP networks, traffic flows in DCNs show totally different characteristics, while the large number of redundant routes in a DCN further complicates the situation. To this end, we propose to utilize resource provisioning information in public …", "total_citations": {"2016": 2, "2017": 1, "2018": 2, "2019": 5, "2020": 3, "2021": 5, "2022": 7, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:FAceZFleit8C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3173039", "authors": ["Feng Li", "Yanbing Yang", "Zicheng Chi", "Liya Zhao", "Yaowen Yang", "Jun Luo"], "publication_date": "2018", "journal": "ACM Transactions on Embedded Computing Systems", "description": "Whereas a lot of efforts have been put on energy conservation in wireless sensor networks (WSNs), the limited lifetime of these systems still hampers their practical deployments. This situation is further exacerbated indoors, as conventional energy harvesting (e.g., solar) may not always work. To enable long-lived indoor sensing, we report in this article a self-sustaining sensing system that draws energy from indoor environments, adapts its duty-cycle to the harvested energy, and pays back the environment by enhancing the awareness of the indoor microclimate through an “energy-free” sensing. First of all, given the pervasive operation of heating, ventilation, and air conditioning (HVAC) systems indoors, our system harvests energy from airflow introduced by the HVAC systems to power each sensor node. Secondly, as the harvested power is tiny, an extremely low but synchronous duty-cycle has to be applied …", "total_citations": {"2018": 2, "2019": 3, "2020": 8, "2021": 4, "2022": 7, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:_Qo2XoVZTnwC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5935238/", "authors": ["Jun Luo", "Ying He"], "publication_date": "2011/4/10", "conference": "2011 Proceedings IEEE INFOCOM", "pages": "616-620", "publisher": "IEEE", "description": "When data productions and consumptions are heavily unbalanced and when the origins of data queries are spatially and temporally distributed, the so called in-network data storage paradigm supersedes the conventional data collection paradigm in wireless sensor networks (WSNs). In this paper, we first introduce geometric quorum systems (along with their metrics) to incarnate the idea of in-network data storage. These quorum systems are “geometric” because curves (rather than discrete node sets) are used to form quorums. We then propose GeoQuorum as a new quorum system, for which the quorum forming curves are parameterized. Our proposal significantly expands the quorum design methodology, by endowing a system with a great flexibility to fine-tune itself towards different application requirements. In particular, the tunability allows GeoQuorum to substantially improve the load balancing performance …", "total_citations": {"2011": 2, "2012": 1, "2013": 3, "2014": 5, "2015": 2, "2016": 5, "2017": 2, "2018": 1, "2019": 2, "2020": 0, "2021": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:sJsF-0ZLhtgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9374635/", "authors": ["Tianyue Zheng", "Zhe Chen", "Shuya Ding", "Jun Luo"], "publication_date": "2021/3/10", "journal": "IEEE Communications Magazine", "volume": "59", "issue": "2", "pages": "70-76", "publisher": "IEEE", "description": "In recent years, radio frequency (RF) sensing has gained increasing popularity due to its pervasiveness, low cost, non-intrusiveness, and privacy preservation. However, realizing the promises of RF sensing is highly nontrivial, given typical challenges such as multipath and interference. One potential solution leverages deep learning to build direct mappings from the RF domain to target domains, hence avoiding complex RF physical modeling. While earlier solutions exploit only simple feature extraction and classification modules, an emerging trend adds functional layers on top of elementary modules for more powerful generalizability and flexible applicability. To better understand this potential, this article takes a layered approach to summarize RF sensing enabled by deep learning. Essentially, we present a four-layer framework: physical, backbone, generalization, and application. While this layered framework …", "total_citations": {"2021": 6, "2022": 12, "2023": 8}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:bz8QjSJIRt4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3084041.3084058", "authors": ["Kai Han", "Yuntian He", "Haisheng Tan", "Shaojie Tang", "He Huang", "Jun Luo"], "publication_date": "2017/7/10", "conference": "Proceedings of the 18th ACM International Symposium on Mobile Ad Hoc Networking and Computing", "pages": "1-10", "description": "Mobile crowdsourcing has been proposed as a promising approach for urban data collection, but it has also brought the critical problem of designing proper mechanisms to incentivize user participation. Most previous work on crowdsourcing incentivization has assumed that each user holds a single private cost for participation or behaves in a \"win all or nothing\" (a.k.a. \"single-minded\") manner. However, in some crowdsourcing applications such as Amazon's Mechanical Turk, the users are usually \"multi-minded\" in the sense that each of them holds heterogeneous private costs for different tasks and only performs a portion of her/his interested tasks according to the announced payments. To address this problem, we propose LIME, an onLine prIcing mechanism to incentivize Multi-minded usErs under the scenario where the users arrive sequentially in an arbitrary order. We show that the design of LIME involves …", "total_citations": {"2018": 7, "2019": 5, "2020": 5, "2021": 2, "2022": 4, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:NaGl4SEjCO4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2107502.2107520", "authors": ["Feng Li", "Jun Luo", "Chi Zhang", "Shiqing Xin", "Ying He"], "publication_date": "2011/5", "conference": "Proceedings of the 12th ACM international symposium on Mobile ad hoc networking & computing", "pages": "141-152", "publisher": "ACM", "description": "A wireless sensor network becomes dynamic if it is monitoring a time-variant event (e.g., expansion of oil spill in ocean). In such applications, on-line boundary detection is a crucial function, as it allows us to track the event variation in a timely fashion. However, the problem becomes very challenging as it demands a highly efficient algorithm to cope with the dynamics introduced by the evolving event. Moreover, as many physical events occupy volumes rather than surfaces (e.g., oil spill again), the algorithm has to work for 3D cases. To this end, we propose UNiform Fast On-Line boundary Detection (UNFOLD) to tackle the challenge. The essence of UNFOLD is to inverse node coordinates such that a \"notched\" surface is \"unfolded\" into a convex one, which in turn reduces boundary detection to simple convexity test. UNFOLD is uniform as every node behaves the same (performing coordinate inversion and convexity …", "total_citations": {"2011": 1, "2012": 5, "2013": 5, "2014": 4, "2015": 3, "2016": 2, "2017": 2, "2018": 1, "2019": 1, "2020": 0, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:CaZNVDsoPx4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3447993.3483267", "authors": ["Zhe Chen", "Tianyue Zheng", "Jun Luo"], "publication_date": "2021/10/25", "journal": "Proceedings of the 27th Annual International Conference on Mobile Computing and Networking", "pages": "601-614", "description": "Radio frequency (RF) technologies have achieved a great success in data communication. In recent years, pervasive RF signals are further exploited for sensing; RF sensing has since attracted attentions from both academia and industry. Existing developments mainly employ commodity Wi-Fi hardware or rely on sophisticated SDR platforms. While promising in many aspects, there still remains a gap between lab prototypes and real-life deployments. On one hand, due to its narrow bandwidth and communication-oriented design, Wi-Fi sensing offers a coarse sensing granularity and its performance is very unstable in harsh real-world environments. On the other hand, SDR-based designs may hardly be adopted in practice due to its large size and high cost. To this end, we propose, design, and implement Octopus, a compact and flexible wideband MIMO sensing platform, built using commercial-grade low-power …", "total_citations": {"2021": 3, "2022": 9, "2023": 11}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:8d8msizDQcsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8486209/", "authors": ["Yanbing Yang", "Jun Luo"], "publication_date": "2018/4/16", "conference": "IEEE INFOCOM 2018-IEEE Conference on Computer Communications", "pages": "315-323", "publisher": "IEEE", "description": "LED-Camera Visible Light Communication (VLC) is gaining increasing attention, thanks to its readiness to be implemented with Commercial Off-The-Shelf devices and its potential to deliver pervasive data services indoors. Nevertheless, existing LED-Camera VLC systems employ mainly low-order modulations such as On-Off Keying (OOK) given the simplicity of their implementation, yet such rudimentary modulations cannot yield a high throughput. In this paper, we investigate various opportunities of using a high-order modulation to boost the throughput of LED-Camera VLC systems, and we decide that Amplitude-Shift Keying (ASK) is the most suitable scheme given the limited operating frequency of such systems. However, directly driving an LED to emit different levels of luminance may suffer heavy distortions caused by the nonlinear behavior of LED. As a result, we innovatively propose to generate ASK using …", "total_citations": {"2018": 1, "2019": 4, "2020": 6, "2021": 2, "2022": 4, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:eq2jaN3J8jMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6666471/", "authors": ["Liu Xiang", "Jun Luo", "Kai Han", "Gaotao Shi"], "publication_date": "2013/9", "conference": "Proc. of the 24th IEEE PIMRC", "publisher": "IEEE", "description": "Inspired by the recent invention of a high efficiency Wireless Power Transfer (WPT) technique, we propose in this paper the Perpetual Wireless Networks (PWNs) as a novel wireless networking paradigm. Similar to the conventional wireless (data) access point, a PWN has a power access point, from which electrical power is injected and distributed into the network in a form of multi-hop transfer. Consequently, we lay our focus on this new type of multi-hop flow problems concerning not data but power. We formulate and analyze a set of such power flow problems (some are joint with data flow), and we devise algorithms to solve them. The intriguing insights obtained from solving these optimization problems offer instructive guidance for future studies on real PWN constructions.", "total_citations": {"2014": 1, "2015": 4, "2016": 8, "2017": 3, "2018": 1, "2019": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:dQ2og3OwTAUC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S0140366414000693", "authors": ["Zhiming Hu", "Yan Qiao", "Jun Luo"], "publication_date": "2015/2/1", "journal": "Computer Communications", "volume": "56", "pages": "25-34", "publisher": "Elsevier", "description": "We address the problem of estimating the real-time traffic flows in data center networks (DCNs), using the light-weight SNMP data. Unlike the problem of estimating the traffic matrix (TM) across origin–destination (OD) pairs in ISP networks, the traffic flows across servers or Top of Rack (ToR) switch pairs in DCNs are notoriously more irregular and volatile. Although numerous methods have been proposed in past several years to solve the TM estimation problem in ISP networks, none of them could be applied to DCNs directly. In this paper, we make the first step to solve the TM estimation problem in DCNs by leveraging the characteristics of prevailing data center architectures and decomposing the topologies of DCNs, which makes TM estimation problems in DCNs easy to handle. We also state a basic theory to obtain the aggregate traffic characteristics of these clusters unbiasedly. We propose two efficient TM …", "total_citations": {"2014": 1, "2015": 4, "2016": 3, "2017": 3, "2018": 4, "2019": 3, "2020": 1, "2021": 0, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:hkOj_22Ku90C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6663535/", "authors": ["Yan Qiao", "Zhiming Hu", "Jun Luo"], "publication_date": "2013/5/22", "conference": "IFIP Networking Conference", "pages": "1-9", "description": "We address the problem of estimating the real-time nature of traffic flows in data center networks, using the light-weight SNMP data. Unlike the problem of estimating the traffic matrix (TM) across origin-destination (OD) pairs in ISP networks, the traffic flows across servers or ToR (Top of Rack) switch pairs in data center networks are notoriously more irregular and volatile. Although numerous methods have been proposed in past several years to solve the TM estimation problem in ISP networks, none of them could be applied to data center networks directly. In this paper, we make the first step to decompose the data center topology to several clusters by leveraging the characteristics of prevailing data center architecture, which makes TM inference problems in data center networks easy to handle. We also state a lemma to obtain the coarse-grained traffic characteristics of these clusters unbiasedly. Two efficient TM …", "total_citations": {"2013": 1, "2014": 2, "2015": 5, "2016": 3, "2017": 1, "2018": 4, "2019": 0, "2020": 1, "2021": 0, "2022": 3, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:hqOjcs7Dif8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4557783/", "authors": ["Jun Luo", "Panagiotis Papadimitratos", "Jean-Pierre Hubaux"], "publication_date": "2008/6/16", "conference": "2008 5th Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks", "pages": "441-450", "publisher": "IEEE", "description": "Resource and cost constraints remain a challenge for wireless sensor network security. In this paper, we propose a new approach to protect confidentiality against a parasitic adversary, which seeks to exploit sensor networks by obtaining measurements in an unauthorized way. Our low-complexity solution, GossiCrypt, leverages on the large scale of sensor networks to protect confidentiality efficiently and effectively. GossiCrypt protects data by symmetric key encryption at their source nodes and re-encryption at a randomly chosen subset of nodes en route to the sink. Furthermore, it employs key refreshing to mitigate the physical compromise of cryptographic keys. We validate GossiCrypt analytically and with simulations, showing it protects data confidentiality with probability almost one. Moreover, compared with a system that uses public-key data encryption, the energy consumption of GossiCrypt is tens to …", "total_citations": {"2009": 7, "2010": 2, "2011": 1, "2012": 2, "2013": 3, "2014": 1, "2015": 0, "2016": 2, "2017": 1, "2018": 0, "2019": 1, "2020": 0, "2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:5awf1xo2G04C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6517117/", "authors": ["Guiyi Wei", "Ping Zhu", "Athanasios V Vasilakos", "Yuxin Mao", "Jun Luo", "Yun Ling"], "publication_date": "2013/5/17", "journal": "IEEE Journal on Selected Areas in Communications", "volume": "31", "issue": "6", "pages": "1135-1146", "publisher": "IEEE", "description": "In collaborative social networks (CSNs), autonomous individuals cooperate for their common reciprocity interests. The intrinsic heterogeneity of individuals' capability and willingness makes significant impact on the promotion of cooperation rate. In this paper, we propose a two-phase Heterogeneous Public Goods Game (HPGG) model to study the cooperation dynamics in CSNs. We introduce two factors to represent the heterogeneity of individual behaviors and the benefit-to-cost enhancement of population, respectively. Based on HPGG CSN model, we quantitatively investigate the relationship between cooperation rate and individuals' heterogeneous behaviors from an evolutionary game perspective. Simulations on the population structure of scale-free networks show the evolution of cooperation in CSNs has no-trivial dependence on the individuals' heterogeneous behaviors. Compared with standard PGG and …", "total_citations": {"2014": 6, "2015": 2, "2016": 6, "2017": 1, "2018": 1, "2019": 4, "2020": 0, "2021": 0, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:8xutWZnSdmoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9165237/", "authors": ["Shuya Ding", "Chaoyu Dong", "Tianyang Zhao", "Liangmong Koh", "Xiaoyin Bai", "Jun Luo"], "publication_date": "2020/8/11", "journal": "IEEE Transactions on Industrial Informatics", "volume": "17", "issue": "7", "pages": "4503-4511", "publisher": "IEEE", "description": "An effective forecast method to trigger Thermal Runaway (TR) warning in an early stage is essential for monitoring battery safety. In this article, we propose a novel data-driven approach to perform multistep ahead forecast accurately for battery TR state at cell-level. We formulate this forecasting task as an imbalance data classification task and propose meta thermal runaway forecasting neural network (Meta-TRFNN) to solve it. Essentially, we exploit high-dimensional thermal images along with low-dimensional temperature and voltage data to capture a more representative thermal profile. Moreover, we adapt a meta-learning framework to handle the data deficiency problem. We evaluate Meta-TRFNN on simulated samples and also explore its applicability in the real world with real samples. Although this classification task is highly imbalanced, Meta-TRFNN is still proven effective with limited historical information …", "total_citations": {"2021": 2, "2022": 6, "2023": 12}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:bKqednn6t2AC": {"external_link": "https://opg.optica.org/abstract.cfm?uri=oe-27-21-30788", "authors": ["Yanbing Yang", "Chen Chen", "Pengfei Du", "Xiong Deng", "Jun Luo", "Wen-De Zhong", "Liangyin Chen"], "publication_date": "2019/10/14", "journal": "Optics Express", "volume": "27", "issue": "21", "pages": "30788-30795", "publisher": "Optical Society of America", "description": "Commercial-off-the-shelf (COTS) devices enabled visible light communication (VLC) for Internet of things (IoT) applications has attracted extensive attentions from both academic and industrial communities, thanks to the pervasive deployments of light emitting diode (LED) lighting infrastructure. However, due to the limitation of frequency response and non-linearity of the commercial illuminating LED light consisting of multiple LED chips, the achievable data rate is far less than that provided by the experimental VLC system with a single LED with specialized devices, e.g., lens. To this end, we propose a power-of-2 arrangement scheme for LED chips to generate spatial summing modulation with low control complexity, and demonstrate its availability in an orthogonal frequency division multiplexing (OFDM) VLC system purely built upon COTS devices. It significantly differs from a conventional OFDM VLC system …", "total_citations": {"2020": 4, "2021": 6, "2022": 4, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:DUooU5lO8OsC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3209582.3209595", "authors": ["Kai Han", "Chaoting Xu", "Fei Gui", "Shaojie Tang", "He Huang", "Jun Luo"], "publication_date": "2018/6/26", "conference": "The 18th ACM International Symposium on Mobile Ad Hoc Networking and Computing", "pages": "121-130", "description": "Viral marketing through online social networks (OSNs) has aroused great interests in the literature. However, the fundamental problem of how to optimize the \"pure gravy\" of a marketing strategy through influence propagation in OSNs still remains largely open. In this paper, we consider a practical setting where the \"seed nodes\" in an OSN can only be probabilistically activated by the product discounts allocated to them, and make the first attempt to seek a discount allocation strategy to maximize the expected difference of profit and cost (i.e., revenue) of the strategy. We show that our problem is much harder than the conventional influence maximization issues investigated by previous work, as it can be formulated as a non-monotone and non-submodular optimization problem. To address our problem, we propose a novel \"surrogate optimization\" approach as well as two randomized algorithms which can find …", "total_citations": {"2018": 3, "2019": 2, "2020": 2, "2021": 8, "2022": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:LkGwnXOMwfcC": {"external_link": "https://scholar.google.com/scholar?cluster=1700439739052355423&hl=en&oi=scholarr", "authors": ["Jun Luo"], "publication_date": "2006", "institution": "Verlag nicht ermittelbar", "total_citations": {"2005": 1, "2006": 4, "2007": 2, "2008": 1, "2009": 1, "2010": 1, "2011": 5, "2012": 1, "2013": 2, "2014": 0, "2015": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:yqoGN6RLRZoC": {"external_link": "http://openaccess.thecvf.com/content_CVPR_2020/html/Li_Enhancing_Intrinsic_Adversarial_Robustness_via_Feature_Pyramid_Decoder_CVPR_2020_paper.html", "authors": ["Guanlin Li", "Shuya Ding", "Jun Luo", "Chang Liu"], "publication_date": "2020/5/6", "conference": "IEEE/CVF CVPR (arXiv preprint arXiv:2005.02552)", "description": "Whereas adversarial training is employed as the main defence strategy against specific adversarial samples, it has limited generalization capability and incurs excessive time complexity. In this paper, we propose an attack-agnostic defence framework to enhance the intrinsic robustness of neural networks, without jeopardizing the ability of generalizing clean samples. Our Feature Pyramid Decoder (FPD) framework applies to all block-based convolutional neural networks (CNNs). It implants denoising and image restoration modules into a targeted CNN, and it also constraints the Lipschitz constant of the classification layer. Moreover, we propose a two-phase strategy to train the FPD-enhanced CNN, utilizing e-neighbourhood noisy images with multi-task and self-supervised learning. Evaluated against a variety of white-box and black-box attacks, we demonstrate that FPD-enhanced CNNs gain sufficient robustness against general adversarial samples on MNIST, SVHN and CALTECH. In addition, if we further conduct adversarial training, the FPD-enhanced CNNs perform better than their non-enhanced versions.", "total_citations": {"2020": 2, "2021": 8, "2022": 3, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:9c2xU6iGI7YC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8632674/", "authors": ["Yanbing Yang", "Jun Luo"], "publication_date": "2019/2/1", "journal": "IEEE Transactions on Mobile Computing", "volume": "19", "issue": "3", "pages": "528-539", "publisher": "IEEE", "description": "LED-Camera Visible Light Communication (VLC) is gaining increasing attention, thanks to its readiness to be implemented with Commercial Off-The-Shelf devices and its potential to deliver pervasive data services indoors. Nevertheless, existing LEDCamera VLC systems employ mainly low-order modulations such as On-Off Keying (OOK) given the simplicity of their implementation, yet such rudimentary modulations cannot yield a high throughput. In this paper, we investigate various opportunities of using a high-order modulation to boost the throughput of LED-Camera VLC systems, and we decide that Amplitude-Shift Keying (ASK) is the most suitable scheme given the limited operating frequency of such systems. However, directly driving an LED to emit different levels of luminance may suffer heavy distortions caused by the nonlinear behavior of LED. As a result, we innovatively propose to generate ASK using …", "total_citations": {"2020": 4, "2021": 6, "2022": 4, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:RYcK_YlVTxYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5555902/", "authors": ["Panagiotis Papadimitratos", "Jun Luo", "J-P Hubaux"], "publication_date": "2010/9", "journal": "IEEE Journal on Selected Areas in Communications", "volume": "28", "issue": "7", "pages": "1036-1045", "publisher": "IEEE", "description": "Due to their limited capabilities, wireless sensor nodes are subject to physical attacks that are hard to defend against. In this paper, we first identify a typical attacker, called parasitic adversary, who seeks to exploit sensor networks by obtaining measurements in an unauthorized way. As a countermeasure, we first employ a randomized key refreshing: with low communication cost, it aims at confining (but not eliminating) the effects of the adversary. Moreover, our low-complexity solution, GossiCrypt, leverages on the large scale of sensor networks to protect data confidentiality, efficiently and effectively. GossiCrypt applies symmetric key encryption to data at their source nodes; and it applies re-encryption at a randomly chosen subset of nodes en route to the sink. The combination of randomized key refreshing and GossiCrypt protects data confidentiality with a probability of almost 1; we show this analytically and with …", "total_citations": {"2012": 3, "2013": 1, "2014": 0, "2015": 2, "2016": 0, "2017": 6, "2018": 5, "2019": 0, "2020": 0, "2021": 0, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:1lhNe0rCu4AC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9796905/", "authors": ["Shujie Zhang", "Tianyue Zheng", "Zhe Chen", "Jun Luo"], "publication_date": "2022/5", "conference": "Proc. of the 41st IEEE INFOCOM", "pages": "1759-1768", "description": "Contact-free vital-signs monitoring enabled by radio frequency (RF) sensing is gaining increasing attention, thanks to its non-intrusiveness, noise-resistance, and low cost. Whereas most of these systems only perform respiration monitoring or retrieve heart rate, few can recover fine-grained heartbeat waveform. The major reason is that, though both respiration and heartbeat cause detectable micro-motions on human bodies, the former is so strong that it overwhelms the latter. In this paper, we aim to answer the question in the paper title, by demystifying how heartbeat waveform can be extracted from RF-sensing signal. Applying several mainstream methods to recover heartbeat waveform from raw RF signal, our results reveal that these methods may not achieve what they have claimed, mainly because they assume linear signal mixing whereas the composition between respiration and heartbeat can be highly …", "total_citations": {"2022": 1, "2023": 16}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:LhH-TYMQEocC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8977514/", "authors": ["Chao Cai", "Henglin Pu", "Menglan Hu", "Rong Zheng", "Jun Luo"], "publication_date": "2020/1/31", "journal": "IEEE Transactions on Mobile Computing", "volume": "20", "issue": "5", "pages": "2067-2079", "publisher": "IEEE", "description": "Temperature is an important data source for weather forecasting, agriculture irrigation, anomaly detection, etc. While temperature measurement can be achieved via low-cost yet standalone hardware with reasonable accuracy, integrating thermal sensing into ubiquitous computing devices is highly non-trivial due to the design requirement for specific heat isolation and proper device layout. In this paper, we present the first integrated thermometer using commercial-off-the-shelf acoustic-enabled devices. Our software sonic thermometer (SST) utilizes on-board dual microphones on commodity mobile devices to estimate sound speed, which has a known relation with temperature. To precisely measure temperature via sound speed, we propose a chirp mixing approach to circumvent low sampling rates on commodity hardware and design a pipeline of signal processing blocks to handle channel distortions. SST, for the first …", "total_citations": {"2020": 5, "2021": 6, "2022": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:HtS1dXgVpQUC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S1077314218303606", "authors": ["Xuequan Lu", "Zhigang Deng", "Jun Luo", "Wenzhi Chen", "Sai-Kit Yeung", "Ying He"], "publication_date": "2019/11/1", "journal": "Computer Vision and Image Understanding", "volume": "188", "pages": "102792", "publisher": "Academic Press", "description": "Articulated skeleton extraction or learning has been extensively studied for 2D (e.g., images and video) and 3D (e.g., volume sequences, motion capture, and mesh sequences) data. Nevertheless, robustly and accurately learning 3D articulated skeletons from point set sequences captured by a single consumer-grade depth camera still remains challenging, since such data are often corrupted with substantial noise and outliers. Relatively few approaches have been proposed to tackle this problem. In this paper, we present a novel unsupervised framework to address this issue. Specifically, we first build one-to-one point correspondences among the point cloud frames in a sequence with our non-rigid point cloud registration algorithm. We then generate a skeleton involving a reasonable number of joints and bones with our skeletal structure extraction algorithm. We lastly present an iterative Linear Blend Skinning …", "total_citations": {"2020": 2, "2021": 2, "2022": 10, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:_5tno0g5mFcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8387459/", "authors": ["Kai Han", "Huan Liu", "Shaojie Tang", "Mingjun Xiao", "Jun Luo"], "publication_date": "2018/6/18", "journal": "IEEE Transactions on Mobile Computing", "volume": "18", "issue": "4", "pages": "934-946", "publisher": "IEEE", "description": "Recently, Mobile Crowdsourcing (MC) has aroused great interest on the part of both academic and industrial circles. One of the key problems in MC is designing the proper mechanisms to incentivize user participation, as users are typically self-interested and must consume a substantial amount of MC resources/costs. Although considerable research has been devoted to this problem, the majority of studies have neglected the privacy issue in mechanism design. In this study, we consider the scenario where a mobile crowdsourcing platform aims to maximize the crowdsourcing revenue under a budget constraint, and users are interested in maximizing their utility while keeping their cost private. We design differentially-private mechanisms for such a scenario under an offline setting where users bid their costs simultaneously and under an online setting where user bids are revealed one by one. We show that our …", "total_citations": {"2019": 3, "2020": 2, "2021": 4, "2022": 6, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:dTyEYWd-f8wC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6495501/", "authors": ["Feng Li", "Chi Zhang", "Jun Luo", "Shi-Qing Xin", "Ying He"], "publication_date": "2013", "journal": "IEEE/ACM Transactions on Networking (TON)", "volume": "22", "issue": "2", "pages": "567-579", "publisher": "IEEE Pres", "description": "Many applications of wireless sensor networks involve monitoring a time-variant event (e.g., radiation pollution in the air). In such applications, fast boundary detection is a crucial function, as it allows us to track the event variation in a timely fashion. However, the problem becomes very challenging as it demands a highly efficient algorithm to cope with the dynamics introduced by the evolving event. Moreover, as many physical events occupy volumes rather than surfaces (e.g., pollution again), the algorithm has to work for 3-D cases. Finally, as boundaries of a 3-D network can be complicated 2-manifolds, many network functionalities (e.g., routing) may fail in the face of such boundaries. To this end, we propose Localized Boundary Detection and Parametrization (LBDP) to tackle these challenges. The first component of LBDP is UNiform Fast On-Line boundary Detection (UNFOLD). It applies an inversion to node …", "total_citations": {"2014": 1, "2015": 2, "2016": 8, "2017": 1, "2018": 1, "2019": 1, "2020": 0, "2021": 0, "2022": 0, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:nVrZBo8bIpAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9325082/", "authors": ["Chao Cai", "Chen Zhe", "Jun Luo", "Henglin Pu", "Menglan Hu", "Rong Zheng"], "publication_date": "2022/9/18", "journal": "IEEE Transactions on Mobile Computing", "volume": "21", "issue": "9", "pages": "3110-3121", "publisher": "IEEE", "description": "Aerial acoustic communication attracts substantial attention for its simplicity and cost-effectiveness. Unfortunately, the preferred inaudible transmission has to strike a balance between the transmission rate and communication range, when the Bit-Error-Rate (BER) is under a certain threshold. Additionally, the performance of previous proposals can be deteriorated by dynamic channel conditions including near-far problem, device heterogeneity, and multipath fading. To this end, we propose a High-speed, long-range, and Robust Chirp Spread Spectrum (HRCSS) scheme for inaudible aerial acoustic communication under dynamic channels. HRCSS innovates in the definition of a loose orthogonality condition, and it leverages this orthogonality to overlap multiple chirp carriers in a single time duration to form a data symbol representing multiple bits, thereby substantially promoting the data rate. To further enhance …", "total_citations": {"2021": 2, "2022": 7, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:IRz6iEL74y4C": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3264909", "authors": ["Jim Cherian", "Jun Luo", "Shen-Shyang Ho"], "publication_date": "2018/9/18", "journal": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies", "volume": "2", "issue": "3", "pages": "1-23", "publisher": "ACM", "description": "Locating a vehicle indoors (e.g., underground parking garages) has been a difficult problem to tackle, due to the unavailability of GPS and/or Wi-Fi signals. Current GPS-free indoor localization efforts often rely on infrastructure supports such as Wi-Fi or BLE beacons, whereas the smartphone-only proposals mostly require significant data collection and training efforts per garage. In this context, we propose ParkLoc, a novel lightweight smartphone-only solution for vehicular localization in GPS/Wi-Fi-deprived environments such as indoor parking garages. ParkLoc exploits the inherent planar graph structure of the navigable paths in parking facilities, in order to match a vehicle trajectory onto a sub-section of the map, by modeling these as sparse directed graphs. Exploiting an approximate graph matching method, ParkLoc is able to track a vehicle in real-time with a median error of 4.8m and localize a parked vehicle …", "total_citations": {"2019": 1, "2020": 4, "2021": 2, "2022": 3, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:zwpXiJ37cpgC": {"external_link": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSNET.2015.070396", "authors": ["Gaotao Shi", "Ruitao Xu", "Yantai Shu", "Jun Luo"], "publication_date": "2015", "journal": "International Journal of Sensor Networks", "volume": "18", "issue": "3-4", "pages": "204-216", "publisher": "Inderscience Publishers (IEL)", "description": "Specifically, ZigBee networks share the 2.4 GHz ISM band with WiFi but have much lower transmission power. Therefore, the ZigBee networks inevitably suffer the interference from WiFi networks. In this paper, we focus on utilising the temporal and spatial feature of WiFi interference to adjust Zigbee channel over the whole networks. We experimentally examine the spatiotemporal variation of interference and then present a novel interference assessing method which jointly considers the intensity and density of WiFi interference in order to better characterise the relation between interference and link quality. Further considering the interference locality, we propose MuZi (Multi-channel ZigBee) as an interference avoiding approach for ZigBee networks. It aims to determine a better working channel for each node while taking network connectivity into consideration. Our experiments show that, under the existence of …", "total_citations": {"2017": 4, "2018": 4, "2019": 3, "2020": 2, "2021": 0, "2022": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:2P1L_qKh6hAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5671576/", "authors": ["Xiang Liu", "Jun Luo"], "publication_date": "2010/9/26", "conference": "21st Annual IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "pages": "2063-2068", "publisher": "IEEE", "description": "Despite all the encouraging reports on the benefit of Partially Overlapped Channels (POCs), the relative simple interference models and rather arbitrary network settings considered in the literature make those reports questionable. In order to gain proper engineering insights, we look into the problem of improving network throughput by making use of POCs in this paper. Our perspectives are novel in that we 1) adopt a more realistic model to capture the additive nature of interference, 2) apply efficient solution techniques to obtain the optimal solutions of the hard optimization problems, and 3) focus on a typical mesh networking scenario. The outcome of our investigations, though revealing interesting aspects of using multiple channels, contradicts the previous statements by exhibiting that only a marginal gain can be obtained if POCs are used.", "total_citations": {"2012": 1, "2013": 2, "2014": 3, "2015": 1, "2016": 3, "2017": 1, "2018": 1, "2019": 1, "2020": 0, "2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=20&pagesize=80&citation_for_view=qXLjz30AAAAJ:IUKN3-7HHlwC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8737550/", "authors": ["Yanbing Yang", "Jun Luo", "Chen Chen", "Wen-De Zhong", "Liangyin Chen"], "publication_date": "2019/4/29", "conference": "IEEE INFOCOM 2019-IEEE Conference on Computer Communications", "pages": "1297-1305", "publisher": "IEEE", "description": "Visible Light Communication (VLC) systems relying on commercial-off-the-shelf (COTS) devices have gathered momentum recently, due to the pervasive adoption of LED lighting and mobile devices. However, the achievable throughput by such practical systems is still several orders below those claimed by controlled experiments with specialized devices. In this paper, we engineer SynLight aiming to significantly improve the data rate of a practical VLC system. SynLight adopts COTS LEDs as its transmitter, but it innovates in its simple yet delicate driver circuit wiring an array of LED chips in a combinatorial manner. Consequently, modulated signals can directly drive the on-off procedures of individual chip groups, so that the spatially synthesized light emissions exhibit a varying luminance following exactly the modulation symbols. To obtain a readily usable receiver, SynLight interfaces a COTS Photo-Diode with a …", "total_citations": {"2019": 3, "2020": 6, "2021": 0, "2022": 1, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:BzfGm06jWhQC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/2491288.2491326", "authors": ["Kai Han", "Liu Xiang", "Jun Luo", "Mingjun Xiao", "Liusheng Huang"], "publication_date": "2013/7/29", "book": "Proceedings of the fourteenth ACM international symposium on Mobile ad hoc networking and computing", "pages": "287-292", "description": "Because data dissemination is crucial to Wireless Sensor Networks (WSNs), its energy-efficiency and reliability are of paramount importance. While achieving these two goals together is highly non-trivial, the situation is exacerbated if WSN nodes are duty-cycled (DC) and their transmission power is adjustable. In this paper, we study the problem of minimizing the expected total transmission power for reliable data dissemination (multicast/broadcast) in DC-WSNs. Due to the NP-hardness of the problem, we design efficient approximation algorithms with provable performance bounds for it.", "total_citations": {"2013": 1, "2014": 2, "2015": 3, "2016": 5, "2017": 0, "2018": 2, "2019": 0, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:bEWYMUwI8FkC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5962999/", "authors": ["Jun Luo", "Feng Li", "Ying He"], "publication_date": "2011/6/5", "conference": "2011 IEEE International Conference on Communications (ICC)", "pages": "1-5", "publisher": "IEEE", "description": "This paper proposes novel mechanisms to access sensory data in a distributed fashion in 3D wireless sensor networks. As these networks have their nodes deployed in 3D volumes, we first propose a volume parametrization algorithm to transform irregular volumes into a regular one; it also allows us to extend network protocols from 2D to 3D (which would otherwise be highly non-trivial). Based on this transformation, we propose a new quorum system, 3DQS, to handle distributed data access. The tunability of 3DQS enables it to adapt to different application requirements. We demonstrate the efficacy and efficiency of 3DQS through both analysis and simulations.", "total_citations": {"2011": 1, "2012": 1, "2013": 1, "2014": 3, "2015": 1, "2016": 3, "2017": 0, "2018": 0, "2019": 1, "2020": 1, "2021": 0, "2022": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:HDshCWvjkbEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5582931/", "authors": ["Jun Luo"], "publication_date": "2010/7/19", "conference": "2010 IEEE International Conference on Multimedia and Expo", "pages": "986-991", "publisher": "IEEE", "description": "Though the existence of a minimum delay peer-to-peer media streaming scheme has been shown (under the name of snowball streaming), no actual algorithm has ever been designed so far, due to the lack of a systematic way to construct the chunk scheduling that achieves the minimum delay bound. Inspired by the growth of interest in building hybrid streaming systems that consist of backbone trees supplemented by other overlay structures, we revisit the minimum delay streaming problem and design practical min-delay algorithms to support the streaming in the backbone trees. What mainly distinguishes our multi-tree push from the conventional ones is an unbalanced tree design guided by the snow-ball streaming, which has a provable minimum delay. We design algorithms to construct and maintain our SNowbAll multi-tree Pushing (SNAP) overlay. Our simulations in ns-2 indicate that our approach outperforms …", "total_citations": {"2011": 2, "2012": 2, "2013": 4, "2014": 2, "2015": 0, "2016": 2, "2017": 1, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:buQ7SEKw-1sC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3447993.3483258", "authors": ["Tianyue Zheng", "Zhe Chen", "Jun Luo", "Lin Ke", "Chaoyang Zhao", "Yaowen Yang"], "publication_date": "2021/10/25", "conference": "Proceedings of the 27th Annual International Conference on Mobile Computing and Networking", "pages": "323-336", "description": "Being able to see into walls is crucial for diagnostics of building health; it enables inspections of wall structure without undermining the structural integrity. However, existing sensing devices do not seem to offer a full capability in mapping the in-wall structure while identifying their status (e.g., seepage and corrosion). In this paper, we design and implement SiWa as a low-cost and portable system for wall inspections. Built upon a customized IR-UWB radar, SiWa scans a wall as a user swipes its probe along the wall surface; it then analyzes the reflected signals to synthesize an image and also to identify the material status. Although conventional schemes exist to handle these problems individually, they require troublesome calibrations that largely prevent them from practical adoptions. To this end, we equip SiWa with a deep learning pipeline to parse the rich sensory data. With innovative construction and training …", "total_citations": {"2021": 3, "2022": 4, "2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:wMgC3FpKEyYC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9530486/", "authors": ["Wenbin Huang", "Wenjuan Tang", "Hongbo Jiang", "Jun Luo", "Yaoxue Zhang"], "publication_date": "2021/9/6", "journal": "IEEE Internet of Things Journal", "volume": "9", "issue": "7", "pages": "5304-5314", "publisher": "IEEE", "description": "Both  voice communication  and automatic speech verification (ASV) over smart devices are vulnerable to the voice impersonation (VI) attack, which is often launched via imitating a target’s voice characteristics to deceive human auditory sense or fool the ASV system. Researchers have designed a number of defense schemes yet without the consideration of universality due to the lack of comprehensive data sets. In this article, we propose a universal defense scheme based on the VI data set collected from a famous TV show named “The Sound.” First, we deliver a thorough study on the VI attacks in both auditory and ASV systems to verify the collected simulated voice could spoof the auditory and the ASV system with a notable probability. Second, we propose a quasi-Gaussian distribution (QGD)-based defense scheme with the discovery about specific voice characteristics that are distinct between attackers and …", "total_citations": {"2022": 10, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:K3LRdlH-MEoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6275778/", "authors": ["Chi Zhang", "Jun Luo", "Liu Xiang", "Feng Li", "Juncong Lin", "Ying He"], "publication_date": "2012/6/18", "conference": "Sensor, Mesh and Ad Hoc Communications and Networks (SECON), 2012 9th Annual IEEE Communications Society Conference on", "publisher": "IEEE", "description": "With the development of ever-expanding wireless sensor networks (WSNs) that are meant to connect physical worlds with human societies, gathering sensory data at a single point is becoming less and less practical. Unfortunately, the alternative in-network data management schemes may fail to operate in the face of communication voids (or holes) in WSNs (especially 3D WSNs). In response to this challenge, we propose harmonic quorum systems (HQSs) as a lightweight data management system for 2D/3D WSNs. HQSs innovate in exploiting a few scalar fields (constructed using pure localized algorithms) to guide data accesses. This liberates HQSs from depending on any routing mechanisms or location services, hence making HQSs efficient and robust against anomalies in WSN topologies. We implement HQSs in TinyOS, and we perform intensive simulations using TOSSIM to validate the performance of HQSs.", "total_citations": {"2013": 1, "2014": 2, "2015": 2, "2016": 4, "2017": 0, "2018": 1, "2019": 1, "2020": 1, "2021": 0, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:PaBasH6fAo0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9792275/", "authors": ["Xiangyu Shen", "Hongbo Jiang", "Daibo Liu", "Kehua Yang", "Feiyang Deng", "John CS Lui", "Jiangchuan Liu", "Schahram Dustdar", "Jun Luo"], "publication_date": "2022/6/9", "journal": "IEEE Internet of Things Journal", "volume": "9", "issue": "17", "pages": "15538-15553", "publisher": "IEEE", "description": "As mobile shopping has gradually become the mainstream shopping mode, recommendation systems are gaining an increasingly wide adoption. Existing recommendation systems are mainly based on explicit and implicit user behaviors. However, these user behaviors may not directly indicate users’ inner feelings, causing erroneous user preference estimation and thus leading to inaccurate recommendations. Inspired by our key observation on the correlation between pupil size and users’ inner feelings, we consider using the change of pupil size when browsing to model users’ preferences, so as to achieve targeted recommendations. To this end, we propose PupilRec as a computer-vision-based recommendation framework involving a mobile terminal and a server side. On the mobile terminal, PupilRec collects users’ pupil size change information through the front camera of smartphones; it then preprocesses …", "total_citations": {"2023": 12}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:_kc_bZDykSQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5291604/", "authors": ["Jun Luo", "André Girard", "Catherine Rosenberg"], "publication_date": "2009/6/23", "conference": "2009 7th International Symposium on Modeling and Optimization in Mobile, Ad Hoc, and Wireless Networks", "pages": "1-9", "publisher": "IEEE", "description": "We focus on efficient algorithms for resource allocation problems in large wireless networks. We first investigate the link scheduling problem and identify the properties that make it possible to compute solutions efficiently. We then show that the node on-off scheduling problem shares these features and is amenable to the same type of solution method. Numerical results confirm the efficiency of our technique for large scale problems. We also extend the technique to the case where the objective function is nonlinear showing that our technique blends smoothly with a sequential linear programming approach. Numerical results for a cross-layer design with a nonlinear fairness utility show that it is possible to compute optimal solutions for large wireless networks in reasonable CPU time.", "total_citations": {"2009": 1, "2010": 4, "2011": 1, "2012": 4, "2013": 1, "2014": 0, "2015": 0, "2016": 0, "2017": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:a0OBvERweLwC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/4699918/", "authors": ["Catherine Rosenberg", "Jun Luo", "André Girard"], "publication_date": "2008/9/15", "conference": "Personal, Indoor and Mobile Radio Communications, 2008. PIMRC 2008. IEEE 19th International Symposium on", "pages": "1-6", "publisher": "IEEE", "description": "Wireless mesh networks are considered as a potentially attractive alternative to provide broadband access to users. They have been studied extensively by the research community since they raised a lot of new issues due to their unique characteristics. Here, we focus on scenarios where these networks are installed and managed to provide broadband access to a set of fixed nodes. While a lot of research has been done on this type of networks, there are very few insightful engineering results that can help network operators deploy and manage such networks. It is the objective of this paper to present some major engineering insights on such networks. We limit our scope to networks that are single rate and in which all nodes use the same transmit power. In particular, we quantify the advantage of multi-hop over single-hop. We illustrate the importance of multi-path routing over single path routing, and of optimal …", "total_citations": {"2009": 1, "2010": 7, "2011": 0, "2012": 0, "2013": 0, "2014": 1, "2015": 1, "2016": 0, "2017": 0, "2018": 0, "2019": 0, "2020": 0, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:jL-93Qbq4QoC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9484787/", "authors": ["Chao Cai", "Henglin Pu", "Liyuan Ye", "Hongbo Jiang", "Jun Luo"], "publication_date": "2021/7/14", "journal": "IEEE Transactions on Mobile Computing", "publisher": "IEEE", "description": "Though measuring ambient temperature is often deemed as an easy job, collecting large-scale temperature readings in real-time is still a formidable task. The recent boom of network-ready (mobile) devices and the subsequent mobile crowdsourcing applications do offer an opportunity to accomplish this task, yet equipping commodity devices with ambient temperature sensing capability is highly non-trivial and hence has never been achieved. In this paper, we propose  Ac o u stic  T h e rmometer (AcuTe+) as an interference-resilient ambient temperature sensor empowered by a single commodity smartphone. AcuTe+ utilizes on-board dual microphones to estimate air-borne sound propagation speed, thereby deriving ambient temperature. To accurately estimate sound propagation speed, we leverage the phase of chirp signals to circumvent the low sample rate on commodity hardware. In addition, we propose to use both …", "total_citations": {"2022": 7, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:5MTHONV0fEkC": {"external_link": "https://www.mdpi.com/1424-8220/21/2/532", "authors": ["Henglin Pu", "Chao Cai", "Menglan Hu", "Tianping Deng", "Rong Zheng", "Jun Luo"], "publication_date": "2021/1/18", "journal": "Sensors", "volume": "21", "issue": "2", "pages": "532", "publisher": "MDPI", "description": "Multiple blind sound source localization is the key technology for a myriad of applications such as robotic navigation and indoor localization. However, existing solutions can only locate a few sound sources simultaneously due to the limitation imposed by the number of microphones in an array. To this end, this paper proposes a novel multiple blind sound source localization algorithms using Source seParation and BeamForming (SPBF). Our algorithm overcomes the limitations of existing solutions and can locate more blind sources than the number of microphones in an array. Specifically, we propose a novel microphone layout, enabling salient multiple source separation while still preserving their arrival time information. After then, we perform source localization via beamforming using each demixed source. Such a design allows minimizing mutual interference from different sound sources, thereby enabling finer AoA estimation. To further enhance localization performance, we design a new spectral weighting function that can enhance the signal-to-noise-ratio, allowing a relatively narrow beam and thus finer angle of arrival estimation. Simulation experiments under typical indoor situations demonstrate a maximum of only 4∘ even under up to 14 sources.", "total_citations": {"2021": 3, "2022": 6, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:HeT0ZceujKMC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8978742/", "authors": ["Yanbing Yang", "Jun Luo", "Chen Chen", "Zequn Chen", "Wen-De Zhong", "Liangyin Chen"], "publication_date": "2020/2/3", "journal": "IEEE Transactions on Mobile Computing", "volume": "20", "issue": "5", "pages": "1979-1992", "publisher": "IEEE", "description": "Visible light communication (VLC) systems relying on commercial-off-the-shelf (COTS) devices have gathered momentum recently, due to the pervasive adoption of LED lighting and mobile devices. However, the achievable throughput by such practical systems is still several orders below those claimed by controlled experiments with specialized devices. In this paper, we engineer CoLight aiming to boost the data rate of the VLC system purely built upon COTS devices. CoLight adopts COTS LEDs as its transmitter, but it innovates in its simple yet delicate driver circuit wiring an array of LED chips in a combinatorial manner. Consequently, modulated signals can directly drive the on-off procedures of individual chip groups, so that the spatially synthesized light emissions exhibit a varying luminance following exactly the modulation symbols. To obtain a readily usable receiver, CoLight interfaces a COTS PD with a …", "total_citations": {"2020": 3, "2021": 2, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:yMeIxYmEMEAC": {"external_link": "https://www.sciencedirect.com/science/article/pii/S1574119217303218", "authors": ["Yanbing Yang", "Jun Luo", "Jie Hao", "Sinno Jialin Pan"], "publication_date": "2018/4/1", "journal": "Pervasive and Mobile Computing", "volume": "45", "pages": "35-54", "publisher": "Elsevier", "description": "As a key component of building management and security, occupancy inference through smart sensing has attracted a lot of research attention for nearly two decades. Nevertheless, existing solutions mostly rely on either pre-deployed infrastructures or user device participation, thus hampering their wide adoption. This paper presents CeilingSee, a dedicated occupancy inference system free of heavy infrastructure deployments and user involvements. Building upon existing LED lighting systems, CeilingSee converts part of the ceiling-mounted LED luminaires to act as sensors, sensing the variances in diffuse reflection caused by occupants. In realizing CeilingSee, we first re-design the LED driver to leverage LED’s photoelectric effect so as to transform a light emitter to a light sensor. In order to produce accurate occupancy inference, we then engineer efficient learning algorithms to fuse sensing information …", "total_citations": {"2018": 1, "2019": 3, "2020": 3, "2021": 1, "2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:ALROH1vI_8AC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9796731/", "authors": ["Tianyue Zheng", "Chao Cai", "Zhe Chen", "Jun Luo"], "publication_date": "2022/5", "conference": "Proc. of the 41st IEEE INFOCOM", "pages": "110-119", "description": "Proliferation of smart environments entails the need for real-time and ubiquitous human-machine interactions through, mostly likely, hand/arm motions. Though a few recent efforts attempt to track hand/arm motions in real-time with COTS devices, they either obtain a rather low accuracy or have to rely on a carefully designed infrastructure and some heavy signal processing. To this end, we propose SoM (Sound of Motion) as a lightweight system for wrist tracking. Requiring only a smart watch-phone pair, SoM entails very light computations that can operate in resource constrained smartwatches. SoM uses embedded IMU sensors to perform basic motion tracking in the smartwatch, and it depends on the fixed smartphone to act as an \"acoustic anchor\": regular beacons sent by the phone are received in an irregular manner due to the watch motion, and such variances provide useful hints to adjust the drifting of IMU …", "total_citations": {"2022": 4, "2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:VL0QpB8kHFEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6655994/", "authors": ["Kai Han", "Liu Xiang", "Jun Luo", "Yang Liu"], "publication_date": "2014/4", "journal": "IEEE Transactions on Vehicular Technology", "volume": "63", "issue": "4", "pages": "1790 - 1801", "publisher": "IEEE Press", "description": "Given the increasing demand from wireless applications, designing energy-efficient group communication protocols is of great importance to multihop wireless networks. A group communication session involves a set of member nodes, where each of them needs to send a certain number of data packets to all other members. In this paper, we consider the problem of building a shared multicast tree spanning the member nodes in static wireless networks such that the total energy consumption of a group communication session using the shared multicast tree is minimized. Since this problem was proven as NP-complete, we propose, under our Minimum-Energy Group COMmunication (MEGCOM) framework, three distributed approximation algorithms with provable approximation ratios. When the transmission power of each wireless node is fixed and identical, our first two algorithms have the approximation ratios of O …", "total_citations": {"2014": 1, "2015": 1, "2016": 5, "2017": 1, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:TQgYirikUcIC": {"external_link": "https://link.springer.com/chapter/10.1007/978-3-642-14849-1_18", "authors": ["Jun Luo", "Liu Xiang"], "publication_date": "2011", "book": "Theoretical Aspects of Distributed Computing in Sensor Networks", "pages": "553-588", "publisher": "Springer, Berlin, Heidelberg", "description": "Though mobility is rarely considered in traditional wireless sensor networks (WSNs), actively exploiting mobility to improve the performance of WSNs has been increasingly recognized as an important aspect of designing WSNs. This chapter focuses on exploiting mobility to improve the network lifetime of a WSN. We present a general optimization framework that is able to capture several aspects of maximizing network lifetime (MNL) involving mobile entities. Based on this framework, we conduct an in-depth analysis on each of these aspects and also describe algorithms that can be used to solve the resulting optimization problems. We also present certain numerical results where engineering insights can be acquired.", "total_citations": {"2011": 2, "2012": 1, "2013": 1, "2014": 0, "2015": 2, "2016": 0, "2017": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:AHdEip9mkN0C": {"external_link": "https://dl.acm.org/doi/abs/10.14778/3450980.3450982", "authors": ["Yahui Sun", "Xiaokui Xiao", "Bin Cui", "Saman Halgamuge", "Theodoros Lappas", "Jun Luo"], "publication_date": "2021/3/1", "journal": "Proceedings of the VLDB Endowment", "volume": "14", "issue": "7", "pages": "1137-1149", "publisher": "VLDB Endowment", "description": "Given an undirected graph and a number of vertex groups, the group Steiner trees problem is to find a tree such that (i) this tree contains at least one vertex in each vertex group; and (ii) the sum of vertex and edge weights in this tree is minimized. Solving this problem is useful in various scenarios, ranging from social networks to knowledge graphs. Most existing work focuses on solving this problem in vertex-unweighted graphs, and not enough work has been done to solve this problem in graphs with both vertex and edge weights. Here, we develop several algorithms to address this issue. Initially, we extend two algorithms from vertex-unweighted graphs to vertex- and edge-weighted graphs. The first one has no approximation guarantee, but often produces good solutions in practice. The second one has an approximation guarantee of |Γ| - 1, where |Γ| is the number of vertex groups. Since the extended (|Γ| - 1 …", "total_citations": {"2021": 2, "2022": 2, "2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:sNmaIFBj_lkC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8509308/", "authors": ["Kai Han", "Yuntian He", "Xiaokui Xiao", "Shaojie Tang", "Fei Gui", "Chaoting Xu", "Jun Luo"], "publication_date": "2018/4/16", "conference": "2018 IEEE 34th International Conference on Data Engineering (ICDE)", "pages": "917-928", "publisher": "IEEE", "description": "Recently, the proliferation of event-based social services has made it possible for organizing personalized offline events through the users' information shared online. In this paper, we study the budget-constrained influential social event organization problem, where the goal is to select a group of influential users with required features to organize a social event under a budget B. We show that our problem is NP-hard and can be formulated as a submodular maximization problem with mixed packing and covering constraints. We then propose several polynomial time algorithms for our problem with provable approximation ratios, which adopt a novel \"surrogate optimization approach and the method of reverse-reachable set sampling. Compared with some related work that can only handle special cases of our problem but with exponential time complexity, our algorithms are much more efficient, and their superiorities …", "total_citations": {"2018": 5, "2019": 0, "2020": 2, "2021": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:4fGpz3EwCPoC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3129881.3129887", "authors": ["Yanbing Yang", "Shuya Ding", "Jie Hao", "Jun Luo"], "publication_date": "2017", "conference": "ACM VLCS", "description": "Given the growing interests on using Commercial Off-The-Shelf (COTS) devices to implement Visible Light Communication (VLC) systems, there is a call for filling the gap between VLC standards and practical deployments. In particular, since LED-Camera VLC systems have shown a strong potential in covering large indoor areas due to the increasing pervasiveness of LED lighting systems and smartphones, providing roaming support to such a system has become an impending need. To this end, we propose RoCLight as a lightweight solution to this call. In order to have a proper feedback channel for roaming support, we innovate in converting part of the LED luminaires (already used as the VLC transmitters) into light sensors. By sensing the disturbance to the ambient diffuse reflection caused by user presence and mobility, RoCLight is able to adaptively handoff its transmissions from one luminaire to another, so …", "total_citations": {"2018": 3, "2019": 4, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:Ehil0879vHcC": {"external_link": "https://opg.optica.org/abstract.cfm?uri=ol-45-17-4927", "authors": ["Chao Hu", "Chen Chen", "Min Guo", "Yanbing Yang", "Jun Luo", "Liangyin Chen"], "publication_date": "2020/9/1", "journal": "Optics Letters", "volume": "45", "issue": "17", "pages": "4927-4930", "publisher": "Optica Publishing Group", "description": "In this Letter, we propose and demonstrate a practical optical-spatial-summing-based non-orthogonal multiple access (OSS-NOMA) technique for visible light communication (VLC) systems. This technique is innovative in adopting OSS in that the transmitter of OSS-NOMA VLC can be built upon commercial illuminating light emitting diodes (LEDs), free of LEDs’ harmful nonlinearity. Unlike conventional NOMA VLC using analog components such as digital-to-analog converters and bias-T in the transmitter side, OSS-NOMA exploits only digital control signals to drive a LED array in forming optical power superposition for NOMA signals. We demonstrate that by simply switching different amounts of LED chips on or off, the proposed OSS-NOMA transmitter can deliver a fine-grained power allocation ratio ranging from 0.01 to one for two users. The implemented OSS-NOMA VLC prototype leveraging commercial …", "total_citations": {"2020": 1, "2021": 3, "2022": 1, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:DJbcl8HfkQkC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8743428/", "authors": ["Feng Li", "Jie Hao", "Jin Wang", "Jun Luo", "Ying He", "Dongxiao Yu", "Xiuzhen Cheng"], "publication_date": "2019/6/21", "journal": "IEEE Internet of Things Journal", "volume": "6", "issue": "5", "pages": "8870-8882", "publisher": "IEEE", "description": "Most existing proposals for indoor localization are “unnatural,” as they rely on sensing abilities not available to human beings. While such a mismatch causes complications in human-computer interactions and thus potentially reduces the usability and friendliness of a localization service, it is partially entailed by the need for low-cost/effort sensing with resource-limited mobile devices. Fortunately, recent developments in smart glasses (e.g., Google Glasses) signal a trend toward realistic visual sensing and hence make the sensing ability of mobile devices more compatible to that of human users. Leveraging such front-end developments, we propose VisioMap as a natural indoor localization system that intentionally mimics the human skills in visual localization. VisioMap uses very sparse photograph samples to reconstruct 3-D indoor scenes; this is facilitated by the facts that photographs are taken at the eye-level …", "total_citations": {"2020": 1, "2021": 1, "2022": 4, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:a9-T7VOCCH8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8302496/", "authors": ["Jie Hao", "Xiaoming Yuan", "Yanbing Yang", "Ran Wang", "Yi Zhuang", "Jun Luo"], "publication_date": "2018/2/26", "journal": "IEEE Access", "volume": "6", "pages": "16377-16385", "publisher": "IEEE", "description": "As a key component of building management and security, occupancy inference through smart sensing has attracted a lot of research attention for nearly two decades. Recently, a cutting edge technique visible light sensing (VLS) that utilizes the LED luminaires as light sensors has shown its promising application potentials in occupancy inference as it piggybacks on pervasive lighting infrastructure without extra equipment deployment. Although existing inference algorithms based on the VLS data set can achieve high accuracy, the performance degrades when the occupants are moving. This paper focuses on the occupancy inference issue and presents an ensemble learning algorithm to improve the inference accuracy. We use heterogeneous learning algorithms to generate diverse learners. Consequently, we adopt forward sequential pruning to enhance the ensemble that pursues inference error minimization …", "total_citations": {"2018": 1, "2019": 4, "2020": 0, "2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:WZBGuue-350C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6857086/", "authors": ["Zhiming Hu", "Yan Qiao", "Jun Luo", "Peng Sun", "Yonggang Wen"], "publication_date": "2014/6/11", "conference": "IFIP Networking", "pages": "1-9", "publisher": "IEEE Press", "description": "Understanding the pattern of end-to-end traffic flows in Data Center Networks (DCNs) is essential to many DCN designs and operations (e.g., traffic engineering and load balancing). However, little research work has been done to obtain traffic information efficiently and yet accurately. Researchers often assume the availability of traffic tracing tools (e.g., OpenFlow) when their proposals require traffic information as input, but these tools may generate high monitoring overhead and consume significant switch resources even if they are available in a DCN. Although estimating the traffic matrix between origin-destination pairs using only basic switch SNMP counters is a mature practice in IP networks, traffic flows in DCNs are notoriously more irregular and volatile, while the large number of redundant routes in a DCN further complicates the situation. To this end, we propose to utilize the service placement logs for …", "total_citations": {"2015": 2, "2016": 1, "2017": 0, "2018": 1, "2019": 2, "2020": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:k_IJM867U9cC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/5546865/", "authors": ["Patrick Mitran", "Catherine Rosenberg", "John Sydor", "Jun Luo", "Samat Shabdanov"], "publication_date": "2010/6/23", "conference": "2010 The 9th IFIP Annual Mediterranean Ad Hoc Networking Workshop (Med-Hoc-Net)", "pages": "1-8", "publisher": "IEEE", "description": "We study the capacity of a single-hop wireless cell comprised of M fixed directional antennas concentrically arranged around a common axis and each reusing the same channel. The premise for this architecture is that co-channel interference between the fixed directional beams can be identified and reported, allowing joint conflict-free scheduling, i.e., it becomes possible to compute the schedule over all the M sectors together. We are primarily interested in studying the capacity gains that can be realized as a function of the number of sectors, the parameters of the directional antennas and other system parameters. Our analytical and numerical results yield several useful engineering insights on the selection of antenna parameters, the impact of node placement, and the impact of physical layer parameters. This study demonstrates how Space Division Multiple Access (SDMA) can yield excellent capacity provided …", "total_citations": {"2011": 1, "2012": 1, "2013": 3, "2014": 1, "2015": 0, "2016": 0, "2017": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:7wO8s98CvbsC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9941045/", "authors": ["Zhe Chen", "Tianyue Zheng", "Chao Hu", "Hangcheng Cao", "Yanbing Yang", "Hongbo Jiang", "Jun Luo"], "publication_date": "2023/3/8", "journal": "IEEE Communications Magazine", "publisher": "IEEE", "description": "The intention of leveraging Radio-Frequency (RF) resources for diverse sensing purposes has grown increasingly keen, thanks to the ever-expanding deployment of IoT devices using RF communications to maintain connectivity. Whereas the original idea was to integrate sensing and communications (a.k.a. ISAC) for individual IoT devices, most proposals in the past decade simply converted such devices (e.g., Wi-Fi or LoRa) into RF sensors without attending to their communication nature. Therefore, we argue that the device architecture has to be overhauled so as to achieve the ISAC ambition. To this end, we propose ISA-CoT as the framework for enabling ISAC over IoT devices. We categorize ISACoT's extensions over existing devices into four aspects, namely time, frequency, space, and protocol. We argue that, as the multistatic communication infrastructure of IoT is adverse to device-free sensing (e.g., lack of …", "total_citations": {"2023": 6}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:WHdLCjDvYFkC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3560905.3568513", "authors": ["Shujie Zhang", "Tianyue Zheng", "Hongbo Wang", "Zhe Chen", "Jun Luo"], "publication_date": "2022/11", "conference": "The 20th ACM Conference on Embedded Networked Sensor Systems (SenSys 2022)", "description": "Recent years have witnessed a growing interest in contact-free respiration monitoring leveraging radio-frequency (RF) technologies. However, the proposed solutions mostly consider single-person scenarios, whereas a few multi-person monitoring proposals simply apply blind source separation to handle inter-person interference, without drawing a clear line between physical and algorithmic separability. In this paper, we set out to answer: under what condition(s) one may physically separate multiple respiration signals sensed by diversified RF technologies? Drawing inspiration from conventional signal processing, we propose respiration-to-interference-plus-noise ratio (RINR) as a novel metric, taking into account the impact from both background noise and various interfering sources. Instead of attenuation in Euclidean distance, RINR has to be evaluated upon range/angle bins where physical separation actually …", "total_citations": {"2023": 5}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:IaI1MmNe2tcC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3495243.3560526", "authors": ["Ziwei Liu", "Tianyue Zheng", "Chao Hu", "Yanbing Yang", "Yimao Sun", "Yi Zhang", "Zhe Chen", "Liangyin Chen", "Jun Luo"], "publication_date": "2022/10/18", "conference": "Proceedings of the 28th Annual International Conference on Mobile Computing And Networking", "pages": "172-185", "description": "Optical camera communication (OCC) enabled by LED and embedded cameras has attracted extensive attention, thanks to its rich spectrum availability and ready deployability. However, the close interactions between OCC and the indoor spaces have created two major challenges. On one hand, the stripe pattern incurred by OCC may greatly damage the accuracy of image-based object recognition. On the other hand, the patterns inherent to indoor spaces can significantly degrade the decoding performance of reflected OCC. To this end, we propose CORE-Lens as a pipeline to make the mutual interference transparent to existing OR and OCC algorithms. Essentially, CORE-Lens treats the two challenges as two sides of a signal mixture issue: the signals transmitted by OCC get mixed with background images so well that their features become entangled. Consequently, CORE-Lens exploits the idea of …", "total_citations": {"2022": 1, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:j7_hQOaDUrUC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9852706/", "authors": ["Tianyue Zheng", "Zhe Chen", "Shujie Zhang", "Jun Luo"], "publication_date": "2022/8/9", "journal": "IEEE Transactions on Mobile Computing", "publisher": "IEEE", "description": "Continuous respiration monitoring is significant for real-life healthcare applications, but realizing it is extremely hard as wearable sensors are cumbersome and contact-free sensors largely fail to tolerate user movements. Meanwhile, tracking users indoors mostly demands user-held devices, while device-free localization can barely tell what and who it tracks. Fortunately, as both contact-free respiration monitoring and device-free localization may rely on Radio-Frequency (RF) sensing, fusing them together creates a novel system capable of continuously tracking users while recovering their fine-grained respiratory waveforms. To this end, we propose BreathCatcher as a continuous human respiration tracking system for indoor applications. To build this system, we employ commercial-grade compact radar pairs to capture RF reflections containing respiratory signals. We then propose a hybrid human respiration and …", "total_citations": {"2022": 1, "2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:4xDN1ZYqzskC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9468341/", "authors": ["Chao Cai", "Henglin Pu", "Menglan Hu", "Rong Zheng", "Jun Luo"], "publication_date": "2021/6/29", "journal": "IEEE Transactions on Mobile Computing", "publisher": "IEEE", "description": "Acoustic sensing has attracted significant attention recently, thanks to the pervasive availability of device support. However, adopting consumer-grade devices (e.g., smartphones) to deploy acoustic sensing applications faces the challenge of device/OS heterogeneity. Researchers have to pay tremendous efforts in tackling platform-dependent details even in simply accessing raw audio samples, thus losing focus on innovating sensing algorithms. To this end, this paper presents the first Acoustic Software Defined Platform (ASDP): a versatile sensing and general benchmarking platform. ASDP encompasses several customized acoustic modules running on a ubiquitous computing board, backed by a dedicated software framework. It is superior to commodity devices in controlling and reconfiguring physical layer settings, thus offering much better usability. The tailored software framework abstracts platform details and …", "total_citations": {"2021": 1, "2022": 3, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:mlAyqtXpCwEC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/8493334/", "authors": ["Kai Han", "Yuntian He", "Xiaokui Xiao", "Shaojie Tang", "Fei Gui", "Chaoting Xu", "Jun Luo"], "publication_date": "2018/10/16", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "31", "issue": "12", "pages": "2379-2392", "publisher": "IEEE", "description": "Recently, the proliferation of event-based social services has made it possible for organizing personalized offline events through the users' information shared online. In this paper, we study the budget-constrained influential social event organization problem, where the goal is to select a group of influential users with required features to organize a social event under a budget B. We show that our problem is NP-hard and can be formulated as a submodular maximization problem with mixed packing and covering constraints. We then propose several polynomial time algorithms for our problem with provable approximation ratios, which adopt a novel “surrogate optimization” approach and the method of reverse-reachable set sampling. Moreover, we also consider the case where the influence spread function is unknown and can be arbitrarily selected from a set of candidate submodular functions, and extend our …", "total_citations": {"2020": 2, "2021": 2, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:JQOojiI6XY0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/6506561/", "authors": ["Menglan Hu", "Jun Luo"], "publication_date": "2012/12/12", "conference": "2012 18th IEEE International Conference on Networks (ICON)", "pages": "222-226", "publisher": "IEEE", "description": "The scheduling of real-time tasks on clusters is a critical issue for offering quality-of-service (QoS) assurance. A significant challenge in real-time task scheduling is to support various types of applications. In this paper we focus on the scheduling of bag-of-tasks (BoT) applications consisting of many independent tasks. BoT applications are a typically “embarrassingly parallel” type of applications which widely exist in various fields in science and engineering. We propose a dynamic (online) real-time scheduling algorithm referred to as scheduling algorithm with migration (SAM) for handling real-time BoT applications on cluster systems. SAM schedules tasks to the minimum number of processors so that computation power can be saved for unscheduled large tasks. SAM also utilizes task migration to optimize load balancing without undermining the schedulability of the tasks. Performance evaluation results are …", "total_citations": {"2016": 1, "2017": 2, "2018": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:4DMP91E08xMC": {"external_link": "https://scholar.google.com/scholar?cluster=12330914638487842037&hl=en&oi=scholarr", "authors": ["Jun Luo", "Jean-Pierre Hubaux"], "publication_date": "2006/6", "conference": "Mobility and Scalability in Wireless Sensor Networks (MSWSN) Workshop (in conjunction with DCOSS'06)", "pages": "153-164", "publisher": "IEEE", "description": "Although commonly considered as a harm in wireless networks, mobility                can potentially be beneficial to wireless sensor networks that usually                consist of static nodes. A recent boom of applying mobile devices to                improve the lifetime of wireless sensor networks has lead to a great deal                of meaningful contributions, both in theory and practice. In this paper,                we survey the efforts relevant to this topic. In addition, we also identify                the lack of theoretical understanding of one of the approaches, namely                mobile sink. We hence briefly describe a theoretical framework that we                have obtained recently; it aims at bringing deeper insight on the optimal                way of using mobile sinks for lifetime improvement.", "total_citations": {"2010": 1, "2011": 1, "2012": 0, "2013": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:3fE2CSJIrl8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/1381946/", "authors": ["Jun Luo", "J-P Hubaux"], "publication_date": "2004/10/4", "conference": "2004 First Annual IEEE Communications Society Conference on Sensor and Ad Hoc Communications and Networks, 2004. IEEE SECON 2004.", "pages": "439-448", "publisher": "IEEE", "description": "Many envisioned applications of ad hoc networks involve only small-scale networks that we term as vicinity ad-hoc groups (VAGs). Distributed coordination services, instead of pairwise communications, are the primary requirements of VAGs. Existing designs for distributed services apply either a layered structure or a vertical integration. While the former contributes to design simplicity, the latter improves runtime efficiency. In this paper, we argue that, since distributed services require group-oriented communications, our NASCENT approach can achieve both design simplicity and runtime efficiency in VAGs, NASCENT is a network layer service dedicated for VAGs. It provides a light-weight membership service along with a routing structure for message passing, and it supports the concurrent execution of various distributed algorithms. NASCENT is also tailored to cope with the transiency of VAGs. We demonstrate …", "total_citations": {"2006": 1, "2007": 2, "2008": 1, "2009": 0, "2010": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:L_l9e5I586QC": {"external_link": "https://www.researchgate.net/profile/Jun-Luo-10/publication/366324804_HeartPrint_Passive_Heart_Sounds_Authentication_Exploiting_In-Ear_Microphones/links/639c30efb260ef307fd6b7a3/HeartPrint-Passive-Heart-Sounds-Authentication-Exploiting-In-Ear-Microphones.pdf", "authors": ["Yetong Cao", "Chao Cai", "Fan Li", "Zhe Chen", "Jun Luo"], "publication_date": "2023/5", "conference": "The 42nd IEEE Conference on Computer Communications (INFOCOM'23)", "pages": "1-10", "description": "Biometrics has been increasingly integrated into wearable devices to enhance data privacy and security in recent years. Meanwhile, the popularity of wearables in turn creates a unique opportunity for capturing novel biometrics leveraging various embedded sensing modalities. In this paper, we study a new intracorporal biometrics combining the uniqueness of i) heart motion, ii) bone conduction, and iii) body asymmetry. Specifically, we design HeartPrint as a passive yet secure user authentication system: it exploits the bone-conducted heart sounds captured by (widely available) dual in-ear microphones (IEMs) to authenticate users, while neatly leveraging IEMs renders itself transparent to users without impairing the normal functions of earphones. To suppress the interference from other body sounds and audio produced by the earphones, we develop a novel interference elimination method using modified nonnegative matrix factorization to separate clean heart sounds from background interference. We further explore the uniqueness of IEM-recorded heart sounds in three aspects to extract a novel biometric representation, based on which HeartPrint leverages a convolutional neural model equipped with a continual learning method to achieve accurate authentication under drifting body conditions. Extensive experiments with 18 pairs of commercial earphones on 45 participants confirm that HeartPrint can achieve 1.6% FAR and 1.8% FRR, while effectively coping with major attacks, complicated interference, and hardware diversity.", "total_citations": {"2023": 4}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:uDGL6kOW6j0C": {"external_link": "https://opg.optica.org/abstract.cfm?uri=oe-29-12-19015", "authors": ["Pinpin Zhang", "Qiuyu Wang", "Yanbing Yang", "Yunfeng Wang", "Yimao Sun", "Wenzheng Xu", "Jun Luo", "Liangyin Chen"], "publication_date": "2021/6/7", "journal": "Optics Express", "volume": "29", "issue": "12", "pages": "19015-19023", "publisher": "Optica Publishing Group", "description": "Deemed as a practical approach to realize Visible Light Communication on commercial-off-the-shelf devices, the Optical Camera Communication (OCC) is attracting increasing attention, thanks to its readiness to be built purely upon ubiquitous LED illuminating infrastructure and handy smartphones. However, limited by the low sampling ability of the built-in camera on a smartphone, the performance of existing OCC systems is still far away from the requirements of practical applications. To this end, we further investigate the reception ability of the smartphone’s camera and propose an accumulative sampling scheme to improve the performance of the OCC system. Essentially, the proposed scheme can use all the grayscale information of the pixels projected by the LED transmitter, whereas the conventional ones normally use single row (or column) pixels for demodulating. By implementing the lightweight …", "total_citations": {"2022": 2, "2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:UHK10RUVsp4C": {"external_link": "https://link.springer.com/article/10.1007/s11276-014-0690-5", "authors": ["Chi Zhang", "Jun Luo"], "publication_date": "2014/8", "journal": "Wireless networks", "volume": "20", "issue": "6", "pages": "1477-1494", "publisher": "Springer US", "description": "For a set of mobile users with designated friendship relations, it is a recurring issue to keep track of whether some friends appear in the vicinity of a given user. While both distributed and centralized solutions for proximity detection have been proposed, the cost metrics for evaluating these proposals are always based on counting the number of message (e.g., query or update) exchanges. However, as mobile users often rely on wireless networks to maintain their connectivity, the cost incurred by any message passing is strongly affected by the distance between the sender and receiver. In this paper, we propose TRack Others if You can (TROY) as a novel distributed solution for proximity detection. Extending the principle of spatial tessellations, TROY incurs only localized message exchanges and is thus superior to existing proposals in terms of more realistic cost metrics that take into account the actual …", "total_citations": {"2019": 2, "2020": 0, "2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:H_jBuBxbQIAC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3570361.3613290", "authors": ["Jingzhi Hu", "Tianyue Zheng", "Zhe Chen", "Hongbo Wang", "Jun Luo"], "publication_date": "2023/10/2", "book": "Proceedings of the 29th Annual International Conference on Mobile Computing and Networking", "pages": "1-15", "description": "Having been studied for more than a decade, Wi-Fi human sensing still faces a major challenge in the presence of multiple persons, simply because the limited bandwidth of Wi-Fi fails to provide a suficient range resolution to physically separate multiple subjects. Existing solutions mostly avoid this challenge by switching to radars with GHz bandwidth, at the cost of cumbersome deployments. Therefore, could Wi-Fi human sensing handle multiple subjects remains an open question. This paper presents MUSE-Fi, the first Wi-Fi multi-person sensing system with physical separability. The principle behind MUSE-Fi is that, given a Wi-Fi device (e.g., smartphone) very close to a subject, the near-field channel variation caused by the subject significantly overwhelms variations caused by other distant subjects. Consequently, focusing on the channel state information (CSI) carried by the trafic in and out of this device …", "total_citations": {"2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:7BrZ7Jt4UNcC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9844136/", "authors": ["Xuewen Geng", "Ruiqing Peng", "Minglei Li", "Wenping Liu", "Guoyin Jiang", "Hongbo Jiang", "Jun Luo"], "publication_date": "2022/7/28", "journal": "IEEE Internet of Things Journal", "volume": "9", "issue": "24", "pages": "24800-24811", "publisher": "IEEE", "description": "In this article, we study the problem of passive human localization using an infrared (IR) thermal imaging camera which detects IR radiation emitted by human without carry-on devices and thereby generates a heat map of human body. Rather than directly using the heat map, we propose to exploit temperature of human body and design a lightweight approach for human localization using machine learning techniques. We observe that person-to-camera distance is closely related with the position and the size of a person’s head in the heat map, and several other features, such as variance, skewness, and kurtosis of temperatures in the head region are also good indicators of person-to-camera distance estimation. Accordingly, we propose a set of features and construct a model for inferring person-to-camera distance using machine learning techniques. With the estimated distance, we further compute human …", "total_citations": {"2023": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:r_AWSJRzSzQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9075468/", "authors": ["Yanbing Yang", "Jun Luo", "Chen Chen", "Liangyin Chen"], "publication_date": "2020/4/21", "journal": "IEEE Internet Computing", "volume": "24", "issue": "1", "pages": "59-65", "publisher": "IEEE", "description": "Whereas the increasing popularity of both commercial light-emitting diode (LED) lighting and mobile devices certainly creates opportunity for real-life deployment of visible light communication (VLC) systems, reaching the high throughput promised by lab experiments still faces major obstacles. In particular, lacking the sophisticated hardware and software support under experimental conditions, real-life systems are challenged in many aspects, especially low signal-to-noise ratio, low operation frequency, uncontrollable LED nonlinearity, and illumination requirements. Nonetheless, deployments tapping commercial infrastructure are critical to gain market penetration for VLC-enabled wireless applications, so boosting the performance of these real-life systems becomes imperative. In this article, we consider the multiple LED chips and/or light sources nature of indoor commercial lighting infrastructure, and propose a …", "total_citations": {"2022": 3}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:0N-VGjzr574C": {"external_link": "https://link.springer.com/article/10.1007/s11276-014-0770-6", "authors": ["Minqi Zhang", "Feng Li", "Ying He", "Juncong Lin", "Xianfeng Gu", "Jun Luo"], "publication_date": "2015/1", "journal": "Wireless Networks", "volume": "21", "pages": "67-80", "publisher": "Springer US", "description": "Although stateless greedy routing is well investigated in 2D wireless sensor networks (WSNs), it is widely believed to be impossible in 3D. In this paper, we aim at overcoming the impossibility through a distributed parametrization that equips a WSN with virtual coordinates favoring greedy routing. We propose a fundamentally new parametrization to embed the network domain, the resulting embedding domain allows greedy routing to have guaranteed delivery. We also present localized algorithms to realize this map in WSNs. To combat the load concentration caused by greedy routing that applies the distance greedy principle, we further propose tunable greedy routing, which relies on tuning a parameter in the greedy objective to naturally balance routing load. These two proposals form our Greedy Routing through dIstributed Parametrization (GRIP). We prove the correctness and efficiency of GRIP and …", "total_citations": {"2016": 1, "2017": 0, "2018": 0, "2019": 0, "2020": 0, "2021": 0, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:FPJr55Dyh1AC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/7064360/", "authors": ["Kalan Nawarathne", "Fang Zhao", "Francisco Camara Pereira", "Jun Luo"], "publication_date": "2014/12/10", "conference": "2014 13th International Conference on Control Automation Robotics & Vision (ICARCV)", "pages": "529-534", "publisher": "IEEE", "description": "GPS localization drains battery aggressively if it is done continuously on a smartphone. This high battery drainage could be reduced by lowering the sampling rate of GPS. However, to fill the reception gaps introduced by low sampling rate, other methods need to be explored. The sensors available in the smartphones allow incremental positioning based on dead reckoning. Even though dead reckoning is a widely researched topic in navigation and walking based localization, it still lacks research on smartphone low-quality sensor based localization for vehicular motion. Therefore this paper describes a dead reckoning system design and implementation for vehicular motion on Android smartphones. It adapts and presents currently used methods for each system step (i.e. filtering, gravity removal, heading estimation and velocity/displacement integration). It also presents new research finding on accelerometer …", "total_citations": {"2016": 1, "2017": 0, "2018": 1, "2019": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:z6xuaG2dYH0C": {"external_link": "https://arxiv.org/abs/2302.08646", "authors": ["Tianyue Zheng", "Ang Li", "Zhe Chen", "Hongbo Wang", "Jun Luo"], "publication_date": "2023/10/6", "conference": "Proceedings of the 29th Annual International Conference on Mobile Computing And Networking", "description": "Object detection with on-board sensors (e.g., lidar, radar, and camera) play a crucial role in autonomous driving (AD), and these sensors complement each other in modalities. While crowdsensing may potentially exploit these sensors (of huge quantity) to derive more comprehensive knowledge, \\textit{federated learning} (FL) appears to be the necessary tool to reach this potential: it enables autonomous vehicles (AVs) to train machine learning models without explicitly sharing raw sensory data. However, the multimodal sensors introduce various data heterogeneity across distributed AVs (e.g., label quantity skews and varied modalities), posing critical challenges to effective FL. To this end, we present AutoFed as a heterogeneity-aware FL framework to fully exploit multimodal sensory data on AVs and thus enable robust AD. Specifically, we first propose a novel model leveraging pseudo-labeling to avoid mistakenly treating unlabeled objects as the background. We also propose an autoencoder-based data imputation method to fill missing data modality (of certain AVs) with the available ones. To further reconcile the heterogeneity, we finally present a client selection mechanism exploiting the similarities among client models to improve both training stability and convergence rate. Our experiments on benchmark dataset confirm that AutoFed substantially improves over status quo approaches in both precision and recall, while demonstrating strong robustness to adverse weather conditions.", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:ZqE1mSdD_DYC": {"external_link": "https://www.researchgate.net/profile/Jun-Luo-10/publication/373686904_Password-Stealing_without_Hacking_Wi-Fi_Enabled_Practical_Keystroke_Eavesdropping/links/64f7f48187d7f830e8047046/Password-Stealing-without-Hacking-Wi-Fi-Enabled-Practical-Keystroke-Eavesdropping.pdf", "authors": ["Jingyang Hu", "Hongbo Wang", "Tianyue Zheng", "Jingzhi Hu", "Zhe Chen", "Hongbo Jiang", "Jun Luo"], "publication_date": "2023/9/7", "journal": "Proc. of the 30th ACM CCS", "pages": "1-14", "description": "The contact-free sensing nature of Wi-Fi has been leveraged to achieve privacy breaches, yet existing attacks relying on Wi-Fi CSI (channel state information) demand hacking Wi-Fi hardware to obtain desired CSIs. Since such hacking has proven prohibitively hard due to compact hardware, its feasibility in keeping up with fast-developing Wi-Fi technology becomes very questionable. To this end, we propose WiKI-Eve to eavesdrop keystrokes on smartphones without the need for hacking. WiKI-Eve exploits a new feature, BFI (beamforming feedback information), offered by latest Wi-Fi hardware: since BFI is transmitted from a smartphone to an AP in clear-text, it can be overheard (hence eavesdropped) by any other Wi-Fi devices switching to monitor mode. As existing keystroke inference methods offer very limited generalizability, WiKI-Eve further innovates in an adversarial learning scheme to enable its inference generalizable towards unseen scenarios. We implement WiKI-Eve and conduct extensive evaluation on it; the results demonstrate that WiKI-Eve achieves 88.9% inference accuracy for individual keystrokes and up to 65.8% top-10 accuracy for stealing passwords of mobile applications (eg, WeChat).", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:NMlhSUseqAsC": {"external_link": "https://arxiv.org/abs/2309.00250", "authors": ["Jun Luo", "Hangcheng Cao", "Hongbo Jiang", "Yanbing Yang", "Zhe Chen"], "publication_date": "2023/9/1", "journal": "arXiv preprint arXiv:2309.00250", "description": "Wi-Fi signals may help realize low-cost and non-invasive human sensing, yet it can also be exploited by eavesdroppers to capture private information. Very few studies rise to handle this privacy concern so far; they either jam all sensing attempts or rely on sophisticated technologies to support only a single sensing user, rendering them impractical for multi-user scenarios. Moreover, these proposals all fail to exploit Wi-Fi's multiple-in multiple-out (MIMO) capability. To this end, we propose MIMOCrypt, a privacy-preserving Wi-Fi sensing framework to support realistic multi-user scenarios. To thwart unauthorized eavesdropping while retaining the sensing and communication capabilities for legitimate users, MIMOCrypt innovates in exploiting MIMO to physically encrypt Wi-Fi channels, treating the sensed human activities as physical plaintexts. The encryption scheme is further enhanced via an optimization framework, aiming to strike a balance among i) risk of eavesdropping, ii) sensing accuracy, and iii) communication quality, upon securely conveying decryption keys to legitimate users. We implement a prototype of MIMOCrypt on an SDR platform and perform extensive experiments to evaluate its effectiveness in common application scenarios, especially privacy-sensitive human gesture recognition.", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:EsEWqaRxkBgC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10123032/", "authors": ["Chao Cai", "Ruinan Jin", "Jiangtian Nie", "Jiawen Kang", "Yang Zhang", "Jun Luo"], "publication_date": "2023/5/11", "journal": "IEEE Transactions on Vehicular Technology", "publisher": "IEEE", "description": "Recently,  passive behavioral biometrics  (e.g., gesture or footstep) acquired from wireless networks or mobile services have become promising complements to conventional user identification methods (e.g., face or fingerprint) under special situations, yet existing sensing technologies require lengthy measurement traces and cannot identify multiple users at the same time. To this end, we propose PURE as a passive multi-person identification system leveraging deep learning enabled footstep separation and recognition. PURE passively identifies a user by identifying the unique “footprints” in its footstep. Different from existing gait-enabled recognition systems incurring a long sensing delay to acquire many footsteps, PURE can recognize a person by as few as only one step, substantially cutting the identification latency. To make PURE adaptive to walking pace variations, environmental dynamics, and even unseen …", "total_citations": {"2021": 1, "2022": 0, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:kw52XkFRtyQC": {"external_link": "https://ieeexplore.ieee.org/document/9928389/", "authors": ["Hangcheng Cao", "Daibo Liu", "Hongbo Jiang", "Chao Cai", "Tianyue Zheng", "John CS Lui", "Jun Luo"], "publication_date": "2022/10/25", "journal": "IEEE Transactions on Mobile Computing", "publisher": "IEEE", "description": "Door lock is regarded as a critical line of defending the privacy and security of personal areas. However, for inner doors in environments like factories, existing locking mechanisms can be poor in user-friendliness and high in cost. For instance, mechanical locks require carrying keys that inevitably compromise user experiences, while smart locks always require non-trivial sensors. Therefore, inner doors urgently require a lightweight unlocking scheme that can properly balance user-friendliness, cost, and security. To this end, we propose HandKey as a keyless unlocking scheme to supplement existing lock systems. HandKey relies on two principles: the simplicity of hand knocking doors and the uniqueness of vibration triggered by the knocking force. In other words, a door and a hand knocking it jointly form a unique physical system that generates hand-dependent and user-specific vibration signatures uniquely …", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:FiytvqdAVhgC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3556562.3558571", "authors": ["Zhe Chen", "Tianyue Zheng", "Chao Hu", "Hangcheng Cao", "Yanbing Yang", "Hongbo Jiang", "Jun Luo"], "publication_date": "2022/10/21", "book": "Proceedings of the 1st ACM MobiCom Workshop on Integrated Sensing and Communications Systems", "pages": "43-48", "description": "The intention of leveraging Radio-Frequency (RF) resources for diverse sensing purposes has grown increasingly keen, thanks to the ever-expanding deployment of IoT devices using RF communications to maintain connectivity. To this end, we propose ISACoT as the framework for enabling Integrated Sensing and Communication (ISAC) over IoT devices. ISACoT extends over existing devices via four aspects, namely time, frequency, space, and protocol. We argue that, as the multistatic communication infrastructure of IoT is adverse to device-free sensing (e.g., lack of precise time synchronization), the keystone of ISACoT should be to operate sensing in a monostatic mode (like radar). We tackle the fundamental time aspect based on Wi-Fi first, then explore the other three aspects with both preliminary proposals made and potential challenges raised for future extensions.", "total_citations": {"2022": 1, "2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:nRpfm8aw39MC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9815037/", "authors": ["Xuewen Geng", "Minglei Li", "Wenping Liu", "Shengkai Zhu", "Hongbo Jiang", "Jiawen Bian", "Xuezhi Fan", "Ruiqing Peng", "Jun Luo"], "publication_date": "2022/7/4", "journal": "IEEE Internet of Things Journal", "volume": "9", "issue": "22", "pages": "23241-23251", "publisher": "IEEE", "description": "We study the problem of cross-modality person reidentification (ReID) and tracking with dual visible-infrared (VI) cameras, while most existing efforts on tracking-by-detection have been paid on single-modality visible ReID which is inapplicable for poor-light environments. The major difficulties for cross-modality (e.g., VI) ReID stem from the large modality gap between three-channel visible images and one-channel infrared images and such unknown environmental factors as background clutter, occlusions, etc. To tackle these issues, we propose to enrich the diversities of visible and infrared images for intra- and cross-modality matching by using both the channel-aware data augmentation (DA) techniques (e.g., channel exchanged augmentation and random occlusions) and standard DA techniques. On top of these DA techniques, we incorporate ResNet50 and vision transformer (ViT) into the feature extraction …", "total_citations": {"2023": 2}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:OR75R8vi5nAC": {"external_link": "https://dl.acm.org/doi/abs/10.14778/3377369.3377375", "authors": ["Yahui Sun", "Jun Luo", "Theodoros Lappas", "Xiaokui Xiao", "Bin Cui"], "publication_date": "2020/1/1", "journal": "Proceedings of the VLDB Endowment", "volume": "13", "issue": "5", "pages": "656-669", "description": "Bump hunting is an important approach to the extraction of insights from Euclidean datasets. Recently, it has been explored for graph datasets for the first time, and a single bump is hunted in an unweighted graph in this exploration. Here, we extend this exploration by hunting multiple bumps in a weighted graph. Given a weighted graph and a set of query nodes exhibiting a property of interest, our objective is to find k non-overlapping and connected subgraphs, i.e., bumps, in which the discrepancy between the numbers of query and non-query nodes is maximized and the sum of edge costs is minimized simultaneously. We prove that our extended bump hunting problem can be transformed to a recently formulated Prize-Collecting Steiner Forest Problem (PCSFP). We further prove that PCSFP is NP-hard even in trees. Then, we propose a fast approximation algorithm for solving PCSFP in trees. Based on this …", "total_citations": {"2021": 1, "2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:__bU50VfleQC": {"external_link": "https://dl.acm.org/doi/abs/10.1145/3596242", "authors": ["Yetong Cao", "Chao Cai", "Anbo Yu", "Fan Li", "Jun Luo"], "publication_date": "2023/7", "journal": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies", "volume": "7", "issue": "3", "pages": "1-23", "publisher": "ACM", "description": "In recent years, particular attention has been devoted to earable acoustic sensing due to its numerous applications. However, the lack of a common platform for accessing raw audio samples has forced researchers/developers to pay great efforts to the trifles of prototyping often irrelevant to the core sensing functions. Meanwhile, the growing popularity of active noise cancellation (ANC) has endowed common earphones with high standard acoustic capability yet to be explored by sensing. To this end, we propose EarACE to be the first acoustic sensing platform exploiting the native acoustics of commercial ANC earphones, significantly improving upon self-crafted earphone sensing devices. EarACE takes a compact design to handle hardware heterogeneity and to deliver flexible control on audio facilities. Leveraging a systematic study on in-ear acoustic signals, EarACE gains abilities to combat performance …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:tHtfpZlB6tUC": {"external_link": "https://www.researchgate.net/profile/Jun-Luo-10/publication/366324795_Wider_is_Better_Contact-free_Vibration_Sensing_via_Different_COTS-RF_Technologies/links/639c2f53e42faa7e75c9690c/Wider-is-Better-Contact-free-Vibration-Sensing-via-Different-COTS-RF-Technologies.pdf", "authors": ["Zhe Chen", "Tianyue Zheng", "Chao Cai", "Yue Gao", "Pengfei Hu", "Jun Luo"], "publication_date": "2023/5", "conference": "The 42nd IEEE Conference on Computer Communications (INFOCOM'23)", "pages": "1-10", "description": "Vibration sensing is crucial to human life and work, as vibrations indicate the status of their respective sources (eg, heartbeat to human health condition). Given the inconvenience of contact sensing, both academia and industry have been intensively exploring contact-free vibration sensing, with several major developments leveraging radio-frequency (RF) technologies made very recently. However, a measurement study systematically comparing these options is still missing. In this paper, we choose to evaluate five representative commercial off-the-shelf (COTS) RF technologies with different carrier frequencies, bandwidths, and waveform designs. We first unify the sensing data format and processing pipeline, and also propose a novel metric v-SNR to quantify sensing quality. Then our extensive evaluations start from controlled experiments for benchmarking, followed by investigations on two real-world applications: machinery vibration measurement and vital sign monitoring. Our comprehensive study reveals that Wi-Fi performs the worst among all five technologies, while a lesser-known UWB-based technology achieves the best overall performance, and others have respective pros and cons in different scenarios.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:-6RzNnnwWf8C": {"external_link": "https://arxiv.org/abs/2303.15686", "authors": ["Jingzhi Hu", "Zhe Chen", "Jun Luo"], "publication_date": "2023/3/28", "journal": "arXiv preprint arXiv:2303.15686", "description": "Metamaterial-based reconfigurable holographic surfaces (RHSs) have been proposed as novel cost-efficient antenna arrays, which are promising for improving the positioning and communication performance of integrated sensing and communications (ISAC) systems. However, due to the high frequency selectivity of the metamaterial elements, RHSs face challenges in supporting ultra-wide bandwidth (UWB), which significantly limits the positioning precision. In this paper, to avoid the physical limitations of UWB RHS while enhancing the performance of RHS-based ISAC systems, we propose a multi-band (MB) based ISAC system. We analyze its positioning precision and propose an efficient algorithm to optimize the large number of variables in analog and digital beamforming. Through comparison with benchmark results, simulation results verify the efficiency of our proposed system and algorithm, and show that the system achieves  less positioning error, which reduces  communication capacity loss.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:MhiOAD_qIWkC": {"external_link": "https://ieeexplore.ieee.org/iel7/7755/4358975/09928387.pdf", "authors": ["Hangcheng Cao", "Daibo Liu", "Hongbo Jiang", "Jun Luo"], "publication_date": "2022/10/25", "journal": "IEEE Transactions on Mobile Computing", "issue": "99", "pages": "1-15", "publisher": "IEEE", "description": "User authentication is a critical module to achieve security and privacy protections, especially for pervasive Internet of Things (IoT) deployments. However, existing methods on IoT devices are significantly short of  implementability  thanks to the lack of device uniformity and protocol openness. For instance, password becomes useless for devices void of text entry interfaces. Biometrics may not scale well as they require both non-trivial sensors and cumbersome user involvement. Proximity-based methods exploiting shared ambient contexts are vulnerable to co-located malicious attacks. Therefore, a low-cost authentication scheme widely implementable on heterogeneous IoT devices is urgently demanded. To this end, we propose  MagSign  that leverages two fundamental capabilities owned by common IoT devices: the ubiquity of magnetic induction sensors and the power of screens to change magnetic field …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:WC23djZS0W4C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/9923566/", "authors": ["Xi Ouyang", "Quan Zhou", "Hujun Shang", "Yuping Zheng", "Shuyan Pan", "Jun Luo"], "publication_date": "2022/10/18", "journal": "IEEE Transactions on Industrial Electronics", "publisher": "IEEE", "description": "Transformer winding turn-to-turn fault is the prominent cause of transformer total failure, so detecting the winding fault in real time to stop the failure development in advance is imperative. However, existing techniques entailing periodic offline inspections fail to continuously monitor transformer winding states while causing extra costs due to the outage during inspections. This has driven researchers to consider effective continuous online monitoring methods from several technical perspectives, including typically port voltage current analysis, online frequency response analysis, and vibration analysis. Since these methods are conventionally evaluated with qualitative comparisons focusing only on feasibility, quantitative assessments indispensable for the targeted improvement of the methods and the most suitable method decision in specific scenarios are still missing. To this end, we conduct a comprehensive …", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:ubry08Y2EpUC": {"external_link": "https://www.mdpi.com/1999-5903/14/1/7", "authors": ["Jin Wang", "Jun Luo"], "publication_date": "2021/12/23", "journal": "Future Internet", "volume": "14", "issue": "1", "pages": "7", "publisher": "MDPI", "description": "While both outdoor and indoor localization methods are flourishing, how to properly marry them to offer pervasive localizability in urban areas remains open. Recently, proposals on indoor–outdoor detection have made the first step towards such an integration, yet complicated urban environments render such a binary classification incompetent. Fortunately, the latest developments in Android have granted us access to raw GNSS measurements, which contain far more information than commonly derived GPS location indicators. In this paper, we explore these newly available measurements in order to better characterize diversified urban environments. Essentially, we tackle the challenges introduced by the complex GNSS data and apply a deep learning model to identify representations for respective location contexts. We further develop two preliminary applications of our deep profiling: one, we offer a more fine-grained semantic classification than binary indoor–outdoor detection; and two, we derive a GPS error indicator that is more meaningful than that provided by Google Maps. These results are all corroborated by our extensive data collection and trace-driven evaluations.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:lgwcVrK6X84C": {"external_link": "https://arxiv.org/abs/2112.00428", "authors": ["Tianyue Zheng", "Zhe Chen", "Shuya Ding", "Chao Cai", "Jun Luo"], "publication_date": "2021/12/1", "journal": "arXiv preprint arXiv:2112.00428", "description": "Whereas adversarial training can be useful against specific adversarial perturbations, they have also proven ineffective in generalizing towards attacks deviating from those used for training. However, we observe that this ineffectiveness is intrinsically connected to domain adaptability, another crucial issue in deep learning for which adversarial domain adaptation appears to be a promising solution. Consequently, we proposed Adv-4-Adv as a novel adversarial training method that aims to retain robustness against unseen adversarial perturbations. Essentially, Adv-4-Adv treats attacks incurring different perturbations as distinct domains, and by leveraging the power of adversarial domain adaptation, it aims to remove the domain/attack-specific features. This forces a trained model to learn a robust domain-invariant representation, which in turn enhances its generalization ability. Extensive evaluations on Fashion-MNIST, SVHN, CIFAR-10, and CIFAR-100 demonstrate that a model trained by Adv-4-Adv based on samples crafted by simple attacks (e.g., FGSM) can be generalized to more advanced attacks (e.g., PGD), and the performance exceeds state-of-the-art proposals on these datasets.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:jgBuDB5drN8C": {"external_link": "https://openreview.net/forum?id=gmxgG6_BL_N", "authors": ["Shujie Zhang", "Tianyue Zheng", "Zhe Chen", "Jun Luo", "Sinno Pan"], "publication_date": "2021/10/6", "description": "In many practical scenarios of signal extraction from a nonlinear mixture, only one (signal) source is intended to be extracted. However, modern methods involving Blind Source Separation are inefficient for this task since they are designed to recover all sources in the mixture. In this paper, we propose supervised Variational Component Decoder (sVCD) as a method dedicated to extracting a single source from nonlinear mixture. sVCD leverages the sequence-to-sequence (Seq2Seq) translation ability of a specially designed neural network to approximate a nonlinear inverse of the mixture process, assisted by priors of the interested source. In order to maintain the robustness in the face of real-life samples, sVCD combines Seq2Seq with variational inference to form a deep generative model, and it is trained by optimizing a variant of variational bound on the data likelihood concerning only the interested source. We demonstrate that sVCD has superior performance on nonlinear source extraction over a state-of-the-art method on diverse datasets, including artificially generated sequences, radio frequency (RF) sensing data, and electroencephalogram (EEG) results.", "total_citations": {"2023": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:F9fV5C73w3QC": {"external_link": "https://link.springer.com/article/10.1007/s11276-020-02402-3", "authors": ["Chao Cai", "Zhen Chen", "Jun Luo", "Linwei Zhu", "Menglan Hu"], "publication_date": "2020/10", "journal": "Wireless Networks", "volume": "26", "pages": "5411-5425", "publisher": "Springer US", "description": "The extremely high frequency of Millimeter-Wave technology warrants Gbps throughput for the next-generation wireless communication systems, but mmWave signals also suffer from severe path loss due to high attenuation. To compensate for this loss, mmWave radios establish communication links via directional beams so as to increase channel gains and communication range. Until recently, the measurement studies on mmWave technology were mainly based on prototypes built from band-limited Software Defined Radio, which could not characterize performance in realistic settings. Latest studies using commodity hardware reports straightforward measurements on the impact of environment settings but did not present deep analysis on the correlations of low-layer information. Meanwhile, those studies lack the ability to configure commodity devices under controlled settings, for instance, a single beam …", "total_citations": {"2022": 1}}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:4aZ_i-5WJEQC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10285302/", "authors": ["Jingzhi Hu", "Zhe Chen", "Tianyue Zheng", "Robert Schober", "Jun Luo"], "publication_date": "2023/10/13", "journal": "IEEE Journal on Selected Areas in Communications", "publisher": "IEEE", "description": "Positioning is an essential service for various applications and is expected to be integrated with existing communication infrastructures in 5G and 6G. Though current Wi-Fi and cellular base stations (BSs) can be used to support this integration, the resulting precision is unsatisfactory due to the lack of precise control of the wireless signals. Recently, BSs adopting reconfigurable holographic surfaces (RHSs) have been advocated for positioning as RHSs’ large number of antenna elements enable generation of arbitrary and highly-focused signal beam patterns. However, existing designs face two major challenges: i) RHSs only have limited operating bandwidth, and ii) the positioning methods cannot adapt to the diverse environments encountered in practice. To overcome these challenges, we present HoloFed, a system providing high-precision environment-adaptive user positioning services by exploiting  multi …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:KWzIFqRkAKkC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10275318/", "authors": ["Chao Cai", "Fei Wang", "Qingguo Xie", "Jun Luo"], "publication_date": "2023/10/10", "journal": "IEEE Transactions on Industrial Electronics", "publisher": "IEEE", "description": "Peak detection is useful in a wide range of applications. To achieve this task, conventional approaches [including dedicated application specific integrated circuit-based designs] often demand  analog  readout chains and compulsory add-ons [e.g., additional analogy-to-digital converter (ADC) for peak sampling], rendering them neither compact nor flexible. In this article, we propose a field programmable gate array (FPGA)-only solution to fulfill this task without any external components. Specifically, we achieve peak detection with only a low-voltage differential signaling (LVDS) comparator and two general-purpose input/outputs (GPIOs). Therefore, one can flexibly make a practical deployment by a simple routing process, a nontrivial task even for inexperienced engineers. Meanwhile, to further compact the design for peak sampling, we leverage an FPGA-based slope ADC within which, we propose a new resource …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:JP7YXuLIOvAC": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10239445/", "authors": ["Jia Xu", "Biao Yang", "Zhe Chen", "Pin Lv", "Shujie Zhang", "Jun Luo"], "publication_date": "2023/9/5", "journal": "IEEE Internet of Things Journal", "publisher": "IEEE", "description": "Hand pose estimation (HPE), which aims to identify and recover the keypoints of a hand, is essential to many potential applications. Conventional computer vision (CV) methods extract visible features from images or videos captured by cameras. However, they are heavily affected by low image contrast, fail to work under occluded scenarios, and inevitably incur privacy concerns. Fortunately, CV leveraging widely available radio frequency (RF) signals (also known as RF vision) can fully address the problem with much lower computational complexity. In this paper, we propose Ske-Fi as an avatar of HPE enabled by RF vision, which uses the emerging Impulse Radio Ultra-Wide Band (IR-UWB) available on smart devices (e.g., Apple air tag) to sense the reflected RF signals of a hand to extract the hand skeleton features for pose estimation. Whereas Ske-Fi is apparently immune to low contrast and occlusion, its …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:-yGd096yOn8C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10129085/", "authors": ["Xiangyu Shen", "Hongbo Jiang", "Daibo Liu", "Kehua Yang", "Feiyang Deng", "Taiyuan Zhang", "Zhu Xiao", "John CS Lui", "Jiangchuan Liu", "Schahram Dustdar", "Jun Luo"], "publication_date": "2023/5/18", "journal": "IEEE Internet of Things Journal", "publisher": "IEEE", "description": "Heart disease has now become a very common and impactful disease, which can actually be easily avoided if treatment is intervened at an early stage. Thus, daily monitoring of heart health has become increasingly important. Existing mobile heart monitoring systems are mainly based on seismocardiography (SCG) or photoplethysmography (PPG). However, these methods suffer from inconvenience and additional equipment requirements, preventing people from monitoring their hearts in any place at any time. Inspired by our observation of the correlation between pupil size and heart rate varaiability (HRV), we consider using the pupillary response when a user unlocks his/her phone using facial recognition to infer the user’s HRV during this time, thus enabling heart monitoring. To this end, we propose a computer vision-based mobile HRV monitoring framework-PupilHeart, designed with a mobile terminal and a …"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:AzKEL7Gb_04C": {"external_link": "https://openaccess.thecvf.com/content/ICCV2023/html/Zhang_OCHID-Fi_Occlusion-Robust_Hand_Pose_Estimation_in_3D_via_RF-Vision_ICCV_2023_paper.html", "authors": ["Shujie Zhang", "Tianyue Zheng", "Zhe Chen", "Jingzhi Hu", "Abdelwahed Khamis", "Jiajun Liu", "Jun Luo"], "publication_date": "2023", "conference": "Proceedings of the IEEE/CVF International Conference on Computer Vision", "pages": "15112-15121", "description": "Hand Pose Estimation (HPE) is crucial to many applications, but conventional cameras-based CM-HPE methods are completely subject to Line-of-Sight (LoS), as cameras cannot capture occluded objects. In this paper, we propose to exploit Radio-Frequency-Vision (RF-vision) capable of bypassing obstacles for achieving occluded HPE, and we introduce OCHID-Fi as the first RF-HPE method with 3D pose estimation capability. OCHID-Fi employs wideband RF sensors widely available on smart devices (eg, iPhones) to probe 3D human hand pose and extract their skeletons behind obstacles. To overcome the challenge in labeling RF imaging given its human incomprehensible nature, OCHID-Fi employs a cross-modality and cross-domain training process. It uses a pre-trained CM-HPE network and a synchronized CM/RF dataset, to guide the training of its complex-valued RF-HPE network under LoS conditions. It further transfers knowledge learned from labeled LoS domain to unlabeled occluded domain via adversarial learning, enabling OCHID-Fi to generalize to unseen occluded scenarios. Experimental results demonstrate the superiority of OCHID-Fi: it achieves comparable accuracy to CM-HPE under normal conditions while maintaining such accuracy even in occluded scenarios, with empirical evidence for its generalizability to new domains."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:2VqYfGB8ITEC": {"external_link": "https://patents.google.com/patent/US10989786B2/en", "inventors": "Jin Wang, Jun Luo, Sinno Jialin Pan", "publication_date": "2021/4/27", "patent_office": "US", "patent_number": "10989786", "application_number": "15393231", "description": "Described herein is a framework for outdoor localization. In accordance with one aspect of the framework, a set of hotspot labels are received from one or more user devices connected to an outdoor wireless local area network. Manifold learning may be performed based on the set of hotspot labels to construct one or more manifolds. Using the one or more constructed manifolds, the framework may then estimate a location of a particular user device associated with a query record received from during an online location query."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:QYdC8u9Cj1oC": {"external_link": null, "inventors": "Shen-Shyang Ho Jun Luo, Richard Wisbrun, Jim Cherian, Hongliang Guo", "publication_date": "2017/4/27", "patent_office": "DE", "patent_number": "DE102015220907A1", "application_number": "DE102015220907.5A"}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:SeFeTyx0c_EC": {"external_link": "https://www.researchgate.net/profile/Jun-Luo-10/publication/251773914_Effective_Location-based_PublishSubscribe_in_MANETs/links/0deec5236c75520d1f000000/Effective-Location-based-Publish-Subscribe-in-MANETs.pdf", "authors": ["Patrick Eugster", "Benoıt Garbinato", "Adrian Holzer", "Jun Luo"], "publication_date": "2007", "conference": "5 th MiNEMA Workshop", "pages": "38-45", "description": "In this paper, we compare two peer-to-peer implementation strategies for persistent publications in location-based publish/subscribe. Both approaches use a scoped flooding algorithm to effectively disseminate data through the network–the first naive alternative propagates only published events, while the second smarter approach disseminates subscriptions during a warm up phase and then routes matching publications with a multisend communication primitive. We show in preliminary performance evaluations that depending on the applicative scenario, the cost of the warm up phase cannot be covered and the seemingly naive approach can outperform the smart one."}, "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=qXLjz30AAAAJ&cstart=100&pagesize=100&citation_for_view=qXLjz30AAAAJ:CNPyR2KL9-0C": {"external_link": "https://ieeexplore.ieee.org/abstract/document/10185157/", "authors": ["Chonggang Wang", "Paul C-P Chao", "Enakshi Bhattacharya", "JC Chiao", "Jun Luo", "Reza Malekian", "Cherif Amirat", "Liesel Bell", "Anta Cisse-Green", "Russell Harrison", "Karen L Hawkins", "Steven Heffner", "Donna Hourican", "Cecelia Jankowski", "Konstantinos Karachalios", "Jamie Moesch", "Thomas Siegert", "Mary Ward-Callan", "Sophia Muirhead"], "description": "This journal is 100% open access, which means that all content is freely available without charge to users or their institutions. All articles are currently published under Creative Commons licenses (either CCBY or CCBY-NC-ND), and the author retains copyright. Users are allowed to read, download, copy, distribute, print, search, or link to the full texts of the articles published under CCBY, or use them for any other lawful purpose, as long as proper attribution is given. Articles published under CCBYNC-ND are also available to users under the same conditions as CCBY, but the reuse cannot be for commercial purposes or change the work in any way. Open access is provided through the payment of an article processing charge (APC) paid after acceptance. APCs are often financed by an author’s institution or the funder supporting their research. Questions about copyright policies or reuse rights may be directed to the …"}}